#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abducted_Pipe_LG_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Abducted_Pipe_LG_02.Abducted_Pipe_LG_02_C
// 0x0020 (0x0E90 - 0x0E70)
class AAbducted_Pipe_LG_02_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AAmbientSound*>                  SoundsToFadeOnDeath;                               // 0x0E78(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	float                                         Fade_Out_Duration;                                 // 0x0E88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Abducted_Pipe_LG_02(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Abducted_Pipe_LG_02_C">();
	}
	static class AAbducted_Pipe_LG_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbducted_Pipe_LG_02_C>();
	}
};
static_assert(alignof(AAbducted_Pipe_LG_02_C) == 0x000008, "Wrong alignment on AAbducted_Pipe_LG_02_C");
static_assert(sizeof(AAbducted_Pipe_LG_02_C) == 0x000E90, "Wrong size on AAbducted_Pipe_LG_02_C");
static_assert(offsetof(AAbducted_Pipe_LG_02_C, UberGraphFrame) == 0x000E70, "Member 'AAbducted_Pipe_LG_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAbducted_Pipe_LG_02_C, SoundsToFadeOnDeath) == 0x000E78, "Member 'AAbducted_Pipe_LG_02_C::SoundsToFadeOnDeath' has a wrong offset!");
static_assert(offsetof(AAbducted_Pipe_LG_02_C, Fade_Out_Duration) == 0x000E88, "Member 'AAbducted_Pipe_LG_02_C::Fade_Out_Duration' has a wrong offset!");

}

