#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccoladeImageWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AccoladeImageWidget.AccoladeImageWidget_C.EventSocket
// 0x0001 (0x0001 - 0x0000)
struct AccoladeImageWidget_C_EventSocket final
{
public:
	bool                                          bAlreadySocketed;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccoladeImageWidget_C_EventSocket) == 0x000001, "Wrong alignment on AccoladeImageWidget_C_EventSocket");
static_assert(sizeof(AccoladeImageWidget_C_EventSocket) == 0x000001, "Wrong size on AccoladeImageWidget_C_EventSocket");
static_assert(offsetof(AccoladeImageWidget_C_EventSocket, bAlreadySocketed) == 0x000000, "Member 'AccoladeImageWidget_C_EventSocket::bAlreadySocketed' has a wrong offset!");

// Function AccoladeImageWidget.AccoladeImageWidget_C.ExecuteUbergraph_AccoladeImageWidget
// 0x00A8 (0x00A8 - 0x0000)
struct AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAlreadySocketed;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_4;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget) == 0x000008, "Wrong alignment on AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget");
static_assert(sizeof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget) == 0x0000A8, "Wrong size on AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, EntryPoint) == 0x000000, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable) == 0x000004, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_struct_Variable) == 0x000008, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable_1) == 0x000018, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_float_Variable) == 0x00001C, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_float_Variable_1) == 0x000020, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable_2) == 0x000024, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable_3) == 0x000025, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Event_IsDesignTime) == 0x000026, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000027, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000028, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_struct_Variable_1) == 0x000040, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_CustomEvent_bAlreadySocketed) == 0x000051, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_CustomEvent_bAlreadySocketed' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default) == 0x000054, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_bool_Variable_4) == 0x000058, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default_1) == 0x000060, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_byte_Variable) == 0x000071, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default_2) == 0x000078, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000080, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, Temp_byte_Variable_1) == 0x000088, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_GetEndTime_ReturnValue) == 0x00008C, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_PlayAnimation_ReturnValue_3) == 0x000090, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default_3) == 0x000098, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000099, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget, K2Node_Select_Default_4) == 0x0000A0, "Member 'AccoladeImageWidget_C_ExecuteUbergraph_AccoladeImageWidget::K2Node_Select_Default_4' has a wrong offset!");

// Function AccoladeImageWidget.AccoladeImageWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AccoladeImageWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccoladeImageWidget_C_PreConstruct) == 0x000001, "Wrong alignment on AccoladeImageWidget_C_PreConstruct");
static_assert(sizeof(AccoladeImageWidget_C_PreConstruct) == 0x000001, "Wrong size on AccoladeImageWidget_C_PreConstruct");
static_assert(offsetof(AccoladeImageWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AccoladeImageWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

