#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmbientAudio

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"


namespace SDK::Params
{

// Function AmbientAudio.AmbientAudioComponent.SetAmbientAsset
// 0x0008 (0x0008 - 0x0000)
struct AmbientAudioComponent_SetAmbientAsset final
{
public:
	class UAmbientAudioDataAsset*                 InAmbientAsset;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientAudioComponent_SetAmbientAsset) == 0x000008, "Wrong alignment on AmbientAudioComponent_SetAmbientAsset");
static_assert(sizeof(AmbientAudioComponent_SetAmbientAsset) == 0x000008, "Wrong size on AmbientAudioComponent_SetAmbientAsset");
static_assert(offsetof(AmbientAudioComponent_SetAmbientAsset, InAmbientAsset) == 0x000000, "Member 'AmbientAudioComponent_SetAmbientAsset::InAmbientAsset' has a wrong offset!");

// Function AmbientAudio.AmbientAudioComponent.SetCrossfadeTime
// 0x0004 (0x0004 - 0x0000)
struct AmbientAudioComponent_SetCrossfadeTime final
{
public:
	float                                         InCrossfadeTime;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientAudioComponent_SetCrossfadeTime) == 0x000004, "Wrong alignment on AmbientAudioComponent_SetCrossfadeTime");
static_assert(sizeof(AmbientAudioComponent_SetCrossfadeTime) == 0x000004, "Wrong size on AmbientAudioComponent_SetCrossfadeTime");
static_assert(offsetof(AmbientAudioComponent_SetCrossfadeTime, InCrossfadeTime) == 0x000000, "Member 'AmbientAudioComponent_SetCrossfadeTime::InCrossfadeTime' has a wrong offset!");

// Function AmbientAudio.AmbientAudioComponent.SetPriority
// 0x0004 (0x0004 - 0x0000)
struct AmbientAudioComponent_SetPriority final
{
public:
	int32                                         InPriority;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientAudioComponent_SetPriority) == 0x000004, "Wrong alignment on AmbientAudioComponent_SetPriority");
static_assert(sizeof(AmbientAudioComponent_SetPriority) == 0x000004, "Wrong size on AmbientAudioComponent_SetPriority");
static_assert(offsetof(AmbientAudioComponent_SetPriority, InPriority) == 0x000000, "Member 'AmbientAudioComponent_SetPriority::InPriority' has a wrong offset!");

// Function AmbientAudio.AmbientAudioSubsystem.AddAmbientEntry
// 0x0018 (0x0018 - 0x0000)
struct AmbientAudioSubsystem_AddAmbientEntry final
{
public:
	class FName                                   AmbientName;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmbientAudioDataAsset*                 Asset;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrossfadeTime;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientAudioSubsystem_AddAmbientEntry) == 0x000008, "Wrong alignment on AmbientAudioSubsystem_AddAmbientEntry");
static_assert(sizeof(AmbientAudioSubsystem_AddAmbientEntry) == 0x000018, "Wrong size on AmbientAudioSubsystem_AddAmbientEntry");
static_assert(offsetof(AmbientAudioSubsystem_AddAmbientEntry, AmbientName) == 0x000000, "Member 'AmbientAudioSubsystem_AddAmbientEntry::AmbientName' has a wrong offset!");
static_assert(offsetof(AmbientAudioSubsystem_AddAmbientEntry, Asset) == 0x000008, "Member 'AmbientAudioSubsystem_AddAmbientEntry::Asset' has a wrong offset!");
static_assert(offsetof(AmbientAudioSubsystem_AddAmbientEntry, Priority) == 0x000010, "Member 'AmbientAudioSubsystem_AddAmbientEntry::Priority' has a wrong offset!");
static_assert(offsetof(AmbientAudioSubsystem_AddAmbientEntry, CrossfadeTime) == 0x000014, "Member 'AmbientAudioSubsystem_AddAmbientEntry::CrossfadeTime' has a wrong offset!");

// Function AmbientAudio.AmbientAudioSubsystem.AddGameplayTag
// 0x0004 (0x0004 - 0x0000)
struct AmbientAudioSubsystem_AddGameplayTag final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientAudioSubsystem_AddGameplayTag) == 0x000004, "Wrong alignment on AmbientAudioSubsystem_AddGameplayTag");
static_assert(sizeof(AmbientAudioSubsystem_AddGameplayTag) == 0x000004, "Wrong size on AmbientAudioSubsystem_AddGameplayTag");
static_assert(offsetof(AmbientAudioSubsystem_AddGameplayTag, GameplayTag) == 0x000000, "Member 'AmbientAudioSubsystem_AddGameplayTag::GameplayTag' has a wrong offset!");

// Function AmbientAudio.AmbientAudioSubsystem.RemoveAmbientEntry
// 0x0008 (0x0008 - 0x0000)
struct AmbientAudioSubsystem_RemoveAmbientEntry final
{
public:
	class FName                                   AmbientName;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrossfadeOverride;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientAudioSubsystem_RemoveAmbientEntry) == 0x000004, "Wrong alignment on AmbientAudioSubsystem_RemoveAmbientEntry");
static_assert(sizeof(AmbientAudioSubsystem_RemoveAmbientEntry) == 0x000008, "Wrong size on AmbientAudioSubsystem_RemoveAmbientEntry");
static_assert(offsetof(AmbientAudioSubsystem_RemoveAmbientEntry, AmbientName) == 0x000000, "Member 'AmbientAudioSubsystem_RemoveAmbientEntry::AmbientName' has a wrong offset!");
static_assert(offsetof(AmbientAudioSubsystem_RemoveAmbientEntry, CrossfadeOverride) == 0x000004, "Member 'AmbientAudioSubsystem_RemoveAmbientEntry::CrossfadeOverride' has a wrong offset!");

// Function AmbientAudio.AmbientAudioSubsystem.RemoveGameplayTag
// 0x0004 (0x0004 - 0x0000)
struct AmbientAudioSubsystem_RemoveGameplayTag final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientAudioSubsystem_RemoveGameplayTag) == 0x000004, "Wrong alignment on AmbientAudioSubsystem_RemoveGameplayTag");
static_assert(sizeof(AmbientAudioSubsystem_RemoveGameplayTag) == 0x000004, "Wrong size on AmbientAudioSubsystem_RemoveGameplayTag");
static_assert(offsetof(AmbientAudioSubsystem_RemoveGameplayTag, GameplayTag) == 0x000000, "Member 'AmbientAudioSubsystem_RemoveGameplayTag::GameplayTag' has a wrong offset!");

// Function AmbientAudio.AmbientVolume.SetAmbientAsset
// 0x0008 (0x0008 - 0x0000)
struct AmbientVolume_SetAmbientAsset final
{
public:
	class UAmbientAudioDataAsset*                 NewAmbientAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientVolume_SetAmbientAsset) == 0x000008, "Wrong alignment on AmbientVolume_SetAmbientAsset");
static_assert(sizeof(AmbientVolume_SetAmbientAsset) == 0x000008, "Wrong size on AmbientVolume_SetAmbientAsset");
static_assert(offsetof(AmbientVolume_SetAmbientAsset, NewAmbientAsset) == 0x000000, "Member 'AmbientVolume_SetAmbientAsset::NewAmbientAsset' has a wrong offset!");

// Function AmbientAudio.AmbientVolume.SetCrossfadeTime
// 0x0004 (0x0004 - 0x0000)
struct AmbientVolume_SetCrossfadeTime final
{
public:
	float                                         NewCrossfadeTime;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientVolume_SetCrossfadeTime) == 0x000004, "Wrong alignment on AmbientVolume_SetCrossfadeTime");
static_assert(sizeof(AmbientVolume_SetCrossfadeTime) == 0x000004, "Wrong size on AmbientVolume_SetCrossfadeTime");
static_assert(offsetof(AmbientVolume_SetCrossfadeTime, NewCrossfadeTime) == 0x000000, "Member 'AmbientVolume_SetCrossfadeTime::NewCrossfadeTime' has a wrong offset!");

// Function AmbientAudio.AmbientVolume.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct AmbientVolume_SetEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientVolume_SetEnabled) == 0x000001, "Wrong alignment on AmbientVolume_SetEnabled");
static_assert(sizeof(AmbientVolume_SetEnabled) == 0x000001, "Wrong size on AmbientVolume_SetEnabled");
static_assert(offsetof(AmbientVolume_SetEnabled, bNewEnabled) == 0x000000, "Member 'AmbientVolume_SetEnabled::bNewEnabled' has a wrong offset!");

// Function AmbientAudio.AmbientVolume.SetPriority
// 0x0004 (0x0004 - 0x0000)
struct AmbientVolume_SetPriority final
{
public:
	int32                                         NewPriority;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AmbientVolume_SetPriority) == 0x000004, "Wrong alignment on AmbientVolume_SetPriority");
static_assert(sizeof(AmbientVolume_SetPriority) == 0x000004, "Wrong size on AmbientVolume_SetPriority");
static_assert(offsetof(AmbientVolume_SetPriority, NewPriority) == 0x000000, "Member 'AmbientVolume_SetPriority::NewPriority' has a wrong offset!");

}

