#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_TeleportFinished

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimNotifyState_TeleportFinished.AnimNotifyState_TeleportFinished_C.Received_NotifyBegin
// 0x0060 (0x0060 - 0x0000)
struct AnimNotifyState_TeleportFinished_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VictoryDrone_C*                     K2Node_DynamicCast_AsBP_Victory_Drone;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on AnimNotifyState_TeleportFinished_C_Received_NotifyBegin");
static_assert(sizeof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin) == 0x000060, "Wrong size on AnimNotifyState_TeleportFinished_C_Received_NotifyBegin");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin, EventReference) == 0x000018, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyBegin::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin, ReturnValue) == 0x000040, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin, K2Node_DynamicCast_AsBP_Victory_Drone) == 0x000050, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyBegin::K2Node_DynamicCast_AsBP_Victory_Drone' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AnimNotifyState_TeleportFinished.AnimNotifyState_TeleportFinished_C.Received_NotifyEnd
// 0x0040 (0x0040 - 0x0000)
struct AnimNotifyState_TeleportFinished_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotifyState_TeleportFinished_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on AnimNotifyState_TeleportFinished_C_Received_NotifyEnd");
static_assert(sizeof(AnimNotifyState_TeleportFinished_C_Received_NotifyEnd) == 0x000040, "Wrong size on AnimNotifyState_TeleportFinished_C_Received_NotifyEnd");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyEnd, EventReference) == 0x000010, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyEnd::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TeleportFinished_C_Received_NotifyEnd, ReturnValue) == 0x000038, "Member 'AnimNotifyState_TeleportFinished_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");

}

