#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_Irwin_FootTurns

#include "Basic.hpp"

#include "FN_NiagaraNotify_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_Irwin_FootTurns.AnimNotify_Irwin_FootTurns_C
// 0x0000 (0x00E0 - 0x00E0)
class UAnimNotify_Irwin_FootTurns_C final : public UFN_NiagaraNotify_C
{
public:
	bool                                          is_Running__;                                      // 0x00D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Left_Foot;                                         // 0x00D6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_Front_Leg;                                      // 0x00D7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_Irwin_FootTurns_C">();
	}
	static class UAnimNotify_Irwin_FootTurns_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_Irwin_FootTurns_C>();
	}
};
static_assert(alignof(UAnimNotify_Irwin_FootTurns_C) == 0x000010, "Wrong alignment on UAnimNotify_Irwin_FootTurns_C");
static_assert(sizeof(UAnimNotify_Irwin_FootTurns_C) == 0x0000E0, "Wrong size on UAnimNotify_Irwin_FootTurns_C");
static_assert(offsetof(UAnimNotify_Irwin_FootTurns_C, is_Running__) == 0x0000D5, "Member 'UAnimNotify_Irwin_FootTurns_C::is_Running__' has a wrong offset!");
static_assert(offsetof(UAnimNotify_Irwin_FootTurns_C, Left_Foot) == 0x0000D6, "Member 'UAnimNotify_Irwin_FootTurns_C::Left_Foot' has a wrong offset!");
static_assert(offsetof(UAnimNotify_Irwin_FootTurns_C, is_Front_Leg) == 0x0000D7, "Member 'UAnimNotify_Irwin_FootTurns_C::is_Front_Leg' has a wrong offset!");

}

