#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announce_EventCine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Announce_EventCine.Announce_EventCine_C
// 0x0028 (0x0318 - 0x02F0)
class AAnnounce_EventCine_C : public AFortClientAnnouncement_Cinematic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           EventMediaSource;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowSkipping;                                     // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMediaSubtitlesPlayer*              EventSubtitlesPlayer;                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnPlayerSkippedCutscene();
	void OnEnteredCinematicState();
	void OnClientAnnouncementStop();
	void HandleClientEvent_CinematicFinishedPlaying(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleAllowSkip();
	void ExecuteUbergraph_Announce_EventCine(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Announce_EventCine_C">();
	}
	static class AAnnounce_EventCine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAnnounce_EventCine_C>();
	}
};
static_assert(alignof(AAnnounce_EventCine_C) == 0x000008, "Wrong alignment on AAnnounce_EventCine_C");
static_assert(sizeof(AAnnounce_EventCine_C) == 0x000318, "Wrong size on AAnnounce_EventCine_C");
static_assert(offsetof(AAnnounce_EventCine_C, UberGraphFrame) == 0x0002F0, "Member 'AAnnounce_EventCine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAnnounce_EventCine_C, DefaultSceneRoot) == 0x0002F8, "Member 'AAnnounce_EventCine_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAnnounce_EventCine_C, EventMediaSource) == 0x000300, "Member 'AAnnounce_EventCine_C::EventMediaSource' has a wrong offset!");
static_assert(offsetof(AAnnounce_EventCine_C, AllowSkipping) == 0x000308, "Member 'AAnnounce_EventCine_C::AllowSkipping' has a wrong offset!");
static_assert(offsetof(AAnnounce_EventCine_C, EventSubtitlesPlayer) == 0x000310, "Member 'AAnnounce_EventCine_C::EventSubtitlesPlayer' has a wrong offset!");

}

