#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announce_EventCine

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Announce_EventCine.Announce_EventCine_C.HandleClientEvent_CinematicFinishedPlaying
// 0x0028 (0x0028 - 0x0000)
struct Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying) == 0x000008, "Wrong alignment on Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying");
static_assert(sizeof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying) == 0x000028, "Wrong size on Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying");
static_assert(offsetof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying, EventSource) == 0x000000, "Member 'Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying::EventSource' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying, EventFocus) == 0x000008, "Member 'Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying::EventFocus' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying, ClientEvent) == 0x000010, "Member 'Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying::ClientEvent' has a wrong offset!");

// Function Announce_EventCine.Announce_EventCine_C.ExecuteUbergraph_Announce_EventCine
// 0x0050 (0x0050 - 0x0000)
struct Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x0018(0x0018)(ConstParm, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortMediaInfo*                         CallFunc_SpawnObject_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine) == 0x000008, "Wrong alignment on Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine");
static_assert(sizeof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine) == 0x000050, "Wrong size on Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, EntryPoint) == 0x000000, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::EntryPoint' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_HandleClientEvent_EventSource) == 0x000008, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_HandleClientEvent_EventSource' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_HandleClientEvent_EventFocus) == 0x000010, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_HandleClientEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_HandleClientEvent_ClientEvent) == 0x000018, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_HandleClientEvent_ClientEvent' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, Temp_bool_Has_Been_Initd_Variable) == 0x000030, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc_SpawnObject_ReturnValue) == 0x000048, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

}

