#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Street_UrbanLight_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Apollo_Street_UrbanLight_01.Apollo_Street_UrbanLight_01_C.ExecuteUbergraph_Apollo_Street_UrbanLight_01
// 0x0008 (0x0008 - 0x0000)
struct Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_Event_CurrentDayPhase;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_Event_PreviousDayPhase;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAtCreation;                          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01) == 0x000004, "Wrong alignment on Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01");
static_assert(sizeof(Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01) == 0x000008, "Wrong size on Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01, EntryPoint) == 0x000000, "Member 'Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01, K2Node_Event_CurrentDayPhase) == 0x000004, "Member 'Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01::K2Node_Event_CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01, K2Node_Event_PreviousDayPhase) == 0x000005, "Member 'Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01::K2Node_Event_PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01, K2Node_Event_bAtCreation) == 0x000006, "Member 'Apollo_Street_UrbanLight_01_C_ExecuteUbergraph_Apollo_Street_UrbanLight_01::K2Node_Event_bAtCreation' has a wrong offset!");

// Function Apollo_Street_UrbanLight_01.Apollo_Street_UrbanLight_01_C.OnDayPhaseChanged
// 0x0003 (0x0003 - 0x0000)
struct Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged final
{
public:
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 PreviousDayPhase;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAtCreation;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged) == 0x000001, "Wrong alignment on Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged");
static_assert(sizeof(Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged) == 0x000003, "Wrong size on Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged, CurrentDayPhase) == 0x000000, "Member 'Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged::CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged, PreviousDayPhase) == 0x000001, "Member 'Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged::PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged, bAtCreation) == 0x000002, "Member 'Apollo_Street_UrbanLight_01_C_OnDayPhaseChanged::bAtCreation' has a wrong offset!");

// Function Apollo_Street_UrbanLight_01.Apollo_Street_UrbanLight_01_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct Apollo_Street_UrbanLight_01_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USpotLightComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USpotLightComponent*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Street_UrbanLight_01_C_UserConstructionScript) == 0x000008, "Wrong alignment on Apollo_Street_UrbanLight_01_C_UserConstructionScript");
static_assert(sizeof(Apollo_Street_UrbanLight_01_C_UserConstructionScript) == 0x000040, "Wrong size on Apollo_Street_UrbanLight_01_C_UserConstructionScript");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Apollo_Street_UrbanLight_01_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Apollo_Street_UrbanLight_01_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Apollo_Street_UrbanLight_01_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_UserConstructionScript, CallFunc_GetLightColor_ReturnValue) == 0x00000C, "Member 'Apollo_Street_UrbanLight_01_C_UserConstructionScript::CallFunc_GetLightColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_UserConstructionScript, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000020, "Member 'Apollo_Street_UrbanLight_01_C_UserConstructionScript::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000030, "Member 'Apollo_Street_UrbanLight_01_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'Apollo_Street_UrbanLight_01_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'Apollo_Street_UrbanLight_01_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Street_UrbanLight_01_C_UserConstructionScript, CallFunc_Array_RemoveItem_ReturnValue) == 0x00003D, "Member 'Apollo_Street_UrbanLight_01_C_UserConstructionScript::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

}

