#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_PowerPlant_Transformer_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_PowerPlant_Transformer_01.Apollo_PowerPlant_Transformer_01_C
// 0x0028 (0x0E98 - 0x0E70)
class AApollo_PowerPlant_Transformer_01_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Transformer_Large_Buzz_Cue;                        // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Electric_ON_Hit;                            // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Shock;                                      // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Electricity_On;                             // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_PowerPlant_Transformer_01(int32 EntryPoint);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_PowerPlant_Transformer_01_C">();
	}
	static class AApollo_PowerPlant_Transformer_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_PowerPlant_Transformer_01_C>();
	}
};
static_assert(alignof(AApollo_PowerPlant_Transformer_01_C) == 0x000008, "Wrong alignment on AApollo_PowerPlant_Transformer_01_C");
static_assert(sizeof(AApollo_PowerPlant_Transformer_01_C) == 0x000E98, "Wrong size on AApollo_PowerPlant_Transformer_01_C");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, UberGraphFrame) == 0x000E70, "Member 'AApollo_PowerPlant_Transformer_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, Transformer_Large_Buzz_Cue) == 0x000E78, "Member 'AApollo_PowerPlant_Transformer_01_C::Transformer_Large_Buzz_Cue' has a wrong offset!");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, Effect_Electric_ON_Hit) == 0x000E80, "Member 'AApollo_PowerPlant_Transformer_01_C::Effect_Electric_ON_Hit' has a wrong offset!");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, Effect_Shock) == 0x000E88, "Member 'AApollo_PowerPlant_Transformer_01_C::Effect_Shock' has a wrong offset!");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, Effect_Electricity_On) == 0x000E90, "Member 'AApollo_PowerPlant_Transformer_01_C::Effect_Electricity_On' has a wrong offset!");

}

