#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_WoodHouse_Floor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_WoodHouse_Floor.Apollo_WoodHouse_Floor_C
// 0x0018 (0x0D78 - 0x0D60)
class AApollo_WoodHouse_Floor_C final : public ABuildingFloor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        WoodStressSound;                                   // 0x0D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             WoodStressLoop_SoundCue;                           // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_WoodHouse_Floor(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_WoodHouse_Floor_C">();
	}
	static class AApollo_WoodHouse_Floor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_WoodHouse_Floor_C>();
	}
};
static_assert(alignof(AApollo_WoodHouse_Floor_C) == 0x000008, "Wrong alignment on AApollo_WoodHouse_Floor_C");
static_assert(sizeof(AApollo_WoodHouse_Floor_C) == 0x000D78, "Wrong size on AApollo_WoodHouse_Floor_C");
static_assert(offsetof(AApollo_WoodHouse_Floor_C, UberGraphFrame) == 0x000D60, "Member 'AApollo_WoodHouse_Floor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_WoodHouse_Floor_C, WoodStressSound) == 0x000D68, "Member 'AApollo_WoodHouse_Floor_C::WoodStressSound' has a wrong offset!");
static_assert(offsetof(AApollo_WoodHouse_Floor_C, WoodStressLoop_SoundCue) == 0x000D70, "Member 'AApollo_WoodHouse_Floor_C::WoodStressLoop_SoundCue' has a wrong offset!");

}

