#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Poster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Poster.Apollo_Poster_C
// 0x0050 (0x0EC0 - 0x0E70)
class AApollo_Poster_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   InteractString;                                    // 0x0E80(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UFortQuestItemDefinition*               QuestToCheck;                                      // 0x0E98(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QuestBackendName;                                  // 0x0EA0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA4[0x4];                                      // 0x0EA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             MarkerSound;                                       // 0x0EA8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DefacedMaterial;                                   // 0x0EB0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInteract;                                       // 0x0EB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDefaced;                                         // 0x0EB9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void ExecuteUbergraph_Apollo_Poster(int32 EntryPoint);
	void OnBounceAnimationUpdate(const struct FFortBounceData& Data);
	void OnCurrentQuestsReady_A9A3369C46B5BFC668A6A19C2DD8D7A9(class UFortQuestManager* OwningQuestManager, bool bFoundAllQuestsOnProfile);
	void OnRep_IsDefaced();
	void PosterCosmeticEffects();
	void ReceiveBeginPlay();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Poster_C">();
	}
	static class AApollo_Poster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Poster_C>();
	}
};
static_assert(alignof(AApollo_Poster_C) == 0x000008, "Wrong alignment on AApollo_Poster_C");
static_assert(sizeof(AApollo_Poster_C) == 0x000EC0, "Wrong size on AApollo_Poster_C");
static_assert(offsetof(AApollo_Poster_C, UberGraphFrame) == 0x000E70, "Member 'AApollo_Poster_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_Poster_C, Box) == 0x000E78, "Member 'AApollo_Poster_C::Box' has a wrong offset!");
static_assert(offsetof(AApollo_Poster_C, InteractString) == 0x000E80, "Member 'AApollo_Poster_C::InteractString' has a wrong offset!");
static_assert(offsetof(AApollo_Poster_C, QuestToCheck) == 0x000E98, "Member 'AApollo_Poster_C::QuestToCheck' has a wrong offset!");
static_assert(offsetof(AApollo_Poster_C, QuestBackendName) == 0x000EA0, "Member 'AApollo_Poster_C::QuestBackendName' has a wrong offset!");
static_assert(offsetof(AApollo_Poster_C, MarkerSound) == 0x000EA8, "Member 'AApollo_Poster_C::MarkerSound' has a wrong offset!");
static_assert(offsetof(AApollo_Poster_C, DefacedMaterial) == 0x000EB0, "Member 'AApollo_Poster_C::DefacedMaterial' has a wrong offset!");
static_assert(offsetof(AApollo_Poster_C, CanInteract) == 0x000EB8, "Member 'AApollo_Poster_C::CanInteract' has a wrong offset!");
static_assert(offsetof(AApollo_Poster_C, IsDefaced) == 0x000EB9, "Member 'AApollo_Poster_C::IsDefaced' has a wrong offset!");

}

