#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_AirDuct_EndCap_Fan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Apollo_AirDuct_Prop_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_AirDuct_EndCap_Fan.Apollo_AirDuct_EndCap_Fan_C
// 0x0018 (0x0E90 - 0x0E78)
class AApollo_AirDuct_EndCap_Fan_C final : public AApollo_AirDuct_Prop_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AMB_FanLoop;                                       // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_AirDuct_EndCap_Fan(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_AirDuct_EndCap_Fan_C">();
	}
	static class AApollo_AirDuct_EndCap_Fan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_AirDuct_EndCap_Fan_C>();
	}
};
static_assert(alignof(AApollo_AirDuct_EndCap_Fan_C) == 0x000008, "Wrong alignment on AApollo_AirDuct_EndCap_Fan_C");
static_assert(sizeof(AApollo_AirDuct_EndCap_Fan_C) == 0x000E90, "Wrong size on AApollo_AirDuct_EndCap_Fan_C");
static_assert(offsetof(AApollo_AirDuct_EndCap_Fan_C, UberGraphFrame) == 0x000E78, "Member 'AApollo_AirDuct_EndCap_Fan_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_AirDuct_EndCap_Fan_C, AMB_FanLoop) == 0x000E80, "Member 'AApollo_AirDuct_EndCap_Fan_C::AMB_FanLoop' has a wrong offset!");
static_assert(offsetof(AApollo_AirDuct_EndCap_Fan_C, StaticMesh1) == 0x000E88, "Member 'AApollo_AirDuct_EndCap_Fan_C::StaticMesh1' has a wrong offset!");

}

