#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Vault_Floor

#include "Basic.hpp"


namespace SDK::Params
{

// Function Apollo_Vault_Floor.Apollo_Vault_Floor_C.ShouldDie
// 0x0020 (0x0020 - 0x0000)
struct Apollo_Vault_Floor_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Vault_Floor_C_ShouldDie) == 0x000008, "Wrong alignment on Apollo_Vault_Floor_C_ShouldDie");
static_assert(sizeof(Apollo_Vault_Floor_C_ShouldDie) == 0x000020, "Wrong size on Apollo_Vault_Floor_C_ShouldDie");
static_assert(offsetof(Apollo_Vault_Floor_C_ShouldDie, Damage) == 0x000000, "Member 'Apollo_Vault_Floor_C_ShouldDie::Damage' has a wrong offset!");
static_assert(offsetof(Apollo_Vault_Floor_C_ShouldDie, EventInstigator) == 0x000008, "Member 'Apollo_Vault_Floor_C_ShouldDie::EventInstigator' has a wrong offset!");
static_assert(offsetof(Apollo_Vault_Floor_C_ShouldDie, DamageCauser) == 0x000010, "Member 'Apollo_Vault_Floor_C_ShouldDie::DamageCauser' has a wrong offset!");
static_assert(offsetof(Apollo_Vault_Floor_C_ShouldDie, ReturnValue) == 0x000018, "Member 'Apollo_Vault_Floor_C_ShouldDie::ReturnValue' has a wrong offset!");

}

