#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Commerce_ArcadeCabinet_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Commerce_ArcadeCabinet_02.Apollo_Commerce_ArcadeCabinet_02_C
// 0x0018 (0x0E88 - 0x0E70)
class AApollo_Commerce_ArcadeCabinet_02_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Music;                                             // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayAudio;                                         // 0x0E80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_Commerce_ArcadeCabinet_02(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Commerce_ArcadeCabinet_02_C">();
	}
	static class AApollo_Commerce_ArcadeCabinet_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Commerce_ArcadeCabinet_02_C>();
	}
};
static_assert(alignof(AApollo_Commerce_ArcadeCabinet_02_C) == 0x000008, "Wrong alignment on AApollo_Commerce_ArcadeCabinet_02_C");
static_assert(sizeof(AApollo_Commerce_ArcadeCabinet_02_C) == 0x000E88, "Wrong size on AApollo_Commerce_ArcadeCabinet_02_C");
static_assert(offsetof(AApollo_Commerce_ArcadeCabinet_02_C, UberGraphFrame) == 0x000E70, "Member 'AApollo_Commerce_ArcadeCabinet_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_Commerce_ArcadeCabinet_02_C, Music) == 0x000E78, "Member 'AApollo_Commerce_ArcadeCabinet_02_C::Music' has a wrong offset!");
static_assert(offsetof(AApollo_Commerce_ArcadeCabinet_02_C, PlayAudio) == 0x000E80, "Member 'AApollo_Commerce_ArcadeCabinet_02_C::PlayAudio' has a wrong offset!");

}

