#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Coastal_Conch_Horn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Coastal_Conch_Horn.Apollo_Coastal_Conch_Horn_C
// 0x0038 (0x0EA8 - 0x0E70)
class AApollo_Coastal_Conch_Horn_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CanThePlayerInteract;                              // 0x0E78(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E79[0x7];                                      // 0x0E79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpawnLocation;                                     // 0x0E80(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x0E98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9C[0x4];                                      // 0x0E9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundCue;                                          // 0x0EA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void ExecuteUbergraph_Apollo_Coastal_Conch_Horn(int32 EntryPoint);
	void PlayHorn();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	void GetIconPlacement(const class AActor* SelfActor, const class AActor* ViewingActor, struct FVector* OutLocation, struct FVector* OutExtents) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Coastal_Conch_Horn_C">();
	}
	static class AApollo_Coastal_Conch_Horn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Coastal_Conch_Horn_C>();
	}
};
static_assert(alignof(AApollo_Coastal_Conch_Horn_C) == 0x000008, "Wrong alignment on AApollo_Coastal_Conch_Horn_C");
static_assert(sizeof(AApollo_Coastal_Conch_Horn_C) == 0x000EA8, "Wrong size on AApollo_Coastal_Conch_Horn_C");
static_assert(offsetof(AApollo_Coastal_Conch_Horn_C, UberGraphFrame) == 0x000E70, "Member 'AApollo_Coastal_Conch_Horn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_Coastal_Conch_Horn_C, CanThePlayerInteract) == 0x000E78, "Member 'AApollo_Coastal_Conch_Horn_C::CanThePlayerInteract' has a wrong offset!");
static_assert(offsetof(AApollo_Coastal_Conch_Horn_C, SpawnLocation) == 0x000E80, "Member 'AApollo_Coastal_Conch_Horn_C::SpawnLocation' has a wrong offset!");
static_assert(offsetof(AApollo_Coastal_Conch_Horn_C, Pitch) == 0x000E98, "Member 'AApollo_Coastal_Conch_Horn_C::Pitch' has a wrong offset!");
static_assert(offsetof(AApollo_Coastal_Conch_Horn_C, SoundCue) == 0x000EA0, "Member 'AApollo_Coastal_Conch_Horn_C::SoundCue' has a wrong offset!");

}

