#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Fac_Pipe_90_03_Child_OilRig

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Apollo_Fac_Pipe_90_03_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Fac_Pipe_90_03_Child_OilRig.Apollo_Fac_Pipe_90_03_Child_OilRig_C
// 0x0018 (0x0E88 - 0x0E70)
class AApollo_Fac_Pipe_90_03_Child_OilRig_C final : public AApollo_Fac_Pipe_90_03_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Is_Oil_Dripping;                                   // 0x0E78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E79[0x7];                                      // 0x0E79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     NewVar_0;                                          // 0x0E80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_Fac_Pipe_90_03_Child_OilRig(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Fac_Pipe_90_03_Child_OilRig_C">();
	}
	static class AApollo_Fac_Pipe_90_03_Child_OilRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Fac_Pipe_90_03_Child_OilRig_C>();
	}
};
static_assert(alignof(AApollo_Fac_Pipe_90_03_Child_OilRig_C) == 0x000008, "Wrong alignment on AApollo_Fac_Pipe_90_03_Child_OilRig_C");
static_assert(sizeof(AApollo_Fac_Pipe_90_03_Child_OilRig_C) == 0x000E88, "Wrong size on AApollo_Fac_Pipe_90_03_Child_OilRig_C");
static_assert(offsetof(AApollo_Fac_Pipe_90_03_Child_OilRig_C, UberGraphFrame) == 0x000E70, "Member 'AApollo_Fac_Pipe_90_03_Child_OilRig_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_Fac_Pipe_90_03_Child_OilRig_C, Is_Oil_Dripping) == 0x000E78, "Member 'AApollo_Fac_Pipe_90_03_Child_OilRig_C::Is_Oil_Dripping' has a wrong offset!");
static_assert(offsetof(AApollo_Fac_Pipe_90_03_Child_OilRig_C, NewVar_0) == 0x000E80, "Member 'AApollo_Fac_Pipe_90_03_Child_OilRig_C::NewVar_0' has a wrong offset!");

}

