#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Agency_Poster_01

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Apollo_Agency_Poster_01.Apollo_Agency_Poster_01_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct Apollo_Agency_Poster_01_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Agency_Poster_01_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on Apollo_Agency_Poster_01_C_BlueprintOnInteract");
static_assert(sizeof(Apollo_Agency_Poster_01_C_BlueprintOnInteract) == 0x000010, "Wrong size on Apollo_Agency_Poster_01_C_BlueprintOnInteract");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'Apollo_Agency_Poster_01_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'Apollo_Agency_Poster_01_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function Apollo_Agency_Poster_01.Apollo_Agency_Poster_01_C.ExecuteUbergraph_Apollo_Agency_Poster_01
// 0x00D8 (0x00D8 - 0x0000)
struct Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      K2Node_CustomEvent_OwningQuestManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFoundAllQuestsOnProfile;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItemDefinition*>       K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0048(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentQuestsReady*    CallFunc_CurrentQuestsReadyAsync_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuest_PlayerControllerOut; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuest_CompletedQuest;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortQuestManager* OwningQuestManager, bool bFoundAllQuestsOnProfile)> K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortBounceData                        K2Node_Event_Data;                                 // 0x00A4(0x0030)(ConstParm, NoDestructor)
};
static_assert(alignof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01) == 0x000008, "Wrong alignment on Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01");
static_assert(sizeof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01) == 0x0000D8, "Wrong size on Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, EntryPoint) == 0x000000, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, K2Node_CustomEvent_OwningQuestManager) == 0x000008, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::K2Node_CustomEvent_OwningQuestManager' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, K2Node_CustomEvent_bFoundAllQuestsOnProfile) == 0x000010, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::K2Node_CustomEvent_bFoundAllQuestsOnProfile' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, Temp_bool_Variable) == 0x000011, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, Temp_object_Variable) == 0x000018, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000020, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, K2Node_MakeArray_Array) == 0x000028, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_GetQuestManager_ReturnValue) == 0x000038, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, K2Node_Event_InteractingPawn) == 0x000040, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, K2Node_Event_InteractionBeingAttempted) == 0x000048, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_CurrentQuestsReadyAsync_ReturnValue) == 0x000050, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_CurrentQuestsReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000058, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_GetQuestManager_ReturnValue_1) == 0x000060, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_HasAuthority_ReturnValue) == 0x000069, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_HasPlayerCompletedQuest_PlayerControllerOut) == 0x000088, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_HasPlayerCompletedQuest_PlayerControllerOut' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_HasPlayerCompletedQuest_CompletedQuest) == 0x000090, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_HasPlayerCompletedQuest_CompletedQuest' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_Not_PreBool_ReturnValue) == 0x0000A0, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, CallFunc_BooleanAND_ReturnValue) == 0x0000A1, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01, K2Node_Event_Data) == 0x0000A4, "Member 'Apollo_Agency_Poster_01_C_ExecuteUbergraph_Apollo_Agency_Poster_01::K2Node_Event_Data' has a wrong offset!");

// Function Apollo_Agency_Poster_01.Apollo_Agency_Poster_01_C.OnBounceAnimationUpdate
// 0x0030 (0x0030 - 0x0000)
struct Apollo_Agency_Poster_01_C_OnBounceAnimationUpdate final
{
public:
	struct FFortBounceData                        Data;                                              // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Apollo_Agency_Poster_01_C_OnBounceAnimationUpdate) == 0x000004, "Wrong alignment on Apollo_Agency_Poster_01_C_OnBounceAnimationUpdate");
static_assert(sizeof(Apollo_Agency_Poster_01_C_OnBounceAnimationUpdate) == 0x000030, "Wrong size on Apollo_Agency_Poster_01_C_OnBounceAnimationUpdate");
static_assert(offsetof(Apollo_Agency_Poster_01_C_OnBounceAnimationUpdate, Data) == 0x000000, "Member 'Apollo_Agency_Poster_01_C_OnBounceAnimationUpdate::Data' has a wrong offset!");

// Function Apollo_Agency_Poster_01.Apollo_Agency_Poster_01_C.OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977
// 0x0010 (0x0010 - 0x0000)
struct Apollo_Agency_Poster_01_C_OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977 final
{
public:
	class UFortQuestManager*                      OwningQuestManager;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFoundAllQuestsOnProfile;                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Agency_Poster_01_C_OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977) == 0x000008, "Wrong alignment on Apollo_Agency_Poster_01_C_OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977");
static_assert(sizeof(Apollo_Agency_Poster_01_C_OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977) == 0x000010, "Wrong size on Apollo_Agency_Poster_01_C_OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977");
static_assert(offsetof(Apollo_Agency_Poster_01_C_OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977, OwningQuestManager) == 0x000000, "Member 'Apollo_Agency_Poster_01_C_OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977::OwningQuestManager' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977, bFoundAllQuestsOnProfile) == 0x000008, "Member 'Apollo_Agency_Poster_01_C_OnCurrentQuestsReady_0C8E5B5B41A11E40F43F7A9CEBE88977::bFoundAllQuestsOnProfile' has a wrong offset!");

// Function Apollo_Agency_Poster_01.Apollo_Agency_Poster_01_C.BlueprintCanInteract
// 0x0010 (0x0010 - 0x0000)
struct Apollo_Agency_Poster_01_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Agency_Poster_01_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on Apollo_Agency_Poster_01_C_BlueprintCanInteract");
static_assert(sizeof(Apollo_Agency_Poster_01_C_BlueprintCanInteract) == 0x000010, "Wrong size on Apollo_Agency_Poster_01_C_BlueprintCanInteract");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'Apollo_Agency_Poster_01_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'Apollo_Agency_Poster_01_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'Apollo_Agency_Poster_01_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'Apollo_Agency_Poster_01_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'Apollo_Agency_Poster_01_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'Apollo_Agency_Poster_01_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Apollo_Agency_Poster_01.Apollo_Agency_Poster_01_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct Apollo_Agency_Poster_01_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Apollo_Agency_Poster_01_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on Apollo_Agency_Poster_01_C_BlueprintGetInteractionString");
static_assert(sizeof(Apollo_Agency_Poster_01_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on Apollo_Agency_Poster_01_C_BlueprintGetInteractionString");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'Apollo_Agency_Poster_01_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'Apollo_Agency_Poster_01_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_Poster_01_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'Apollo_Agency_Poster_01_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");

}

