#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Outdoor_Bouncy_Umbrella_Table_03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Apollo_Outdoor_Bouncy_Umbrella_Table_03.Apollo_Outdoor_Bouncy_Umbrella_Table_03_C.BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Apollo_Outdoor_Bouncy_Umbrella_Table_03.Apollo_Outdoor_Bouncy_Umbrella_Table_03_C.ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03
// 0x0120 (0x0120 - 0x0000)
struct Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03) == 0x000008, "Wrong alignment on Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03");
static_assert(sizeof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03) == 0x000120, "Wrong size on Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, EntryPoint) == 0x000000, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000108, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000110, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'Apollo_Outdoor_Bouncy_Umbrella_Table_03_C_ExecuteUbergraph_Apollo_Outdoor_Bouncy_Umbrella_Table_03::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

