#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Candle_03

#include "Basic.hpp"

#include "Transylvania_LightMaster_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Candle_03.Apollo_Candle_03_C
// 0x0020 (0x0FA0 - 0x0F80)
class AApollo_Candle_03_C final : public ATransylvania_LightMaster_C
{
public:
	class UStaticMeshComponent*                   BloomPlane2;                                       // 0x0F80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame2;                                            // 0x0F88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BloomPlane1;                                       // 0x0F90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame1;                                            // 0x0F98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Candle_03_C">();
	}
	static class AApollo_Candle_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Candle_03_C>();
	}
};
static_assert(alignof(AApollo_Candle_03_C) == 0x000008, "Wrong alignment on AApollo_Candle_03_C");
static_assert(sizeof(AApollo_Candle_03_C) == 0x000FA0, "Wrong size on AApollo_Candle_03_C");
static_assert(offsetof(AApollo_Candle_03_C, BloomPlane2) == 0x000F80, "Member 'AApollo_Candle_03_C::BloomPlane2' has a wrong offset!");
static_assert(offsetof(AApollo_Candle_03_C, Flame2) == 0x000F88, "Member 'AApollo_Candle_03_C::Flame2' has a wrong offset!");
static_assert(offsetof(AApollo_Candle_03_C, BloomPlane1) == 0x000F90, "Member 'AApollo_Candle_03_C::BloomPlane1' has a wrong offset!");
static_assert(offsetof(AApollo_Candle_03_C, Flame1) == 0x000F98, "Member 'AApollo_Candle_03_C::Flame1' has a wrong offset!");

}

