#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Waterbody_Waterfall_Transition_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Waterbody_Waterfall_Transition_Parent.Apollo_Waterbody_Waterfall_Transition_Parent_C
// 0x00B0 (0x0440 - 0x0390)
class AApollo_Waterbody_Waterfall_Transition_Parent_C : public AFortWaterBodyActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow1;                                            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LocalTempMID;                                      // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          NiagaraSystem;                                     // 0x03B0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         CascadeSystem;                                     // 0x03D8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                WaterFallTop;                                      // 0x0400(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterFallWidth;                                    // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WaterBottom;                                       // 0x0420(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PreviewNS;                                         // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CE_TestNiagara();
	void ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent(int32 EntryPoint);
	void OnLoaded_9FE809154B223C99D4F819AC7006D6B4(class UObject* Loaded);
	void OnLoaded_9FE809154B223C99D4F819ACEE7823E3(class UObject* Loaded);
	void OnLoaded_F0E84E4149FDF7FB4B67B3AB3A9A3A09(class UObject* Loaded);
	void OnLoaded_F0E84E4149FDF7FB4B67B3ABA4E4CF5E(class UObject* Loaded);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Waterbody_Waterfall_Transition_Parent_C">();
	}
	static class AApollo_Waterbody_Waterfall_Transition_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Waterbody_Waterfall_Transition_Parent_C>();
	}
};
static_assert(alignof(AApollo_Waterbody_Waterfall_Transition_Parent_C) == 0x000008, "Wrong alignment on AApollo_Waterbody_Waterfall_Transition_Parent_C");
static_assert(sizeof(AApollo_Waterbody_Waterfall_Transition_Parent_C) == 0x000440, "Wrong size on AApollo_Waterbody_Waterfall_Transition_Parent_C");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, UberGraphFrame) == 0x000390, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, Arrow1) == 0x000398, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::Arrow1' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, Arrow) == 0x0003A0, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::Arrow' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, LocalTempMID) == 0x0003A8, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::LocalTempMID' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, NiagaraSystem) == 0x0003B0, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, CascadeSystem) == 0x0003D8, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::CascadeSystem' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, WaterFallTop) == 0x000400, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::WaterFallTop' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, WaterFallWidth) == 0x000418, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::WaterFallWidth' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, WaterBottom) == 0x000420, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::WaterBottom' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Waterfall_Transition_Parent_C, PreviewNS) == 0x000438, "Member 'AApollo_Waterbody_Waterfall_Transition_Parent_C::PreviewNS' has a wrong offset!");

}

