#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_AirDuct_Grate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Apollo_AirDuct_Grate.Apollo_AirDuct_Grate_C.UserConstructionScript
// 0x0190 (0x0190 - 0x0000)
struct Apollo_AirDuct_Grate_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class UBillboardComponent*                    CallFunc_AddComponent_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    CallFunc_AddComponent_ReturnValue_1;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x00D0(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_AirDuct_Grate_C_UserConstructionScript) == 0x000010, "Wrong alignment on Apollo_AirDuct_Grate_C_UserConstructionScript");
static_assert(sizeof(Apollo_AirDuct_Grate_C_UserConstructionScript) == 0x000190, "Wrong size on Apollo_AirDuct_Grate_C_UserConstructionScript");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000060, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0000C0, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_1) == 0x0000C8, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_GetRelativeTransform_ReturnValue) == 0x0000D0, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000130, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x000148, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000160, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x000178, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x00017C, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000180, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_Abs_ReturnValue) == 0x000184, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_Abs_ReturnValue_1) == 0x000188, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00018C, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_AirDuct_Grate_C_UserConstructionScript, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00018D, "Member 'Apollo_AirDuct_Grate_C_UserConstructionScript::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");

}

