#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Donut_Spotlight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Apollo_Donut_Spotlight.Apollo_Donut_Spotlight_C.ExecuteUbergraph_Apollo_Donut_Spotlight
// 0x0004 (0x0004 - 0x0000)
struct Apollo_Donut_Spotlight_C_ExecuteUbergraph_Apollo_Donut_Spotlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Donut_Spotlight_C_ExecuteUbergraph_Apollo_Donut_Spotlight) == 0x000004, "Wrong alignment on Apollo_Donut_Spotlight_C_ExecuteUbergraph_Apollo_Donut_Spotlight");
static_assert(sizeof(Apollo_Donut_Spotlight_C_ExecuteUbergraph_Apollo_Donut_Spotlight) == 0x000004, "Wrong size on Apollo_Donut_Spotlight_C_ExecuteUbergraph_Apollo_Donut_Spotlight");
static_assert(offsetof(Apollo_Donut_Spotlight_C_ExecuteUbergraph_Apollo_Donut_Spotlight, EntryPoint) == 0x000000, "Member 'Apollo_Donut_Spotlight_C_ExecuteUbergraph_Apollo_Donut_Spotlight::EntryPoint' has a wrong offset!");

// Function Apollo_Donut_Spotlight.Apollo_Donut_Spotlight_C.UserConstructionScript
// 0x0080 (0x0080 - 0x0000)
struct Apollo_Donut_Spotlight_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Donut_Spotlight_C_UserConstructionScript) == 0x000008, "Wrong alignment on Apollo_Donut_Spotlight_C_UserConstructionScript");
static_assert(sizeof(Apollo_Donut_Spotlight_C_UserConstructionScript) == 0x000080, "Wrong size on Apollo_Donut_Spotlight_C_UserConstructionScript");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000010, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000018, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000038, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x00003C, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000040, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_SafeDivide_ReturnValue) == 0x000044, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_Fraction_ReturnValue) == 0x000048, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_Abs_ReturnValue) == 0x00004C, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000054, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_GetPlatformName_ReturnValue) == 0x000068, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Donut_Spotlight_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000078, "Member 'Apollo_Donut_Spotlight_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

}

