#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Tree_RedAlder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Parent_Tree_Apollo_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Tree_RedAlder.Apollo_Tree_RedAlder_C
// 0x0028 (0x0F18 - 0x0EF0)
class AApollo_Tree_RedAlder_C : public AParent_Tree_Apollo_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Apollo_Tree_RedAlder_C;             // 0x0EF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UShadowProxyMeshComponent_C*            ShadowProxyMeshComponent;                          // 0x0EF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeathEffect_leafColor;                             // 0x0F00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          useDeathFXOverride;                                // 0x0F10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void activateDeathFXOverride();
	void ExecuteUbergraph_Apollo_Tree_RedAlder(int32 EntryPoint);
	void initRandomUndergrowth();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Tree_RedAlder_C">();
	}
	static class AApollo_Tree_RedAlder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Tree_RedAlder_C>();
	}
};
static_assert(alignof(AApollo_Tree_RedAlder_C) == 0x000008, "Wrong alignment on AApollo_Tree_RedAlder_C");
static_assert(sizeof(AApollo_Tree_RedAlder_C) == 0x000F18, "Wrong size on AApollo_Tree_RedAlder_C");
static_assert(offsetof(AApollo_Tree_RedAlder_C, UberGraphFrame_Apollo_Tree_RedAlder_C) == 0x000EF0, "Member 'AApollo_Tree_RedAlder_C::UberGraphFrame_Apollo_Tree_RedAlder_C' has a wrong offset!");
static_assert(offsetof(AApollo_Tree_RedAlder_C, ShadowProxyMeshComponent) == 0x000EF8, "Member 'AApollo_Tree_RedAlder_C::ShadowProxyMeshComponent' has a wrong offset!");
static_assert(offsetof(AApollo_Tree_RedAlder_C, DeathEffect_leafColor) == 0x000F00, "Member 'AApollo_Tree_RedAlder_C::DeathEffect_leafColor' has a wrong offset!");
static_assert(offsetof(AApollo_Tree_RedAlder_C, useDeathFXOverride) == 0x000F10, "Member 'AApollo_Tree_RedAlder_C::useDeathFXOverride' has a wrong offset!");

}

