#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_MountainBase_Fan_Large

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_MountainBase_Fan_Large.Apollo_MountainBase_Fan_Large_C
// 0x0018 (0x0E88 - 0x0E70)
class AApollo_MountainBase_Fan_Large_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AmbientAudio;                                      // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MilitaryBase_Solid_Vent_01;                      // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_MountainBase_Fan_Large(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_MountainBase_Fan_Large_C">();
	}
	static class AApollo_MountainBase_Fan_Large_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_MountainBase_Fan_Large_C>();
	}
};
static_assert(alignof(AApollo_MountainBase_Fan_Large_C) == 0x000008, "Wrong alignment on AApollo_MountainBase_Fan_Large_C");
static_assert(sizeof(AApollo_MountainBase_Fan_Large_C) == 0x000E88, "Wrong size on AApollo_MountainBase_Fan_Large_C");
static_assert(offsetof(AApollo_MountainBase_Fan_Large_C, UberGraphFrame) == 0x000E70, "Member 'AApollo_MountainBase_Fan_Large_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_MountainBase_Fan_Large_C, AmbientAudio) == 0x000E78, "Member 'AApollo_MountainBase_Fan_Large_C::AmbientAudio' has a wrong offset!");
static_assert(offsetof(AApollo_MountainBase_Fan_Large_C, S_MilitaryBase_Solid_Vent_01) == 0x000E80, "Member 'AApollo_MountainBase_Fan_Large_C::S_MilitaryBase_Solid_Vent_01' has a wrong offset!");

}

