#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_GasPump_Valet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Curie_structs.hpp"


namespace SDK::Params
{

// Function Apollo_GasPump_Valet.Apollo_GasPump_Valet_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct Apollo_GasPump_Valet_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_GasPump_Valet_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on Apollo_GasPump_Valet_C_BlueprintOnInteract");
static_assert(sizeof(Apollo_GasPump_Valet_C_BlueprintOnInteract) == 0x000010, "Wrong size on Apollo_GasPump_Valet_C_BlueprintOnInteract");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'Apollo_GasPump_Valet_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'Apollo_GasPump_Valet_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function Apollo_GasPump_Valet.Apollo_GasPump_Valet_C.BlueprintOnLocalInteract
// 0x0038 (0x0038 - 0x0000)
struct Apollo_GasPump_Valet_C_BlueprintOnLocalInteract final
{
public:
	class AFortPlayerPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBulletsPerClip_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingAmmo_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract) == 0x000008, "Wrong alignment on Apollo_GasPump_Valet_C_BlueprintOnLocalInteract");
static_assert(sizeof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract) == 0x000038, "Wrong size on Apollo_GasPump_Valet_C_BlueprintOnLocalInteract");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract, InteractingPawn) == 0x000000, "Member 'Apollo_GasPump_Valet_C_BlueprintOnLocalInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract, InteractionBeingAttempted) == 0x000008, "Member 'Apollo_GasPump_Valet_C_BlueprintOnLocalInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract, ReturnValue) == 0x000009, "Member 'Apollo_GasPump_Valet_C_BlueprintOnLocalInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Apollo_GasPump_Valet_C_BlueprintOnLocalInteract::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'Apollo_GasPump_Valet_C_BlueprintOnLocalInteract::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract, CallFunc_GetBulletsPerClip_ReturnValue) == 0x00002C, "Member 'Apollo_GasPump_Valet_C_BlueprintOnLocalInteract::CallFunc_GetBulletsPerClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract, CallFunc_GetRemainingAmmo_ReturnValue) == 0x000030, "Member 'Apollo_GasPump_Valet_C_BlueprintOnLocalInteract::CallFunc_GetRemainingAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_BlueprintOnLocalInteract, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000034, "Member 'Apollo_GasPump_Valet_C_BlueprintOnLocalInteract::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function Apollo_GasPump_Valet.Apollo_GasPump_Valet_C.ExecuteUbergraph_Apollo_GasPump_Valet
// 0x09B0 (0x09B0 - 0x0000)
struct Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0008(0x0020)()
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0030(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0048(0x0020)(ConstParm)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_1;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0088(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x00C0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x01B0(0x0018)()
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0200(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x02C8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue; // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF[0x1];                                      // 0x02EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorSubmergedInOcean_ReturnValue;      // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanTotalHeight_ReturnValue;          // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurieContainerHandle                  K2Node_Event_CurieContainerHandle_1;               // 0x0320(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_ElementTag_1;                         // 0x0324(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FCurieInteractParamsHandle             K2Node_Event_InteractParamsHandle_1;               // 0x0328(0x0010)(ConstParm)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetInstigatorInfoFromInteractParams_Instigator; // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInstigatorInfoFromInteractParams_EffectCauser; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurieContainerHandle                  K2Node_Event_CurieContainerHandle;                 // 0x0370(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_ElementTag;                           // 0x0374(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FCurieInteractParamsHandle             K2Node_Event_InteractParamsHandle;                 // 0x0378(0x0010)(ConstParm)
	class AActor*                                 CallFunc_GetInstigatorInfoFromInteractParams_Instigator_1; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInstigatorInfoFromInteractParams_EffectCauser_1; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller_1;     // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue_1;                 // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHoseAttachStartLocation_Location;      // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHoseAttachStartLocation_Location_1;    // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x03E8(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1; // 0x04DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x04DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x04DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DF[0x1];                                      // 0x04DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_7;            // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_8;            // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle;     // 0x04E8(0x0018)()
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0500(0x00D0)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x05D0(0x00D0)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAttached;                      // 0x06A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3[0x1];                                      // 0x06A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x06A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B2[0x2];                                      // 0x06B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_2; // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x06C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x06C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBulletsPerClip_ReturnValue;            // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingAmmo_ReturnValue;             // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_3; // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x3];                                      // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_4; // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2[0xE];                                      // 0x06E2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x06F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0x3];                                      // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0758(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0778(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0790(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0880(0x0018)()
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IHeldObjectInterface_C> K2Node_DynamicCast_AsHeld_Object_Interface;        // 0x08A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B1[0x7];                                      // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller_2;     // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Get_Last_Instigator_Last_Instigator;      // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue_3;              // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x08E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x08E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x08E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E3[0x5];                                      // 0x08E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x08F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F5[0x3];                                      // 0x08F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x08F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0910(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue; // 0x0930(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0948(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0964(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0965(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_966[0x2];                                      // 0x0966(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default_1;                           // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Held_Petrol_Pump_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_989[0x3];                                      // 0x0989(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x098C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActiveForActor_ReturnValue;        // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0999(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99A[0x2];                                      // 0x099A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_9;            // 0x099C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x09A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x09A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A5[0x3];                                      // 0x09A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x09A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x09AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet) == 0x000010, "Wrong alignment on Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet");
static_assert(sizeof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet) == 0x0009B0, "Wrong size on Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, EntryPoint) == 0x000000, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, Temp_struct_Variable) == 0x000008, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_InteractingPawn) == 0x000028, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_InteractionBeingAttempted) == 0x000030, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_CustomEvent_GameState) == 0x000038, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_CustomEvent_Playlist) == 0x000040, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_CustomEvent_PlaylistContextTags) == 0x000048, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000068, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_IsServer_ReturnValue) == 0x000071, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetSubGame_ReturnValue) == 0x000072, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000073, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, Temp_object_Variable) == 0x000078, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_Damage_1) == 0x000080, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_DamageTags_1) == 0x000088, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_Momentum_1) == 0x0000A8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_HitInfo_1) == 0x0000C0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_InstigatedBy_1) == 0x0001A0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_DamageCauser_1) == 0x0001A8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_EffectContext_1) == 0x0001B0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0001C8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001E0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, Temp_object_Variable_1) == 0x0001F8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_MakeTransform_ReturnValue) == 0x000200, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000260, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetUpVector_ReturnValue) == 0x000278, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_Add_VectorVector_ReturnValue) == 0x000290, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0002A8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetValueAtLevel_ReturnValue) == 0x0002B0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_IsValid_ReturnValue) == 0x0002B4, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0002B8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002BC, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0002C0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x0002C4, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_CreateDelegate_OutputDelegate) == 0x0002C8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_FTrunc_ReturnValue) == 0x0002D4, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002D8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetGameUserSettings_ReturnValue) == 0x0002E0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x0002E8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_SwitchInteger_CmpSuccess) == 0x0002EC, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue) == 0x0002ED, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_IsValid_ReturnValue_1) == 0x0002EE, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0002F0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_IsActorSubmergedInOcean_ReturnValue) == 0x0002F4, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_IsActorSubmergedInOcean_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002F8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetOceanTotalHeight_ReturnValue) == 0x000310, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetOceanTotalHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_BreakVector_X) == 0x000314, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_BreakVector_Y) == 0x000318, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_BreakVector_Z) == 0x00031C, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_CurieContainerHandle_1) == 0x000320, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_CurieContainerHandle_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_ElementTag_1) == 0x000324, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_ElementTag_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_InteractParamsHandle_1) == 0x000328, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_InteractParamsHandle_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000338, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetInstigatorInfoFromInteractParams_Instigator) == 0x000340, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetInstigatorInfoFromInteractParams_Instigator' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetInstigatorInfoFromInteractParams_EffectCauser) == 0x000348, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetInstigatorInfoFromInteractParams_EffectCauser' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_BooleanOR_ReturnValue) == 0x000350, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000358, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_DynamicCast_bSuccess_1) == 0x000360, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetPlayerPawn_ReturnValue) == 0x000368, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_CurieContainerHandle) == 0x000370, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_CurieContainerHandle' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_ElementTag) == 0x000374, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_ElementTag' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_Event_InteractParamsHandle) == 0x000378, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_Event_InteractParamsHandle' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetInstigatorInfoFromInteractParams_Instigator_1) == 0x000388, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetInstigatorInfoFromInteractParams_Instigator_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetInstigatorInfoFromInteractParams_EffectCauser_1) == 0x000390, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetInstigatorInfoFromInteractParams_EffectCauser_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_DynamicCast_AsFort_Player_Controller_1) == 0x000398, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_DynamicCast_AsFort_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, K2Node_DynamicCast_bSuccess_2) == 0x0003A0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x0003A8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetSubGame_ReturnValue_1) == 0x0003B0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetSubGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0003B1, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_BooleanAND_ReturnValue) == 0x0003B2, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_IsValid_ReturnValue_2) == 0x0003B3, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_HasAuthority_ReturnValue) == 0x0003B4, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetHoseAttachStartLocation_Location) == 0x0003B8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetHoseAttachStartLocation_Location' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetHoseAttachStartLocation_Location_1) == 0x0003D0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetHoseAttachStartLocation_Location_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0003E8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x0004C8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x0004CC, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_FTrunc_ReturnValue_1) == 0x0004D0, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_GetValueAtLevel_ReturnValue_6) == 0x0004D4, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_GetValueAtLevel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet, CallFunc_HasAuthority_ReturnValue_1) == 0x0004D8, "Member 'Apollo_GasPump_Valet_C_ExecuteUbergraph_Apollo_GasPump_Valet::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
