#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Welcome_FoodTruck_02

#include "Basic.hpp"

#include "Car_DEFAULT_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Welcome_FoodTruck_02.Apollo_Welcome_FoodTruck_02_C
// 0x0020 (0x10F0 - 0x10D0)
class AApollo_Welcome_FoodTruck_02_C final : public ACar_DEFAULT_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Apollo_Welcome_FoodTruck_02_C;      // 0x10D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x10D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWelcomePartyAudioRoutingComponent_C*   WelcomePartyAudioRoutingComponent;                 // 0x10E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_NeoT_FoodTruck_Durr;                            // 0x10E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_Welcome_FoodTruck_02(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Welcome_FoodTruck_02_C">();
	}
	static class AApollo_Welcome_FoodTruck_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Welcome_FoodTruck_02_C>();
	}
};
static_assert(alignof(AApollo_Welcome_FoodTruck_02_C) == 0x000008, "Wrong alignment on AApollo_Welcome_FoodTruck_02_C");
static_assert(sizeof(AApollo_Welcome_FoodTruck_02_C) == 0x0010F0, "Wrong size on AApollo_Welcome_FoodTruck_02_C");
static_assert(offsetof(AApollo_Welcome_FoodTruck_02_C, UberGraphFrame_Apollo_Welcome_FoodTruck_02_C) == 0x0010D0, "Member 'AApollo_Welcome_FoodTruck_02_C::UberGraphFrame_Apollo_Welcome_FoodTruck_02_C' has a wrong offset!");
static_assert(offsetof(AApollo_Welcome_FoodTruck_02_C, Audio) == 0x0010D8, "Member 'AApollo_Welcome_FoodTruck_02_C::Audio' has a wrong offset!");
static_assert(offsetof(AApollo_Welcome_FoodTruck_02_C, WelcomePartyAudioRoutingComponent) == 0x0010E0, "Member 'AApollo_Welcome_FoodTruck_02_C::WelcomePartyAudioRoutingComponent' has a wrong offset!");
static_assert(offsetof(AApollo_Welcome_FoodTruck_02_C, SM_NeoT_FoodTruck_Durr) == 0x0010E8, "Member 'AApollo_Welcome_FoodTruck_02_C::SM_NeoT_FoodTruck_Durr' has a wrong offset!");

}

