#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Farm_Windmill_Spinning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Farm_Windmill_Spinning.Apollo_Farm_Windmill_Spinning_C
// 0x0028 (0x0E98 - 0x0E70)
class AApollo_Farm_Windmill_Spinning_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          ProjectileBlocker;                                 // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Farm_Windmill_Fan_01_LOD_00;                     // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        windmill_creaking_Cue;                             // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation;                                          // 0x0E90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_Farm_Windmill_Spinning(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Farm_Windmill_Spinning_C">();
	}
	static class AApollo_Farm_Windmill_Spinning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Farm_Windmill_Spinning_C>();
	}
};
static_assert(alignof(AApollo_Farm_Windmill_Spinning_C) == 0x000008, "Wrong alignment on AApollo_Farm_Windmill_Spinning_C");
static_assert(sizeof(AApollo_Farm_Windmill_Spinning_C) == 0x000E98, "Wrong size on AApollo_Farm_Windmill_Spinning_C");
static_assert(offsetof(AApollo_Farm_Windmill_Spinning_C, UberGraphFrame) == 0x000E70, "Member 'AApollo_Farm_Windmill_Spinning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_Farm_Windmill_Spinning_C, ProjectileBlocker) == 0x000E78, "Member 'AApollo_Farm_Windmill_Spinning_C::ProjectileBlocker' has a wrong offset!");
static_assert(offsetof(AApollo_Farm_Windmill_Spinning_C, S_Farm_Windmill_Fan_01_LOD_00) == 0x000E80, "Member 'AApollo_Farm_Windmill_Spinning_C::S_Farm_Windmill_Fan_01_LOD_00' has a wrong offset!");
static_assert(offsetof(AApollo_Farm_Windmill_Spinning_C, windmill_creaking_Cue) == 0x000E88, "Member 'AApollo_Farm_Windmill_Spinning_C::windmill_creaking_Cue' has a wrong offset!");
static_assert(offsetof(AApollo_Farm_Windmill_Spinning_C, Rotation) == 0x000E90, "Member 'AApollo_Farm_Windmill_Spinning_C::Rotation' has a wrong offset!");

}

