#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_WoodMines_Archway

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Parent_BuildingWall_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_WoodMines_Archway.Apollo_WoodMines_Archway_C
// 0x0018 (0x0FC8 - 0x0FB0)
class AApollo_WoodMines_Archway_C final : public AParent_BuildingWall_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        WoodCreakSound;                                    // 0x0FB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayCreakSound;                                    // 0x0FC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_WoodMines_Archway(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_WoodMines_Archway_C">();
	}
	static class AApollo_WoodMines_Archway_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_WoodMines_Archway_C>();
	}
};
static_assert(alignof(AApollo_WoodMines_Archway_C) == 0x000008, "Wrong alignment on AApollo_WoodMines_Archway_C");
static_assert(sizeof(AApollo_WoodMines_Archway_C) == 0x000FC8, "Wrong size on AApollo_WoodMines_Archway_C");
static_assert(offsetof(AApollo_WoodMines_Archway_C, UberGraphFrame) == 0x000FB0, "Member 'AApollo_WoodMines_Archway_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_WoodMines_Archway_C, WoodCreakSound) == 0x000FB8, "Member 'AApollo_WoodMines_Archway_C::WoodCreakSound' has a wrong offset!");
static_assert(offsetof(AApollo_WoodMines_Archway_C, PlayCreakSound) == 0x000FC0, "Member 'AApollo_WoodMines_Archway_C::PlayCreakSound' has a wrong offset!");

}

