#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Coastal_Seaweed_05

#include "Basic.hpp"


namespace SDK::Params
{

// Function Apollo_Coastal_Seaweed_05.Apollo_Coastal_Seaweed_05_C.ExecuteUbergraph_Apollo_Coastal_Seaweed_05
// 0x0008 (0x0008 - 0x0000)
struct Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05) == 0x000004, "Wrong alignment on Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05");
static_assert(sizeof(Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05) == 0x000008, "Wrong size on Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05");
static_assert(offsetof(Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05, EntryPoint) == 0x000000, "Member 'Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05, CallFunc_IsErebus_ReturnValue) == 0x000006, "Member 'Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'Apollo_Coastal_Seaweed_05_C_ExecuteUbergraph_Apollo_Coastal_Seaweed_05::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

