#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Farm_AppleBox_LootDrop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Farm_AppleBox_LootDrop.Apollo_Farm_AppleBox_LootDrop_C
// 0x0018 (0x0E88 - 0x0E70)
class AApollo_Farm_AppleBox_LootDrop_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLinkToActorComponent*              FortLinkToActor;                                   // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBuildingActorLootDropOnDeathComponent_C* BuildingActorLootDropOnDeathComponent;             // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature(class AActor* DamageCauser);
	void ExecuteUbergraph_Apollo_Farm_AppleBox_LootDrop(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Farm_AppleBox_LootDrop_C">();
	}
	static class AApollo_Farm_AppleBox_LootDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Farm_AppleBox_LootDrop_C>();
	}
};
static_assert(alignof(AApollo_Farm_AppleBox_LootDrop_C) == 0x000008, "Wrong alignment on AApollo_Farm_AppleBox_LootDrop_C");
static_assert(sizeof(AApollo_Farm_AppleBox_LootDrop_C) == 0x000E88, "Wrong size on AApollo_Farm_AppleBox_LootDrop_C");
static_assert(offsetof(AApollo_Farm_AppleBox_LootDrop_C, UberGraphFrame) == 0x000E70, "Member 'AApollo_Farm_AppleBox_LootDrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_Farm_AppleBox_LootDrop_C, FortLinkToActor) == 0x000E78, "Member 'AApollo_Farm_AppleBox_LootDrop_C::FortLinkToActor' has a wrong offset!");
static_assert(offsetof(AApollo_Farm_AppleBox_LootDrop_C, BuildingActorLootDropOnDeathComponent) == 0x000E80, "Member 'AApollo_Farm_AppleBox_LootDrop_C::BuildingActorLootDropOnDeathComponent' has a wrong offset!");

}

