#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APOLLO_MASTER_TODM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function APOLLO_MASTER_TODM.APOLLO_MASTER_TODM_C.DisableLightAndFog
// 0x0001 (0x0001 - 0x0000)
struct APOLLO_MASTER_TODM_C_DisableLightAndFog final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APOLLO_MASTER_TODM_C_DisableLightAndFog) == 0x000001, "Wrong alignment on APOLLO_MASTER_TODM_C_DisableLightAndFog");
static_assert(sizeof(APOLLO_MASTER_TODM_C_DisableLightAndFog) == 0x000001, "Wrong size on APOLLO_MASTER_TODM_C_DisableLightAndFog");
static_assert(offsetof(APOLLO_MASTER_TODM_C_DisableLightAndFog, Enable) == 0x000000, "Member 'APOLLO_MASTER_TODM_C_DisableLightAndFog::Enable' has a wrong offset!");

// Function APOLLO_MASTER_TODM.APOLLO_MASTER_TODM_C.EmptyTransform
// 0x00C0 (0x00C0 - 0x0000)
struct APOLLO_MASTER_TODM_C_EmptyTransform final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(APOLLO_MASTER_TODM_C_EmptyTransform) == 0x000010, "Wrong alignment on APOLLO_MASTER_TODM_C_EmptyTransform");
static_assert(sizeof(APOLLO_MASTER_TODM_C_EmptyTransform) == 0x0000C0, "Wrong size on APOLLO_MASTER_TODM_C_EmptyTransform");
static_assert(offsetof(APOLLO_MASTER_TODM_C_EmptyTransform, Transform) == 0x000000, "Member 'APOLLO_MASTER_TODM_C_EmptyTransform::Transform' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_EmptyTransform, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'APOLLO_MASTER_TODM_C_EmptyTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function APOLLO_MASTER_TODM.APOLLO_MASTER_TODM_C.ExecuteUbergraph_APOLLO_MASTER_TODM
// 0x0148 (0x0148 - 0x0000)
struct APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStormStrength_ReturnValue;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x011C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_3;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM) == 0x000008, "Wrong alignment on APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM");
static_assert(sizeof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM) == 0x000148, "Wrong size on APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, EntryPoint) == 0x000000, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::EntryPoint' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_FFloor_ReturnValue) == 0x000004, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Conv_IntToBool_ReturnValue) == 0x000008, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, K2Node_CustomEvent_Enable_1) == 0x000024, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_IsValid_ReturnValue) == 0x000025, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Not_PreBool_ReturnValue) == 0x000026, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_RandomFloatInRange_ReturnValue) == 0x000028, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_BreakColor_R) == 0x000034, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_BreakColor_G) == 0x000038, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_BreakColor_B) == 0x00003C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_BreakColor_A) == 0x000040, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_LinearColorLerp_ReturnValue) == 0x000044, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000054, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_BreakColor_R_1) == 0x000058, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_BreakColor_R_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_BreakColor_G_1) == 0x00005C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_BreakColor_G_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_BreakColor_B_1) == 0x000060, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_BreakColor_B_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_BreakColor_A_1) == 0x000064, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_BreakColor_A_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000068, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00006C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000070, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000074, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000078, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000080, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000084, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000088, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00008C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_GetLightColor_ReturnValue) == 0x000090, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_GetLightColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_GetGameUserSettings_ReturnValue) == 0x0000A0, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_GetStormStrength_ReturnValue) == 0x0000A8, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_GetStormStrength_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, K2Node_Event_DeltaSeconds) == 0x0000B8, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, Temp_bool_Variable) == 0x0000BC, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000BD, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000C0, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C8, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x0000D0, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_GetShadowQuality_ReturnValue) == 0x0000D8, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Greater_IntInt_ReturnValue) == 0x0000DC, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, K2Node_SwitchInteger_CmpSuccess) == 0x0000DD, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0000E0, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_MakeColor_ReturnValue) == 0x0000E4, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Square_ReturnValue) == 0x0000F4, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x0000F8, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x0000FC, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000100, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x000104, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000108, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_MakeColor_ReturnValue_1) == 0x00010C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, K2Node_CreateDelegate_OutputDelegate_3) == 0x00011C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x000128, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_Multiply_FloatFloat_ReturnValue_10) == 0x00012C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_Multiply_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x000130, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, K2Node_CustomEvent_Enable) == 0x000138, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_BooleanOR_ReturnValue) == 0x000139, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_SelectFloat_ReturnValue) == 0x00013C, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM, CallFunc_GetGameUserSettings_ReturnValue_3) == 0x000140, "Member 'APOLLO_MASTER_TODM_C_ExecuteUbergraph_APOLLO_MASTER_TODM::CallFunc_GetGameUserSettings_ReturnValue_3' has a wrong offset!");

// Function APOLLO_MASTER_TODM.APOLLO_MASTER_TODM_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct APOLLO_MASTER_TODM_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APOLLO_MASTER_TODM_C_ReceiveTick) == 0x000004, "Wrong alignment on APOLLO_MASTER_TODM_C_ReceiveTick");
static_assert(sizeof(APOLLO_MASTER_TODM_C_ReceiveTick) == 0x000004, "Wrong size on APOLLO_MASTER_TODM_C_ReceiveTick");
static_assert(offsetof(APOLLO_MASTER_TODM_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'APOLLO_MASTER_TODM_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function APOLLO_MASTER_TODM.APOLLO_MASTER_TODM_C.SetHeavySSAO
// 0x0008 (0x0008 - 0x0000)
struct APOLLO_MASTER_TODM_C_SetHeavySSAO final
{
public:
	float                                         CallFunc_GetNumericCVar_OutValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumericCVar_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APOLLO_MASTER_TODM_C_SetHeavySSAO) == 0x000004, "Wrong alignment on APOLLO_MASTER_TODM_C_SetHeavySSAO");
static_assert(sizeof(APOLLO_MASTER_TODM_C_SetHeavySSAO) == 0x000008, "Wrong size on APOLLO_MASTER_TODM_C_SetHeavySSAO");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetHeavySSAO, CallFunc_GetNumericCVar_OutValue) == 0x000000, "Member 'APOLLO_MASTER_TODM_C_SetHeavySSAO::CallFunc_GetNumericCVar_OutValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetHeavySSAO, CallFunc_GetNumericCVar_ReturnValue) == 0x000004, "Member 'APOLLO_MASTER_TODM_C_SetHeavySSAO::CallFunc_GetNumericCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetHeavySSAO, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'APOLLO_MASTER_TODM_C_SetHeavySSAO::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function APOLLO_MASTER_TODM.APOLLO_MASTER_TODM_C.SetMotionBlurAmount
// 0x0008 (0x0008 - 0x0000)
struct APOLLO_MASTER_TODM_C_SetMotionBlurAmount final
{
public:
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APOLLO_MASTER_TODM_C_SetMotionBlurAmount) == 0x000004, "Wrong alignment on APOLLO_MASTER_TODM_C_SetMotionBlurAmount");
static_assert(sizeof(APOLLO_MASTER_TODM_C_SetMotionBlurAmount) == 0x000008, "Wrong size on APOLLO_MASTER_TODM_C_SetMotionBlurAmount");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetMotionBlurAmount, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000000, "Member 'APOLLO_MASTER_TODM_C_SetMotionBlurAmount::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetMotionBlurAmount, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'APOLLO_MASTER_TODM_C_SetMotionBlurAmount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetMotionBlurAmount, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000005, "Member 'APOLLO_MASTER_TODM_C_SetMotionBlurAmount::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetMotionBlurAmount, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'APOLLO_MASTER_TODM_C_SetMotionBlurAmount::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function APOLLO_MASTER_TODM.APOLLO_MASTER_TODM_C.SetShadowStateMPC
// 0x0008 (0x0008 - 0x0000)
struct APOLLO_MASTER_TODM_C_SetShadowStateMPC final
{
public:
	float                                         CallFunc_GetNumericCVar_OutValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumericCVar_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APOLLO_MASTER_TODM_C_SetShadowStateMPC) == 0x000004, "Wrong alignment on APOLLO_MASTER_TODM_C_SetShadowStateMPC");
static_assert(sizeof(APOLLO_MASTER_TODM_C_SetShadowStateMPC) == 0x000008, "Wrong size on APOLLO_MASTER_TODM_C_SetShadowStateMPC");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetShadowStateMPC, CallFunc_GetNumericCVar_OutValue) == 0x000000, "Member 'APOLLO_MASTER_TODM_C_SetShadowStateMPC::CallFunc_GetNumericCVar_OutValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetShadowStateMPC, CallFunc_GetNumericCVar_ReturnValue) == 0x000004, "Member 'APOLLO_MASTER_TODM_C_SetShadowStateMPC::CallFunc_GetNumericCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SetShadowStateMPC, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'APOLLO_MASTER_TODM_C_SetShadowStateMPC::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function APOLLO_MASTER_TODM.APOLLO_MASTER_TODM_C.SkyDomeCloudsToggle
// 0x0001 (0x0001 - 0x0000)
struct APOLLO_MASTER_TODM_C_SkyDomeCloudsToggle final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APOLLO_MASTER_TODM_C_SkyDomeCloudsToggle) == 0x000001, "Wrong alignment on APOLLO_MASTER_TODM_C_SkyDomeCloudsToggle");
static_assert(sizeof(APOLLO_MASTER_TODM_C_SkyDomeCloudsToggle) == 0x000001, "Wrong size on APOLLO_MASTER_TODM_C_SkyDomeCloudsToggle");
static_assert(offsetof(APOLLO_MASTER_TODM_C_SkyDomeCloudsToggle, Enable) == 0x000000, "Member 'APOLLO_MASTER_TODM_C_SkyDomeCloudsToggle::Enable' has a wrong offset!");

// Function APOLLO_MASTER_TODM.APOLLO_MASTER_TODM_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct APOLLO_MASTER_TODM_C_UserConstructionScript final
{
public:
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APOLLO_MASTER_TODM_C_UserConstructionScript) == 0x000004, "Wrong alignment on APOLLO_MASTER_TODM_C_UserConstructionScript");
static_assert(sizeof(APOLLO_MASTER_TODM_C_UserConstructionScript) == 0x000020, "Wrong size on APOLLO_MASTER_TODM_C_UserConstructionScript");
static_assert(offsetof(APOLLO_MASTER_TODM_C_UserConstructionScript, CallFunc_MakeColor_ReturnValue) == 0x000000, "Member 'APOLLO_MASTER_TODM_C_UserConstructionScript::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(APOLLO_MASTER_TODM_C_UserConstructionScript, CallFunc_MakeColor_ReturnValue_1) == 0x000010, "Member 'APOLLO_MASTER_TODM_C_UserConstructionScript::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");

}

