#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ApplyMedkit_Athena_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ApplyMedkit_Athena_AnimBP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ApplyMedkit_Athena_AnimBP.ApplyMedkit_Athena_AnimBP_C
// 0x02B0 (0x06A0 - 0x03F0)
class UApplyMedkit_Athena_AnimBP_C final : public UFortItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ApplyMedkit_Athena_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x03F8(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0400(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0408(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0410(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0430(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0478(0x0040)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x04B8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0500(0x0100)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0600(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0648(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0670(0x0028)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ApplyMedkit_Athena_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ApplyMedkit_Athena_AnimBP_C">();
	}
	static class UApplyMedkit_Athena_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApplyMedkit_Athena_AnimBP_C>();
	}
};
static_assert(alignof(UApplyMedkit_Athena_AnimBP_C) == 0x000010, "Wrong alignment on UApplyMedkit_Athena_AnimBP_C");
static_assert(sizeof(UApplyMedkit_Athena_AnimBP_C) == 0x0006A0, "Wrong size on UApplyMedkit_Athena_AnimBP_C");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, UberGraphFrame) == 0x0003F0, "Member 'UApplyMedkit_Athena_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, __AnimBlueprintMutables) == 0x0003F8, "Member 'UApplyMedkit_Athena_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000400, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimBlueprintExtension_Base) == 0x000408, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_Root) == 0x000410, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_Slot_1) == 0x000430, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000478, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x0004B8, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000500, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_Slot) == 0x000600, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x000648, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000670, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

