#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmoredBattleBusRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusPassengerAnimInstance.GenerateCharacterPitchAndYawForSlopedTerrain
// 0x0028 (0x0028 - 0x0000)
struct FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain final
{
public:
	const class AFortAthenaVehicle*               VehicleActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurretYaw_0;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurretPitch_0;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PawnYawRotator;                                    // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain) == 0x000008, "Wrong alignment on FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain");
static_assert(sizeof(FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain) == 0x000028, "Wrong size on FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain, VehicleActor) == 0x000000, "Member 'FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain::VehicleActor' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain, TurretYaw_0) == 0x000008, "Member 'FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain::TurretYaw_0' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain, TurretPitch_0) == 0x00000C, "Member 'FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain::TurretPitch_0' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain, PawnYawRotator) == 0x000010, "Member 'FortArmoredBattleBusPassengerAnimInstance_GenerateCharacterPitchAndYawForSlopedTerrain::PawnYawRotator' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusPassengerAnimInstance.GetFootAttachTransform
// 0x0070 (0x0070 - 0x0000)
struct FortArmoredBattleBusPassengerAnimInstance_GetFootAttachTransform final
{
public:
	const class USkeletalMeshComponent*           BusMeshComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusPassengerAnimInstance_GetFootAttachTransform) == 0x000010, "Wrong alignment on FortArmoredBattleBusPassengerAnimInstance_GetFootAttachTransform");
static_assert(sizeof(FortArmoredBattleBusPassengerAnimInstance_GetFootAttachTransform) == 0x000070, "Wrong size on FortArmoredBattleBusPassengerAnimInstance_GetFootAttachTransform");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GetFootAttachTransform, BusMeshComponent) == 0x000000, "Member 'FortArmoredBattleBusPassengerAnimInstance_GetFootAttachTransform::BusMeshComponent' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GetFootAttachTransform, ReturnValue) == 0x000010, "Member 'FortArmoredBattleBusPassengerAnimInstance_GetFootAttachTransform::ReturnValue' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusPassengerAnimInstance.GetHandAttachLocation
// 0x0028 (0x0028 - 0x0000)
struct FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation final
{
public:
	const class USkeletalMeshComponent*           BusMeshComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FrontHandAttachBoneName;                           // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RearHandAttachBoneName;                            // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation) == 0x000008, "Wrong alignment on FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation");
static_assert(sizeof(FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation) == 0x000028, "Wrong size on FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation, BusMeshComponent) == 0x000000, "Member 'FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation::BusMeshComponent' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation, FrontHandAttachBoneName) == 0x000008, "Member 'FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation::FrontHandAttachBoneName' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation, RearHandAttachBoneName) == 0x00000C, "Member 'FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation::RearHandAttachBoneName' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation, ReturnValue) == 0x000010, "Member 'FortArmoredBattleBusPassengerAnimInstance_GetHandAttachLocation::ReturnValue' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusPassengerAnimInstance.GetPassengerTransform
// 0x0070 (0x0070 - 0x0000)
struct FortArmoredBattleBusPassengerAnimInstance_GetPassengerTransform final
{
public:
	const class USkeletalMeshComponent*           BusMeshComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusPassengerAnimInstance_GetPassengerTransform) == 0x000010, "Wrong alignment on FortArmoredBattleBusPassengerAnimInstance_GetPassengerTransform");
static_assert(sizeof(FortArmoredBattleBusPassengerAnimInstance_GetPassengerTransform) == 0x000070, "Wrong size on FortArmoredBattleBusPassengerAnimInstance_GetPassengerTransform");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GetPassengerTransform, BusMeshComponent) == 0x000000, "Member 'FortArmoredBattleBusPassengerAnimInstance_GetPassengerTransform::BusMeshComponent' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_GetPassengerTransform, ReturnValue) == 0x000010, "Member 'FortArmoredBattleBusPassengerAnimInstance_GetPassengerTransform::ReturnValue' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusPassengerAnimInstance.UnrotateHandAttachLocation
// 0x0060 (0x0060 - 0x0000)
struct FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation final
{
public:
	struct FVector                                HandLocation;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FootLocation;                                      // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               FootRotation;                                      // 0x0030(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation) == 0x000008, "Wrong alignment on FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation");
static_assert(sizeof(FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation) == 0x000060, "Wrong size on FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation, HandLocation) == 0x000000, "Member 'FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation::HandLocation' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation, FootLocation) == 0x000018, "Member 'FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation::FootLocation' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation, FootRotation) == 0x000030, "Member 'FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation::FootRotation' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation, ReturnValue) == 0x000048, "Member 'FortArmoredBattleBusPassengerAnimInstance_UnrotateHandAttachLocation::ReturnValue' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusPassengerAnimInstance.UpdateHandPositionsSlopeValues
// 0x0008 (0x0008 - 0x0000)
struct FortArmoredBattleBusPassengerAnimInstance_UpdateHandPositionsSlopeValues final
{
public:
	const class USkeletalMeshComponent*           BusMeshComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusPassengerAnimInstance_UpdateHandPositionsSlopeValues) == 0x000008, "Wrong alignment on FortArmoredBattleBusPassengerAnimInstance_UpdateHandPositionsSlopeValues");
static_assert(sizeof(FortArmoredBattleBusPassengerAnimInstance_UpdateHandPositionsSlopeValues) == 0x000008, "Wrong size on FortArmoredBattleBusPassengerAnimInstance_UpdateHandPositionsSlopeValues");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UpdateHandPositionsSlopeValues, BusMeshComponent) == 0x000000, "Member 'FortArmoredBattleBusPassengerAnimInstance_UpdateHandPositionsSlopeValues::BusMeshComponent' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusPassengerAnimInstance.UpdateSmoothedVehicleYawRate
// 0x0008 (0x0008 - 0x0000)
struct FortArmoredBattleBusPassengerAnimInstance_UpdateSmoothedVehicleYawRate final
{
public:
	const class AFortAthenaVehicle*               VehicleActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusPassengerAnimInstance_UpdateSmoothedVehicleYawRate) == 0x000008, "Wrong alignment on FortArmoredBattleBusPassengerAnimInstance_UpdateSmoothedVehicleYawRate");
static_assert(sizeof(FortArmoredBattleBusPassengerAnimInstance_UpdateSmoothedVehicleYawRate) == 0x000008, "Wrong size on FortArmoredBattleBusPassengerAnimInstance_UpdateSmoothedVehicleYawRate");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UpdateSmoothedVehicleYawRate, VehicleActor) == 0x000000, "Member 'FortArmoredBattleBusPassengerAnimInstance_UpdateSmoothedVehicleYawRate::VehicleActor' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusPassengerAnimInstance.UpdateYawDeltaSmoothed
// 0x0030 (0x0030 - 0x0000)
struct FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed final
{
public:
	const class AFortAthenaVehicle*               VehicleActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               NewRotation;                                       // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SmoothedYawValue;                                  // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed) == 0x000008, "Wrong alignment on FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed");
static_assert(sizeof(FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed) == 0x000030, "Wrong size on FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed, VehicleActor) == 0x000000, "Member 'FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed::VehicleActor' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed, SocketName) == 0x000008, "Member 'FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed::SocketName' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed, NewRotation) == 0x000010, "Member 'FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed::NewRotation' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed, SmoothedYawValue) == 0x000028, "Member 'FortArmoredBattleBusPassengerAnimInstance_UpdateYawDeltaSmoothed::SmoothedYawValue' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusVehicleAnimInstance.GetPitchAndYaw
// 0x0038 (0x0038 - 0x0000)
struct FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw final
{
public:
	const class AFortAthenaVehicle*               VehicleActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerPawn*                  GunnerActor;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdjustedPitch;                                     // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdjustedYaw;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayerControlled;                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               YawRotator;                                        // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw) == 0x000008, "Wrong alignment on FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw");
static_assert(sizeof(FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw) == 0x000038, "Wrong size on FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw, VehicleActor) == 0x000000, "Member 'FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw::VehicleActor' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw, GunnerActor) == 0x000008, "Member 'FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw::GunnerActor' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw, AdjustedPitch) == 0x000010, "Member 'FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw::AdjustedPitch' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw, AdjustedYaw) == 0x000014, "Member 'FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw::AdjustedYaw' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw, bIsLocalPlayerControlled) == 0x000018, "Member 'FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw::bIsLocalPlayerControlled' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw, YawRotator) == 0x000020, "Member 'FortArmoredBattleBusVehicleAnimInstance_GetPitchAndYaw::YawRotator' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusVehicleAnimInstance.UpdateSmoothedVehicleYawRate
// 0x0028 (0x0028 - 0x0000)
struct FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate final
{
public:
	const class AFortAthenaVehicle*               VehicleActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PreviousRotator;                                   // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate) == 0x000008, "Wrong alignment on FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate");
static_assert(sizeof(FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate) == 0x000028, "Wrong size on FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate, VehicleActor) == 0x000000, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate::VehicleActor' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate, PreviousRotator) == 0x000008, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate::PreviousRotator' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate, ReturnValue) == 0x000020, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateSmoothedVehicleYawRate::ReturnValue' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusVehicleAnimInstance.UpdateTurretAimPitchWeaponYaw
// 0x0038 (0x0038 - 0x0000)
struct FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw final
{
public:
	const class AFortAthenaVehicle*               OwnerVehicle;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerPawn*                  GunnerActor;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawOffset;                                         // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurretAimPitch;                                    // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawDeltaSmoothed;                                  // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               WeaponYaw;                                         // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw) == 0x000008, "Wrong alignment on FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw");
static_assert(sizeof(FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw) == 0x000038, "Wrong size on FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw, OwnerVehicle) == 0x000000, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw::OwnerVehicle' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw, GunnerActor) == 0x000008, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw::GunnerActor' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw, SocketName) == 0x000010, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw::SocketName' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw, YawOffset) == 0x000014, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw::YawOffset' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw, TurretAimPitch) == 0x000018, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw::TurretAimPitch' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw, YawDeltaSmoothed) == 0x00001C, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw::YawDeltaSmoothed' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw, WeaponYaw) == 0x000020, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateTurretAimPitchWeaponYaw::WeaponYaw' has a wrong offset!");

// Function ArmoredBattleBusRuntime.FortArmoredBattleBusVehicleAnimInstance.UpdateYawDeltaSmoothed
// 0x0030 (0x0030 - 0x0000)
struct FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed final
{
public:
	const class AFortAthenaVehicle*               VehicleActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               NewRotation;                                       // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SmoothedYawValue;                                  // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed) == 0x000008, "Wrong alignment on FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed");
static_assert(sizeof(FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed) == 0x000030, "Wrong size on FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed, VehicleActor) == 0x000000, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed::VehicleActor' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed, SocketName) == 0x000008, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed::SocketName' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed, NewRotation) == 0x000010, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed::NewRotation' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed, SmoothedYawValue) == 0x000028, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed::SmoothedYawValue' has a wrong offset!");
static_assert(offsetof(FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed, ReturnValue) == 0x00002C, "Member 'FortArmoredBattleBusVehicleAnimInstance_UpdateYawDeltaSmoothed::ReturnValue' has a wrong offset!");

}

