#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Artemis_RealityPG_PeelyInstallation_A

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Artemis_RealityPG_PeelyInstallation_A.Artemis_RealityPG_PeelyInstallation_A_C
// 0x0018 (0x0E88 - 0x0E70)
class AArtemis_RealityPG_PeelyInstallation_A_C final : public ABuildingProp
{
public:
	class UStaticMeshComponent*                   SM_RealityPG_PeelyInstallation_D;                  // 0x0E70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_PeelyInstallation_C;                  // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_PeelyInstallation_B;                  // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Artemis_RealityPG_PeelyInstallation_A_C">();
	}
	static class AArtemis_RealityPG_PeelyInstallation_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArtemis_RealityPG_PeelyInstallation_A_C>();
	}
};
static_assert(alignof(AArtemis_RealityPG_PeelyInstallation_A_C) == 0x000008, "Wrong alignment on AArtemis_RealityPG_PeelyInstallation_A_C");
static_assert(sizeof(AArtemis_RealityPG_PeelyInstallation_A_C) == 0x000E88, "Wrong size on AArtemis_RealityPG_PeelyInstallation_A_C");
static_assert(offsetof(AArtemis_RealityPG_PeelyInstallation_A_C, SM_RealityPG_PeelyInstallation_D) == 0x000E70, "Member 'AArtemis_RealityPG_PeelyInstallation_A_C::SM_RealityPG_PeelyInstallation_D' has a wrong offset!");
static_assert(offsetof(AArtemis_RealityPG_PeelyInstallation_A_C, SM_RealityPG_PeelyInstallation_C) == 0x000E78, "Member 'AArtemis_RealityPG_PeelyInstallation_A_C::SM_RealityPG_PeelyInstallation_C' has a wrong offset!");
static_assert(offsetof(AArtemis_RealityPG_PeelyInstallation_A_C, SM_RealityPG_PeelyInstallation_B) == 0x000E80, "Member 'AArtemis_RealityPG_PeelyInstallation_A_C::SM_RealityPG_PeelyInstallation_B' has a wrong offset!");

}

