#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Artemis_KillVolumeMeshPlacer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Artemis_KillVolumeMeshPlacer.Artemis_KillVolumeMeshPlacer_C.ExecuteUbergraph_Artemis_KillVolumeMeshPlacer
// 0x00B0 (0x00B0 - 0x0000)
struct Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer) == 0x000010, "Wrong alignment on Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer");
static_assert(sizeof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer) == 0x0000B0, "Wrong size on Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, EntryPoint) == 0x000000, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, CallFunc_Array_Get_Item) == 0x000028, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'Artemis_KillVolumeMeshPlacer_C_ExecuteUbergraph_Artemis_KillVolumeMeshPlacer::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

