#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Artemis_BoatSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Artemis_BoatSpline.Artemis_BoatSpline_C.SnapToFortniteGrid
// 0x0060 (0x0060 - 0x0000)
struct Artemis_BoatSpline_C_SnapToFortniteGrid final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLocation;                                       // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue_1;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue_2;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_BoatSpline_C_SnapToFortniteGrid) == 0x000008, "Wrong alignment on Artemis_BoatSpline_C_SnapToFortniteGrid");
static_assert(sizeof(Artemis_BoatSpline_C_SnapToFortniteGrid) == 0x000060, "Wrong size on Artemis_BoatSpline_C_SnapToFortniteGrid");
static_assert(offsetof(Artemis_BoatSpline_C_SnapToFortniteGrid, Location) == 0x000000, "Member 'Artemis_BoatSpline_C_SnapToFortniteGrid::Location' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_SnapToFortniteGrid, NewLocation) == 0x000018, "Member 'Artemis_BoatSpline_C_SnapToFortniteGrid::NewLocation' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_SnapToFortniteGrid, CallFunc_BreakVector_X) == 0x000030, "Member 'Artemis_BoatSpline_C_SnapToFortniteGrid::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_SnapToFortniteGrid, CallFunc_BreakVector_Y) == 0x000034, "Member 'Artemis_BoatSpline_C_SnapToFortniteGrid::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_SnapToFortniteGrid, CallFunc_BreakVector_Z) == 0x000038, "Member 'Artemis_BoatSpline_C_SnapToFortniteGrid::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_SnapToFortniteGrid, CallFunc_GridSnap_Float_ReturnValue) == 0x00003C, "Member 'Artemis_BoatSpline_C_SnapToFortniteGrid::CallFunc_GridSnap_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_SnapToFortniteGrid, CallFunc_GridSnap_Float_ReturnValue_1) == 0x000040, "Member 'Artemis_BoatSpline_C_SnapToFortniteGrid::CallFunc_GridSnap_Float_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_SnapToFortniteGrid, CallFunc_GridSnap_Float_ReturnValue_2) == 0x000044, "Member 'Artemis_BoatSpline_C_SnapToFortniteGrid::CallFunc_GridSnap_Float_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_SnapToFortniteGrid, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'Artemis_BoatSpline_C_SnapToFortniteGrid::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function Artemis_BoatSpline.Artemis_BoatSpline_C.OnReady_C2E712E747854352C550DFAB72482F44
// 0x0030 (0x0030 - 0x0000)
struct Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44) == 0x000008, "Wrong alignment on Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44");
static_assert(sizeof(Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44) == 0x000030, "Wrong size on Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44");
static_assert(offsetof(Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44, GameState) == 0x000000, "Member 'Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44::GameState' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44, Playlist) == 0x000008, "Member 'Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44::Playlist' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44, PlaylistContextTags) == 0x000010, "Member 'Artemis_BoatSpline_C_OnReady_C2E712E747854352C550DFAB72482F44::PlaylistContextTags' has a wrong offset!");

// Function Artemis_BoatSpline.Artemis_BoatSpline_C.GetGridRotationOnSpline
// 0x00D0 (0x00D0 - 0x0000)
struct Artemis_BoatSpline_C_GetGridRotationOnSpline final
{
public:
	float                                         ForwardVectorYawRotation;                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       Spline;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SplinePoint;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Z__Yaw_;                                           // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Artemis_BoatSpline_C_GetGridRotationOnSpline) == 0x000008, "Wrong alignment on Artemis_BoatSpline_C_GetGridRotationOnSpline");
static_assert(sizeof(Artemis_BoatSpline_C_GetGridRotationOnSpline) == 0x0000D0, "Wrong size on Artemis_BoatSpline_C_GetGridRotationOnSpline");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, ForwardVectorYawRotation) == 0x000000, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::ForwardVectorYawRotation' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, Spline) == 0x000008, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::Spline' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, SplinePoint) == 0x000010, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::SplinePoint' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, Rotation) == 0x000018, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::Rotation' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, Z__Yaw_) == 0x000030, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::Z__Yaw_' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_GetDirectionAtSplinePoint_ReturnValue) == 0x000050, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_GetDirectionAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000068, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000080, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_BreakRotator_Roll) == 0x000098, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_BreakRotator_Pitch) == 0x00009C, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_BreakRotator_Yaw) == 0x0000A0, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_GridSnap_Float_ReturnValue) == 0x0000A4, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_GridSnap_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_Conv_FloatToString_ReturnValue) == 0x0000A8, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_GetGridRotationOnSpline, CallFunc_MakeRotator_ReturnValue_1) == 0x0000B8, "Member 'Artemis_BoatSpline_C_GetGridRotationOnSpline::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");

// Function Artemis_BoatSpline.Artemis_BoatSpline_C.ExecuteUbergraph_Artemis_BoatSpline
// 0x0140 (0x0140 - 0x0000)
struct Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0028(0x0020)(ConstParm)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0050(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetGridRotationOnSpline_Rotation;         // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGridRotationOnSpline_Z__Yaw_;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SnapToFortniteGrid_NewLocation;           // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0060)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline) == 0x000010, "Wrong alignment on Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline");
static_assert(sizeof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline) == 0x000140, "Wrong size on Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, EntryPoint) == 0x000000, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::EntryPoint' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000004, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, K2Node_CustomEvent_GameState) == 0x000018, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, K2Node_CustomEvent_Playlist) == 0x000020, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, K2Node_CustomEvent_PlaylistContextTags) == 0x000028, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000048, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, Temp_struct_Variable) == 0x000050, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, Temp_object_Variable) == 0x000070, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, Temp_object_Variable_1) == 0x000078, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000080, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_HasAuthority_ReturnValue) == 0x000089, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_IsValid_ReturnValue_1) == 0x00008A, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_GetGridRotationOnSpline_Rotation) == 0x000090, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_GetGridRotationOnSpline_Rotation' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_GetGridRotationOnSpline_Z__Yaw_) == 0x0000A8, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_GetGridRotationOnSpline_Z__Yaw_' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0000B0, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_SnapToFortniteGrid_NewLocation) == 0x0000C8, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_SnapToFortniteGrid_NewLocation' has a wrong offset!");
static_assert(offsetof(Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'Artemis_BoatSpline_C_ExecuteUbergraph_Artemis_BoatSpline::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

}

