#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Artemis_Seven_Village_Wall_01A3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Parent_BuildingWall_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Artemis_Seven_Village_Wall_01A3.Artemis_Seven_Village_Wall_01A3_C
// 0x0020 (0x0FD0 - 0x0FB0)
class AArtemis_Seven_Village_Wall_01A3_C final : public AParent_BuildingWall_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Fan_Looping_Sound;                                 // 0x0FB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan2;                                              // 0x0FC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan1;                                              // 0x0FC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Artemis_Seven_Village_Wall_01A3(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Artemis_Seven_Village_Wall_01A3_C">();
	}
	static class AArtemis_Seven_Village_Wall_01A3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArtemis_Seven_Village_Wall_01A3_C>();
	}
};
static_assert(alignof(AArtemis_Seven_Village_Wall_01A3_C) == 0x000008, "Wrong alignment on AArtemis_Seven_Village_Wall_01A3_C");
static_assert(sizeof(AArtemis_Seven_Village_Wall_01A3_C) == 0x000FD0, "Wrong size on AArtemis_Seven_Village_Wall_01A3_C");
static_assert(offsetof(AArtemis_Seven_Village_Wall_01A3_C, UberGraphFrame) == 0x000FB0, "Member 'AArtemis_Seven_Village_Wall_01A3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AArtemis_Seven_Village_Wall_01A3_C, Fan_Looping_Sound) == 0x000FB8, "Member 'AArtemis_Seven_Village_Wall_01A3_C::Fan_Looping_Sound' has a wrong offset!");
static_assert(offsetof(AArtemis_Seven_Village_Wall_01A3_C, Fan2) == 0x000FC0, "Member 'AArtemis_Seven_Village_Wall_01A3_C::Fan2' has a wrong offset!");
static_assert(offsetof(AArtemis_Seven_Village_Wall_01A3_C, Fan1) == 0x000FC8, "Member 'AArtemis_Seven_Village_Wall_01A3_C::Fan1' has a wrong offset!");

}

