#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Artemis_MovieScreen_DriveIn_Screen_Extended

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.AudioEnable
// 0x0002 (0x0002 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_AudioEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstStart;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_AudioEnable) == 0x000001, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_AudioEnable");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_AudioEnable) == 0x000002, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_AudioEnable");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_AudioEnable, Enable) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_AudioEnable::Enable' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_AudioEnable, FirstStart) == 0x000001, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_AudioEnable::FirstStart' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.CheckBlocks
// 0x000A (0x000A - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks final
{
public:
	bool                                          Video;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocked;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUCPTypes                                     CallFunc_ShouldProtectPlayerFromContent_ReturnValue; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUCPTypes                                     CallFunc_ShouldProtectPlayerFromContent_ReturnValue_1; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks) == 0x000001, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks) == 0x00000A, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, Video) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::Video' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, bLocked) == 0x000001, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::bLocked' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, CallFunc_ShouldProtectPlayerFromContent_ReturnValue) == 0x000002, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::CallFunc_ShouldProtectPlayerFromContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, CallFunc_ShouldProtectPlayerFromContent_ReturnValue_1) == 0x000004, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::CallFunc_ShouldProtectPlayerFromContent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000006, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000008, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks, CallFunc_BooleanOR_ReturnValue_1) == 0x000009, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_CheckBlocks::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended
// 0x0178 (0x0178 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPlayingReplay_ReturnValue;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FirstStart_2;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool FirstStart)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              K2Node_DynamicCast_AsMaterial;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable_3;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FirstStart_1;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable_2;                       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetRiskyReelsPlaylistBlacklistFilter_ReturnValue; // 0x0040(0x0020)()
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FromStart;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Prop_Video_Stream_Trigger1_C*   CallFunc_GetActorOfClass_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetData_Int_Data;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Enable, bool FirstStart)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_2;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x00D8(0x0020)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00F8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_107[0x1];                                      // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0108(0x0020)()
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FirstStart;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0138(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0140(0x0020)(ConstParm)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0164(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldStreamBePlaying_ReturnValue;        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended) == 0x000008, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended) == 0x000178, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, EntryPoint) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::EntryPoint' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_Event_EndPlayReason) == 0x000005, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_GetIsPlayingReplay_ReturnValue) == 0x000006, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_GetIsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_FirstStart_2) == 0x000007, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_FirstStart_2' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, Temp_object_Variable) == 0x000008, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_DynamicCast_AsMaterial) == 0x000020, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_DynamicCast_AsMaterial' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_Enable_3) == 0x000038, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_Enable_3' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_FirstStart_1) == 0x000039, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_FirstStart_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_Enable_2) == 0x00003A, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_Enable_2' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_Not_PreBool_ReturnValue) == 0x00003B, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_GetRiskyReelsPlaylistBlacklistFilter_ReturnValue) == 0x000040, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_GetRiskyReelsPlaylistBlacklistFilter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_Enable_1) == 0x000060, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_FromStart) == 0x000061, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_FromStart' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000062, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_EqualEqual_BoolBool_ReturnValue_1) == 0x000063, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_EqualEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_IsPlaying_ReturnValue) == 0x000064, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_BooleanAND_ReturnValue) == 0x000065, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_BooleanOR_ReturnValue) == 0x000066, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_Not_PreBool_ReturnValue_1) == 0x000067, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_GetActorOfClass_ReturnValue) == 0x000078, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_Loaded) == 0x000088, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_GetData_Int_Data) == 0x000090, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_GetData_Int_Data' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000094, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A4, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A8, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0000B8, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, Temp_object_Variable_1) == 0x0000C8, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, Temp_object_Variable_2) == 0x0000D0, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x0000D8, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000F8, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_HasAnyTags_ReturnValue) == 0x000104, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_Not_PreBool_ReturnValue_2) == 0x000105, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_BooleanOR_ReturnValue_1) == 0x000106, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, Temp_struct_Variable) == 0x000108, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_Enable) == 0x000128, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_FirstStart) == 0x000129, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_FirstStart' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_Not_PreBool_ReturnValue_3) == 0x00012A, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_GameState) == 0x000130, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_Playlist) == 0x000138, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CustomEvent_PlaylistContextTags) == 0x000140, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000160, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_Not_PreBool_ReturnValue_4) == 0x000161, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_BooleanAND_ReturnValue_2) == 0x000162, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, K2Node_CreateDelegate_OutputDelegate_6) == 0x000164, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_ShouldStreamBePlaying_ReturnValue) == 0x000170, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_ShouldStreamBePlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended, CallFunc_Not_PreBool_ReturnValue_5) == 0x000171, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ExecuteUbergraph_Artemis_MovieScreen_DriveIn_Screen_Extended::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.Flip Audio Submix
// 0x0004 (0x0004 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix final
{
public:
	bool                                          First;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Default;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix) == 0x000001, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix) == 0x000004, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix, First) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix::First' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix, Default) == 0x000001, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix::Default' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_Flip_Audio_Submix::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.On Video Started
// 0x0001 (0x0001 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_On_Video_Started final
{
public:
	bool                                          FirstStart;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_On_Video_Started) == 0x000001, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_On_Video_Started");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_On_Video_Started) == 0x000001, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_On_Video_Started");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_On_Video_Started, FirstStart) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_On_Video_Started::FirstStart' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.OnAudioEnable
// 0x0002 (0x0002 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnAudioEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstStart;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnAudioEnable) == 0x000001, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnAudioEnable");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnAudioEnable) == 0x000002, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnAudioEnable");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnAudioEnable, Enable) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnAudioEnable::Enable' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnAudioEnable, FirstStart) == 0x000001, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnAudioEnable::FirstStart' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.OnLoaded_0262C34647634C0A92D13FB200770283
// 0x0008 (0x0008 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnLoaded_0262C34647634C0A92D13FB200770283 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnLoaded_0262C34647634C0A92D13FB200770283) == 0x000008, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnLoaded_0262C34647634C0A92D13FB200770283");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnLoaded_0262C34647634C0A92D13FB200770283) == 0x000008, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnLoaded_0262C34647634C0A92D13FB200770283");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnLoaded_0262C34647634C0A92D13FB200770283, Loaded) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnLoaded_0262C34647634C0A92D13FB200770283::Loaded' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.OnReady_AB528D594097CED8314C7EABB9D42BCA
// 0x0030 (0x0030 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA) == 0x000008, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA) == 0x000030, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA, GameState) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA::GameState' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA, Playlist) == 0x000008, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA::Playlist' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA, PlaylistContextTags) == 0x000010, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_OnReady_AB528D594097CED8314C7EABB9D42BCA::PlaylistContextTags' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_ReceiveEndPlay");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ReceiveEndPlay) == 0x000001, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_ReceiveEndPlay");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.SubtitleEnable
// 0x0002 (0x0002 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_SubtitleEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FromStart;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_SubtitleEnable) == 0x000001, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_SubtitleEnable");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_SubtitleEnable) == 0x000002, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_SubtitleEnable");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_SubtitleEnable, Enable) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_SubtitleEnable::Enable' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_SubtitleEnable, FromStart) == 0x000001, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_SubtitleEnable::FromStart' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.UpdateBlocks
// 0x000E (0x000E - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUCPTypes                                     CallFunc_ShouldProtectPlayerFromContent_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScreenRecordingInProgress_ReturnValue;  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks) == 0x000001, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks) == 0x00000E, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_Contains_ReturnValue) == 0x000001, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_Not_PreBool_ReturnValue_1) == 0x000002, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_ShouldProtectPlayerFromContent_ReturnValue) == 0x000003, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_ShouldProtectPlayerFromContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_Not_PreBool_ReturnValue_2) == 0x000005, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_Not_PreBool_ReturnValue_3) == 0x000006, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000007, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000008, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_Not_PreBool_ReturnValue_4) == 0x000009, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_Not_PreBool_ReturnValue_5) == 0x00000A, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_BooleanAND_ReturnValue_1) == 0x00000C, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks, CallFunc_IsScreenRecordingInProgress_ReturnValue) == 0x00000D, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_UpdateBlocks::CallFunc_IsScreenRecordingInProgress_ReturnValue' has a wrong offset!");

// Function Artemis_MovieScreen_DriveIn_Screen_Extended.Artemis_MovieScreen_DriveIn_Screen_Extended_C.VideoEnable
// 0x0001 (0x0001 - 0x0000)
struct Artemis_MovieScreen_DriveIn_Screen_Extended_C_VideoEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_VideoEnable) == 0x000001, "Wrong alignment on Artemis_MovieScreen_DriveIn_Screen_Extended_C_VideoEnable");
static_assert(sizeof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_VideoEnable) == 0x000001, "Wrong size on Artemis_MovieScreen_DriveIn_Screen_Extended_C_VideoEnable");
static_assert(offsetof(Artemis_MovieScreen_DriveIn_Screen_Extended_C_VideoEnable, Enable) == 0x000000, "Member 'Artemis_MovieScreen_DriveIn_Screen_Extended_C_VideoEnable::Enable' has a wrong offset!");

}

