#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Artemis_Seven_Village_Stair_02_Curved

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Artemis_Seven_Village_Stair_02_Curved.Artemis_Seven_Village_Stair_02_Curved_C
// 0x0018 (0x0D80 - 0x0D68)
class AArtemis_Seven_Village_Stair_02_Curved_C final : public ABuildingStairs
{
public:
	class UStaticMeshComponent*                   Cube2;                                             // 0x0D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube1;                                             // 0x0D70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CUBE;                                              // 0x0D78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Artemis_Seven_Village_Stair_02_Curved_C">();
	}
	static class AArtemis_Seven_Village_Stair_02_Curved_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArtemis_Seven_Village_Stair_02_Curved_C>();
	}
};
static_assert(alignof(AArtemis_Seven_Village_Stair_02_Curved_C) == 0x000008, "Wrong alignment on AArtemis_Seven_Village_Stair_02_Curved_C");
static_assert(sizeof(AArtemis_Seven_Village_Stair_02_Curved_C) == 0x000D80, "Wrong size on AArtemis_Seven_Village_Stair_02_Curved_C");
static_assert(offsetof(AArtemis_Seven_Village_Stair_02_Curved_C, Cube2) == 0x000D68, "Member 'AArtemis_Seven_Village_Stair_02_Curved_C::Cube2' has a wrong offset!");
static_assert(offsetof(AArtemis_Seven_Village_Stair_02_Curved_C, Cube1) == 0x000D70, "Member 'AArtemis_Seven_Village_Stair_02_Curved_C::Cube1' has a wrong offset!");
static_assert(offsetof(AArtemis_Seven_Village_Stair_02_Curved_C, CUBE) == 0x000D78, "Member 'AArtemis_Seven_Village_Stair_02_Curved_C::CUBE' has a wrong offset!");

}

