#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMinimapContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMinimapContainer.AthenaMinimapContainer_C
// 0x0028 (0x0348 - 0x0320)
class UAthenaMinimapContainer_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Map;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMinimap*                         Minimap;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMinimapOverlay_C*                      MinimapOverlay;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Map;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_Map_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_AthenaMinimapContainer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMinimapContainer_C">();
	}
	static class UAthenaMinimapContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMinimapContainer_C>();
	}
};
static_assert(alignof(UAthenaMinimapContainer_C) == 0x000008, "Wrong alignment on UAthenaMinimapContainer_C");
static_assert(sizeof(UAthenaMinimapContainer_C) == 0x000348, "Wrong size on UAthenaMinimapContainer_C");
static_assert(offsetof(UAthenaMinimapContainer_C, UberGraphFrame) == 0x000320, "Member 'UAthenaMinimapContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMinimapContainer_C, Button_Map) == 0x000328, "Member 'UAthenaMinimapContainer_C::Button_Map' has a wrong offset!");
static_assert(offsetof(UAthenaMinimapContainer_C, Minimap) == 0x000330, "Member 'UAthenaMinimapContainer_C::Minimap' has a wrong offset!");
static_assert(offsetof(UAthenaMinimapContainer_C, MinimapOverlay) == 0x000338, "Member 'UAthenaMinimapContainer_C::MinimapOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaMinimapContainer_C, Overlay_Map) == 0x000340, "Member 'UAthenaMinimapContainer_C::Overlay_Map' has a wrong offset!");

}

