#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInterrogation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInterrogation.AthenaInterrogation_C
// 0x00A8 (0x03C8 - 0x0320)
class UAthenaInterrogation_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Miss;                                              // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Good;                                              // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Great;                                             // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Perfect;                                           // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Timer;                                             // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton_Interrogate_C*                  Button_Interrogate;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_SuccessText;                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGBurst;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MidBurst;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SharpBurst;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SmallBurst;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InnerRing;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractButton_Gamepad;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractButton_KBM;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OuterRing;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_46;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimingGlow;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimingRing;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ConfirmationSpeed;                                 // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaInterrogation(int32 EntryPoint);
	void Handle_Feedback(EFortQuickTimeEventResult Result);
	void OnQuickTimeEventFeedback(EFortQuickTimeEventResult Result);
	void OnQuickTimeEventWidgetStarted(float Duration, float SweetSpot, float PerfectTolerance, float GreatTolerance, float GoodTolerance);
	void OnQuickTimeEventWidgetStopped();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInterrogation_C">();
	}
	static class UAthenaInterrogation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInterrogation_C>();
	}
};
static_assert(alignof(UAthenaInterrogation_C) == 0x000008, "Wrong alignment on UAthenaInterrogation_C");
static_assert(sizeof(UAthenaInterrogation_C) == 0x0003C8, "Wrong size on UAthenaInterrogation_C");
static_assert(offsetof(UAthenaInterrogation_C, UberGraphFrame) == 0x000320, "Member 'UAthenaInterrogation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Miss) == 0x000328, "Member 'UAthenaInterrogation_C::Miss' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Good) == 0x000330, "Member 'UAthenaInterrogation_C::Good' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Great) == 0x000338, "Member 'UAthenaInterrogation_C::Great' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Perfect) == 0x000340, "Member 'UAthenaInterrogation_C::Perfect' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Timer) == 0x000348, "Member 'UAthenaInterrogation_C::Timer' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Background) == 0x000350, "Member 'UAthenaInterrogation_C::Background' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Button_Interrogate) == 0x000358, "Member 'UAthenaInterrogation_C::Button_Interrogate' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, CommonWidgetSwitcher_SuccessText) == 0x000360, "Member 'UAthenaInterrogation_C::CommonWidgetSwitcher_SuccessText' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Image_BGBurst) == 0x000368, "Member 'UAthenaInterrogation_C::Image_BGBurst' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Image_MidBurst) == 0x000370, "Member 'UAthenaInterrogation_C::Image_MidBurst' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Image_SharpBurst) == 0x000378, "Member 'UAthenaInterrogation_C::Image_SharpBurst' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Image_SmallBurst) == 0x000380, "Member 'UAthenaInterrogation_C::Image_SmallBurst' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, InnerRing) == 0x000388, "Member 'UAthenaInterrogation_C::InnerRing' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, InteractButton_Gamepad) == 0x000390, "Member 'UAthenaInterrogation_C::InteractButton_Gamepad' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, InteractButton_KBM) == 0x000398, "Member 'UAthenaInterrogation_C::InteractButton_KBM' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, OuterRing) == 0x0003A0, "Member 'UAthenaInterrogation_C::OuterRing' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, Overlay_46) == 0x0003A8, "Member 'UAthenaInterrogation_C::Overlay_46' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, TimingGlow) == 0x0003B0, "Member 'UAthenaInterrogation_C::TimingGlow' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, TimingRing) == 0x0003B8, "Member 'UAthenaInterrogation_C::TimingRing' has a wrong offset!");
static_assert(offsetof(UAthenaInterrogation_C, ConfirmationSpeed) == 0x0003C0, "Member 'UAthenaInterrogation_C::ConfirmationSpeed' has a wrong offset!");

}

