#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_GameState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_GameState.Athena_GameState_C
// 0x0020 (0x3230 - 0x3210)
class AAthena_GameState_C final : public AFortGameStateBR
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x3218(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Victory_Royale_Sound;                              // 0x3220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_GameState(int32 EntryPoint);
	void OnWinnerAnnounced();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_GameState_C">();
	}
	static class AAthena_GameState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_GameState_C>();
	}
};
static_assert(alignof(AAthena_GameState_C) == 0x000010, "Wrong alignment on AAthena_GameState_C");
static_assert(sizeof(AAthena_GameState_C) == 0x003230, "Wrong size on AAthena_GameState_C");
static_assert(offsetof(AAthena_GameState_C, UberGraphFrame) == 0x003210, "Member 'AAthena_GameState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_GameState_C, DefaultSceneRoot) == 0x003218, "Member 'AAthena_GameState_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAthena_GameState_C, Victory_Royale_Sound) == 0x003220, "Member 'AAthena_GameState_C::Victory_Royale_Sound' has a wrong offset!");

}

