#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryItemTileButton_Currency

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaInventoryItemTileButton_Currency.AthenaInventoryItemTileButton_Currency_C.ExecuteUbergraph_AthenaInventoryItemTileButton_Currency
// 0x0028 (0x0028 - 0x0000)
struct AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaItemIconResource_C*              K2Node_DynamicCast_AsAthena_Item_Icon_Resource;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaItemIconResource_C*              K2Node_DynamicCast_AsAthena_Item_Icon_Resource_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency) == 0x000008, "Wrong alignment on AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency");
static_assert(sizeof(AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency) == 0x000028, "Wrong size on AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency, EntryPoint) == 0x000000, "Member 'AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency, K2Node_DynamicCast_AsAthena_Item_Icon_Resource) == 0x000008, "Member 'AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency::K2Node_DynamicCast_AsAthena_Item_Icon_Resource' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency, K2Node_DynamicCast_AsAthena_Item_Icon_Resource_1) == 0x000018, "Member 'AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency::K2Node_DynamicCast_AsAthena_Item_Icon_Resource_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'AthenaInventoryItemTileButton_Currency_C_ExecuteUbergraph_AthenaInventoryItemTileButton_Currency::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AthenaInventoryItemTileButton_Currency.AthenaInventoryItemTileButton_Currency_C.HandleIntro
// 0x0010 (0x0010 - 0x0000)
struct AthenaInventoryItemTileButton_Currency_C_HandleIntro final
{
public:
	class UAthenaItemIconResource_C*              K2Node_DynamicCast_AsAthena_Item_Icon_Resource;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryItemTileButton_Currency_C_HandleIntro) == 0x000008, "Wrong alignment on AthenaInventoryItemTileButton_Currency_C_HandleIntro");
static_assert(sizeof(AthenaInventoryItemTileButton_Currency_C_HandleIntro) == 0x000010, "Wrong size on AthenaInventoryItemTileButton_Currency_C_HandleIntro");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_HandleIntro, K2Node_DynamicCast_AsAthena_Item_Icon_Resource) == 0x000000, "Member 'AthenaInventoryItemTileButton_Currency_C_HandleIntro::K2Node_DynamicCast_AsAthena_Item_Icon_Resource' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_HandleIntro, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'AthenaInventoryItemTileButton_Currency_C_HandleIntro::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaInventoryItemTileButton_Currency.AthenaInventoryItemTileButton_Currency_C.OnDragDetected
// 0x0128 (0x0128 - 0x0000)
struct AthenaInventoryItemTileButton_Currency_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00D0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              Local_ItemToRepresent;                             // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaInventoryDragDrop_C*             CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputEvent                            CallFunc_GetInputEventFromPointerEvent_ReturnValue; // 0x00E8(0x0018)()
	bool                                          CallFunc_InputEvent_IsShiftDown_ReturnValue;       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetItemToRepresent_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaInventoryDragVisual_C*           CallFunc_Create_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected) == 0x000008, "Wrong alignment on AthenaInventoryItemTileButton_Currency_C_OnDragDetected");
static_assert(sizeof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected) == 0x000128, "Wrong size on AthenaInventoryItemTileButton_Currency_C_OnDragDetected");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, PointerEvent) == 0x000040, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, Operation) == 0x0000D0, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, Local_ItemToRepresent) == 0x0000D8, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::Local_ItemToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000E0, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, CallFunc_GetInputEventFromPointerEvent_ReturnValue) == 0x0000E8, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::CallFunc_GetInputEventFromPointerEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, CallFunc_InputEvent_IsShiftDown_ReturnValue) == 0x000100, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::CallFunc_InputEvent_IsShiftDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, CallFunc_GetItemToRepresent_ReturnValue) == 0x000108, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::CallFunc_GetItemToRepresent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, CallFunc_GetOwningPlayer_ReturnValue) == 0x000110, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x000120, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaInventoryItemTileButton_Currency.AthenaInventoryItemTileButton_Currency_C.OnDrop
// 0x00F0 (0x00F0 - 0x0000)
struct AthenaInventoryItemTileButton_Currency_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0040(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ValidDrop;                                         // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_DynamicCast_AsFort_Item;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryItemTileButton_Currency_C_OnDrop) == 0x000008, "Wrong alignment on AthenaInventoryItemTileButton_Currency_C_OnDrop");
static_assert(sizeof(AthenaInventoryItemTileButton_Currency_C_OnDrop) == 0x0000F0, "Wrong size on AthenaInventoryItemTileButton_Currency_C_OnDrop");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDrop, MyGeometry) == 0x000000, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDrop, PointerEvent) == 0x000040, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDrop, Operation) == 0x0000D0, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDrop, ReturnValue) == 0x0000D8, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDrop, ValidDrop) == 0x0000D9, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDrop::ValidDrop' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDrop, K2Node_DynamicCast_AsFort_Item) == 0x0000E0, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDrop::K2Node_DynamicCast_AsFort_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'AthenaInventoryItemTileButton_Currency_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaInventoryItemTileButton_Currency.AthenaInventoryItemTileButton_Currency_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct AthenaInventoryItemTileButton_Currency_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0048(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
};
static_assert(alignof(AthenaInventoryItemTileButton_Currency_C_OnFocusReceived) == 0x000008, "Wrong alignment on AthenaInventoryItemTileButton_Currency_C_OnFocusReceived");
static_assert(sizeof(AthenaInventoryItemTileButton_Currency_C_OnFocusReceived) == 0x0001B8, "Wrong size on AthenaInventoryItemTileButton_Currency_C_OnFocusReceived");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'AthenaInventoryItemTileButton_Currency_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnFocusReceived, InFocusEvent) == 0x000040, "Member 'AthenaInventoryItemTileButton_Currency_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnFocusReceived, ReturnValue) == 0x000048, "Member 'AthenaInventoryItemTileButton_Currency_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'AthenaInventoryItemTileButton_Currency_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function AthenaInventoryItemTileButton_Currency.AthenaInventoryItemTileButton_Currency_C.OnMouseButtonDown_Border
// 0x03C8 (0x03C8 - 0x0000)
struct AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0190(0x00B8)()
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_DetectDrag_ReturnValue;                   // 0x0250(0x00B8)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x0310(0x00B8)()
};
static_assert(alignof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border) == 0x000008, "Wrong alignment on AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border");
static_assert(sizeof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border) == 0x0003C8, "Wrong size on AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border, MyGeometry) == 0x000000, "Member 'AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border, MouseEvent) == 0x000040, "Member 'AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border::MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border, ReturnValue) == 0x0000D0, "Member 'AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border, CallFunc_GetContext_ReturnValue) == 0x000188, "Member 'AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border, CallFunc_Unhandled_ReturnValue) == 0x000190, "Member 'AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border, CallFunc_GetCurrentInputType_ReturnValue) == 0x000248, "Member 'AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border, CallFunc_DetectDrag_ReturnValue) == 0x000250, "Member 'AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border::CallFunc_DetectDrag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000308, "Member 'AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border, CallFunc_Unhandled_ReturnValue_1) == 0x000310, "Member 'AthenaInventoryItemTileButton_Currency_C_OnMouseButtonDown_Border::CallFunc_Unhandled_ReturnValue_1' has a wrong offset!");

// Function AthenaInventoryItemTileButton_Currency.AthenaInventoryItemTileButton_Currency_C.UpdateInteractionWidgetVisibility
// 0x0030 (0x0030 - 0x0000)
struct AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility final
{
public:
	class UFortItem*                              Local_ItemToRepresent;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetOwningController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquipable_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetItemToRepresent_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility) == 0x000008, "Wrong alignment on AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility");
static_assert(sizeof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility) == 0x000030, "Wrong size on AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, Local_ItemToRepresent) == 0x000000, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::Local_ItemToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, Temp_byte_Variable) == 0x000008, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, Temp_byte_Variable_1) == 0x000009, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, CallFunc_GetOwningController_ReturnValue) == 0x000010, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::CallFunc_GetOwningController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, CallFunc_GetType_ReturnValue) == 0x000018, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, CallFunc_IsEquipable_ReturnValue) == 0x000019, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::CallFunc_IsEquipable_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, CallFunc_IsValid_ReturnValue) == 0x00001B, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, CallFunc_GetItemToRepresent_ReturnValue) == 0x000020, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::CallFunc_GetItemToRepresent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, Temp_bool_Variable) == 0x000028, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility, K2Node_Select_Default) == 0x000029, "Member 'AthenaInventoryItemTileButton_Currency_C_UpdateInteractionWidgetVisibility::K2Node_Select_Default' has a wrong offset!");

}

