#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_CoolCarpet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Athena_Prop_SneakySnowmanV2_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_CoolCarpet.Athena_Prop_CoolCarpet_C
// 0x0060 (0x1028 - 0x0FC8)
class AAthena_Prop_CoolCarpet_C final : public AAthena_Prop_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Prop_CoolCarpet_C;           // 0x0FC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ShadowInsert;                                   // 0x0FD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap2;                               // 0x0FD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap1;                               // 0x0FE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpenFlaps_Rotation_FDF331244F066E298266B69ACE6D4998; // 0x0FE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenFlaps__Direction_FDF331244F066E298266B69ACE6D4998; // 0x0FEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FED[0x3];                                      // 0x0FED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenFlaps;                                         // 0x0FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandMatInt;                                        // 0x0FF8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatIntOverride;                                    // 0x0FFC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         CanHideInProp;                                     // 0x1000(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void CloseFlaps();
	void ExecuteUbergraph_Athena_Prop_CoolCarpet(int32 EntryPoint);
	void GetMaterialInt(int32* MatInt);
	void OnRep_MatIntOverride();
	void OpenFlaps__FinishedFunc();
	void OpenFlaps__UpdateFunc();
	void OpenFlapsMulticast();
	void ReceiveBeginPlay();
	void UserConstructionScript();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	bool IsTargetableByLinearMover() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_CoolCarpet_C">();
	}
	static class AAthena_Prop_CoolCarpet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_CoolCarpet_C>();
	}
};
static_assert(alignof(AAthena_Prop_CoolCarpet_C) == 0x000008, "Wrong alignment on AAthena_Prop_CoolCarpet_C");
static_assert(sizeof(AAthena_Prop_CoolCarpet_C) == 0x001028, "Wrong size on AAthena_Prop_CoolCarpet_C");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, UberGraphFrame_Athena_Prop_CoolCarpet_C) == 0x000FC8, "Member 'AAthena_Prop_CoolCarpet_C::UberGraphFrame_Athena_Prop_CoolCarpet_C' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, SM_ShadowInsert) == 0x000FD0, "Member 'AAthena_Prop_CoolCarpet_C::SM_ShadowInsert' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, SM_CoolCarpet_Flap2) == 0x000FD8, "Member 'AAthena_Prop_CoolCarpet_C::SM_CoolCarpet_Flap2' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, SM_CoolCarpet_Flap1) == 0x000FE0, "Member 'AAthena_Prop_CoolCarpet_C::SM_CoolCarpet_Flap1' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, OpenFlaps_Rotation_FDF331244F066E298266B69ACE6D4998) == 0x000FE8, "Member 'AAthena_Prop_CoolCarpet_C::OpenFlaps_Rotation_FDF331244F066E298266B69ACE6D4998' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, OpenFlaps__Direction_FDF331244F066E298266B69ACE6D4998) == 0x000FEC, "Member 'AAthena_Prop_CoolCarpet_C::OpenFlaps__Direction_FDF331244F066E298266B69ACE6D4998' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, OpenFlaps) == 0x000FF0, "Member 'AAthena_Prop_CoolCarpet_C::OpenFlaps' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, RandMatInt) == 0x000FF8, "Member 'AAthena_Prop_CoolCarpet_C::RandMatInt' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, MatIntOverride) == 0x000FFC, "Member 'AAthena_Prop_CoolCarpet_C::MatIntOverride' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, CanHideInProp) == 0x001000, "Member 'AAthena_Prop_CoolCarpet_C::CanHideInProp' has a wrong offset!");

}

