#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDBoundActionButton

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function AthenaHUDBoundActionButton.AthenaHUDBoundActionButton_C.ExecuteUbergraph_AthenaHUDBoundActionButton
// 0x0004 (0x0004 - 0x0000)
struct AthenaHUDBoundActionButton_C_ExecuteUbergraph_AthenaHUDBoundActionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDBoundActionButton_C_ExecuteUbergraph_AthenaHUDBoundActionButton) == 0x000004, "Wrong alignment on AthenaHUDBoundActionButton_C_ExecuteUbergraph_AthenaHUDBoundActionButton");
static_assert(sizeof(AthenaHUDBoundActionButton_C_ExecuteUbergraph_AthenaHUDBoundActionButton) == 0x000004, "Wrong size on AthenaHUDBoundActionButton_C_ExecuteUbergraph_AthenaHUDBoundActionButton");
static_assert(offsetof(AthenaHUDBoundActionButton_C_ExecuteUbergraph_AthenaHUDBoundActionButton, EntryPoint) == 0x000000, "Member 'AthenaHUDBoundActionButton_C_ExecuteUbergraph_AthenaHUDBoundActionButton::EntryPoint' has a wrong offset!");

// Function AthenaHUDBoundActionButton.AthenaHUDBoundActionButton_C.UpdateInputActionIconSize
// 0x0018 (0x0018 - 0x0000)
struct AthenaHUDBoundActionButton_C_UpdateInputActionIconSize final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDBoundActionButton_C_UpdateInputActionIconSize) == 0x000008, "Wrong alignment on AthenaHUDBoundActionButton_C_UpdateInputActionIconSize");
static_assert(sizeof(AthenaHUDBoundActionButton_C_UpdateInputActionIconSize) == 0x000018, "Wrong size on AthenaHUDBoundActionButton_C_UpdateInputActionIconSize");
static_assert(offsetof(AthenaHUDBoundActionButton_C_UpdateInputActionIconSize, Temp_float_Variable) == 0x000000, "Member 'AthenaHUDBoundActionButton_C_UpdateInputActionIconSize::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUDBoundActionButton_C_UpdateInputActionIconSize, Temp_float_Variable_1) == 0x000004, "Member 'AthenaHUDBoundActionButton_C_UpdateInputActionIconSize::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUDBoundActionButton_C_UpdateInputActionIconSize, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaHUDBoundActionButton_C_UpdateInputActionIconSize::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDBoundActionButton_C_UpdateInputActionIconSize, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'AthenaHUDBoundActionButton_C_UpdateInputActionIconSize::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDBoundActionButton_C_UpdateInputActionIconSize, Temp_bool_Variable) == 0x000011, "Member 'AthenaHUDBoundActionButton_C_UpdateInputActionIconSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUDBoundActionButton_C_UpdateInputActionIconSize, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'AthenaHUDBoundActionButton_C_UpdateInputActionIconSize::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDBoundActionButton_C_UpdateInputActionIconSize, K2Node_Select_Default) == 0x000014, "Member 'AthenaHUDBoundActionButton_C_UpdateInputActionIconSize::K2Node_Select_Default' has a wrong offset!");

}

