#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_DamageStateParticles

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Athena_DamageStateParticles.Athena_DamageStateParticles
// 0x0060 (0x0060 - 0x0000)
struct FAthena_DamageStateParticles final
{
public:
	class UParticleSystem*                        Emitter_7_6BFD67FD462FFC8B6E2485A882FAEADA;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Spawned_19_ADE1ECD74E521455DA9695B1FDB47581;       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalSpawnPosition_9_507DFDCB4A99E944783EEAB44C495149; // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LocalSpawnRotation_12_86D59DAF4DC65EF2E0CEB2BD7740F557; // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                LocalSpawnScale_20_D001987D4D7EB90DF56AAC9B5F8133A8; // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthPercent_24_AC35B253419518DA53906DB5CCAD79F8; // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAthena_DamageStateParticles) == 0x000008, "Wrong alignment on FAthena_DamageStateParticles");
static_assert(sizeof(FAthena_DamageStateParticles) == 0x000060, "Wrong size on FAthena_DamageStateParticles");
static_assert(offsetof(FAthena_DamageStateParticles, Emitter_7_6BFD67FD462FFC8B6E2485A882FAEADA) == 0x000000, "Member 'FAthena_DamageStateParticles::Emitter_7_6BFD67FD462FFC8B6E2485A882FAEADA' has a wrong offset!");
static_assert(offsetof(FAthena_DamageStateParticles, Spawned_19_ADE1ECD74E521455DA9695B1FDB47581) == 0x000008, "Member 'FAthena_DamageStateParticles::Spawned_19_ADE1ECD74E521455DA9695B1FDB47581' has a wrong offset!");
static_assert(offsetof(FAthena_DamageStateParticles, LocalSpawnPosition_9_507DFDCB4A99E944783EEAB44C495149) == 0x000010, "Member 'FAthena_DamageStateParticles::LocalSpawnPosition_9_507DFDCB4A99E944783EEAB44C495149' has a wrong offset!");
static_assert(offsetof(FAthena_DamageStateParticles, LocalSpawnRotation_12_86D59DAF4DC65EF2E0CEB2BD7740F557) == 0x000028, "Member 'FAthena_DamageStateParticles::LocalSpawnRotation_12_86D59DAF4DC65EF2E0CEB2BD7740F557' has a wrong offset!");
static_assert(offsetof(FAthena_DamageStateParticles, LocalSpawnScale_20_D001987D4D7EB90DF56AAC9B5F8133A8) == 0x000040, "Member 'FAthena_DamageStateParticles::LocalSpawnScale_20_D001987D4D7EB90DF56AAC9B5F8133A8' has a wrong offset!");
static_assert(offsetof(FAthena_DamageStateParticles, HealthPercent_24_AC35B253419518DA53906DB5CCAD79F8) == 0x000058, "Member 'FAthena_DamageStateParticles::HealthPercent_24_AC35B253419518DA53906DB5CCAD79F8' has a wrong offset!");

}

