#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastPlayersRemaining

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastPlayersRemaining.AthenaBroadcastPlayersRemaining_C
// 0x01C8 (0x04A8 - 0x02E0)
class UAthenaBroadcastPlayersRemaining_C final : public UAthenaSpectatorPlayersLeftBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TeamsElimScale;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayersElimScale;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                PlayersLeft;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Team_Icon;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TeamsLeft;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TeamsSB;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TotalPlayers;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TotalTeams;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DesignTime_PlayersLeft;                            // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DesignTime_TotalPlayers;                           // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DesignTime_TeamsLeft;                              // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DesignTime_TotalTeams;                             // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DesignTime_MaxSquadSize;                           // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              DefaultTeamIcon;                                   // 0x0340(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<int32, TSoftObjectPtr<class UTexture2D>> TeamIcons;                                         // 0x0368(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateFontInfo                         LargeFont;                                         // 0x03B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         MediumFont;                                        // 0x0408(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SmallFont;                                         // 0x0458(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaBroadcastPlayersRemaining(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateMaxSquadSize(int32 MaxSquadSize);
	void UpdatePlayersLeft(int32 InPlayersLeft);
	void UpdateTeamsLeft(int32 InTeamsLeft);
	void UpdateTotalPlayers(int32 InTotalPlayers);
	void UpdateTotalTeams(int32 InTotalTeams);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcastPlayersRemaining_C">();
	}
	static class UAthenaBroadcastPlayersRemaining_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastPlayersRemaining_C>();
	}
};
static_assert(alignof(UAthenaBroadcastPlayersRemaining_C) == 0x000008, "Wrong alignment on UAthenaBroadcastPlayersRemaining_C");
static_assert(sizeof(UAthenaBroadcastPlayersRemaining_C) == 0x0004A8, "Wrong size on UAthenaBroadcastPlayersRemaining_C");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, UberGraphFrame) == 0x0002E0, "Member 'UAthenaBroadcastPlayersRemaining_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, TeamsElimScale) == 0x0002E8, "Member 'UAthenaBroadcastPlayersRemaining_C::TeamsElimScale' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, PlayersElimScale) == 0x0002F0, "Member 'UAthenaBroadcastPlayersRemaining_C::PlayersElimScale' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, PlayersLeft) == 0x0002F8, "Member 'UAthenaBroadcastPlayersRemaining_C::PlayersLeft' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, Team_Icon) == 0x000300, "Member 'UAthenaBroadcastPlayersRemaining_C::Team_Icon' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, TeamsLeft) == 0x000308, "Member 'UAthenaBroadcastPlayersRemaining_C::TeamsLeft' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, TeamsSB) == 0x000310, "Member 'UAthenaBroadcastPlayersRemaining_C::TeamsSB' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, TotalPlayers) == 0x000318, "Member 'UAthenaBroadcastPlayersRemaining_C::TotalPlayers' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, TotalTeams) == 0x000320, "Member 'UAthenaBroadcastPlayersRemaining_C::TotalTeams' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, DesignTime_PlayersLeft) == 0x000328, "Member 'UAthenaBroadcastPlayersRemaining_C::DesignTime_PlayersLeft' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, DesignTime_TotalPlayers) == 0x00032C, "Member 'UAthenaBroadcastPlayersRemaining_C::DesignTime_TotalPlayers' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, DesignTime_TeamsLeft) == 0x000330, "Member 'UAthenaBroadcastPlayersRemaining_C::DesignTime_TeamsLeft' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, DesignTime_TotalTeams) == 0x000334, "Member 'UAthenaBroadcastPlayersRemaining_C::DesignTime_TotalTeams' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, DesignTime_MaxSquadSize) == 0x000338, "Member 'UAthenaBroadcastPlayersRemaining_C::DesignTime_MaxSquadSize' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, DefaultTeamIcon) == 0x000340, "Member 'UAthenaBroadcastPlayersRemaining_C::DefaultTeamIcon' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, TeamIcons) == 0x000368, "Member 'UAthenaBroadcastPlayersRemaining_C::TeamIcons' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, LargeFont) == 0x0003B8, "Member 'UAthenaBroadcastPlayersRemaining_C::LargeFont' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, MediumFont) == 0x000408, "Member 'UAthenaBroadcastPlayersRemaining_C::MediumFont' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayersRemaining_C, SmallFont) == 0x000458, "Member 'UAthenaBroadcastPlayersRemaining_C::SmallFont' has a wrong offset!");

}

