#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastPlayerEventScore

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastPlayerEventScore.AthenaBroadcastPlayerEventScore_C
// 0x0018 (0x0348 - 0x0330)
class UAthenaBroadcastPlayerEventScore_C final : public UAthenaBroadcastPlayerEventScoreWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBox_0;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EStretch                                      OldStretch;                                        // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaBroadcastPlayerEventScore(int32 EntryPoint);
	void OnPointTextSet();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcastPlayerEventScore_C">();
	}
	static class UAthenaBroadcastPlayerEventScore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastPlayerEventScore_C>();
	}
};
static_assert(alignof(UAthenaBroadcastPlayerEventScore_C) == 0x000008, "Wrong alignment on UAthenaBroadcastPlayerEventScore_C");
static_assert(sizeof(UAthenaBroadcastPlayerEventScore_C) == 0x000348, "Wrong size on UAthenaBroadcastPlayerEventScore_C");
static_assert(offsetof(UAthenaBroadcastPlayerEventScore_C, UberGraphFrame) == 0x000330, "Member 'UAthenaBroadcastPlayerEventScore_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerEventScore_C, ScaleBox_0) == 0x000338, "Member 'UAthenaBroadcastPlayerEventScore_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerEventScore_C, OldStretch) == 0x000340, "Member 'UAthenaBroadcastPlayerEventScore_C::OldStretch' has a wrong offset!");

}

