#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLoadingMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLoadingMessage.AthenaLoadingMessage_C
// 0x0018 (0x02D0 - 0x02B8)
class UAthenaLoadingMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         LoadingBox;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RelocatingTextBlock;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_AthenaLoadingMessage(int32 EntryPoint);
	void HandleLoadingScreenChanged(class AFortPlayerControllerAthena* PlayerController, bool bEnabled, const class FText& HUDReasonText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLoadingMessage_C">();
	}
	static class UAthenaLoadingMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLoadingMessage_C>();
	}
};
static_assert(alignof(UAthenaLoadingMessage_C) == 0x000008, "Wrong alignment on UAthenaLoadingMessage_C");
static_assert(sizeof(UAthenaLoadingMessage_C) == 0x0002D0, "Wrong size on UAthenaLoadingMessage_C");
static_assert(offsetof(UAthenaLoadingMessage_C, UberGraphFrame) == 0x0002B8, "Member 'UAthenaLoadingMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLoadingMessage_C, LoadingBox) == 0x0002C0, "Member 'UAthenaLoadingMessage_C::LoadingBox' has a wrong offset!");
static_assert(offsetof(UAthenaLoadingMessage_C, RelocatingTextBlock) == 0x0002C8, "Member 'UAthenaLoadingMessage_C::RelocatingTextBlock' has a wrong offset!");

}

