#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDBottomBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaHUDBottomBar.AthenaHUDBottomBar_C.ExecuteUbergraph_AthenaHUDBottomBar
// 0x0018 (0x0018 - 0x0000)
struct AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar) == 0x000008, "Wrong alignment on AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar");
static_assert(sizeof(AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar) == 0x000018, "Wrong size on AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar");
static_assert(offsetof(AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar, EntryPoint) == 0x000000, "Member 'AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'AthenaHUDBottomBar_C_ExecuteUbergraph_AthenaHUDBottomBar::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

