#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSessionId

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaSessionId.AthenaSessionId_C.ExecuteUbergraph_AthenaSessionId
// 0x0004 (0x0004 - 0x0000)
struct AthenaSessionId_C_ExecuteUbergraph_AthenaSessionId final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSessionId_C_ExecuteUbergraph_AthenaSessionId) == 0x000004, "Wrong alignment on AthenaSessionId_C_ExecuteUbergraph_AthenaSessionId");
static_assert(sizeof(AthenaSessionId_C_ExecuteUbergraph_AthenaSessionId) == 0x000004, "Wrong size on AthenaSessionId_C_ExecuteUbergraph_AthenaSessionId");
static_assert(offsetof(AthenaSessionId_C_ExecuteUbergraph_AthenaSessionId, EntryPoint) == 0x000000, "Member 'AthenaSessionId_C_ExecuteUbergraph_AthenaSessionId::EntryPoint' has a wrong offset!");

// Function AthenaSessionId.AthenaSessionId_C.UpdateSessionId
// 0x0048 (0x0048 - 0x0000)
struct AthenaSessionId_C_UpdateSessionId final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSessionId_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSessionId_C_UpdateSessionId) == 0x000008, "Wrong alignment on AthenaSessionId_C_UpdateSessionId");
static_assert(sizeof(AthenaSessionId_C_UpdateSessionId) == 0x000048, "Wrong size on AthenaSessionId_C_UpdateSessionId");
static_assert(offsetof(AthenaSessionId_C_UpdateSessionId, Temp_byte_Variable) == 0x000000, "Member 'AthenaSessionId_C_UpdateSessionId::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSessionId_C_UpdateSessionId, Temp_byte_Variable_1) == 0x000001, "Member 'AthenaSessionId_C_UpdateSessionId::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSessionId_C_UpdateSessionId, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaSessionId_C_UpdateSessionId::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSessionId_C_UpdateSessionId, Temp_bool_Variable) == 0x000010, "Member 'AthenaSessionId_C_UpdateSessionId::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSessionId_C_UpdateSessionId, CallFunc_GetSessionId_ReturnValue) == 0x000018, "Member 'AthenaSessionId_C_UpdateSessionId::CallFunc_GetSessionId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSessionId_C_UpdateSessionId, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'AthenaSessionId_C_UpdateSessionId::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSessionId_C_UpdateSessionId, CallFunc_TextIsEmpty_ReturnValue) == 0x000040, "Member 'AthenaSessionId_C_UpdateSessionId::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSessionId_C_UpdateSessionId, K2Node_Select_Default) == 0x000041, "Member 'AthenaSessionId_C_UpdateSessionId::K2Node_Select_Default' has a wrong offset!");

}

