#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorTrapsLoadout

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaSpectatorTrapsLoadout.AthenaSpectatorTrapsLoadout_C.ExecuteUbergraph_AthenaSpectatorTrapsLoadout
// 0x0018 (0x0018 - 0x0000)
struct AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAthenaSpectatorInventorySlotBase*> K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout) == 0x000008, "Wrong alignment on AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout");
static_assert(sizeof(AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout) == 0x000018, "Wrong size on AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout");
static_assert(offsetof(AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout, EntryPoint) == 0x000000, "Member 'AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout, K2Node_Event_IsDesignTime) == 0x000004, "Member 'AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout, K2Node_MakeArray_Array) == 0x000008, "Member 'AthenaSpectatorTrapsLoadout_C_ExecuteUbergraph_AthenaSpectatorTrapsLoadout::K2Node_MakeArray_Array' has a wrong offset!");

// Function AthenaSpectatorTrapsLoadout.AthenaSpectatorTrapsLoadout_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorTrapsLoadout_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorTrapsLoadout_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaSpectatorTrapsLoadout_C_PreConstruct");
static_assert(sizeof(AthenaSpectatorTrapsLoadout_C_PreConstruct) == 0x000001, "Wrong size on AthenaSpectatorTrapsLoadout_C_PreConstruct");
static_assert(offsetof(AthenaSpectatorTrapsLoadout_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaSpectatorTrapsLoadout_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

