#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInteractionIndicator

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.AttemptSetItemToRepresent
// 0x0030 (0x0030 - 0x0000)
struct AthenaInteractionIndicator_C_AttemptSetItemToRepresent final
{
public:
	class UFortItemWidget_NUI*                    Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortItem*                        ItemToRepresent;                                   // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_AttemptSetItemToRepresent) == 0x000008, "Wrong alignment on AthenaInteractionIndicator_C_AttemptSetItemToRepresent");
static_assert(sizeof(AthenaInteractionIndicator_C_AttemptSetItemToRepresent) == 0x000030, "Wrong size on AthenaInteractionIndicator_C_AttemptSetItemToRepresent");
static_assert(offsetof(AthenaInteractionIndicator_C_AttemptSetItemToRepresent, Widget) == 0x000000, "Member 'AthenaInteractionIndicator_C_AttemptSetItemToRepresent::Widget' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_AttemptSetItemToRepresent, ItemToRepresent) == 0x000008, "Member 'AthenaInteractionIndicator_C_AttemptSetItemToRepresent::ItemToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_AttemptSetItemToRepresent, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'AthenaInteractionIndicator_C_AttemptSetItemToRepresent::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_AttemptSetItemToRepresent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AthenaInteractionIndicator_C_AttemptSetItemToRepresent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_AttemptSetItemToRepresent, CallFunc_GetItemDefinitionBP_ReturnValue_1) == 0x000020, "Member 'AthenaInteractionIndicator_C_AttemptSetItemToRepresent::CallFunc_GetItemDefinitionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_AttemptSetItemToRepresent, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'AthenaInteractionIndicator_C_AttemptSetItemToRepresent::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.BindMultiInteractUpdate
// 0x0030 (0x0030 - 0x0000)
struct AthenaInteractionIndicator_C_BindMultiInteractUpdate final
{
public:
	TDelegate<void(int32 InteractingActorCount, float MultiInteractMultiplier, float InteractingDuration)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActorComponent_MultiInteract*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMultiInteractActorComponent_C*         K2Node_DynamicCast_AsMulti_Interact_Actor_Component; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_BindMultiInteractUpdate) == 0x000008, "Wrong alignment on AthenaInteractionIndicator_C_BindMultiInteractUpdate");
static_assert(sizeof(AthenaInteractionIndicator_C_BindMultiInteractUpdate) == 0x000030, "Wrong size on AthenaInteractionIndicator_C_BindMultiInteractUpdate");
static_assert(offsetof(AthenaInteractionIndicator_C_BindMultiInteractUpdate, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaInteractionIndicator_C_BindMultiInteractUpdate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_BindMultiInteractUpdate, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'AthenaInteractionIndicator_C_BindMultiInteractUpdate::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_BindMultiInteractUpdate, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AthenaInteractionIndicator_C_BindMultiInteractUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_BindMultiInteractUpdate, K2Node_DynamicCast_AsMulti_Interact_Actor_Component) == 0x000020, "Member 'AthenaInteractionIndicator_C_BindMultiInteractUpdate::K2Node_DynamicCast_AsMulti_Interact_Actor_Component' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_BindMultiInteractUpdate, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AthenaInteractionIndicator_C_BindMultiInteractUpdate::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.EventUpdateTargeting
// 0x0001 (0x0001 - 0x0000)
struct AthenaInteractionIndicator_C_EventUpdateTargeting final
{
public:
	bool                                          bIsTargeting;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_EventUpdateTargeting) == 0x000001, "Wrong alignment on AthenaInteractionIndicator_C_EventUpdateTargeting");
static_assert(sizeof(AthenaInteractionIndicator_C_EventUpdateTargeting) == 0x000001, "Wrong size on AthenaInteractionIndicator_C_EventUpdateTargeting");
static_assert(offsetof(AthenaInteractionIndicator_C_EventUpdateTargeting, bIsTargeting) == 0x000000, "Member 'AthenaInteractionIndicator_C_EventUpdateTargeting::bIsTargeting' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.ExecuteUbergraph_AthenaInteractionIndicator
// 0x00C0 (0x00C0 - 0x0000)
struct AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortInteractContextInfo* ContextInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortInteractContextInfo* ContextInfo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            K2Node_CustomEvent_Pickup;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsTargeting)>            K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsTargeting;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_2;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_3;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortPickup* PickUp)>    K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator) == 0x000008, "Wrong alignment on AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator");
static_assert(sizeof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator) == 0x0000C0, "Wrong size on AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, EntryPoint) == 0x000000, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_GetContext_ReturnValue_1) == 0x000028, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, Temp_float_Variable) == 0x00004C, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_CustomEvent_bNewInputType) == 0x000050, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_CustomEvent_Pickup) == 0x000060, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_CustomEvent_Pickup' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_CustomEvent_bIsTargeting) == 0x000078, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_CustomEvent_bIsTargeting' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_Array_Add_ReturnValue_1) == 0x000080, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, Temp_float_Variable_1) == 0x000084, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_Array_Add_ReturnValue_2) == 0x000088, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_Array_Add_ReturnValue_3) == 0x00008C, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, Temp_bool_Variable) == 0x000090, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_GetContext_ReturnValue_2) == 0x000098, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_IsValid_ReturnValue_2) == 0x0000A0, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_Select_Default) == 0x0000A4, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, CallFunc_GetContext_ReturnValue_3) == 0x0000A8, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B0, "Member 'AthenaInteractionIndicator_C_ExecuteUbergraph_AthenaInteractionIndicator::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.Get Interact Actor Count
// 0x0028 (0x0028 - 0x0000)
struct AthenaInteractionIndicator_C_Get_Interact_Actor_Count final
{
public:
	class UFortInteractContextInfo*               CurrentInteraction_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractionCount;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActorComponent_MultiInteract*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultipleInteractionEnabled_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInteractingActorCount_ReturnValue;     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count) == 0x000008, "Wrong alignment on AthenaInteractionIndicator_C_Get_Interact_Actor_Count");
static_assert(sizeof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count) == 0x000028, "Wrong size on AthenaInteractionIndicator_C_Get_Interact_Actor_Count");
static_assert(offsetof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count, CurrentInteraction_0) == 0x000000, "Member 'AthenaInteractionIndicator_C_Get_Interact_Actor_Count::CurrentInteraction_0' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count, InteractionCount) == 0x000008, "Member 'AthenaInteractionIndicator_C_Get_Interact_Actor_Count::InteractionCount' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'AthenaInteractionIndicator_C_Get_Interact_Actor_Count::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000D, "Member 'AthenaInteractionIndicator_C_Get_Interact_Actor_Count::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'AthenaInteractionIndicator_C_Get_Interact_Actor_Count::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count, CallFunc_IsMultipleInteractionEnabled_ReturnValue) == 0x000018, "Member 'AthenaInteractionIndicator_C_Get_Interact_Actor_Count::CallFunc_IsMultipleInteractionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count, CallFunc_GetInteractingActorCount_ReturnValue) == 0x00001C, "Member 'AthenaInteractionIndicator_C_Get_Interact_Actor_Count::CallFunc_GetInteractingActorCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Get_Interact_Actor_Count, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'AthenaInteractionIndicator_C_Get_Interact_Actor_Count::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.GetVisibleVisibility
// 0x0006 (0x0006 - 0x0000)
struct AthenaInteractionIndicator_C_GetVisibleVisibility final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_GetVisibleVisibility) == 0x000001, "Wrong alignment on AthenaInteractionIndicator_C_GetVisibleVisibility");
static_assert(sizeof(AthenaInteractionIndicator_C_GetVisibleVisibility) == 0x000006, "Wrong size on AthenaInteractionIndicator_C_GetVisibleVisibility");
static_assert(offsetof(AthenaInteractionIndicator_C_GetVisibleVisibility, Visibility_0) == 0x000000, "Member 'AthenaInteractionIndicator_C_GetVisibleVisibility::Visibility_0' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_GetVisibleVisibility, Temp_bool_Variable) == 0x000001, "Member 'AthenaInteractionIndicator_C_GetVisibleVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_GetVisibleVisibility, Temp_byte_Variable) == 0x000002, "Member 'AthenaInteractionIndicator_C_GetVisibleVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_GetVisibleVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'AthenaInteractionIndicator_C_GetVisibleVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_GetVisibleVisibility, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'AthenaInteractionIndicator_C_GetVisibleVisibility::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_GetVisibleVisibility, K2Node_Select_Default) == 0x000005, "Member 'AthenaInteractionIndicator_C_GetVisibleVisibility::K2Node_Select_Default' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.Handle Interaction Changed
// 0x0028 (0x0028 - 0x0000)
struct AthenaInteractionIndicator_C_Handle_Interaction_Changed final
{
public:
	class UFortInteractContextInfo*               CurrentInteraction_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ValidInteraction;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibleVisibility_Visibility;          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColor_White_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_Handle_Interaction_Changed) == 0x000008, "Wrong alignment on AthenaInteractionIndicator_C_Handle_Interaction_Changed");
static_assert(sizeof(AthenaInteractionIndicator_C_Handle_Interaction_Changed) == 0x000028, "Wrong size on AthenaInteractionIndicator_C_Handle_Interaction_Changed");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, CurrentInteraction_0) == 0x000000, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::CurrentInteraction_0' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, ValidInteraction) == 0x000008, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::ValidInteraction' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, Temp_byte_Variable) == 0x00000A, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, CallFunc_IsValid_ReturnValue_1) == 0x00000B, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, CallFunc_IsValid_ReturnValue_2) == 0x00000D, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000E, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, CallFunc_GetVisibleVisibility_Visibility) == 0x00000F, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::CallFunc_GetVisibleVisibility_Visibility' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, CallFunc_LinearColor_White_ReturnValue) == 0x000010, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::CallFunc_LinearColor_White_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, Temp_bool_Variable) == 0x000020, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_Handle_Interaction_Changed, K2Node_Select_Default) == 0x000021, "Member 'AthenaInteractionIndicator_C_Handle_Interaction_Changed::K2Node_Select_Default' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.HandleFirstContext
// 0x0098 (0x0098 - 0x0000)
struct AthenaInteractionIndicator_C_HandleFirstContext final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInitiatePrivateMatchmaking_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInteractContextInfoWidget*         CallFunc_ActivateContextOverride_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidContextOverride_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetInteractText_InteractText;             // 0x0018(0x0018)()
	bool                                          CallFunc_GetInteractText_Result;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetIndicatedActor_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            K2Node_DynamicCast_AsFort_Pickup;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetIndicatedActor_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMatchmakingInterface_C> K2Node_DynamicCast_AsMatchmaking_Interface;        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AthenaInteractDetails_LocalPlayerLookingAt; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AthenaInteractDetails_IsInPlayMode;       // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Athena_Wumba_C*                      K2Node_DynamicCast_AsB_Athena_Wumba;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PickedUp_ReturnValue;                     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_HandleFirstContext) == 0x000008, "Wrong alignment on AthenaInteractionIndicator_C_HandleFirstContext");
static_assert(sizeof(AthenaInteractionIndicator_C_HandleFirstContext) == 0x000098, "Wrong size on AthenaInteractionIndicator_C_HandleFirstContext");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, Temp_bool_Variable) == 0x000000, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, Temp_byte_Variable) == 0x000001, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_CanInitiatePrivateMatchmaking_ReturnValue) == 0x000003, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_CanInitiatePrivateMatchmaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, Temp_bool_Variable_1) == 0x000004, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_ActivateContextOverride_ReturnValue) == 0x000008, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_ActivateContextOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_HasValidContextOverride_ReturnValue) == 0x000010, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_HasValidContextOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_GetInteractText_InteractText) == 0x000018, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_GetInteractText_InteractText' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_GetInteractText_Result) == 0x000030, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_GetInteractText_Result' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, K2Node_Select_Default) == 0x000031, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_GetIndicatedActor_ReturnValue) == 0x000038, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_GetIndicatedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, K2Node_DynamicCast_AsFort_Pickup) == 0x000040, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::K2Node_DynamicCast_AsFort_Pickup' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_GetIndicatedActor_ReturnValue_1) == 0x000050, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_GetIndicatedActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, K2Node_DynamicCast_AsMatchmaking_Interface) == 0x000058, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::K2Node_DynamicCast_AsMatchmaking_Interface' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000070, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_AthenaInteractDetails_LocalPlayerLookingAt) == 0x000081, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_AthenaInteractDetails_LocalPlayerLookingAt' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_AthenaInteractDetails_IsInPlayMode) == 0x000082, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_AthenaInteractDetails_IsInPlayMode' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000083, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_Not_PreBool_ReturnValue) == 0x000084, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_BooleanAND_ReturnValue) == 0x000085, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, K2Node_DynamicCast_AsB_Athena_Wumba) == 0x000088, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::K2Node_DynamicCast_AsB_Athena_Wumba' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleFirstContext, CallFunc_PickedUp_ReturnValue) == 0x000091, "Member 'AthenaInteractionIndicator_C_HandleFirstContext::CallFunc_PickedUp_ReturnValue' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.HandleSecondContext
// 0x0018 (0x0018 - 0x0000)
struct AthenaInteractionIndicator_C_HandleSecondContext final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidSecondContextOverride_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInteractContextInfoWidget*         CallFunc_ActivateContextOverride_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_HandleSecondContext) == 0x000008, "Wrong alignment on AthenaInteractionIndicator_C_HandleSecondContext");
static_assert(sizeof(AthenaInteractionIndicator_C_HandleSecondContext) == 0x000018, "Wrong size on AthenaInteractionIndicator_C_HandleSecondContext");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleSecondContext, Temp_byte_Variable) == 0x000000, "Member 'AthenaInteractionIndicator_C_HandleSecondContext::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleSecondContext, Temp_byte_Variable_1) == 0x000001, "Member 'AthenaInteractionIndicator_C_HandleSecondContext::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleSecondContext, Temp_bool_Variable) == 0x000002, "Member 'AthenaInteractionIndicator_C_HandleSecondContext::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleSecondContext, CallFunc_HasValidSecondContextOverride_ReturnValue) == 0x000003, "Member 'AthenaInteractionIndicator_C_HandleSecondContext::CallFunc_HasValidSecondContextOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleSecondContext, CallFunc_ActivateContextOverride_ReturnValue) == 0x000008, "Member 'AthenaInteractionIndicator_C_HandleSecondContext::CallFunc_ActivateContextOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleSecondContext, K2Node_Select_Default) == 0x000010, "Member 'AthenaInteractionIndicator_C_HandleSecondContext::K2Node_Select_Default' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.HandleTintCraftingContext
// 0x01D0 (0x01D0 - 0x0000)
struct AthenaInteractionIndicator_C_HandleTintCraftingContext final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetIndicatedActor_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            K2Node_DynamicCast_AsFort_Pickup;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemEntry                         CallFunc_GetItemEntry_ReturnValue;                 // 0x0020(0x01A0)(ConstParm)
	class UFortResourceItemDefinition*            K2Node_DynamicCast_AsFort_Resource_Item_Definition; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_HandleTintCraftingContext) == 0x000008, "Wrong alignment on AthenaInteractionIndicator_C_HandleTintCraftingContext");
static_assert(sizeof(AthenaInteractionIndicator_C_HandleTintCraftingContext) == 0x0001D0, "Wrong size on AthenaInteractionIndicator_C_HandleTintCraftingContext");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, Temp_bool_Variable) == 0x000000, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, Temp_byte_Variable) == 0x000001, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, CallFunc_GetIndicatedActor_ReturnValue) == 0x000008, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::CallFunc_GetIndicatedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, K2Node_DynamicCast_AsFort_Pickup) == 0x000010, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::K2Node_DynamicCast_AsFort_Pickup' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, CallFunc_GetItemEntry_ReturnValue) == 0x000020, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::CallFunc_GetItemEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, K2Node_DynamicCast_AsFort_Resource_Item_Definition) == 0x0001C0, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::K2Node_DynamicCast_AsFort_Resource_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001C9, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_HandleTintCraftingContext, K2Node_Select_Default) == 0x0001CA, "Member 'AthenaInteractionIndicator_C_HandleTintCraftingContext::K2Node_Select_Default' has a wrong offset!");

// Function AthenaInteractionIndicator.AthenaInteractionIndicator_C.InteractionFailureText
// 0x0050 (0x0050 - 0x0000)
struct AthenaInteractionIndicator_C_InteractionFailureText final
{
public:
	class AFortPickup*                            PickUp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBackpackItemCounts_ItemsCount;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBackpackItemCounts_MaxItemsCount;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBackpackItemCounts_OverflowItemsCount; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0030(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInteractionIndicator_C_InteractionFailureText) == 0x000008, "Wrong alignment on AthenaInteractionIndicator_C_InteractionFailureText");
static_assert(sizeof(AthenaInteractionIndicator_C_InteractionFailureText) == 0x000050, "Wrong size on AthenaInteractionIndicator_C_InteractionFailureText");
static_assert(offsetof(AthenaInteractionIndicator_C_InteractionFailureText, PickUp) == 0x000000, "Member 'AthenaInteractionIndicator_C_InteractionFailureText::PickUp' has a wrong offset!");
static_assert(offsetof(AthenaInteractionIndicator_C_InteractionFailureText, Temp_byte_Variable) == 0x000008, "Member 'AthenaInteractionIndicator_C_InteractionFailureText::Temp_byte_Variable' has a wrong offset!");
