#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_SneakySnowmanV2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_SneakySnowmanV2.Athena_Prop_SneakySnowmanV2_C.Apply Water In Radius
// 0x0188 (0x0188 - 0x0000)
struct Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActiveForActor_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x00A0(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius) == 0x000008, "Wrong alignment on Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius");
static_assert(sizeof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius) == 0x000188, "Wrong size on Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_IsCurieActiveForActor_ReturnValue) == 0x00000C, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_IsCurieActiveForActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_GetValueAsBool_ReturnValue) == 0x00000D, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_HasAuthority_ReturnValue) == 0x000040, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, K2Node_MakeArray_Array) == 0x000048, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_GetActorScale3D_ReturnValue) == 0x000058, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_VSize_ReturnValue) == 0x000070, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000074, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_SphereOverlapActors_OutActors) == 0x000078, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_SphereOverlapActors_ReturnValue) == 0x000088, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_Array_Get_Item) == 0x000090, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_MakeHitResult_ReturnValue) == 0x0000A0, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'Athena_Prop_SneakySnowmanV2_C_Apply_Water_In_Radius::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Athena_Prop_SneakySnowmanV2.Athena_Prop_SneakySnowmanV2_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct Athena_Prop_SneakySnowmanV2_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_SneakySnowmanV2_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on Athena_Prop_SneakySnowmanV2_C_BlueprintOnInteract");
static_assert(sizeof(Athena_Prop_SneakySnowmanV2_C_BlueprintOnInteract) == 0x000010, "Wrong size on Athena_Prop_SneakySnowmanV2_C_BlueprintOnInteract");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'Athena_Prop_SneakySnowmanV2_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'Athena_Prop_SneakySnowmanV2_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function Athena_Prop_SneakySnowmanV2.Athena_Prop_SneakySnowmanV2_C.BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Athena_Prop_SneakySnowmanV2_C_BndEvt__OverlapCheck_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Athena_Prop_SneakySnowmanV2.Athena_Prop_SneakySnowmanV2_C.ExecuteUbergraph_Athena_Prop_SneakySnowmanV2
// 0x0E60 (0x0E60 - 0x0000)
struct Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_1;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0020(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x0058(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_1;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0148(0x0018)()
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0188(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0290(0x0020)(ConstParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x02B8(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceStartAndEnd_Start;                   // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceStartAndEnd_End;                     // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0360(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443[0x1];                                      // 0x0443(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable;                              // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue;  // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue_1; // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0538(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0540(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0548(0x00B0)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0600(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x0608(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Player;                               // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0651(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652[0xE];                                      // 0x0652(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0660(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x06C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x06D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x06F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0708(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0720(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0788(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x07A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x07C0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x08B0(0x0018)()
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x08C8(0x0010)(ConstParm, ReferenceParm)
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4[0x4];                                      // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_HeldObject_Snowball_C*               K2Node_DynamicCast_AsB_Held_Object_Snowball;       // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x08F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x08F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x08F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x08F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_911[0x7];                                      // 0x0911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0918(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x093C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0940(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_959[0x3];                                      // 0x0959(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x095C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_964[0x4];                                      // 0x0964(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0968(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0970(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97C[0x4];                                      // 0x097C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0980(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_989[0x7];                                      // 0x0989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0990(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x09A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x09C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x09C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x09C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x09CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x09D0(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E4[0x4];                                      // 0x09E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x09E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0A00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0A18(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0A30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A31[0x7];                                      // 0x0A31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0A38(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0A50(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0B31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0B32(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B33[0x1];                                      // 0x0B33(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0B34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0B38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3C[0x4];                                      // 0x0B3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0B40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0B58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0B70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0B88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0BA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0BB0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0BB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0BBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0BC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0BC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0BD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0BE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACar_DEFAULT_C*                         K2Node_DynamicCast_AsCar_DEFAULT;                  // 0x0C00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C09[0x7];                                      // 0x0C09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0C10(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0C28(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0D08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D09[0x7];                                      // 0x0D09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x0D10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0D18(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0DF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF9[0x7];                                      // 0x0DF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_2;                          // 0x0E00(0x0010)(ConstParm, ReferenceParm)
	TArray<class UPrimitiveComponent*>            CallFunc_BoxOverlapComponents_OutComponents;       // 0x0E10(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BoxOverlapComponents_ReturnValue;         // 0x0E20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E21[0x3];                                      // 0x0E21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0E24(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0E30(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x0E38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E39[0x3];                                      // 0x0E39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0E3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0E40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0E41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E42[0x2];                                      // 0x0E42(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0E44(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0E50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2) == 0x000010, "Wrong alignment on Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2");
static_assert(sizeof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2) == 0x000E60, "Wrong size on Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, EntryPoint) == 0x000000, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000018, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_Event_Damage_1) == 0x00001C, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_Event_DamageTags_1) == 0x000020, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_Event_Momentum_1) == 0x000040, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_Event_HitInfo_1) == 0x000058, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_Event_InstigatedBy_1) == 0x000138, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_Event_DamageCauser_1) == 0x000140, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_Event_EffectContext_1) == 0x000148, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000160, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000168, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_ComponentBoundEvent_OtherActor) == 0x000170, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_ComponentBoundEvent_OtherComp) == 0x000178, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000180, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_ComponentBoundEvent_bFromSweep) == 0x000184, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_ComponentBoundEvent_SweepResult) == 0x000188, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000268, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_DynamicCast_bSuccess) == 0x000270, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, CallFunc_GetGameState_ReturnValue) == 0x000278, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000280, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_1) == 0x000288, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_CustomEvent_PlaylistName) == 0x00028C, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2, K2Node_CustomEvent_PlaylistContextTags) == 0x000290, "Member 'Athena_Prop_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Prop_SneakySnowmanV2::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
