#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaRewardItemTypeRarityTag

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaRewardItemTypeRarityTag.AthenaRewardItemTypeRarityTag_C.ExecuteUbergraph_AthenaRewardItemTypeRarityTag
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemSeriesDefinition*        K2Node_Event_SeriesData;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    K2Node_Event_RarityData;                           // 0x0010(0x0080)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag) == 0x000008, "Wrong alignment on AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag");
static_assert(sizeof(AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag) == 0x0000A0, "Wrong size on AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag");
static_assert(offsetof(AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag, EntryPoint) == 0x000000, "Member 'AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag, K2Node_Event_SeriesData) == 0x000008, "Member 'AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag::K2Node_Event_SeriesData' has a wrong offset!");
static_assert(offsetof(AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag, K2Node_Event_RarityData) == 0x000010, "Member 'AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag::K2Node_Event_RarityData' has a wrong offset!");
static_assert(offsetof(AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000090, "Member 'AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000098, "Member 'AthenaRewardItemTypeRarityTag_C_ExecuteUbergraph_AthenaRewardItemTypeRarityTag::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function AthenaRewardItemTypeRarityTag.AthenaRewardItemTypeRarityTag_C.OnInitializeRarityWithoutSeries
// 0x0080 (0x0080 - 0x0000)
struct AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithoutSeries final
{
public:
	struct FFortRarityItemData                    RarityData;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithoutSeries) == 0x000008, "Wrong alignment on AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithoutSeries");
static_assert(sizeof(AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithoutSeries) == 0x000080, "Wrong size on AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithoutSeries");
static_assert(offsetof(AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithoutSeries, RarityData) == 0x000000, "Member 'AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithoutSeries::RarityData' has a wrong offset!");

// Function AthenaRewardItemTypeRarityTag.AthenaRewardItemTypeRarityTag_C.OnInitializeRarityWithSeries
// 0x0008 (0x0008 - 0x0000)
struct AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithSeries final
{
public:
	const class UFortItemSeriesDefinition*        SeriesData;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithSeries) == 0x000008, "Wrong alignment on AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithSeries");
static_assert(sizeof(AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithSeries) == 0x000008, "Wrong size on AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithSeries");
static_assert(offsetof(AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithSeries, SeriesData) == 0x000000, "Member 'AthenaRewardItemTypeRarityTag_C_OnInitializeRarityWithSeries::SeriesData' has a wrong offset!");

}

