#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTransientQuestStartedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaTransientQuestStartedOverlay.AthenaTransientQuestStartedOverlay_C.ClearActiveContent
// 0x0010 (0x0010 - 0x0000)
struct AthenaTransientQuestStartedOverlay_C_ClearActiveContent final
{
public:
	TScriptInterface<class IFortPrioritizedWidget> CallFunc_SetHasActiveContent_self_CastInput;       // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTransientQuestStartedOverlay_C_ClearActiveContent) == 0x000008, "Wrong alignment on AthenaTransientQuestStartedOverlay_C_ClearActiveContent");
static_assert(sizeof(AthenaTransientQuestStartedOverlay_C_ClearActiveContent) == 0x000010, "Wrong size on AthenaTransientQuestStartedOverlay_C_ClearActiveContent");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_ClearActiveContent, CallFunc_SetHasActiveContent_self_CastInput) == 0x000000, "Member 'AthenaTransientQuestStartedOverlay_C_ClearActiveContent::CallFunc_SetHasActiveContent_self_CastInput' has a wrong offset!");

// Function AthenaTransientQuestStartedOverlay.AthenaTransientQuestStartedOverlay_C.ExecuteUbergraph_AthenaTransientQuestStartedOverlay
// 0x0048 (0x0048 - 0x0000)
struct AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOutroDelay_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortQuestItem*                   K2Node_Event_QuestItem;                            // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay) == 0x000008, "Wrong alignment on AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay");
static_assert(sizeof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay) == 0x000048, "Wrong size on AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay, EntryPoint) == 0x000000, "Member 'AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay, CallFunc_GetOutroDelay_ReturnValue) == 0x000010, "Member 'AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay::CallFunc_GetOutroDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay, CallFunc_PlayAnimationByName_ReturnValue) == 0x000020, "Member 'AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay, K2Node_Event_QuestItem) == 0x000030, "Member 'AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay::K2Node_Event_QuestItem' has a wrong offset!");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'AthenaTransientQuestStartedOverlay_C_ExecuteUbergraph_AthenaTransientQuestStartedOverlay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function AthenaTransientQuestStartedOverlay.AthenaTransientQuestStartedOverlay_C.OnTransientQuestStarted
// 0x0008 (0x0008 - 0x0000)
struct AthenaTransientQuestStartedOverlay_C_OnTransientQuestStarted final
{
public:
	const class UFortQuestItem*                   QuestItem;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTransientQuestStartedOverlay_C_OnTransientQuestStarted) == 0x000008, "Wrong alignment on AthenaTransientQuestStartedOverlay_C_OnTransientQuestStarted");
static_assert(sizeof(AthenaTransientQuestStartedOverlay_C_OnTransientQuestStarted) == 0x000008, "Wrong size on AthenaTransientQuestStartedOverlay_C_OnTransientQuestStarted");
static_assert(offsetof(AthenaTransientQuestStartedOverlay_C_OnTransientQuestStarted, QuestItem) == 0x000000, "Member 'AthenaTransientQuestStartedOverlay_C_OnTransientQuestStarted::QuestItem' has a wrong offset!");

}

