#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemIconResource_Currency

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaItemIconResource_Currency.AthenaItemIconResource_Currency_C.ExecuteUbergraph_AthenaItemIconResource_Currency
// 0x0038 (0x0038 - 0x0000)
struct AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItem*                        K2Node_Event_ItemToRepresent;                      // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency) == 0x000008, "Wrong alignment on AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency");
static_assert(sizeof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency) == 0x000038, "Wrong size on AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, EntryPoint) == 0x000000, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, K2Node_MakeStruct_Margin) == 0x000004, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, Temp_bool_Variable) == 0x000014, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, Temp_byte_Variable) == 0x000015, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, Temp_byte_Variable_1) == 0x000016, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, Temp_bool_Variable_1) == 0x000017, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, Temp_byte_Variable_2) == 0x000018, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, Temp_byte_Variable_3) == 0x000019, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, K2Node_Event_ItemToRepresent) == 0x000020, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::K2Node_Event_ItemToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, K2Node_Select_Default) == 0x000029, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, K2Node_Select_Default_1) == 0x00002A, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, CallFunc_IsMobileGame_ReturnValue) == 0x00002B, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000030, "Member 'AthenaItemIconResource_Currency_C_ExecuteUbergraph_AthenaItemIconResource_Currency::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function AthenaItemIconResource_Currency.AthenaItemIconResource_Currency_C.IntroAnim
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemIconResource_Currency_C_IntroAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconResource_Currency_C_IntroAnim) == 0x000008, "Wrong alignment on AthenaItemIconResource_Currency_C_IntroAnim");
static_assert(sizeof(AthenaItemIconResource_Currency_C_IntroAnim) == 0x000008, "Wrong size on AthenaItemIconResource_Currency_C_IntroAnim");
static_assert(offsetof(AthenaItemIconResource_Currency_C_IntroAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'AthenaItemIconResource_Currency_C_IntroAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function AthenaItemIconResource_Currency.AthenaItemIconResource_Currency_C.OnPostItemToRepresentChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemIconResource_Currency_C_OnPostItemToRepresentChanged final
{
public:
	const class UFortItem*                        ItemToRepresent;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconResource_Currency_C_OnPostItemToRepresentChanged) == 0x000008, "Wrong alignment on AthenaItemIconResource_Currency_C_OnPostItemToRepresentChanged");
static_assert(sizeof(AthenaItemIconResource_Currency_C_OnPostItemToRepresentChanged) == 0x000008, "Wrong size on AthenaItemIconResource_Currency_C_OnPostItemToRepresentChanged");
static_assert(offsetof(AthenaItemIconResource_Currency_C_OnPostItemToRepresentChanged, ItemToRepresent) == 0x000000, "Member 'AthenaItemIconResource_Currency_C_OnPostItemToRepresentChanged::ItemToRepresent' has a wrong offset!");

// Function AthenaItemIconResource_Currency.AthenaItemIconResource_Currency_C.RandomizeAngleFloats
// 0x0020 (0x0020 - 0x0000)
struct AthenaItemIconResource_Currency_C_RandomizeAngleFloats final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconResource_Currency_C_RandomizeAngleFloats) == 0x000008, "Wrong alignment on AthenaItemIconResource_Currency_C_RandomizeAngleFloats");
static_assert(sizeof(AthenaItemIconResource_Currency_C_RandomizeAngleFloats) == 0x000020, "Wrong size on AthenaItemIconResource_Currency_C_RandomizeAngleFloats");
static_assert(offsetof(AthenaItemIconResource_Currency_C_RandomizeAngleFloats, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'AthenaItemIconResource_Currency_C_RandomizeAngleFloats::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_RandomizeAngleFloats, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'AthenaItemIconResource_Currency_C_RandomizeAngleFloats::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_RandomizeAngleFloats, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000010, "Member 'AthenaItemIconResource_Currency_C_RandomizeAngleFloats::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_RandomizeAngleFloats, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000014, "Member 'AthenaItemIconResource_Currency_C_RandomizeAngleFloats::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_RandomizeAngleFloats, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000018, "Member 'AthenaItemIconResource_Currency_C_RandomizeAngleFloats::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");

// Function AthenaItemIconResource_Currency.AthenaItemIconResource_Currency_C.SetFontMaterial
// 0x0070 (0x0070 - 0x0000)
struct AthenaItemIconResource_Currency_C_SetFontMaterial final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0020(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconResource_Currency_C_SetFontMaterial) == 0x000008, "Wrong alignment on AthenaItemIconResource_Currency_C_SetFontMaterial");
static_assert(sizeof(AthenaItemIconResource_Currency_C_SetFontMaterial) == 0x000070, "Wrong size on AthenaItemIconResource_Currency_C_SetFontMaterial");
static_assert(offsetof(AthenaItemIconResource_Currency_C_SetFontMaterial, Temp_bool_Variable) == 0x000000, "Member 'AthenaItemIconResource_Currency_C_SetFontMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_SetFontMaterial, Temp_int_Variable) == 0x000004, "Member 'AthenaItemIconResource_Currency_C_SetFontMaterial::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_SetFontMaterial, Temp_int_Variable_1) == 0x000008, "Member 'AthenaItemIconResource_Currency_C_SetFontMaterial::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_SetFontMaterial, CallFunc_IsMobileGame_ReturnValue) == 0x00000C, "Member 'AthenaItemIconResource_Currency_C_SetFontMaterial::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_SetFontMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'AthenaItemIconResource_Currency_C_SetFontMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_SetFontMaterial, K2Node_Select_Default) == 0x000018, "Member 'AthenaItemIconResource_Currency_C_SetFontMaterial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaItemIconResource_Currency_C_SetFontMaterial, K2Node_MakeStruct_SlateFontInfo) == 0x000020, "Member 'AthenaItemIconResource_Currency_C_SetFontMaterial::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function AthenaItemIconResource_Currency.AthenaItemIconResource_Currency_C.SetHoveredState
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemIconResource_Currency_C_SetHoveredState final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconResource_Currency_C_SetHoveredState) == 0x000001, "Wrong alignment on AthenaItemIconResource_Currency_C_SetHoveredState");
static_assert(sizeof(AthenaItemIconResource_Currency_C_SetHoveredState) == 0x000001, "Wrong size on AthenaItemIconResource_Currency_C_SetHoveredState");
static_assert(offsetof(AthenaItemIconResource_Currency_C_SetHoveredState, bIsHovered) == 0x000000, "Member 'AthenaItemIconResource_Currency_C_SetHoveredState::bIsHovered' has a wrong offset!");

}

