#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastTeamTag

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaBroadcastTeamTag.AthenaBroadcastTeamTag_C.ExecuteUbergraph_AthenaBroadcastTeamTag
// 0x0068 (0x0068 - 0x0000)
struct AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MaxSquadSize;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value;                           // 0x0010(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0040(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag) == 0x000008, "Wrong alignment on AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag");
static_assert(sizeof(AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag) == 0x000068, "Wrong size on AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag, EntryPoint) == 0x000000, "Member 'AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag, Temp_bool_Variable) == 0x000004, "Member 'AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag, K2Node_Event_MaxSquadSize) == 0x000008, "Member 'AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag::K2Node_Event_MaxSquadSize' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag, CallFunc_Map_Find_Value) == 0x000010, "Member 'AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag, K2Node_Event_IsDesignTime) == 0x000039, "Member 'AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag, K2Node_Select_Default) == 0x000040, "Member 'AthenaBroadcastTeamTag_C_ExecuteUbergraph_AthenaBroadcastTeamTag::K2Node_Select_Default' has a wrong offset!");

// Function AthenaBroadcastTeamTag.AthenaBroadcastTeamTag_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaBroadcastTeamTag_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastTeamTag_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaBroadcastTeamTag_C_PreConstruct");
static_assert(sizeof(AthenaBroadcastTeamTag_C_PreConstruct) == 0x000001, "Wrong size on AthenaBroadcastTeamTag_C_PreConstruct");
static_assert(offsetof(AthenaBroadcastTeamTag_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaBroadcastTeamTag_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaBroadcastTeamTag.AthenaBroadcastTeamTag_C.ToggleAllowSessionRank
// 0x0003 (0x0003 - 0x0000)
struct AthenaBroadcastTeamTag_C_ToggleAllowSessionRank final
{
public:
	bool                                          Allow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastTeamTag_C_ToggleAllowSessionRank) == 0x000001, "Wrong alignment on AthenaBroadcastTeamTag_C_ToggleAllowSessionRank");
static_assert(sizeof(AthenaBroadcastTeamTag_C_ToggleAllowSessionRank) == 0x000003, "Wrong size on AthenaBroadcastTeamTag_C_ToggleAllowSessionRank");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleAllowSessionRank, Allow) == 0x000000, "Member 'AthenaBroadcastTeamTag_C_ToggleAllowSessionRank::Allow' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleAllowSessionRank, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000001, "Member 'AthenaBroadcastTeamTag_C_ToggleAllowSessionRank::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleAllowSessionRank, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'AthenaBroadcastTeamTag_C_ToggleAllowSessionRank::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaBroadcastTeamTag.AthenaBroadcastTeamTag_C.ToggleDisplaySessionRank
// 0x0014 (0x0014 - 0x0000)
struct AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank final
{
public:
	bool                                          Display;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank) == 0x000004, "Wrong alignment on AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank");
static_assert(sizeof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank) == 0x000014, "Wrong size on AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank, Display) == 0x000000, "Member 'AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank::Display' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank, Temp_bool_Variable) == 0x000001, "Member 'AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank, Temp_byte_Variable) == 0x000002, "Member 'AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank, Temp_byte_Variable_1) == 0x000003, "Member 'AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank, Temp_bool_Variable_1) == 0x000004, "Member 'AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank, K2Node_Select_Default) == 0x000005, "Member 'AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank, Temp_float_Variable) == 0x000008, "Member 'AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank, Temp_float_Variable_1) == 0x00000C, "Member 'AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank, K2Node_Select_Default_1) == 0x000010, "Member 'AthenaBroadcastTeamTag_C_ToggleDisplaySessionRank::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaBroadcastTeamTag.AthenaBroadcastTeamTag_C.UpdateMaxSquadSize
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcastTeamTag_C_UpdateMaxSquadSize final
{
public:
	int32                                         MaxSquadSize;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastTeamTag_C_UpdateMaxSquadSize) == 0x000004, "Wrong alignment on AthenaBroadcastTeamTag_C_UpdateMaxSquadSize");
static_assert(sizeof(AthenaBroadcastTeamTag_C_UpdateMaxSquadSize) == 0x000004, "Wrong size on AthenaBroadcastTeamTag_C_UpdateMaxSquadSize");
static_assert(offsetof(AthenaBroadcastTeamTag_C_UpdateMaxSquadSize, MaxSquadSize) == 0x000000, "Member 'AthenaBroadcastTeamTag_C_UpdateMaxSquadSize::MaxSquadSize' has a wrong offset!");

// Function AthenaBroadcastTeamTag.AthenaBroadcastTeamTag_C.UpdateSessionRank
// 0x0038 (0x0038 - 0x0000)
struct AthenaBroadcastTeamTag_C_UpdateSessionRank final
{
public:
	int32                                         InSessionRank_0;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastTeamTag_C_UpdateSessionRank) == 0x000008, "Wrong alignment on AthenaBroadcastTeamTag_C_UpdateSessionRank");
static_assert(sizeof(AthenaBroadcastTeamTag_C_UpdateSessionRank) == 0x000038, "Wrong size on AthenaBroadcastTeamTag_C_UpdateSessionRank");
static_assert(offsetof(AthenaBroadcastTeamTag_C_UpdateSessionRank, InSessionRank_0) == 0x000000, "Member 'AthenaBroadcastTeamTag_C_UpdateSessionRank::InSessionRank_0' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_UpdateSessionRank, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'AthenaBroadcastTeamTag_C_UpdateSessionRank::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_UpdateSessionRank, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'AthenaBroadcastTeamTag_C_UpdateSessionRank::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_UpdateSessionRank, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'AthenaBroadcastTeamTag_C_UpdateSessionRank::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastTeamTag_C_UpdateSessionRank, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'AthenaBroadcastTeamTag_C_UpdateSessionRank::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

