#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestFunctionLibrary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_CheckActorHasTags
// 0x00D0 (0x00D0 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TagsToCheck;                                       // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          OnlyExactMatch;                                    // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDidActorHaveTags;                                 // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TagsWeWant;                                        // 0x0040(0x0020)(Edit, BlueprintVisible)
	bool                                          bOnlyExactMatch;                                   // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0080(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x00A8(0x0020)()
	bool                                          CallFunc_HasAllTags_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags) == 0x000008, "Wrong alignment on AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags");
static_assert(sizeof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags) == 0x0000D0, "Wrong size on AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, TargetActor) == 0x000000, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::TargetActor' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, TagsToCheck) == 0x000008, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::TagsToCheck' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, OnlyExactMatch) == 0x000028, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::OnlyExactMatch' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, __WorldContext) == 0x000030, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, bDidActorHaveTags) == 0x000038, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::bDidActorHaveTags' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, TagsWeWant) == 0x000040, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::TagsWeWant' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, bOnlyExactMatch) == 0x000060, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::bOnlyExactMatch' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000068, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, CallFunc_DoesImplementInterface_ReturnValue) == 0x000079, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000080, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, Temp_struct_Variable) == 0x0000A8, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags, CallFunc_HasAllTags_ReturnValue) == 0x0000C8, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckActorHasTags::CallFunc_HasAllTags_ReturnValue' has a wrong offset!");

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_CheckCreativeMode
// 0x0050 (0x0050 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode final
{
public:
	class AGameStateBase*                         InGameState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanCompleteQuest;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x0028(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode) == 0x000008, "Wrong alignment on AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode");
static_assert(sizeof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode) == 0x000050, "Wrong size on AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode, InGameState) == 0x000000, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode::InGameState' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode, __WorldContext) == 0x000008, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode, CanCompleteQuest) == 0x000010, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode::CanCompleteQuest' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000018, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x000028, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode, CallFunc_HasTag_ReturnValue) == 0x000048, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode, CallFunc_HasTag_ReturnValue_1) == 0x000049, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode, CallFunc_BooleanOR_ReturnValue) == 0x00004A, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckCreativeMode::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_CheckQuestAndObjectiveCompletion
// 0x0040 (0x0040 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion final
{
public:
	class AFortPlayerController*                  InPlayerControlle;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               InQuestItemRef;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectiveBackendName;                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestIsValid;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestCompleted;                                    // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ObjectiveCompleted;                                // 0x0022(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedObjectiveWithName_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion) == 0x000008, "Wrong alignment on AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion");
static_assert(sizeof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion) == 0x000040, "Wrong size on AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, InPlayerControlle) == 0x000000, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::InPlayerControlle' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, InQuestItemRef) == 0x000008, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::InQuestItemRef' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, ObjectiveBackendName) == 0x000010, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::ObjectiveBackendName' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, __WorldContext) == 0x000018, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, QuestIsValid) == 0x000020, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::QuestIsValid' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, QuestCompleted) == 0x000021, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, ObjectiveCompleted) == 0x000022, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, CallFunc_IsValid_ReturnValue) == 0x000023, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, CallFunc_IsValid_ReturnValue_1) == 0x000024, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, CallFunc_GetQuestManager_ReturnValue) == 0x000028, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000030, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, CallFunc_HasCompletedObjectiveWithName_ReturnValue) == 0x000038, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::CallFunc_HasCompletedObjectiveWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, CallFunc_HasCompletedQuest_ReturnValue) == 0x000039, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::CallFunc_HasCompletedQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion, CallFunc_IsValid_ReturnValue_2) == 0x00003A, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletion::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_CheckQuestAndObjectiveCompletionMP
// 0x0058 (0x0058 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP final
{
public:
	TArray<class AFortPlayerController*>          InPlayerControlle;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UFortQuestItemDefinition*               InQuestItemRef;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectiveBackendName;                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestIsValid;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestCompleted;                                    // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ObjectiveCompleted;                                // 0x002A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result_ObjectiveCompleted;                         // 0x002B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result_QuestCompleted;                             // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result_QuestIsValid;                               // 0x002D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP) == 0x000008, "Wrong alignment on AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP");
static_assert(sizeof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP) == 0x000058, "Wrong size on AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, InPlayerControlle) == 0x000000, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::InPlayerControlle' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, InQuestItemRef) == 0x000010, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::InQuestItemRef' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, ObjectiveBackendName) == 0x000018, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::ObjectiveBackendName' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, __WorldContext) == 0x000020, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, QuestIsValid) == 0x000028, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::QuestIsValid' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, QuestCompleted) == 0x000029, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, ObjectiveCompleted) == 0x00002A, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, Result_ObjectiveCompleted) == 0x00002B, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::Result_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, Result_QuestCompleted) == 0x00002C, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::Result_QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, Result_QuestIsValid) == 0x00002D, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::Result_QuestIsValid' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, Temp_int_Array_Index_Variable) == 0x000034, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_Array_Get_Item) == 0x000040, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000050, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000051, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x000052, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_BooleanAND_ReturnValue_1) == 0x000054, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP, CallFunc_BooleanAND_ReturnValue_2) == 0x000055, "Member 'AthenaQuestFunctionLibrary_C_Athena_CheckQuestAndObjectiveCompletionMP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_GiveQuestUpdateToPlayers
// 0x0070 (0x0070 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers final
{
public:
	class UFortQuestItemDefinition*               InQuestItemRef;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectiveBackendName;                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ObjectiveStatEvent;                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	TArray<class AFortPlayerController*>          PlayerControllersForUpdate;                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedObjectiveWithName_ReturnValue; // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers) == 0x000008, "Wrong alignment on AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers");
static_assert(sizeof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers) == 0x000070, "Wrong size on AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, InQuestItemRef) == 0x000000, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::InQuestItemRef' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, ObjectiveBackendName) == 0x000008, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::ObjectiveBackendName' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, ObjectiveStatEvent) == 0x000010, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::ObjectiveStatEvent' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, PlayerControllersForUpdate) == 0x000020, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::PlayerControllersForUpdate' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, __WorldContext) == 0x000030, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, Temp_int_Array_Index_Variable) == 0x000038, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_Array_Get_Item) == 0x000040, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_GetQuestManager_ReturnValue) == 0x000050, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000058, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_IsValid_ReturnValue_2) == 0x000061, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_HasCompletedObjectiveWithName_ReturnValue) == 0x000062, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_HasCompletedObjectiveWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'AthenaQuestFunctionLibrary_C_Athena_GiveQuestUpdateToPlayers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_HasPlayerCompletedQuest
// 0x0038 (0x0038 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest final
{
public:
	class AFortPlayerController*                  InPlayerControlle;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               InQuestItemRef;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasQuest;                                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestCompleted;                                    // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest) == 0x000008, "Wrong alignment on AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest");
static_assert(sizeof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest) == 0x000038, "Wrong size on AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, InPlayerControlle) == 0x000000, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::InPlayerControlle' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, InQuestItemRef) == 0x000008, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::InQuestItemRef' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, __WorldContext) == 0x000010, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, HasQuest) == 0x000018, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::HasQuest' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, QuestCompleted) == 0x000019, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, CallFunc_IsValid_ReturnValue_1) == 0x00001B, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, CallFunc_GetQuestManager_ReturnValue) == 0x000020, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000028, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, CallFunc_HasCompletedQuest_ReturnValue) == 0x000030, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::CallFunc_HasCompletedQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest, CallFunc_IsValid_ReturnValue_2) == 0x000031, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasPlayerCompletedQuest::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_HasQuest
// 0x0038 (0x0038 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_HasQuest final
{
public:
	class AFortPlayerController*                  InPlayerControlle;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               InQuestItemRef;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerHasQuest;                                    // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestFunctionLibrary_C_Athena_HasQuest) == 0x000008, "Wrong alignment on AthenaQuestFunctionLibrary_C_Athena_HasQuest");
static_assert(sizeof(AthenaQuestFunctionLibrary_C_Athena_HasQuest) == 0x000038, "Wrong size on AthenaQuestFunctionLibrary_C_Athena_HasQuest");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasQuest, InPlayerControlle) == 0x000000, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasQuest::InPlayerControlle' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasQuest, InQuestItemRef) == 0x000008, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasQuest::InQuestItemRef' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasQuest, __WorldContext) == 0x000010, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasQuest::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasQuest, PlayerHasQuest) == 0x000018, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasQuest::PlayerHasQuest' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasQuest, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasQuest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasQuest, CallFunc_IsValid_ReturnValue_1) == 0x00001A, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasQuest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasQuest, CallFunc_GetQuestManager_ReturnValue) == 0x000020, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasQuest::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasQuest, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000028, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasQuest::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_HasQuest, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'AthenaQuestFunctionLibrary_C_Athena_HasQuest::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_IsCreativeOrPlaygroundPlaylist
// 0x0030 (0x0030 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist) == 0x000008, "Wrong alignment on AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist");
static_assert(sizeof(AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist) == 0x000030, "Wrong size on AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist, TagContainer) == 0x000000, "Member 'AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist::TagContainer' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist, __WorldContext) == 0x000020, "Member 'AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist, ReturnValue) == 0x000028, "Member 'AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist, CallFunc_HasTag_ReturnValue) == 0x000029, "Member 'AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist, CallFunc_HasTag_ReturnValue_1) == 0x00002A, "Member 'AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist, CallFunc_BooleanOR_ReturnValue) == 0x00002B, "Member 'AthenaQuestFunctionLibrary_C_Athena_IsCreativeOrPlaygroundPlaylist::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_PartyAssistCheck
// 0x0020 (0x0020 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectiveBackendName;                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAssistingObjective;                             // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValidPlayerController;                          // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck) == 0x000008, "Wrong alignment on AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck");
static_assert(sizeof(AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck) == 0x000020, "Wrong size on AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck, PlayerController) == 0x000000, "Member 'AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck::PlayerController' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck, ObjectiveBackendName) == 0x000008, "Member 'AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck::ObjectiveBackendName' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck, __WorldContext) == 0x000010, "Member 'AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck, bIsAssistingObjective) == 0x000018, "Member 'AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck::bIsAssistingObjective' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck, bIsValidPlayerController) == 0x000019, "Member 'AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck::bIsValidPlayerController' has a wrong offset!");
static_assert(offsetof(AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'AthenaQuestFunctionLibrary_C_Athena_PartyAssistCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C.Athena_PlayQuestRewardFeedback
// 0x0160 (0x0160 - 0x0000)
struct AthenaQuestFunctionLibrary_C_Athena_PlayQuestRewardFeedback final
{
public:
	bool                                          PlayFX_onPlayer_;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Success_Sound;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Success_Particles;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Success_Niagara;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   Success_Shake;                                     // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuestActor;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Effect_Transform;                                  // 0x0040(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
