#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorBuildCountWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpectatorBuildCountWidget.AthenaSpectatorBuildCountWidget_C
// 0x00F8 (0x03F8 - 0x0300)
class UAthenaSpectatorBuildCountWidget_C final : public UAthenaSpectatorBuildCountBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CollectedScale;                                    // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                MatCount;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              MetalIcon;                                         // 0x0320(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              WoodIcon;                                          // 0x0348(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              StoneIcon;                                         // 0x0370(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              BuildIcon;                                         // 0x0398(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnBuildCountIncreased;                             // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class UTexture2D>              GoldIcon;                                          // 0x03D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSpectatorBuildCountWidget(int32 EntryPoint);
	void OnBuildCountChanged(int32 OldCount, int32 NewCount);
	void OnFollowedPlayerChanged_BP();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpectatorBuildCountWidget_C">();
	}
	static class UAthenaSpectatorBuildCountWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectatorBuildCountWidget_C>();
	}
};
static_assert(alignof(UAthenaSpectatorBuildCountWidget_C) == 0x000008, "Wrong alignment on UAthenaSpectatorBuildCountWidget_C");
static_assert(sizeof(UAthenaSpectatorBuildCountWidget_C) == 0x0003F8, "Wrong size on UAthenaSpectatorBuildCountWidget_C");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, UberGraphFrame) == 0x000300, "Member 'UAthenaSpectatorBuildCountWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, CollectedScale) == 0x000308, "Member 'UAthenaSpectatorBuildCountWidget_C::CollectedScale' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, Icon) == 0x000310, "Member 'UAthenaSpectatorBuildCountWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, MatCount) == 0x000318, "Member 'UAthenaSpectatorBuildCountWidget_C::MatCount' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, MetalIcon) == 0x000320, "Member 'UAthenaSpectatorBuildCountWidget_C::MetalIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, WoodIcon) == 0x000348, "Member 'UAthenaSpectatorBuildCountWidget_C::WoodIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, StoneIcon) == 0x000370, "Member 'UAthenaSpectatorBuildCountWidget_C::StoneIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, BuildIcon) == 0x000398, "Member 'UAthenaSpectatorBuildCountWidget_C::BuildIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, OnBuildCountIncreased) == 0x0003C0, "Member 'UAthenaSpectatorBuildCountWidget_C::OnBuildCountIncreased' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorBuildCountWidget_C, GoldIcon) == 0x0003D0, "Member 'UAthenaSpectatorBuildCountWidget_C::GoldIcon' has a wrong offset!");

}

