#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEventMatchStatusText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaEventMatchStatusText.AthenaEventMatchStatusText_C
// 0x00B0 (0x0368 - 0x02B8)
class UAthenaEventMatchStatusText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HighlightStat3;                                    // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightStat1;                                    // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewTopScore;                                       // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x02E0(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateColor                            Color;                                             // 0x0330(0x0014)(Edit, BlueprintVisible)
	bool                                          ShowMaterialHighlight;                             // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      HighlightMaterial;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TextToDisplay;                                     // 0x0350(0x0018)(Edit, BlueprintVisible)

public:
	void ApplyNewText();
	void ApplyText();
	void ExecuteUbergraph_AthenaEventMatchStatusText(int32 EntryPoint);
	void GetFont(struct FSlateFontInfo* Output);
	void HighlightMaterialControl();
	void PreConstruct(bool IsDesignTime);
	void SetFont(const struct FSlateFontInfo& FontIn);
	void SetOpacityAndColor(const struct FSlateColor& ColorIn);
	void SetText(const class FText& InText, bool ApplyImmediately);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaEventMatchStatusText_C">();
	}
	static class UAthenaEventMatchStatusText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEventMatchStatusText_C>();
	}
};
static_assert(alignof(UAthenaEventMatchStatusText_C) == 0x000008, "Wrong alignment on UAthenaEventMatchStatusText_C");
static_assert(sizeof(UAthenaEventMatchStatusText_C) == 0x000368, "Wrong size on UAthenaEventMatchStatusText_C");
static_assert(offsetof(UAthenaEventMatchStatusText_C, UberGraphFrame) == 0x0002B8, "Member 'UAthenaEventMatchStatusText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusText_C, HighlightStat3) == 0x0002C0, "Member 'UAthenaEventMatchStatusText_C::HighlightStat3' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusText_C, HighlightStat1) == 0x0002C8, "Member 'UAthenaEventMatchStatusText_C::HighlightStat1' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusText_C, NewTopScore) == 0x0002D0, "Member 'UAthenaEventMatchStatusText_C::NewTopScore' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusText_C, TextBlock) == 0x0002D8, "Member 'UAthenaEventMatchStatusText_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusText_C, Font) == 0x0002E0, "Member 'UAthenaEventMatchStatusText_C::Font' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusText_C, Color) == 0x000330, "Member 'UAthenaEventMatchStatusText_C::Color' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusText_C, ShowMaterialHighlight) == 0x000344, "Member 'UAthenaEventMatchStatusText_C::ShowMaterialHighlight' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusText_C, HighlightMaterial) == 0x000348, "Member 'UAthenaEventMatchStatusText_C::HighlightMaterial' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusText_C, TextToDisplay) == 0x000350, "Member 'UAthenaEventMatchStatusText_C::TextToDisplay' has a wrong offset!");

}

