#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastHUD

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaBroadcastHUD.AthenaBroadcastHUD_C.AllWinnersAnnoucedDelegateEvent
// 0x0020 (0x0020 - 0x0000)
struct AthenaBroadcastHUD_C_AllWinnersAnnoucedDelegateEvent final
{
public:
	struct FAthenaWinnerInfo                      WinnerInfo;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaBroadcastHUD_C_AllWinnersAnnoucedDelegateEvent) == 0x000008, "Wrong alignment on AthenaBroadcastHUD_C_AllWinnersAnnoucedDelegateEvent");
static_assert(sizeof(AthenaBroadcastHUD_C_AllWinnersAnnoucedDelegateEvent) == 0x000020, "Wrong size on AthenaBroadcastHUD_C_AllWinnersAnnoucedDelegateEvent");
static_assert(offsetof(AthenaBroadcastHUD_C_AllWinnersAnnoucedDelegateEvent, WinnerInfo) == 0x000000, "Member 'AthenaBroadcastHUD_C_AllWinnersAnnoucedDelegateEvent::WinnerInfo' has a wrong offset!");

// Function AthenaBroadcastHUD.AthenaBroadcastHUD_C.BindBroadcastEvents
// 0x0038 (0x0038 - 0x0000)
struct AthenaBroadcastHUD_C_BindBroadcastEvents final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortLiveBroadcastController*           K2Node_DynamicCast_AsFort_Live_Broadcast_Controller; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUD_C_BindBroadcastEvents) == 0x000008, "Wrong alignment on AthenaBroadcastHUD_C_BindBroadcastEvents");
static_assert(sizeof(AthenaBroadcastHUD_C_BindBroadcastEvents) == 0x000038, "Wrong size on AthenaBroadcastHUD_C_BindBroadcastEvents");
static_assert(offsetof(AthenaBroadcastHUD_C_BindBroadcastEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaBroadcastHUD_C_BindBroadcastEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindBroadcastEvents, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaBroadcastHUD_C_BindBroadcastEvents::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindBroadcastEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AthenaBroadcastHUD_C_BindBroadcastEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindBroadcastEvents, K2Node_DynamicCast_AsFort_Live_Broadcast_Controller) == 0x000028, "Member 'AthenaBroadcastHUD_C_BindBroadcastEvents::K2Node_DynamicCast_AsFort_Live_Broadcast_Controller' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindBroadcastEvents, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaBroadcastHUD_C_BindBroadcastEvents::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaBroadcastHUD.AthenaBroadcastHUD_C.BindGameStateEvents
// 0x0040 (0x0040 - 0x0000)
struct AthenaBroadcastHUD_C_BindGameStateEvents final
{
public:
	class AFortGameStateAthena*                   GameStateAthena;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, EAthenaGamePhaseStep GamePhaseStep)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SecondsRemaining)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUD_C_BindGameStateEvents) == 0x000008, "Wrong alignment on AthenaBroadcastHUD_C_BindGameStateEvents");
static_assert(sizeof(AthenaBroadcastHUD_C_BindGameStateEvents) == 0x000040, "Wrong size on AthenaBroadcastHUD_C_BindGameStateEvents");
static_assert(offsetof(AthenaBroadcastHUD_C_BindGameStateEvents, GameStateAthena) == 0x000000, "Member 'AthenaBroadcastHUD_C_BindGameStateEvents::GameStateAthena' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindGameStateEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaBroadcastHUD_C_BindGameStateEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindGameStateEvents, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'AthenaBroadcastHUD_C_BindGameStateEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindGameStateEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AthenaBroadcastHUD_C_BindGameStateEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindGameStateEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'AthenaBroadcastHUD_C_BindGameStateEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindGameStateEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'AthenaBroadcastHUD_C_BindGameStateEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function AthenaBroadcastHUD.AthenaBroadcastHUD_C.BindReplayContextEvents
// 0x0048 (0x0048 - 0x0000)
struct AthenaBroadcastHUD_C_BindReplayContextEvents final
{
public:
	TDelegate<void(bool bIsReadyForPlayback)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bShouldSuppress)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsPlaying)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bShowWatermark)>          K2Node_CreateDelegate_OutputDelegate_3;            // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bStreaming)>              K2Node_CreateDelegate_OutputDelegate_4;            // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUD_C_BindReplayContextEvents) == 0x000008, "Wrong alignment on AthenaBroadcastHUD_C_BindReplayContextEvents");
static_assert(sizeof(AthenaBroadcastHUD_C_BindReplayContextEvents) == 0x000048, "Wrong size on AthenaBroadcastHUD_C_BindReplayContextEvents");
static_assert(offsetof(AthenaBroadcastHUD_C_BindReplayContextEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaBroadcastHUD_C_BindReplayContextEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindReplayContextEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x00000C, "Member 'AthenaBroadcastHUD_C_BindReplayContextEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindReplayContextEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000018, "Member 'AthenaBroadcastHUD_C_BindReplayContextEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindReplayContextEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000024, "Member 'AthenaBroadcastHUD_C_BindReplayContextEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindReplayContextEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x000030, "Member 'AthenaBroadcastHUD_C_BindReplayContextEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindReplayContextEvents, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'AthenaBroadcastHUD_C_BindReplayContextEvents::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AthenaBroadcastHUD.AthenaBroadcastHUD_C.BindSpectatingEvents
// 0x0038 (0x0038 - 0x0000)
struct AthenaBroadcastHUD_C_BindSpectatingEvents final
{
public:
	TDelegate<void(class AFortPlayerControllerSpectating* SpectatorPC, ESpectatorCameraType NewCameraType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortPlayerState* NewlyDeadPlayer)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUD_C_BindSpectatingEvents) == 0x000008, "Wrong alignment on AthenaBroadcastHUD_C_BindSpectatingEvents");
static_assert(sizeof(AthenaBroadcastHUD_C_BindSpectatingEvents) == 0x000038, "Wrong size on AthenaBroadcastHUD_C_BindSpectatingEvents");
static_assert(offsetof(AthenaBroadcastHUD_C_BindSpectatingEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaBroadcastHUD_C_BindSpectatingEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindSpectatingEvents, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaBroadcastHUD_C_BindSpectatingEvents::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindSpectatingEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AthenaBroadcastHUD_C_BindSpectatingEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindSpectatingEvents, K2Node_DynamicCast_AsFort_Player_Controller_Spectating) == 0x000028, "Member 'AthenaBroadcastHUD_C_BindSpectatingEvents::K2Node_DynamicCast_AsFort_Player_Controller_Spectating' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_BindSpectatingEvents, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaBroadcastHUD_C_BindSpectatingEvents::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaBroadcastHUD.AthenaBroadcastHUD_C.BndEvt__BattleBusButton_K2Node_ComponentBoundEvent_27_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaBroadcastHUD_C_BndEvt__BattleBusButton_K2Node_ComponentBoundEvent_27_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUD_C_BndEvt__BattleBusButton_K2Node_ComponentBoundEvent_27_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaBroadcastHUD_C_BndEvt__BattleBusButton_K2Node_ComponentBoundEvent_27_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaBroadcastHUD_C_BndEvt__BattleBusButton_K2Node_ComponentBoundEvent_27_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaBroadcastHUD_C_BndEvt__BattleBusButton_K2Node_ComponentBoundEvent_27_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaBroadcastHUD_C_BndEvt__BattleBusButton_K2Node_ComponentBoundEvent_27_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaBroadcastHUD_C_BndEvt__BattleBusButton_K2Node_ComponentBoundEvent_27_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaBroadcastHUD.AthenaBroadcastHUD_C.CheckIfCreativeOrPlayground
// 0x0010 (0x0010 - 0x0000)
struct AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground final
{
public:
	class AFortGameStateAthena*                   GameStateAthena;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeLTMPlaylist_ReturnValue;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground) == 0x000008, "Wrong alignment on AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground");
static_assert(sizeof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground) == 0x000010, "Wrong size on AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground");
static_assert(offsetof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground, GameStateAthena) == 0x000000, "Member 'AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground::GameStateAthena' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground, Temp_bool_Variable) == 0x000008, "Member 'AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground, CallFunc_IsCreativeLTMPlaylist_ReturnValue) == 0x00000A, "Member 'AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground::CallFunc_IsCreativeLTMPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x00000B, "Member 'AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground, Temp_byte_Variable) == 0x00000C, "Member 'AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground, Temp_byte_Variable_1) == 0x00000E, "Member 'AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground, K2Node_Select_Default) == 0x00000F, "Member 'AthenaBroadcastHUD_C_CheckIfCreativeOrPlayground::K2Node_Select_Default' has a wrong offset!");

// Function AthenaBroadcastHUD.AthenaBroadcastHUD_C.ExecuteUbergraph_AthenaBroadcastHUD
// 0x02D0 (0x02D0 - 0x0000)
struct AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudVisibilityState                           Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudVisibilityState                           K2Node_CustomEvent_HUDVisibility;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HUDScale;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortLiveBroadcastController*           K2Node_DynamicCast_AsFort_Live_Broadcast_Controller; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaWinnerInfo                      K2Node_CustomEvent_WinnerInfo;                     // 0x0050(0x0020)(ConstParm)
	bool                                          CallFunc_OnAllWinnersAnnounced_Displayed;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_FailedReason;                         // 0x0078(0x0020)()
	class FText                                   K2Node_Event_FailureText;                          // 0x0098(0x0018)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIndicatorsEnabled;                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsTargeting;                         // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudVisibilityState                           Temp_byte_Variable_11;                             // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TimeRemaining;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortPlaylistAthena*              K2Node_Event_PlaylistData;                         // 0x00D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIExtensionSlot                              K2Node_Event_ExtensionSlot_1;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget_1;                             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          K2Node_Event_NewMinigame;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudVisibilityState                           Temp_byte_Variable_16;                             // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_Event_GameStateAthena;                      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_18;                             // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortMinigame* Minigame, EFortMinigameState MinigameState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0134(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortMinigame*                          K2Node_CustomEvent_ChangedMinigame;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameState                            K2Node_CustomEvent_MinigameState;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_19;                             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_20;                             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortSafeZoneInterface> K2Node_CustomEvent_SafeZoneInterface;              // 0x0170(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          K2Node_CustomEvent_NewPhaseStep;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudVisibilityState                           Temp_byte_Variable_21;                             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bNewlyOpened)>            K2Node_CreateDelegate_OutputDelegate_3;            // 0x01B4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCursorModeEnabled;                   // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ActionName;                           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_CustomWidget;                         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetEquippedWeapon_ReturnValue;            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeaponRanged*                      K2Node_DynamicCast_AsFort_Weapon_Ranged;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingScope_ReturnValue;                 // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHudVisibilityState                           K2Node_Event_NewVisibility;                        // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_22;                             // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena_1;     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_23;                             // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21B[0x5];                                      // 0x021B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetVisibilityText_Text;                   // 0x0220(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FAthenaWinnerInfo& WinnerInfo)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x023C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIExtensionSlot                              K2Node_Event_ExtensionSlot;                        // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_24;                             // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_3;      // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_25;                             // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue_2;                 // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_1;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue_1;          // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_9;                           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD) == 0x000008, "Wrong alignment on AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD");
static_assert(sizeof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD) == 0x0002D0, "Wrong size on AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, EntryPoint) == 0x000000, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_object_Variable) == 0x000008, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable) == 0x000010, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_1) == 0x000011, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_2) == 0x000012, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_3) == 0x000013, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_4) == 0x000014, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_5) == 0x000015, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_6) == 0x000016, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_bool_Variable) == 0x000017, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_7) == 0x000018, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_8) == 0x000019, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_bool_Variable_1) == 0x00001A, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_int_Variable) == 0x00001C, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_int_Variable_1) == 0x000020, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_CustomEvent_HUDVisibility) == 0x000024, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_CustomEvent_HUDVisibility' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_9) == 0x000025, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_HUDScale) == 0x000028, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_HUDScale' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_DynamicCast_AsFort_Live_Broadcast_Controller) == 0x000040, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_DynamicCast_AsFort_Live_Broadcast_Controller' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_10) == 0x000049, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_CustomEvent_WinnerInfo) == 0x000050, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_CustomEvent_WinnerInfo' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, CallFunc_OnAllWinnersAnnounced_Displayed) == 0x000070, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::CallFunc_OnAllWinnersAnnounced_Displayed' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_FailedReason) == 0x000078, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_FailedReason' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_FailureText) == 0x000098, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_FailureText' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, CallFunc_HasTag_ReturnValue) == 0x0000B0, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_bIndicatorsEnabled) == 0x0000B1, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_bIndicatorsEnabled' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_bIsTargeting) == 0x0000B2, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_bIsTargeting' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_11) == 0x0000B3, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_CustomEvent_TimeRemaining) == 0x0000B4, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_CustomEvent_TimeRemaining' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_12) == 0x0000B8, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_13) == 0x0000B9, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_PlaylistData) == 0x0000D8, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_PlaylistData' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_ExtensionSlot_1) == 0x0000E0, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_ExtensionSlot_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_Widget_1) == 0x0000E8, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_Widget_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_SwitchEnum_CmpSuccess) == 0x0000F0, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, CallFunc_AddChildToOverlay_ReturnValue) == 0x0000F8, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_14) == 0x000100, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_NewMinigame) == 0x000108, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_NewMinigame' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_15) == 0x000111, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, Temp_byte_Variable_16) == 0x000112, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_Event_GameStateAthena) == 0x000118, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_Event_GameStateAthena' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, CallFunc_GetGameState_ReturnValue) == 0x000120, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000128, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'AthenaBroadcastHUD_C_ExecuteUbergraph_AthenaBroadcastHUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
