#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Soccerball

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsBall_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Soccerball.Athena_Soccerball_C
// 0x0048 (0x0B30 - 0x0AE8)
class AAthena_Soccerball_C final : public APhysicsBall_Master_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Soccerball_C;                // 0x0AE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPawn*                              LastToKick;                                        // 0x0AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                original_location;                                 // 0x0AF8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      Last_Kicker_Quest_Manager;                         // 0x0B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0B18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               Quest_Item;                                        // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Quest_Backend_Name;                                // 0x0B28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Soccerball(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void Update_Quest_With_Distance();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Soccerball_C">();
	}
	static class AAthena_Soccerball_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Soccerball_C>();
	}
};
static_assert(alignof(AAthena_Soccerball_C) == 0x000008, "Wrong alignment on AAthena_Soccerball_C");
static_assert(sizeof(AAthena_Soccerball_C) == 0x000B30, "Wrong size on AAthena_Soccerball_C");
static_assert(offsetof(AAthena_Soccerball_C, UberGraphFrame_Athena_Soccerball_C) == 0x000AE8, "Member 'AAthena_Soccerball_C::UberGraphFrame_Athena_Soccerball_C' has a wrong offset!");
static_assert(offsetof(AAthena_Soccerball_C, LastToKick) == 0x000AF0, "Member 'AAthena_Soccerball_C::LastToKick' has a wrong offset!");
static_assert(offsetof(AAthena_Soccerball_C, original_location) == 0x000AF8, "Member 'AAthena_Soccerball_C::original_location' has a wrong offset!");
static_assert(offsetof(AAthena_Soccerball_C, Last_Kicker_Quest_Manager) == 0x000B10, "Member 'AAthena_Soccerball_C::Last_Kicker_Quest_Manager' has a wrong offset!");
static_assert(offsetof(AAthena_Soccerball_C, TimerHandle) == 0x000B18, "Member 'AAthena_Soccerball_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(AAthena_Soccerball_C, Quest_Item) == 0x000B20, "Member 'AAthena_Soccerball_C::Quest_Item' has a wrong offset!");
static_assert(offsetof(AAthena_Soccerball_C, Quest_Backend_Name) == 0x000B28, "Member 'AAthena_Soccerball_C::Quest_Backend_Name' has a wrong offset!");

}

