#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorHitPointBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpectatorHitPointBar.AthenaSpectatorHitPointBar_C
// 0x0158 (0x0450 - 0x02F8)
class UAthenaSpectatorHitPointBar_C final : public UAthenaSpectatorHitPointBarBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CurrentValue;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxValue;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         NumbersHB;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           ProgressBarDelta;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           ProgressBarFill;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           HealthFillColorA;                                  // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HealthFillColorB;                                  // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HealthDeltaColorA;                                 // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HealthDeltaColorB;                                 // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HealthBackgroundColor;                             // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShieldFillColorA;                                  // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShieldFillColorB;                                  // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShieldDeltaColorA;                                 // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShieldDeltaColorB;                                 // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShieldBackgroundColor;                             // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VehicleHealthFillColorA;                           // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VehicleHealthFillColorB;                           // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VehicleHealthDeltaColorA;                          // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VehicleHealthDeltaColorB;                          // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VehicleHealthBackgroundColor;                      // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowNumbers;                                       // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           ShieldIcon;                                        // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           VehicleIcon;                                       // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             HealthTexture;                                     // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesignTime_CurrentValue;                           // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesignTime_DeltaValue;                             // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideShieldOnDbno;                                  // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxHealthValue;                                    // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeTextVisibility(bool bIsVisible);
	void ExecuteUbergraph_AthenaSpectatorHitPointBar(int32 EntryPoint);
	void InitializeBar();
	void OnCurrentValueChanged(float InCurrentValue);
	void OnDBNOChanged(bool bInIsDBNO);
	void OnDeltaValueChanged(float InDeltaValue);
	void PreConstruct(bool IsDesignTime);
	void UpdateCurrentValueText(float InCurrentValue);
	void UpdateMaxValueText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpectatorHitPointBar_C">();
	}
	static class UAthenaSpectatorHitPointBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectatorHitPointBar_C>();
	}
};
static_assert(alignof(UAthenaSpectatorHitPointBar_C) == 0x000008, "Wrong alignment on UAthenaSpectatorHitPointBar_C");
static_assert(sizeof(UAthenaSpectatorHitPointBar_C) == 0x000450, "Wrong size on UAthenaSpectatorHitPointBar_C");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, UberGraphFrame) == 0x0002F8, "Member 'UAthenaSpectatorHitPointBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, CurrentValue) == 0x000300, "Member 'UAthenaSpectatorHitPointBar_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, Icon) == 0x000308, "Member 'UAthenaSpectatorHitPointBar_C::Icon' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, MaxValue) == 0x000310, "Member 'UAthenaSpectatorHitPointBar_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, NumbersHB) == 0x000318, "Member 'UAthenaSpectatorHitPointBar_C::NumbersHB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, ProgressBarDelta) == 0x000320, "Member 'UAthenaSpectatorHitPointBar_C::ProgressBarDelta' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, ProgressBarFill) == 0x000328, "Member 'UAthenaSpectatorHitPointBar_C::ProgressBarFill' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, HealthFillColorA) == 0x000330, "Member 'UAthenaSpectatorHitPointBar_C::HealthFillColorA' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, HealthFillColorB) == 0x000340, "Member 'UAthenaSpectatorHitPointBar_C::HealthFillColorB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, HealthDeltaColorA) == 0x000350, "Member 'UAthenaSpectatorHitPointBar_C::HealthDeltaColorA' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, HealthDeltaColorB) == 0x000360, "Member 'UAthenaSpectatorHitPointBar_C::HealthDeltaColorB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, HealthBackgroundColor) == 0x000370, "Member 'UAthenaSpectatorHitPointBar_C::HealthBackgroundColor' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, ShieldFillColorA) == 0x000380, "Member 'UAthenaSpectatorHitPointBar_C::ShieldFillColorA' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, ShieldFillColorB) == 0x000390, "Member 'UAthenaSpectatorHitPointBar_C::ShieldFillColorB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, ShieldDeltaColorA) == 0x0003A0, "Member 'UAthenaSpectatorHitPointBar_C::ShieldDeltaColorA' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, ShieldDeltaColorB) == 0x0003B0, "Member 'UAthenaSpectatorHitPointBar_C::ShieldDeltaColorB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, ShieldBackgroundColor) == 0x0003C0, "Member 'UAthenaSpectatorHitPointBar_C::ShieldBackgroundColor' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, VehicleHealthFillColorA) == 0x0003D0, "Member 'UAthenaSpectatorHitPointBar_C::VehicleHealthFillColorA' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, VehicleHealthFillColorB) == 0x0003E0, "Member 'UAthenaSpectatorHitPointBar_C::VehicleHealthFillColorB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, VehicleHealthDeltaColorA) == 0x0003F0, "Member 'UAthenaSpectatorHitPointBar_C::VehicleHealthDeltaColorA' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, VehicleHealthDeltaColorB) == 0x000400, "Member 'UAthenaSpectatorHitPointBar_C::VehicleHealthDeltaColorB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, VehicleHealthBackgroundColor) == 0x000410, "Member 'UAthenaSpectatorHitPointBar_C::VehicleHealthBackgroundColor' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, ShowNumbers) == 0x000420, "Member 'UAthenaSpectatorHitPointBar_C::ShowNumbers' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, ShieldIcon) == 0x000428, "Member 'UAthenaSpectatorHitPointBar_C::ShieldIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, VehicleIcon) == 0x000430, "Member 'UAthenaSpectatorHitPointBar_C::VehicleIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, HealthTexture) == 0x000438, "Member 'UAthenaSpectatorHitPointBar_C::HealthTexture' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, DesignTime_CurrentValue) == 0x000440, "Member 'UAthenaSpectatorHitPointBar_C::DesignTime_CurrentValue' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, DesignTime_DeltaValue) == 0x000444, "Member 'UAthenaSpectatorHitPointBar_C::DesignTime_DeltaValue' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, HideShieldOnDbno) == 0x000448, "Member 'UAthenaSpectatorHitPointBar_C::HideShieldOnDbno' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorHitPointBar_C, MaxHealthValue) == 0x00044C, "Member 'UAthenaSpectatorHitPointBar_C::MaxHealthValue' has a wrong offset!");

}

