#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorMaterialCountsWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpectatorMaterialCountsWidget.AthenaSpectatorMaterialCountsWidget_C
// 0x0078 (0x03A0 - 0x0328)
class UAthenaSpectatorMaterialCountsWidget_C final : public UAthenaSpectatorMaterialCountsBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaSpectatorBuildCountWidget_C*     Gold;                                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          GoldBorder;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorBuildCountWidget_C*     Metal;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          MetalBorder;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorBuildCountWidget_C*     Stone;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          StoneBorder;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorBuildCountWidget_C*     Wood;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          WoodBorder;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         RemainingTimeToDisplay;                            // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             DesignTime_BuildingMaterial;                       // 0x037C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HighlightedColor;                                  // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NonHighlightedColor;                               // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaSpectatorMaterialCountsWidget(int32 EntryPoint);
	void OnBuildCountIncreased();
	void OnBuildingMaterialChanged(EFortResourceType BuildingMaterial);
	void OnBuildModeChanged();
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPS);
	void OnReplayScrubComplete();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpectatorMaterialCountsWidget_C">();
	}
	static class UAthenaSpectatorMaterialCountsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectatorMaterialCountsWidget_C>();
	}
};
static_assert(alignof(UAthenaSpectatorMaterialCountsWidget_C) == 0x000008, "Wrong alignment on UAthenaSpectatorMaterialCountsWidget_C");
static_assert(sizeof(UAthenaSpectatorMaterialCountsWidget_C) == 0x0003A0, "Wrong size on UAthenaSpectatorMaterialCountsWidget_C");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, UberGraphFrame) == 0x000328, "Member 'UAthenaSpectatorMaterialCountsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, FadeOut) == 0x000330, "Member 'UAthenaSpectatorMaterialCountsWidget_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, Gold) == 0x000338, "Member 'UAthenaSpectatorMaterialCountsWidget_C::Gold' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, GoldBorder) == 0x000340, "Member 'UAthenaSpectatorMaterialCountsWidget_C::GoldBorder' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, Metal) == 0x000348, "Member 'UAthenaSpectatorMaterialCountsWidget_C::Metal' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, MetalBorder) == 0x000350, "Member 'UAthenaSpectatorMaterialCountsWidget_C::MetalBorder' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, Stone) == 0x000358, "Member 'UAthenaSpectatorMaterialCountsWidget_C::Stone' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, StoneBorder) == 0x000360, "Member 'UAthenaSpectatorMaterialCountsWidget_C::StoneBorder' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, Wood) == 0x000368, "Member 'UAthenaSpectatorMaterialCountsWidget_C::Wood' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, WoodBorder) == 0x000370, "Member 'UAthenaSpectatorMaterialCountsWidget_C::WoodBorder' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, RemainingTimeToDisplay) == 0x000378, "Member 'UAthenaSpectatorMaterialCountsWidget_C::RemainingTimeToDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, DesignTime_BuildingMaterial) == 0x00037C, "Member 'UAthenaSpectatorMaterialCountsWidget_C::DesignTime_BuildingMaterial' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, HighlightedColor) == 0x000380, "Member 'UAthenaSpectatorMaterialCountsWidget_C::HighlightedColor' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMaterialCountsWidget_C, NonHighlightedColor) == 0x000390, "Member 'UAthenaSpectatorMaterialCountsWidget_C::NonHighlightedColor' has a wrong offset!");

}

