#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEmptyResourceSlotPresentation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaEmptyResourceSlotPresentation.AthenaEmptyResourceSlotPresentation_C
// 0x0078 (0x0358 - 0x02E0)
class UAthenaEmptyResourceSlotPresentation_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Empty_0;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty_1;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty_2;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty_3;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty_4;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty_5;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UImage*>                         IngredientsEmptyArray;                             // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UImage*>                         ResourcesEmptyArray;                               // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UImage*>                         AmmoEmptyArray;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         IngredientsNumItems;                               // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmmoNumItems;                                      // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResourcesNumItems;                                 // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaEmptyResourceSlotPresentation(int32 EntryPoint);
	void MakeAmmoArray();
	void MakeIngredientsArray();
	void MakeResourcesArray();
	void PreConstruct(bool IsDesignTime);
	void UpdateAmmoViewVisual(int32 AmmoNumItems_0);
	void UpdateIngredientViewVisual(int32 NumItems);
	void UpdateResourceViewVisual(int32 ResourcesNumItems_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaEmptyResourceSlotPresentation_C">();
	}
	static class UAthenaEmptyResourceSlotPresentation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEmptyResourceSlotPresentation_C>();
	}
};
static_assert(alignof(UAthenaEmptyResourceSlotPresentation_C) == 0x000008, "Wrong alignment on UAthenaEmptyResourceSlotPresentation_C");
static_assert(sizeof(UAthenaEmptyResourceSlotPresentation_C) == 0x000358, "Wrong size on UAthenaEmptyResourceSlotPresentation_C");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, UberGraphFrame) == 0x0002E0, "Member 'UAthenaEmptyResourceSlotPresentation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, Empty_0) == 0x0002E8, "Member 'UAthenaEmptyResourceSlotPresentation_C::Empty_0' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, Empty_1) == 0x0002F0, "Member 'UAthenaEmptyResourceSlotPresentation_C::Empty_1' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, Empty_2) == 0x0002F8, "Member 'UAthenaEmptyResourceSlotPresentation_C::Empty_2' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, Empty_3) == 0x000300, "Member 'UAthenaEmptyResourceSlotPresentation_C::Empty_3' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, Empty_4) == 0x000308, "Member 'UAthenaEmptyResourceSlotPresentation_C::Empty_4' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, Empty_5) == 0x000310, "Member 'UAthenaEmptyResourceSlotPresentation_C::Empty_5' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, IngredientsEmptyArray) == 0x000318, "Member 'UAthenaEmptyResourceSlotPresentation_C::IngredientsEmptyArray' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, ResourcesEmptyArray) == 0x000328, "Member 'UAthenaEmptyResourceSlotPresentation_C::ResourcesEmptyArray' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, AmmoEmptyArray) == 0x000338, "Member 'UAthenaEmptyResourceSlotPresentation_C::AmmoEmptyArray' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, IngredientsNumItems) == 0x000348, "Member 'UAthenaEmptyResourceSlotPresentation_C::IngredientsNumItems' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, AmmoNumItems) == 0x00034C, "Member 'UAthenaEmptyResourceSlotPresentation_C::AmmoNumItems' has a wrong offset!");
static_assert(offsetof(UAthenaEmptyResourceSlotPresentation_C, ResourcesNumItems) == 0x000350, "Member 'UAthenaEmptyResourceSlotPresentation_C::ResourcesNumItems' has a wrong offset!");

}

