#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Mustache_LockOnWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_Mustache_LockOnWidget.Athena_Mustache_LockOnWidget_C
// 0x0038 (0x02F0 - 0x02B8)
class UAthena_Mustache_LockOnWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Scale;                                             // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_83;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LockinOnSound;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LockinOffSound;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_Athena_Mustache_LockOnWidget(int32 EntryPoint);
	void MoveUI();
	void WidgetAnimationEvt_Scale_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Mustache_LockOnWidget_C">();
	}
	static class UAthena_Mustache_LockOnWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_Mustache_LockOnWidget_C>();
	}
};
static_assert(alignof(UAthena_Mustache_LockOnWidget_C) == 0x000008, "Wrong alignment on UAthena_Mustache_LockOnWidget_C");
static_assert(sizeof(UAthena_Mustache_LockOnWidget_C) == 0x0002F0, "Wrong size on UAthena_Mustache_LockOnWidget_C");
static_assert(offsetof(UAthena_Mustache_LockOnWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UAthena_Mustache_LockOnWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthena_Mustache_LockOnWidget_C, Flash) == 0x0002C0, "Member 'UAthena_Mustache_LockOnWidget_C::Flash' has a wrong offset!");
static_assert(offsetof(UAthena_Mustache_LockOnWidget_C, Scale) == 0x0002C8, "Member 'UAthena_Mustache_LockOnWidget_C::Scale' has a wrong offset!");
static_assert(offsetof(UAthena_Mustache_LockOnWidget_C, Image_83) == 0x0002D0, "Member 'UAthena_Mustache_LockOnWidget_C::Image_83' has a wrong offset!");
static_assert(offsetof(UAthena_Mustache_LockOnWidget_C, Target) == 0x0002D8, "Member 'UAthena_Mustache_LockOnWidget_C::Target' has a wrong offset!");
static_assert(offsetof(UAthena_Mustache_LockOnWidget_C, LockinOnSound) == 0x0002E0, "Member 'UAthena_Mustache_LockOnWidget_C::LockinOnSound' has a wrong offset!");
static_assert(offsetof(UAthena_Mustache_LockOnWidget_C, LockinOffSound) == 0x0002E8, "Member 'UAthena_Mustache_LockOnWidget_C::LockinOffSound' has a wrong offset!");

}

