#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEventMatchScoreboardScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaEventMatchScoreboardScreen.AthenaEventMatchScoreboardScreen_C
// 0x0038 (0x05F0 - 0x05B8)
class UAthenaEventMatchScoreboardScreen_C final : public UAthenaEventMatchScoreboardScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               EliminationsSB;                                    // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HealthSB;                                          // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MaterialsSB;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlaceSB;                                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlayerNameSB;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SquadIdSB;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaEventMatchScoreboardScreen(int32 EntryPoint);
	void SetSquadIdsVisible_BP(bool bSquadIdsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaEventMatchScoreboardScreen_C">();
	}
	static class UAthenaEventMatchScoreboardScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEventMatchScoreboardScreen_C>();
	}
};
static_assert(alignof(UAthenaEventMatchScoreboardScreen_C) == 0x000008, "Wrong alignment on UAthenaEventMatchScoreboardScreen_C");
static_assert(sizeof(UAthenaEventMatchScoreboardScreen_C) == 0x0005F0, "Wrong size on UAthenaEventMatchScoreboardScreen_C");
static_assert(offsetof(UAthenaEventMatchScoreboardScreen_C, UberGraphFrame) == 0x0005B8, "Member 'UAthenaEventMatchScoreboardScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchScoreboardScreen_C, EliminationsSB) == 0x0005C0, "Member 'UAthenaEventMatchScoreboardScreen_C::EliminationsSB' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchScoreboardScreen_C, HealthSB) == 0x0005C8, "Member 'UAthenaEventMatchScoreboardScreen_C::HealthSB' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchScoreboardScreen_C, MaterialsSB) == 0x0005D0, "Member 'UAthenaEventMatchScoreboardScreen_C::MaterialsSB' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchScoreboardScreen_C, PlaceSB) == 0x0005D8, "Member 'UAthenaEventMatchScoreboardScreen_C::PlaceSB' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchScoreboardScreen_C, PlayerNameSB) == 0x0005E0, "Member 'UAthenaEventMatchScoreboardScreen_C::PlayerNameSB' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchScoreboardScreen_C, SquadIdSB) == 0x0005E8, "Member 'UAthenaEventMatchScoreboardScreen_C::SquadIdSB' has a wrong offset!");

}

