#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBottomBarWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaBottomBarWidget.AthenaBottomBarWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaBottomBarWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBottomBarWidget_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaBottomBarWidget_C_PreConstruct");
static_assert(sizeof(AthenaBottomBarWidget_C_PreConstruct) == 0x000001, "Wrong size on AthenaBottomBarWidget_C_PreConstruct");
static_assert(offsetof(AthenaBottomBarWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaBottomBarWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaBottomBarWidget.AthenaBottomBarWidget_C.ExecuteUbergraph_AthenaBottomBarWidget
// 0x0038 (0x0038 - 0x0000)
struct AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget) == 0x000008, "Wrong alignment on AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget");
static_assert(sizeof(AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget) == 0x000038, "Wrong size on AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget");
static_assert(offsetof(AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget, EntryPoint) == 0x000000, "Member 'AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget, K2Node_MakeStruct_LinearColor) == 0x000008, "Member 'AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget, K2Node_MakeStruct_Margin) == 0x00001C, "Member 'AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000030, "Member 'AthenaBottomBarWidget_C_ExecuteUbergraph_AthenaBottomBarWidget::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");

}

