#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaGamePhaseChangeWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.BP_HandleGamePhaseStepChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged) == 0x000001, "Wrong alignment on AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged) == 0x000001, "Wrong size on AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged::Step' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.BP_UpdateMessaging
// 0x0038 (0x0038 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Message_0;                                         // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   TimeText_0;                                        // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging) == 0x000038, "Wrong size on AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging::Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging, Message_0) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging::Message_0' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging, TimeText_0) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging::TimeText_0' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.ExecuteUbergraph_AthenaGamePhaseChangeWidget
// 0x04A0 (0x04A0 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_7;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_8;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_9;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_10;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_11;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_12;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_13;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_14;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable_2;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x00C0(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00F0(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0108(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0120(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0168(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0180(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0198(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x01B0(0x0018)()
	EAthenaGamePhaseStep                          Temp_byte_Variable_3;                              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_13;                             // 0x01D0(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x01E8(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0200(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x0218(0x0018)()
	class FText                                   Temp_text_Variable_17;                             // 0x0230(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x0248(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x0260(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x0278(0x0018)()
	class FText                                   Temp_text_Variable_21;                             // 0x0290(0x0018)()
	class FText                                   Temp_text_Variable_22;                             // 0x02A8(0x0018)()
	class FText                                   Temp_text_Variable_23;                             // 0x02C0(0x0018)()
	class FText                                   Temp_text_Variable_24;                             // 0x02D8(0x0018)()
	class FText                                   Temp_text_Variable_25;                             // 0x02F0(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_6;                              // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_7;                              // 0x030E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30F[0x1];                                      // 0x030F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_15;                           // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_16;                           // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_17;                           // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0328(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          K2Node_Event_Step_1;                               // 0x0334(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          K2Node_Event_Step;                                 // 0x0335(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_336[0x2];                                      // 0x0336(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Message;                              // 0x0338(0x0018)(ConstParm)
	class FText                                   K2Node_Event_TimeText;                             // 0x0350(0x0018)(ConstParm)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0370(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x03C0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03D8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x03F0(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default_4;                           // 0x040B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_18;                           // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_19;                           // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_20;                           // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0430(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_21;                           // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_22;                           // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_23;                           // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_24;                           // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePhaseStepNotificationWidgetVisible_ReturnValue; // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_25;                           // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_5;                           // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget) == 0x0004A0, "Wrong size on AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, EntryPoint) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable) == 0x000004, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_1) == 0x000010, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable_1) == 0x000018, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_2) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_3) == 0x000028, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_4) == 0x000030, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_5) == 0x000038, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_6) == 0x000040, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_7) == 0x000048, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_8) == 0x000050, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_9) == 0x000058, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_10) == 0x000060, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_11) == 0x000068, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_12) == 0x000070, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_13) == 0x000078, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_14) == 0x000080, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable_2) == 0x000088, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable) == 0x000090, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_1) == 0x0000A8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_2) == 0x0000C0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_3) == 0x0000D8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_4) == 0x0000F0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_5) == 0x000108, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_6) == 0x000120, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_7) == 0x000138, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_8) == 0x000150, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_9) == 0x000168, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_10) == 0x000180, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_11) == 0x000198, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_12) == 0x0001B0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable_3) == 0x0001C8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_13) == 0x0001D0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_14) == 0x0001E8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_15) == 0x000200, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_16) == 0x000218, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_17) == 0x000230, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_17' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_18) == 0x000248, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_18' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_19) == 0x000260, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_19' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_20) == 0x000278, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_20' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_21) == 0x000290, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_21' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_22) == 0x0002A8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_22' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_23) == 0x0002C0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_23' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_24) == 0x0002D8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_24' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_text_Variable_25) == 0x0002F0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_text_Variable_25' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000308, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_bool_Variable) == 0x000309, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable_4) == 0x00030A, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable_5) == 0x00030B, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_bool_Variable_1) == 0x00030C, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable_6) == 0x00030D, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable_7) == 0x00030E, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_15) == 0x000310, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_16) == 0x000318, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_17) == 0x000320, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000328, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Step_1) == 0x000334, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Step_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Step) == 0x000335, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Message) == 0x000338, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_TimeText) == 0x000350, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_TimeText' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Select_Default) == 0x000368, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Select_Default_1) == 0x000370, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000388, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_Split_LeftS) == 0x000398, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_Split_RightS) == 0x0003A8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_Split_ReturnValue) == 0x0003B8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Select_Default_2) == 0x0003C0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x0003D8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0003F0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000408, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000409, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Select_Default_3) == 0x00040A, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Select_Default_4) == 0x00040B, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_18) == 0x000410, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_19) == 0x000418, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_20) == 0x000420, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_20' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000428, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000430, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000440, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_DynamicCast_bSuccess) == 0x000448, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_21) == 0x000450, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_21' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000458, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_22) == 0x000460, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_22' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_23) == 0x000468, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_23' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_24) == 0x000470, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_24' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_GetGameStateAthena_ReturnValue) == 0x000478, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000480, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_IsGamePhaseStepNotificationWidgetVisible_ReturnValue) == 0x000488, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_IsGamePhaseStepNotificationWidgetVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_25) == 0x000490, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_25' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Select_Default_5) == 0x000498, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Select_Default_5' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.PlayGamePhaseAlertSound
// 0x0080 (0x0080 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_6;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_7;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_8;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_9;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_10;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_11;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_12;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound) == 0x000080, "Wrong size on AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_byte_Variable) == 0x000001, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_1) == 0x000010, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_2) == 0x000018, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_3) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_4) == 0x000028, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_5) == 0x000030, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_6) == 0x000038, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_7) == 0x000040, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_8) == 0x000048, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_9) == 0x000050, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_10) == 0x000058, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_11) == 0x000060, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_12) == 0x000068, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, K2Node_Select_Default) == 0x000070, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.PlayIntroAnimation
// 0x0040 (0x0040 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_PlayIntroAnimation final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_PlayIntroAnimation");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation) == 0x000040, "Wrong size on AthenaGamePhaseChangeWidget_C_PlayIntroAnimation");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000002, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000003, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, Temp_bool_Variable) == 0x000005, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, Temp_bool_Variable_1) == 0x000010, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000014, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, K2Node_Select_Default) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, K2Node_Select_Default_1) == 0x000030, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.ToggleCompass
// 0x0010 (0x0010 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_ToggleCompass final
{
public:
