#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEventMatchPlayerGridTeamWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaEventMatchPlayerGridTeamWidget.AthenaEventMatchPlayerGridTeamWidget_C.AddToGrid
// 0x0028 (0x0028 - 0x0000)
struct AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid final
{
public:
	class UUserWidget*                            PlayerWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_DummyWidgetsToAdd;                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid");
static_assert(sizeof(AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid) == 0x000028, "Wrong size on AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid, PlayerWidget) == 0x000000, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid::PlayerWidget' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid, Local_DummyWidgetsToAdd) == 0x000008, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid::Local_DummyWidgetsToAdd' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000010, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid, CallFunc_GetChildrenCount_ReturnValue) == 0x000018, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid, CallFunc_Percent_IntInt_ReturnValue) == 0x000020, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid, CallFunc_Divide_IntInt_ReturnValue) == 0x000024, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_AddToGrid::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaEventMatchPlayerGridTeamWidget.AthenaEventMatchPlayerGridTeamWidget_C.ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget
// 0x0050 (0x0050 - 0x0000)
struct AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaEventMatchPlayerGridDummyWidget_C* CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaEventMatchPlayerWidgetBase*      CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget");
static_assert(sizeof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget) == 0x000050, "Wrong size on AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, EntryPoint) == 0x000000, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, Temp_int_Variable) == 0x000010, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_Array_Get_Item) == 0x000038, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000041, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridTeamWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaEventMatchPlayerGridTeamWidget.AthenaEventMatchPlayerGridTeamWidget_C.OnGridSizeChanged
// 0x0038 (0x0038 - 0x0000)
struct AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged final
{
public:
	int32                                         InGridSize;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaEventMatchPlayerWidgetBase*      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaEventMatchPlayerGridPlayerWidget_C* K2Node_DynamicCast_AsAthena_Event_Match_Player_Grid_Player_Widget; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged");
static_assert(sizeof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged) == 0x000038, "Wrong size on AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged, InGridSize) == 0x000000, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged::InGridSize' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged, Temp_int_Array_Index_Variable) == 0x000004, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged, K2Node_DynamicCast_AsAthena_Event_Match_Player_Grid_Player_Widget) == 0x000028, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged::K2Node_DynamicCast_AsAthena_Event_Match_Player_Grid_Player_Widget' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_OnGridSizeChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaEventMatchPlayerGridTeamWidget.AthenaEventMatchPlayerGridTeamWidget_C.SetEliminationsVisibility
// 0x0038 (0x0038 - 0x0000)
struct AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility final
{
public:
	bool                                          bInVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaEventMatchPlayerWidgetBase*      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaEventMatchPlayerGridPlayerWidget_C* K2Node_DynamicCast_AsAthena_Event_Match_Player_Grid_Player_Widget; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility");
static_assert(sizeof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility) == 0x000038, "Wrong size on AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility, bInVisible) == 0x000000, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility::bInVisible' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility, K2Node_DynamicCast_AsAthena_Event_Match_Player_Grid_Player_Widget) == 0x000028, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility::K2Node_DynamicCast_AsAthena_Event_Match_Player_Grid_Player_Widget' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaEventMatchPlayerGridTeamWidget_C_SetEliminationsVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

