#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryPanel.AthenaInventoryPanel_C
// 0x0040 (0x0740 - 0x0700)
class UAthenaInventoryPanel_C final : public UAthenaInventoryPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0708(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverResources;                                    // 0x0710(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaEmptyResourceSlotPresentation_C* EmptyAmmoView;                                     // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaEmptyResourceSlotPresentation_C* EmptyIngredientView;                               // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaEmptyResourceSlotPresentation_C* EmptyResourceView;                                 // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsResourceAnimFinished;                            // 0x0730(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__AmmoView_K2Node_ComponentBoundEvent_3_OnInventoryUpdated__DelegateSignature();
	void BndEvt__IngredientView_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__IngredientView_K2Node_ComponentBoundEvent_1_OnInventoryUpdated__DelegateSignature();
	void BndEvt__ResourceView_K2Node_ComponentBoundEvent_2_OnInventoryUpdated__DelegateSignature();
	void ExecuteUbergraph_AthenaInventoryPanel(int32 EntryPoint);
	class UWidget* GetNavigatedToWidget(class UFortItemTileView* Section, EUINavigation Navigation_0);
	void GetNextSection(class UFortItemTileView* CurrentSection, class UFortItemTileView** PreviousSection);
	void GetPreviousSection(class UFortItemTileView* CurrentSection, class UFortItemTileView** PreviousSection);
	void HandleIntroAnim();
	class UWidget* NavAmmo(EUINavigation Navigation_0);
	class UWidget* NavIngredients(EUINavigation Navigation_0);
	class UWidget* NavQuickbar(EUINavigation Navigation_0);
	class UWidget* NavResources(EUINavigation Navigation_0);
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnInitialized();
	void ResourceAnimFinished();
	void UpdateAmmoPopulatedVisual();
	void UpdateIngredientsPopulatedVisual();
	void UpdateResourcesPopulatedVisual();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryPanel_C">();
	}
	static class UAthenaInventoryPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryPanel_C>();
	}
};
static_assert(alignof(UAthenaInventoryPanel_C) == 0x000010, "Wrong alignment on UAthenaInventoryPanel_C");
static_assert(sizeof(UAthenaInventoryPanel_C) == 0x000740, "Wrong size on UAthenaInventoryPanel_C");
static_assert(offsetof(UAthenaInventoryPanel_C, UberGraphFrame) == 0x000700, "Member 'UAthenaInventoryPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryPanel_C, Intro) == 0x000708, "Member 'UAthenaInventoryPanel_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryPanel_C, HoverResources) == 0x000710, "Member 'UAthenaInventoryPanel_C::HoverResources' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryPanel_C, EmptyAmmoView) == 0x000718, "Member 'UAthenaInventoryPanel_C::EmptyAmmoView' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryPanel_C, EmptyIngredientView) == 0x000720, "Member 'UAthenaInventoryPanel_C::EmptyIngredientView' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryPanel_C, EmptyResourceView) == 0x000728, "Member 'UAthenaInventoryPanel_C::EmptyResourceView' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryPanel_C, IsResourceAnimFinished) == 0x000730, "Member 'UAthenaInventoryPanel_C::IsResourceAnimFinished' has a wrong offset!");

}

