#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemIconResource_Currency

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemIconResource_Currency.AthenaItemIconResource_Currency_C
// 0x0048 (0x0370 - 0x0328)
class UAthenaItemIconResource_Currency_C final : public UAthenaItemIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Empty;                                       // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Empty;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Populated;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       X;                                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         RandomFloat_Top;                                   // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Left;                                  // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Right;                                 // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Bottom;                                // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaItemIconResource_Currency(int32 EntryPoint);
	void IntroAnim();
	void OnPostItemToRepresentChanged(const class UFortItem* ItemToRepresent);
	void RandomizeAngleFloats();
	void SetFontMaterial();
	void SetHoveredState(bool bIsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemIconResource_Currency_C">();
	}
	static class UAthenaItemIconResource_Currency_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemIconResource_Currency_C>();
	}
};
static_assert(alignof(UAthenaItemIconResource_Currency_C) == 0x000008, "Wrong alignment on UAthenaItemIconResource_Currency_C");
static_assert(sizeof(UAthenaItemIconResource_Currency_C) == 0x000370, "Wrong size on UAthenaItemIconResource_Currency_C");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, UberGraphFrame) == 0x000328, "Member 'UAthenaItemIconResource_Currency_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Hover_Empty) == 0x000330, "Member 'UAthenaItemIconResource_Currency_C::Hover_Empty' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Intro) == 0x000338, "Member 'UAthenaItemIconResource_Currency_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Hover) == 0x000340, "Member 'UAthenaItemIconResource_Currency_C::Hover' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Empty) == 0x000348, "Member 'UAthenaItemIconResource_Currency_C::Empty' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, Populated) == 0x000350, "Member 'UAthenaItemIconResource_Currency_C::Populated' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, X) == 0x000358, "Member 'UAthenaItemIconResource_Currency_C::X' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, RandomFloat_Top) == 0x000360, "Member 'UAthenaItemIconResource_Currency_C::RandomFloat_Top' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, RandomFloat_Left) == 0x000364, "Member 'UAthenaItemIconResource_Currency_C::RandomFloat_Left' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, RandomFloat_Right) == 0x000368, "Member 'UAthenaItemIconResource_Currency_C::RandomFloat_Right' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_Currency_C, RandomFloat_Bottom) == 0x00036C, "Member 'UAthenaItemIconResource_Currency_C::RandomFloat_Bottom' has a wrong offset!");

}

