#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_BurstReaction_Exploding_GasTank

#include "Basic.hpp"

#include "Athena_Prop_BurstReaction_Exploding_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_BurstReaction_Exploding_GasTank.Athena_Prop_BurstReaction_Exploding_GasTank_C
// 0x0030 (0x1038 - 0x1008)
class AAthena_Prop_BurstReaction_Exploding_GasTank_C final : public AAthena_Prop_BurstReaction_Exploding_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Prop_BurstReaction_Exploding_GasTank_C; // 0x1008(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_InternalFire2;                                   // 0x1010(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Fire1;                                           // 0x1018(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_InternalFire;                                    // 0x1020(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Fire;                                            // 0x1028(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HealthCheckHandle;                                 // 0x1030(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckHealth();
	void ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank(int32 EntryPoint);
	void ExplodeAndDie();
	void FireEffect(const struct FVector& HitLocation);
	void ReceiveBeginPlay();
	void StopGrowTimeline();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_BurstReaction_Exploding_GasTank_C">();
	}
	static class AAthena_Prop_BurstReaction_Exploding_GasTank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_BurstReaction_Exploding_GasTank_C>();
	}
};
static_assert(alignof(AAthena_Prop_BurstReaction_Exploding_GasTank_C) == 0x000008, "Wrong alignment on AAthena_Prop_BurstReaction_Exploding_GasTank_C");
static_assert(sizeof(AAthena_Prop_BurstReaction_Exploding_GasTank_C) == 0x001038, "Wrong size on AAthena_Prop_BurstReaction_Exploding_GasTank_C");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, UberGraphFrame_Athena_Prop_BurstReaction_Exploding_GasTank_C) == 0x001008, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::UberGraphFrame_Athena_Prop_BurstReaction_Exploding_GasTank_C' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, P_InternalFire2) == 0x001010, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::P_InternalFire2' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, P_Fire1) == 0x001018, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::P_Fire1' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, P_InternalFire) == 0x001020, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::P_InternalFire' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, P_Fire) == 0x001028, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::P_Fire' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, HealthCheckHandle) == 0x001030, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::HealthCheckHandle' has a wrong offset!");

}

