#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaReadyUpTooltipWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaReadyUpTooltipWidget.AthenaReadyUpTooltipWidget_C
// 0x0060 (0x0358 - 0x02F8)
class UAthenaReadyUpTooltipWidget_C final : public UAthenaReadyUpTooltipWidget
{
public:
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget;                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_1;                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_2;                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_3;                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_4;                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_5;                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_6;                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReadyUpTooltipTickWidget_C*      AthenaReadyUpTooltipTickWidget_7;                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Backplate;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackplateShadow;                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Tail;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTailShadow;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaReadyUpTooltipWidget_C">();
	}
	static class UAthenaReadyUpTooltipWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaReadyUpTooltipWidget_C>();
	}
};
static_assert(alignof(UAthenaReadyUpTooltipWidget_C) == 0x000008, "Wrong alignment on UAthenaReadyUpTooltipWidget_C");
static_assert(sizeof(UAthenaReadyUpTooltipWidget_C) == 0x000358, "Wrong size on UAthenaReadyUpTooltipWidget_C");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, AthenaReadyUpTooltipTickWidget) == 0x0002F8, "Member 'UAthenaReadyUpTooltipWidget_C::AthenaReadyUpTooltipTickWidget' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, AthenaReadyUpTooltipTickWidget_1) == 0x000300, "Member 'UAthenaReadyUpTooltipWidget_C::AthenaReadyUpTooltipTickWidget_1' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, AthenaReadyUpTooltipTickWidget_2) == 0x000308, "Member 'UAthenaReadyUpTooltipWidget_C::AthenaReadyUpTooltipTickWidget_2' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, AthenaReadyUpTooltipTickWidget_3) == 0x000310, "Member 'UAthenaReadyUpTooltipWidget_C::AthenaReadyUpTooltipTickWidget_3' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, AthenaReadyUpTooltipTickWidget_4) == 0x000318, "Member 'UAthenaReadyUpTooltipWidget_C::AthenaReadyUpTooltipTickWidget_4' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, AthenaReadyUpTooltipTickWidget_5) == 0x000320, "Member 'UAthenaReadyUpTooltipWidget_C::AthenaReadyUpTooltipTickWidget_5' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, AthenaReadyUpTooltipTickWidget_6) == 0x000328, "Member 'UAthenaReadyUpTooltipWidget_C::AthenaReadyUpTooltipTickWidget_6' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, AthenaReadyUpTooltipTickWidget_7) == 0x000330, "Member 'UAthenaReadyUpTooltipWidget_C::AthenaReadyUpTooltipTickWidget_7' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, Image_Backplate) == 0x000338, "Member 'UAthenaReadyUpTooltipWidget_C::Image_Backplate' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, Image_BackplateShadow) == 0x000340, "Member 'UAthenaReadyUpTooltipWidget_C::Image_BackplateShadow' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, Image_Tail) == 0x000348, "Member 'UAthenaReadyUpTooltipWidget_C::Image_Tail' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipWidget_C, ImageTailShadow) == 0x000350, "Member 'UAthenaReadyUpTooltipWidget_C::ImageTailShadow' has a wrong offset!");

}

