#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSupplyDrop_Vault

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaSupplyDrop_Vault.AthenaSupplyDrop_Vault_C.ExecuteUbergraph_AthenaSupplyDrop_Vault
// 0x0004 (0x0004 - 0x0000)
struct AthenaSupplyDrop_Vault_C_ExecuteUbergraph_AthenaSupplyDrop_Vault final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSupplyDrop_Vault_C_ExecuteUbergraph_AthenaSupplyDrop_Vault) == 0x000004, "Wrong alignment on AthenaSupplyDrop_Vault_C_ExecuteUbergraph_AthenaSupplyDrop_Vault");
static_assert(sizeof(AthenaSupplyDrop_Vault_C_ExecuteUbergraph_AthenaSupplyDrop_Vault) == 0x000004, "Wrong size on AthenaSupplyDrop_Vault_C_ExecuteUbergraph_AthenaSupplyDrop_Vault");
static_assert(offsetof(AthenaSupplyDrop_Vault_C_ExecuteUbergraph_AthenaSupplyDrop_Vault, EntryPoint) == 0x000000, "Member 'AthenaSupplyDrop_Vault_C_ExecuteUbergraph_AthenaSupplyDrop_Vault::EntryPoint' has a wrong offset!");

// Function AthenaSupplyDrop_Vault.AthenaSupplyDrop_Vault_C.BlueprintCanInteract
// 0x0010 (0x0010 - 0x0000)
struct AthenaSupplyDrop_Vault_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSupplyDrop_Vault_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on AthenaSupplyDrop_Vault_C_BlueprintCanInteract");
static_assert(sizeof(AthenaSupplyDrop_Vault_C_BlueprintCanInteract) == 0x000010, "Wrong size on AthenaSupplyDrop_Vault_C_BlueprintCanInteract");
static_assert(offsetof(AthenaSupplyDrop_Vault_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'AthenaSupplyDrop_Vault_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Vault_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaSupplyDrop_Vault_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Vault_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'AthenaSupplyDrop_Vault_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Vault_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'AthenaSupplyDrop_Vault_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");

}

