#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastHUDMenuStatusLayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaBroadcastHUDMenuStatusLayer.AthenaBroadcastHUDMenuStatusLayer_C.AddHUDMenuStatus
// 0x0008 (0x0008 - 0x0000)
struct AthenaBroadcastHUDMenuStatusLayer_C_AddHUDMenuStatus final
{
public:
	class UAthenaBroadcastHUDMenuStatusBase*      HUDMenuStatusWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUDMenuStatusLayer_C_AddHUDMenuStatus) == 0x000008, "Wrong alignment on AthenaBroadcastHUDMenuStatusLayer_C_AddHUDMenuStatus");
static_assert(sizeof(AthenaBroadcastHUDMenuStatusLayer_C_AddHUDMenuStatus) == 0x000008, "Wrong size on AthenaBroadcastHUDMenuStatusLayer_C_AddHUDMenuStatus");
static_assert(offsetof(AthenaBroadcastHUDMenuStatusLayer_C_AddHUDMenuStatus, HUDMenuStatusWidget) == 0x000000, "Member 'AthenaBroadcastHUDMenuStatusLayer_C_AddHUDMenuStatus::HUDMenuStatusWidget' has a wrong offset!");

// Function AthenaBroadcastHUDMenuStatusLayer.AthenaBroadcastHUDMenuStatusLayer_C.ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer
// 0x0028 (0x0028 - 0x0000)
struct AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaBroadcastHUDMenuStatusBase*      K2Node_Event_HUDMenuStatusWidget_1;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaBroadcastHUDMenuStatusBase*      K2Node_Event_HUDMenuStatusWidget;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActorCanvasSlot*                   CallFunc_AddActorIndicator_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer) == 0x000008, "Wrong alignment on AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer");
static_assert(sizeof(AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer) == 0x000028, "Wrong size on AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer");
static_assert(offsetof(AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer, EntryPoint) == 0x000000, "Member 'AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer, K2Node_Event_HUDMenuStatusWidget_1) == 0x000008, "Member 'AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer::K2Node_Event_HUDMenuStatusWidget_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer, K2Node_Event_HUDMenuStatusWidget) == 0x000010, "Member 'AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer::K2Node_Event_HUDMenuStatusWidget' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer, CallFunc_RemoveChild_ReturnValue) == 0x000018, "Member 'AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer, CallFunc_AddActorIndicator_ReturnValue) == 0x000020, "Member 'AthenaBroadcastHUDMenuStatusLayer_C_ExecuteUbergraph_AthenaBroadcastHUDMenuStatusLayer::CallFunc_AddActorIndicator_ReturnValue' has a wrong offset!");

// Function AthenaBroadcastHUDMenuStatusLayer.AthenaBroadcastHUDMenuStatusLayer_C.RemoveHUDMenuStatus
// 0x0008 (0x0008 - 0x0000)
struct AthenaBroadcastHUDMenuStatusLayer_C_RemoveHUDMenuStatus final
{
public:
	class UAthenaBroadcastHUDMenuStatusBase*      HUDMenuStatusWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastHUDMenuStatusLayer_C_RemoveHUDMenuStatus) == 0x000008, "Wrong alignment on AthenaBroadcastHUDMenuStatusLayer_C_RemoveHUDMenuStatus");
static_assert(sizeof(AthenaBroadcastHUDMenuStatusLayer_C_RemoveHUDMenuStatus) == 0x000008, "Wrong size on AthenaBroadcastHUDMenuStatusLayer_C_RemoveHUDMenuStatus");
static_assert(offsetof(AthenaBroadcastHUDMenuStatusLayer_C_RemoveHUDMenuStatus, HUDMenuStatusWidget) == 0x000000, "Member 'AthenaBroadcastHUDMenuStatusLayer_C_RemoveHUDMenuStatus::HUDMenuStatusWidget' has a wrong offset!");

}

