#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_VehicleSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Athena_VehicleSpawner.Athena_VehicleSpawner_C.ExecuteUbergraph_Athena_VehicleSpawner
// 0x02B0 (0x02B0 - 0x0000)
struct Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0070(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAthenaVehiclesEnabled_ReturnValue;     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameModeAthena*                    K2Node_DynamicCast_AsFort_Game_Mode_Athena;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetVehicleClass_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     CallFunc_GetVehicleClassOverride_ReturnValue;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Option_B___If_false__use_Option_A_Variable; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0140(0x0060)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x01A0(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0xF];                                      // 0x0201(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select_Default_1;                           // 0x0210(0x0060)(IsPlainOldData, NoDestructor)
	class AFortAthenaVehicle*                     K2Node_Event_Vehicle;                              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     CallFunc_SpawnVehicleWithConstruction_ReturnValue; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_TryConstructWithModServer_self_CastInput; // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetForceSpawnAlways_ReturnValue;          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_SetForcedToAlwaysSpawn_self_CastInput;    // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner) == 0x000010, "Wrong alignment on Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner");
static_assert(sizeof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner) == 0x0002B0, "Wrong size on Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, EntryPoint) == 0x000000, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetTransform_ReturnValue_1) == 0x000070, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetGameMode_ReturnValue) == 0x0000D0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_AreAthenaVehiclesEnabled_ReturnValue) == 0x0000D8, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_AreAthenaVehiclesEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_DynamicCast_AsFort_Game_Mode_Athena) == 0x0000E0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_DynamicCast_AsFort_Game_Mode_Athena' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x0000E9, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x0000F0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x0000F8, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000100, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, Temp_bool_Variable) == 0x000104, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetVehicleClass_ReturnValue) == 0x000108, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetVehicleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_ClassDynamicCast_AsActor) == 0x000110, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_ClassDynamicCast_bSuccess) == 0x000118, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetVehicleClassOverride_ReturnValue) == 0x000120, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetVehicleClassOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, Temp_bool_Option_B___If_false__use_Option_A_Variable) == 0x000128, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::Temp_bool_Option_B___If_false__use_Option_A_Variable' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_IsValidClass_ReturnValue) == 0x000129, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_Select_Default) == 0x000130, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_HasAuthority_ReturnValue) == 0x000138, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_MakeTransform_ReturnValue) == 0x000140, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_ComposeTransforms_ReturnValue) == 0x0001A0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, Temp_bool_Variable_1) == 0x000200, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_Select_Default_1) == 0x000210, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_Event_Vehicle) == 0x000270, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_Event_Vehicle' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_SpawnVehicleWithConstruction_ReturnValue) == 0x000278, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_SpawnVehicleWithConstruction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_TryConstructWithModServer_self_CastInput) == 0x000280, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_TryConstructWithModServer_self_CastInput' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetForceSpawnAlways_ReturnValue) == 0x000290, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetForceSpawnAlways_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_SetForcedToAlwaysSpawn_self_CastInput) == 0x000298, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_SetForcedToAlwaysSpawn_self_CastInput' has a wrong offset!");

// Function Athena_VehicleSpawner.Athena_VehicleSpawner_C.OnConstructVehicle
// 0x0008 (0x0008 - 0x0000)
struct Athena_VehicleSpawner_C_OnConstructVehicle final
{
public:
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_VehicleSpawner_C_OnConstructVehicle) == 0x000008, "Wrong alignment on Athena_VehicleSpawner_C_OnConstructVehicle");
static_assert(sizeof(Athena_VehicleSpawner_C_OnConstructVehicle) == 0x000008, "Wrong size on Athena_VehicleSpawner_C_OnConstructVehicle");
static_assert(offsetof(Athena_VehicleSpawner_C_OnConstructVehicle, Vehicle) == 0x000000, "Member 'Athena_VehicleSpawner_C_OnConstructVehicle::Vehicle' has a wrong offset!");

}

