#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchStatusTextPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchStatusTextPlayer.AthenaMatchStatusTextPlayer_C
// 0x00D0 (0x0388 - 0x02B8)
class UAthenaMatchStatusTextPlayer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TopPlayerDead;                                     // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewTopPlayer;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LensFlare1;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LensFlare2;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LensFlare3;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LensFlare4;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Strikethrough;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x0300(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateColor                            Color;                                             // 0x0350(0x0014)(Edit, BlueprintVisible)
	bool                                          ShowMaterialHighlight;                             // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      HighlightMaterial;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TextToDisplay;                                     // 0x0370(0x0018)(Edit, BlueprintVisible)

public:
	void ApplyNewText();
	void ApplyText();
	void ExecuteUbergraph_AthenaMatchStatusTextPlayer(int32 EntryPoint);
	void GetFont(struct FSlateFontInfo* Output);
	void HighlightMaterialControl();
	void HighlightMaterialOff();
	void HighlightMaterialOn();
	void PreConstruct(bool IsDesignTime);
	void SetFont(const struct FSlateFontInfo& FontIn);
	void SetOpacityAndColor(const struct FSlateColor& ColorIn);
	void SetText(const class FText& InText, bool ApplyImmediately);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchStatusTextPlayer_C">();
	}
	static class UAthenaMatchStatusTextPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchStatusTextPlayer_C>();
	}
};
static_assert(alignof(UAthenaMatchStatusTextPlayer_C) == 0x000008, "Wrong alignment on UAthenaMatchStatusTextPlayer_C");
static_assert(sizeof(UAthenaMatchStatusTextPlayer_C) == 0x000388, "Wrong size on UAthenaMatchStatusTextPlayer_C");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, UberGraphFrame) == 0x0002B8, "Member 'UAthenaMatchStatusTextPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, TopPlayerDead) == 0x0002C0, "Member 'UAthenaMatchStatusTextPlayer_C::TopPlayerDead' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, NewTopPlayer) == 0x0002C8, "Member 'UAthenaMatchStatusTextPlayer_C::NewTopPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, LensFlare1) == 0x0002D0, "Member 'UAthenaMatchStatusTextPlayer_C::LensFlare1' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, LensFlare2) == 0x0002D8, "Member 'UAthenaMatchStatusTextPlayer_C::LensFlare2' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, LensFlare3) == 0x0002E0, "Member 'UAthenaMatchStatusTextPlayer_C::LensFlare3' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, LensFlare4) == 0x0002E8, "Member 'UAthenaMatchStatusTextPlayer_C::LensFlare4' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, Strikethrough) == 0x0002F0, "Member 'UAthenaMatchStatusTextPlayer_C::Strikethrough' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, TextBlock) == 0x0002F8, "Member 'UAthenaMatchStatusTextPlayer_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, Font) == 0x000300, "Member 'UAthenaMatchStatusTextPlayer_C::Font' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, Color) == 0x000350, "Member 'UAthenaMatchStatusTextPlayer_C::Color' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, ShowMaterialHighlight) == 0x000364, "Member 'UAthenaMatchStatusTextPlayer_C::ShowMaterialHighlight' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, HighlightMaterial) == 0x000368, "Member 'UAthenaMatchStatusTextPlayer_C::HighlightMaterial' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatusTextPlayer_C, TextToDisplay) == 0x000370, "Member 'UAthenaMatchStatusTextPlayer_C::TextToDisplay' has a wrong offset!");

}

