#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_OldMap_Dyn_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Athena_OldMap_Dyn_AnimBP.Athena_OldMap_Dyn_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_13;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_14;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_15;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_13) == 0x000004, "Member 'Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_13' has a wrong offset!");
static_assert(offsetof(Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_14) == 0x000008, "Member 'Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_14' has a wrong offset!");
static_assert(offsetof(Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_15) == 0x000010, "Member 'Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_15' has a wrong offset!");
static_assert(offsetof(Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'Athena_OldMap_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

