#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaReplayActionFeedRow

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaReplayActionFeedRow.AthenaReplayActionFeedRow_C.ExecuteUbergraph_AthenaReplayActionFeedRow
// 0x0058 (0x0058 - 0x0000)
struct AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_VictimName;                           // 0x0008(0x0018)(ConstParm)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InstigatorName;                       // 0x0030(0x0018)(ConstParm)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button_1;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow) == 0x000008, "Wrong alignment on AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow");
static_assert(sizeof(AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow) == 0x000058, "Wrong size on AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow");
static_assert(offsetof(AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow, EntryPoint) == 0x000000, "Member 'AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow, K2Node_Event_VictimName) == 0x000008, "Member 'AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow::K2Node_Event_VictimName' has a wrong offset!");
static_assert(offsetof(AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000020, "Member 'AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow, K2Node_Event_InstigatorName) == 0x000030, "Member 'AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow::K2Node_Event_InstigatorName' has a wrong offset!");
static_assert(offsetof(AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow, K2Node_DynamicCast_AsIcon_Text_Button_1) == 0x000048, "Member 'AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow::K2Node_DynamicCast_AsIcon_Text_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'AthenaReplayActionFeedRow_C_ExecuteUbergraph_AthenaReplayActionFeedRow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AthenaReplayActionFeedRow.AthenaReplayActionFeedRow_C.OnInstigatorNameUpdated
// 0x0018 (0x0018 - 0x0000)
struct AthenaReplayActionFeedRow_C_OnInstigatorNameUpdated final
{
public:
	class FText                                   InstigatorName;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaReplayActionFeedRow_C_OnInstigatorNameUpdated) == 0x000008, "Wrong alignment on AthenaReplayActionFeedRow_C_OnInstigatorNameUpdated");
static_assert(sizeof(AthenaReplayActionFeedRow_C_OnInstigatorNameUpdated) == 0x000018, "Wrong size on AthenaReplayActionFeedRow_C_OnInstigatorNameUpdated");
static_assert(offsetof(AthenaReplayActionFeedRow_C_OnInstigatorNameUpdated, InstigatorName) == 0x000000, "Member 'AthenaReplayActionFeedRow_C_OnInstigatorNameUpdated::InstigatorName' has a wrong offset!");

// Function AthenaReplayActionFeedRow.AthenaReplayActionFeedRow_C.OnVictimNameUpdated
// 0x0018 (0x0018 - 0x0000)
struct AthenaReplayActionFeedRow_C_OnVictimNameUpdated final
{
public:
	class FText                                   VictimName;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaReplayActionFeedRow_C_OnVictimNameUpdated) == 0x000008, "Wrong alignment on AthenaReplayActionFeedRow_C_OnVictimNameUpdated");
static_assert(sizeof(AthenaReplayActionFeedRow_C_OnVictimNameUpdated) == 0x000018, "Wrong size on AthenaReplayActionFeedRow_C_OnVictimNameUpdated");
static_assert(offsetof(AthenaReplayActionFeedRow_C_OnVictimNameUpdated, VictimName) == 0x000000, "Member 'AthenaReplayActionFeedRow_C_OnVictimNameUpdated::VictimName' has a wrong offset!");

}

