#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_VehicleSpawner

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_VehicleSpawner.Athena_VehicleSpawner_C
// 0x0038 (0x0300 - 0x02C8)
class AAthena_VehicleSpawner_C : public AFortAthenaVehicleSpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 SpawnedVehicle;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          YAxisForward;                                      // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldDestroyAfterVehicleSpawn;                   // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ForceMods;                                         // 0x02E0(0x0020)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_Athena_VehicleSpawner(int32 EntryPoint);
	void OnConstructVehicle(class AFortAthenaVehicle* Vehicle);
	void SpawnVehicle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_VehicleSpawner_C">();
	}
	static class AAthena_VehicleSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_VehicleSpawner_C>();
	}
};
static_assert(alignof(AAthena_VehicleSpawner_C) == 0x000008, "Wrong alignment on AAthena_VehicleSpawner_C");
static_assert(sizeof(AAthena_VehicleSpawner_C) == 0x000300, "Wrong size on AAthena_VehicleSpawner_C");
static_assert(offsetof(AAthena_VehicleSpawner_C, UberGraphFrame) == 0x0002C8, "Member 'AAthena_VehicleSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_VehicleSpawner_C, SpawnedVehicle) == 0x0002D0, "Member 'AAthena_VehicleSpawner_C::SpawnedVehicle' has a wrong offset!");
static_assert(offsetof(AAthena_VehicleSpawner_C, YAxisForward) == 0x0002D8, "Member 'AAthena_VehicleSpawner_C::YAxisForward' has a wrong offset!");
static_assert(offsetof(AAthena_VehicleSpawner_C, bShouldDestroyAfterVehicleSpawn) == 0x0002D9, "Member 'AAthena_VehicleSpawner_C::bShouldDestroyAfterVehicleSpawn' has a wrong offset!");
static_assert(offsetof(AAthena_VehicleSpawner_C, ForceMods) == 0x0002E0, "Member 'AAthena_VehicleSpawner_C::ForceMods' has a wrong offset!");

}

