#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQTE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaQTE.AthenaQTE_C
// 0x0018 (0x0338 - 0x0320)
class UAthenaQTE_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaInterrogation_C*                 AthenaInterrogation;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_QTEType;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaQTE(int32 EntryPoint);
	void OnQuickTimeEventWidgetStarted(float Duration, float SweetSpot, float PerfectTolerance, float GreatTolerance, float GoodTolerance);
	void OnQuickTimeEventWidgetStopped();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQTE_C">();
	}
	static class UAthenaQTE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQTE_C>();
	}
};
static_assert(alignof(UAthenaQTE_C) == 0x000008, "Wrong alignment on UAthenaQTE_C");
static_assert(sizeof(UAthenaQTE_C) == 0x000338, "Wrong size on UAthenaQTE_C");
static_assert(offsetof(UAthenaQTE_C, UberGraphFrame) == 0x000320, "Member 'UAthenaQTE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaQTE_C, AthenaInterrogation) == 0x000328, "Member 'UAthenaQTE_C::AthenaInterrogation' has a wrong offset!");
static_assert(offsetof(UAthenaQTE_C, Switcher_QTEType) == 0x000330, "Member 'UAthenaQTE_C::Switcher_QTEType' has a wrong offset!");

}

