#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorRebootWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaSpectatorRebootWidget.AthenaSpectatorRebootWidget_C.ExecuteUbergraph_AthenaSpectatorRebootWidget
// 0x00C8 (0x00C8 - 0x0000)
struct AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActorComponent_MultiInteract*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InteractingActorCount, float MultiInteractMultiplier, float InteractingDuration)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemainingResurrectionChipExpirationTime_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0030(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_CustomEvent_PlayerController;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnableLoadScreen;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_HUDReasonText;                  // 0x0078(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InteractingActorCount;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MultiInteractMultiplier;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InteractingDuration;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x00B4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMultiplier_ReturnValue;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInteractionDuration_ReturnValue;       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget) == 0x000008, "Wrong alignment on AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget");
static_assert(sizeof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget) == 0x0000C8, "Wrong size on AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, EntryPoint) == 0x000000, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_GetRemainingResurrectionChipExpirationTime_ReturnValue) == 0x000028, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_GetRemainingResurrectionChipExpirationTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_TextToUpper_ReturnValue) == 0x000030, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000050, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, Temp_bool_Variable) == 0x000051, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000054, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_CustomEvent_PlayerController) == 0x000068, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_CustomEvent_bEnableLoadScreen) == 0x000070, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_CustomEvent_bEnableLoadScreen' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_CustomEvent_HUDReasonText) == 0x000078, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_CustomEvent_HUDReasonText' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000090, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_CustomEvent_InteractingActorCount) == 0x000098, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_CustomEvent_InteractingActorCount' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_CustomEvent_MultiInteractMultiplier) == 0x00009C, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_CustomEvent_MultiInteractMultiplier' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_CustomEvent_InteractingDuration) == 0x0000A0, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_CustomEvent_InteractingDuration' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_GetEndTime_ReturnValue) == 0x0000A4, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000A8, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B0, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, Temp_float_Variable) == 0x0000B4, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, K2Node_Select_Default) == 0x0000B8, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000BC, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000BD, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_GetMultiplier_ReturnValue) == 0x0000C0, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_GetMultiplier_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget, CallFunc_GetInteractionDuration_ReturnValue) == 0x0000C4, "Member 'AthenaSpectatorRebootWidget_C_ExecuteUbergraph_AthenaSpectatorRebootWidget::CallFunc_GetInteractionDuration_ReturnValue' has a wrong offset!");

// Function AthenaSpectatorRebootWidget.AthenaSpectatorRebootWidget_C.HandleOnLoadScreenChanged
// 0x0028 (0x0028 - 0x0000)
struct AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged final
{
public:
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableLoadScreen;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HUDReasonText;                                     // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged) == 0x000008, "Wrong alignment on AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged");
static_assert(sizeof(AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged) == 0x000028, "Wrong size on AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged, PlayerController) == 0x000000, "Member 'AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged::PlayerController' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged, bEnableLoadScreen) == 0x000008, "Member 'AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged::bEnableLoadScreen' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged, HUDReasonText) == 0x000010, "Member 'AthenaSpectatorRebootWidget_C_HandleOnLoadScreenChanged::HUDReasonText' has a wrong offset!");

// Function AthenaSpectatorRebootWidget.AthenaSpectatorRebootWidget_C.HandleOnResurrectionStateChanged
// 0x0058 (0x0058 - 0x0000)
struct AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResurrectingNow_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeResurrected_ReturnValue;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResurrectionChipAvailable_ReturnValue;  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue;         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0010(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0040(0x0018)()
};
static_assert(alignof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged) == 0x000008, "Wrong alignment on AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged");
static_assert(sizeof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged) == 0x000058, "Wrong size on AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_IsResurrectingNow_ReturnValue) == 0x000002, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_IsResurrectingNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_CanBeResurrected_ReturnValue) == 0x000003, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_CanBeResurrected_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_IsResurrectionChipAvailable_ReturnValue) == 0x000005, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_IsResurrectionChipAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_GetSpawnMachineState_ReturnValue) == 0x000007, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_GetSpawnMachineState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000009, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_BooleanAND_ReturnValue_1) == 0x00000B, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000C, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_TextToUpper_ReturnValue) == 0x000010, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged, CallFunc_TextToUpper_ReturnValue_1) == 0x000040, "Member 'AthenaSpectatorRebootWidget_C_HandleOnResurrectionStateChanged::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");

// Function AthenaSpectatorRebootWidget.AthenaSpectatorRebootWidget_C.HandleRebootActorChanged
// 0x000C (0x000C - 0x0000)
struct AthenaSpectatorRebootWidget_C_HandleRebootActorChanged final
{
public:
	int32                                         InteractingActorCount;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MultiInteractMultiplier;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InteractingDuration;                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorRebootWidget_C_HandleRebootActorChanged) == 0x000004, "Wrong alignment on AthenaSpectatorRebootWidget_C_HandleRebootActorChanged");
static_assert(sizeof(AthenaSpectatorRebootWidget_C_HandleRebootActorChanged) == 0x00000C, "Wrong size on AthenaSpectatorRebootWidget_C_HandleRebootActorChanged");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleRebootActorChanged, InteractingActorCount) == 0x000000, "Member 'AthenaSpectatorRebootWidget_C_HandleRebootActorChanged::InteractingActorCount' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleRebootActorChanged, MultiInteractMultiplier) == 0x000004, "Member 'AthenaSpectatorRebootWidget_C_HandleRebootActorChanged::MultiInteractMultiplier' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_HandleRebootActorChanged, InteractingDuration) == 0x000008, "Member 'AthenaSpectatorRebootWidget_C_HandleRebootActorChanged::InteractingDuration' has a wrong offset!");

// Function AthenaSpectatorRebootWidget.AthenaSpectatorRebootWidget_C.PlayRebootAnimation
// 0x0020 (0x0020 - 0x0000)
struct AthenaSpectatorRebootWidget_C_PlayRebootAnimation final
{
public:
	float                                         PlayMultiplier;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartDuration;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorRebootWidget_C_PlayRebootAnimation) == 0x000008, "Wrong alignment on AthenaSpectatorRebootWidget_C_PlayRebootAnimation");
static_assert(sizeof(AthenaSpectatorRebootWidget_C_PlayRebootAnimation) == 0x000020, "Wrong size on AthenaSpectatorRebootWidget_C_PlayRebootAnimation");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_PlayRebootAnimation, PlayMultiplier) == 0x000000, "Member 'AthenaSpectatorRebootWidget_C_PlayRebootAnimation::PlayMultiplier' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorRebootWidget_C_PlayRebootAnimation, StartDuration) == 0x000004, "Member 'AthenaSpectatorRebootWidget_C_PlayRebootAnimation::StartDuration' has a wrong offset!");
