#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDBoundActionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHUDBoundActionButton.AthenaHUDBoundActionButton_C
// 0x0030 (0x1050 - 0x1020)
class UAthenaHUDBoundActionButton_C final : public UFortBoundActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1020(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ContentBorder;                                     // 0x1028(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              InputActionIconScale;                              // 0x1030(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         MobileButtonStyle;                                 // 0x1038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonButtonStyle>         PCandConsoleButtonStyle;                           // 0x1040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaHUDBoundActionButton(int32 EntryPoint);
	void UpdateInputActionIconSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHUDBoundActionButton_C">();
	}
	static class UAthenaHUDBoundActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDBoundActionButton_C>();
	}
};
static_assert(alignof(UAthenaHUDBoundActionButton_C) == 0x000010, "Wrong alignment on UAthenaHUDBoundActionButton_C");
static_assert(sizeof(UAthenaHUDBoundActionButton_C) == 0x001050, "Wrong size on UAthenaHUDBoundActionButton_C");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, UberGraphFrame) == 0x001020, "Member 'UAthenaHUDBoundActionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, ContentBorder) == 0x001028, "Member 'UAthenaHUDBoundActionButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, InputActionIconScale) == 0x001030, "Member 'UAthenaHUDBoundActionButton_C::InputActionIconScale' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, MobileButtonStyle) == 0x001038, "Member 'UAthenaHUDBoundActionButton_C::MobileButtonStyle' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBoundActionButton_C, PCandConsoleButtonStyle) == 0x001040, "Member 'UAthenaHUDBoundActionButton_C::PCandConsoleButtonStyle' has a wrong offset!");

}

