#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastSquadStatusTG

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.ExecuteUbergraph_AthenaBroadcastSquadStatusTG
// 0x00F0 (0x00F0 - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRemoteSquadViewData*             K2Node_Event_InSquadData_1;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0038(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaBroadcastPlayerStatusTG_C*       K2Node_DynamicCast_AsAthena_Broadcast_Player_Status_TG; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPipModeEnabled;                      // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UFortMinigameTeamIdentification*  K2Node_Event_MinigameTeamId;                       // 0x0090(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue_1;              // 0x00A0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaBroadcastPlayerStatusTG_C*       K2Node_DynamicCast_AsAthena_Broadcast_Player_Status_TG_1; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortMinigameTeamIdentification*  K2Node_CustomEvent_MinigameTeamId;                 // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemoteSquadViewData*             K2Node_Event_InSquadData;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InSquadSessionRank;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisplay;                             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG) == 0x000008, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG) == 0x0000F0, "Wrong size on AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, EntryPoint) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_float_Variable) == 0x000004, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_float_Variable_1) == 0x000008, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_bool_Variable) == 0x000010, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Event_InSquadData_1) == 0x000020, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Event_InSquadData_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Event_InPlayerData) == 0x000028, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Event_InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Event_IsDesignTime) == 0x000030, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_GetAllEntries_ReturnValue) == 0x000038, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_int_Loop_Counter_Variable_1) == 0x000048, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_Array_Get_Item) == 0x000050, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_DynamicCast_AsAthena_Broadcast_Player_Status_TG) == 0x000058, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_DynamicCast_AsAthena_Broadcast_Player_Status_TG' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_byte_Variable) == 0x00006D, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Event_bPipModeEnabled) == 0x00006E, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Event_bPipModeEnabled' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000070, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Select_Default) == 0x000078, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_byte_Variable_1) == 0x00007C, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_MakeStruct_Margin) == 0x000080, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Event_MinigameTeamId) == 0x000090, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Event_MinigameTeamId' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, Temp_bool_Variable_1) == 0x000098, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_GetAllEntries_ReturnValue_1) == 0x0000A0, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_GetAllEntries_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Select_Default_1) == 0x0000B0, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_DynamicCast_AsAthena_Broadcast_Player_Status_TG_1) == 0x0000C0, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_DynamicCast_AsAthena_Broadcast_Player_Status_TG_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_Array_Length_ReturnValue_1) == 0x0000CC, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_CustomEvent_MinigameTeamId) == 0x0000D0, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_CustomEvent_MinigameTeamId' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D8, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Event_InSquadData) == 0x0000E0, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Event_InSquadData' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Event_InSquadSessionRank) == 0x0000E8, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Event_InSquadSessionRank' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG, K2Node_Event_bDisplay) == 0x0000EC, "Member 'AthenaBroadcastSquadStatusTG_C_ExecuteUbergraph_AthenaBroadcastSquadStatusTG::K2Node_Event_bDisplay' has a wrong offset!");

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.HandleDisplaySessionRankChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_HandleDisplaySessionRankChanged final
{
public:
	bool                                          bDisplay;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_HandleDisplaySessionRankChanged) == 0x000001, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_HandleDisplaySessionRankChanged");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_HandleDisplaySessionRankChanged) == 0x000001, "Wrong size on AthenaBroadcastSquadStatusTG_C_HandleDisplaySessionRankChanged");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_HandleDisplaySessionRankChanged, bDisplay) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_HandleDisplaySessionRankChanged::bDisplay' has a wrong offset!");

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.OnMinigameTeamIdChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_OnMinigameTeamIdChanged final
{
public:
	const class UFortMinigameTeamIdentification*  MinigameTeamId;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_OnMinigameTeamIdChanged) == 0x000008, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_OnMinigameTeamIdChanged");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_OnMinigameTeamIdChanged) == 0x000008, "Wrong size on AthenaBroadcastSquadStatusTG_C_OnMinigameTeamIdChanged");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_OnMinigameTeamIdChanged, MinigameTeamId) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_OnMinigameTeamIdChanged::MinigameTeamId' has a wrong offset!");

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.OnPipModeChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_OnPipModeChanged final
{
public:
	bool                                          bPipModeEnabled_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_OnPipModeChanged) == 0x000001, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_OnPipModeChanged");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_OnPipModeChanged) == 0x000001, "Wrong size on AthenaBroadcastSquadStatusTG_C_OnPipModeChanged");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_OnPipModeChanged, bPipModeEnabled_0) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_OnPipModeChanged::bPipModeEnabled_0' has a wrong offset!");

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.OnPlayerAdded
// 0x0010 (0x0010 - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_OnPlayerAdded final
{
public:
	class UAthenaRemoteSquadViewData*             InSquadData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_OnPlayerAdded) == 0x000008, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_OnPlayerAdded");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_OnPlayerAdded) == 0x000010, "Wrong size on AthenaBroadcastSquadStatusTG_C_OnPlayerAdded");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_OnPlayerAdded, InSquadData) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_OnPlayerAdded::InSquadData' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_OnPlayerAdded, InPlayerData) == 0x000008, "Member 'AthenaBroadcastSquadStatusTG_C_OnPlayerAdded::InPlayerData' has a wrong offset!");

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.OnSquadSessionRankChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_OnSquadSessionRankChanged final
{
public:
	class UAthenaRemoteSquadViewData*             InSquadData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSquadSessionRank;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_OnSquadSessionRankChanged) == 0x000008, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_OnSquadSessionRankChanged");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_OnSquadSessionRankChanged) == 0x000010, "Wrong size on AthenaBroadcastSquadStatusTG_C_OnSquadSessionRankChanged");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_OnSquadSessionRankChanged, InSquadData) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_OnSquadSessionRankChanged::InSquadData' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_OnSquadSessionRankChanged, InSquadSessionRank) == 0x000008, "Member 'AthenaBroadcastSquadStatusTG_C_OnSquadSessionRankChanged::InSquadSessionRank' has a wrong offset!");

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_PreConstruct");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_PreConstruct) == 0x000001, "Wrong size on AthenaBroadcastSquadStatusTG_C_PreConstruct");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.RebuildSquad
// 0x0090 (0x0090 - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_RebuildSquad final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortMinigameTeamIdentification*  CallFunc_GetMinigameTeamId_ReturnValue;            // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaRemotePlayerViewData*>    CallFunc_GetPlayerDatas_ReturnValue;               // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemotePlayerViewData*            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 CallFunc_GetPlayerState_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetPlayerUniqueNetID_ReturnValue;         // 0x0048(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaBroadcastPlayerStatusTG_C*       K2Node_DynamicCast_AsAthena_Broadcast_Player_Status_TG; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_RebuildSquad) == 0x000008, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_RebuildSquad");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_RebuildSquad) == 0x000090, "Wrong size on AthenaBroadcastSquadStatusTG_C_RebuildSquad");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_GetMinigameTeamId_ReturnValue) == 0x000010, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_GetMinigameTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_GetPlayerDatas_ReturnValue) == 0x000018, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_GetPlayerDatas_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_Array_Get_Item) == 0x000030, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_GetPlayerState_ReturnValue) == 0x000038, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_IsValid_ReturnValue_1) == 0x000044, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_GetPlayerUniqueNetID_ReturnValue) == 0x000048, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_GetPlayerUniqueNetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue) == 0x000070, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, CallFunc_BP_CreateEntry_ReturnValue) == 0x000078, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::CallFunc_BP_CreateEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, K2Node_DynamicCast_AsAthena_Broadcast_Player_Status_TG) == 0x000080, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::K2Node_DynamicCast_AsAthena_Broadcast_Player_Status_TG' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_RebuildSquad, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'AthenaBroadcastSquadStatusTG_C_RebuildSquad::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.UpdateFromMinigameTeamId
// 0x0008 (0x0008 - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_UpdateFromMinigameTeamId final
{
public:
	const class UFortMinigameTeamIdentification*  MinigameTeamId;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_UpdateFromMinigameTeamId) == 0x000008, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_UpdateFromMinigameTeamId");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_UpdateFromMinigameTeamId) == 0x000008, "Wrong size on AthenaBroadcastSquadStatusTG_C_UpdateFromMinigameTeamId");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_UpdateFromMinigameTeamId, MinigameTeamId) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_UpdateFromMinigameTeamId::MinigameTeamId' has a wrong offset!");

// Function AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C.UpdateTeamTagVisibility
// 0x000C (0x000C - 0x0000)
struct AthenaBroadcastSquadStatusTG_C_UpdateTeamTagVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumEntries_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastSquadStatusTG_C_UpdateTeamTagVisibility) == 0x000004, "Wrong alignment on AthenaBroadcastSquadStatusTG_C_UpdateTeamTagVisibility");
static_assert(sizeof(AthenaBroadcastSquadStatusTG_C_UpdateTeamTagVisibility) == 0x00000C, "Wrong size on AthenaBroadcastSquadStatusTG_C_UpdateTeamTagVisibility");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_UpdateTeamTagVisibility, Temp_bool_Variable) == 0x000000, "Member 'AthenaBroadcastSquadStatusTG_C_UpdateTeamTagVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastSquadStatusTG_C_UpdateTeamTagVisibility, Temp_byte_Variable) == 0x000001, "Member 'AthenaBroadcastSquadStatusTG_C_UpdateTeamTagVisibility::Temp_byte_Variable' has a wrong offset!");
