#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcasterMapSettings

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcasterMapSettings_C_BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on AthenaBroadcasterMapSettings_C_BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on AthenaBroadcasterMapSettings_C_BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcasterMapSettings_C_BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on AthenaBroadcasterMapSettings_C_BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on AthenaBroadcasterMapSettings_C_BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcasterMapSettings_C_BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on AthenaBroadcasterMapSettings_C_BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on AthenaBroadcasterMapSettings_C_BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcasterMapSettings_C_BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on AthenaBroadcasterMapSettings_C_BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on AthenaBroadcasterMapSettings_C_BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcasterMapSettings_C_BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on AthenaBroadcasterMapSettings_C_BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on AthenaBroadcasterMapSettings_C_BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.BP_HandleMapIconAdded
// 0x0008 (0x0008 - 0x0000)
struct AthenaBroadcasterMapSettings_C_BP_HandleMapIconAdded final
{
public:
	class UFortSpectateClickableMapIcon*          MapIcon;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_BP_HandleMapIconAdded) == 0x000008, "Wrong alignment on AthenaBroadcasterMapSettings_C_BP_HandleMapIconAdded");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_BP_HandleMapIconAdded) == 0x000008, "Wrong size on AthenaBroadcasterMapSettings_C_BP_HandleMapIconAdded");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_BP_HandleMapIconAdded, MapIcon) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_BP_HandleMapIconAdded::MapIcon' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.ExecuteUbergraph_AthenaBroadcasterMapSettings
// 0x0168 (0x0168 - 0x0000)
struct AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_3;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Slider_Value;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_2;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0030(0x0010)(ReferenceParm)
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_2;                          // 0x0050(0x0010)(ReferenceParm)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_1;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_3;                          // 0x0068(0x0010)(ReferenceParm)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating_1; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating_2; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating_3; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating_4; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSpectateClickableMapIcon*          K2Node_Event_MapIcon;                              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxMapZoomLevel_ReturnValue;           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_5;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButtonReplay_C*                CallFunc_Create_ReturnValue;                       // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButtonLegacy* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x014C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings) == 0x000008, "Wrong alignment on AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings) == 0x000168, "Wrong size on AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, EntryPoint) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, Temp_bool_Variable) == 0x000004, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_Event_IsDesignTime) == 0x000005, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_MakeArray_Array) == 0x000008, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_ComponentBoundEvent_Selected_Index_3) == 0x000018, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_ComponentBoundEvent_Selected_Index_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_ComponentBoundEvent_Slider_Value) == 0x000020, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_ComponentBoundEvent_Slider_Value' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_ComponentBoundEvent_Selected_Index_2) == 0x000028, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_ComponentBoundEvent_Selected_Index_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00002C, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_MakeArray_Array_1) == 0x000030, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_AsRotator_Selector_Replay_Settings) == 0x000040, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_AsRotator_Selector_Replay_Settings' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_MakeArray_Array_2) == 0x000050, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_ComponentBoundEvent_Selected_Index_1) == 0x000060, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_ComponentBoundEvent_Selected_Index_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000064, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_MakeArray_Array_3) == 0x000068, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_ComponentBoundEvent_Selected_Index) == 0x000078, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_ComponentBoundEvent_Selected_Index' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_Greater_IntInt_ReturnValue_3) == 0x00007C, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, Temp_float_Variable) == 0x000088, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_AsFort_Player_Controller_Spectating) == 0x000090, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_AsFort_Player_Controller_Spectating' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000A0, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0000A8, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_AsFort_Player_Controller_Spectating_1) == 0x0000B0, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_AsFort_Player_Controller_Spectating_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_AsFort_Player_Controller_Spectating_2) == 0x0000C0, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_AsFort_Player_Controller_Spectating_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x0000D0, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetOwningPlayer_ReturnValue_4) == 0x0000D8, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetOwningPlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_AsFort_Player_Controller_Spectating_3) == 0x0000E0, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_AsFort_Player_Controller_Spectating_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_bSuccess_4) == 0x0000E8, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_AsFort_Player_Controller_Spectating_4) == 0x0000F0, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_AsFort_Player_Controller_Spectating_4' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_DynamicCast_bSuccess_5) == 0x0000F8, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, Temp_bool_Variable_1) == 0x0000F9, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, Temp_byte_Variable) == 0x0000FA, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_Event_MapIcon) == 0x000100, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_Event_MapIcon' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetContext_ReturnValue) == 0x000108, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetOwner_ReturnValue) == 0x000110, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetMaxMapZoomLevel_ReturnValue) == 0x000118, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetMaxMapZoomLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetObjectClass_ReturnValue) == 0x000120, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_Add_FloatFloat_ReturnValue) == 0x000128, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_MapRangeClamped_ReturnValue) == 0x00012C, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_GetOwningPlayer_ReturnValue_5) == 0x000130, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_GetOwningPlayer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_Select_Default) == 0x000138, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_Create_ReturnValue) == 0x000140, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, Temp_byte_Variable_1) == 0x000148, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_CreateDelegate_OutputDelegate) == 0x00014C, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, K2Node_Select_Default_1) == 0x000158, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000160, "Member 'AthenaBroadcasterMapSettings_C_ExecuteUbergraph_AthenaBroadcasterMapSettings::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.Map Icon Added
// 0x0040 (0x0040 - 0x0000)
struct AthenaBroadcasterMapSettings_C_Map_Icon_Added final
{
public:
	class UFortSpectateClickableMapIcon*          Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonLegacy* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButtonReplay_C*                CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_Map_Icon_Added) == 0x000008, "Wrong alignment on AthenaBroadcasterMapSettings_C_Map_Icon_Added");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_Map_Icon_Added) == 0x000040, "Wrong size on AthenaBroadcasterMapSettings_C_Map_Icon_Added");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Map_Icon_Added, Icon) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_Map_Icon_Added::Icon' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Map_Icon_Added, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaBroadcasterMapSettings_C_Map_Icon_Added::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Map_Icon_Added, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AthenaBroadcasterMapSettings_C_Map_Icon_Added::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Map_Icon_Added, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'AthenaBroadcasterMapSettings_C_Map_Icon_Added::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Map_Icon_Added, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'AthenaBroadcasterMapSettings_C_Map_Icon_Added::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Map_Icon_Added, CallFunc_Create_ReturnValue) == 0x000030, "Member 'AthenaBroadcasterMapSettings_C_Map_Icon_Added::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Map_Icon_Added, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000038, "Member 'AthenaBroadcasterMapSettings_C_Map_Icon_Added::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.OnMapIconClicked
// 0x0030 (0x0030 - 0x0000)
struct AthenaBroadcasterMapSettings_C_OnMapIconClicked final
{
public:
	class UCommonButtonLegacy*                    ButtonClicked;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ToggleIconVisibility_ReturnValue;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_OnMapIconClicked) == 0x000008, "Wrong alignment on AthenaBroadcasterMapSettings_C_OnMapIconClicked");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_OnMapIconClicked) == 0x000030, "Wrong size on AthenaBroadcasterMapSettings_C_OnMapIconClicked");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_OnMapIconClicked, ButtonClicked) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_OnMapIconClicked::ButtonClicked' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_OnMapIconClicked, Temp_bool_Variable) == 0x000008, "Member 'AthenaBroadcasterMapSettings_C_OnMapIconClicked::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_OnMapIconClicked, Temp_float_Variable) == 0x00000C, "Member 'AthenaBroadcasterMapSettings_C_OnMapIconClicked::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_OnMapIconClicked, Temp_float_Variable_1) == 0x000010, "Member 'AthenaBroadcasterMapSettings_C_OnMapIconClicked::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_OnMapIconClicked, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'AthenaBroadcasterMapSettings_C_OnMapIconClicked::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_OnMapIconClicked, CallFunc_Map_Find_Value) == 0x000020, "Member 'AthenaBroadcasterMapSettings_C_OnMapIconClicked::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_OnMapIconClicked, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'AthenaBroadcasterMapSettings_C_OnMapIconClicked::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_OnMapIconClicked, CallFunc_ToggleIconVisibility_ReturnValue) == 0x000029, "Member 'AthenaBroadcasterMapSettings_C_OnMapIconClicked::CallFunc_ToggleIconVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_OnMapIconClicked, K2Node_Select_Default) == 0x00002C, "Member 'AthenaBroadcasterMapSettings_C_OnMapIconClicked::K2Node_Select_Default' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaBroadcasterMapSettings_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaBroadcasterMapSettings_C_PreConstruct");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_PreConstruct) == 0x000001, "Wrong size on AthenaBroadcasterMapSettings_C_PreConstruct");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C.Refresh Options
// 0x0080 (0x0080 - 0x0000)
struct AthenaBroadcasterMapSettings_C_Refresh_Options final
{
public:
	class AFortPlayerControllerSpectating*        SpectatorController;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxMapZoomLevel_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMapWeaponTracersEnabled_ReturnValue;   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowBusPathsOnMap_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowPlayersOnMap_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowVehiclesOnMap_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0068(0x0018)()
};
static_assert(alignof(AthenaBroadcasterMapSettings_C_Refresh_Options) == 0x000008, "Wrong alignment on AthenaBroadcasterMapSettings_C_Refresh_Options");
static_assert(sizeof(AthenaBroadcasterMapSettings_C_Refresh_Options) == 0x000080, "Wrong size on AthenaBroadcasterMapSettings_C_Refresh_Options");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Refresh_Options, SpectatorController) == 0x000000, "Member 'AthenaBroadcasterMapSettings_C_Refresh_Options::SpectatorController' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Refresh_Options, Temp_bool_Variable) == 0x000008, "Member 'AthenaBroadcasterMapSettings_C_Refresh_Options::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcasterMapSettings_C_Refresh_Options, Temp_byte_Variable) == 0x000009, "Member 'AthenaBroadcasterMapSettings_C_Refresh_Options::Temp_byte_Variable' has a wrong offset!");
