#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastPlayersRemaining

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaBroadcastPlayersRemaining.AthenaBroadcastPlayersRemaining_C.ExecuteUbergraph_AthenaBroadcastPlayersRemaining
// 0x01B8 (0x01B8 - 0x0000)
struct AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InTotalPlayers;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InPlayersLeft;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InTeamsLeft;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InTotalTeams;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MaxSquadSize;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue_1;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value;                           // 0x0050(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0080(0x0028)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_Select_Default_1;                           // 0x00C0(0x0050)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_Select_Default_2;                           // 0x0110(0x0050)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_Select_Default_4;                           // 0x0168(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining) == 0x000008, "Wrong alignment on AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining");
static_assert(sizeof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining) == 0x0001B8, "Wrong size on AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, EntryPoint) == 0x000000, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, Temp_bool_Variable) == 0x000004, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, Temp_bool_Variable_1) == 0x000005, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Event_IsDesignTime) == 0x000006, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Event_InTotalPlayers) == 0x000008, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Event_InTotalPlayers' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Event_InPlayersLeft) == 0x00000C, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Event_InPlayersLeft' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000015, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000018, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Greater_IntInt_ReturnValue_2) == 0x00001C, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001D, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, Temp_bool_Variable_2) == 0x00001E, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, Temp_bool_Variable_3) == 0x00001F, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Event_InTeamsLeft) == 0x000020, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Event_InTeamsLeft' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000024, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000028, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, Temp_byte_Variable) == 0x00002D, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Event_InTotalTeams) == 0x000030, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Event_InTotalTeams' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000034, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Greater_IntInt_ReturnValue_4) == 0x000038, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Event_MaxSquadSize) == 0x00003C, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Event_MaxSquadSize' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Greater_IntInt_ReturnValue_5) == 0x000040, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Greater_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Min_ReturnValue) == 0x000044, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Min_ReturnValue_1) == 0x000048, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Min_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, Temp_byte_Variable_1) == 0x00004C, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Map_Find_Value) == 0x000050, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Select_Default) == 0x000080, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000B0, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, Temp_bool_Variable_4) == 0x0000B8, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Select_Default_1) == 0x0000C0, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Select_Default_2) == 0x000110, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Select_Default_3) == 0x000160, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining, K2Node_Select_Default_4) == 0x000168, "Member 'AthenaBroadcastPlayersRemaining_C_ExecuteUbergraph_AthenaBroadcastPlayersRemaining::K2Node_Select_Default_4' has a wrong offset!");

// Function AthenaBroadcastPlayersRemaining.AthenaBroadcastPlayersRemaining_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaBroadcastPlayersRemaining_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastPlayersRemaining_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaBroadcastPlayersRemaining_C_PreConstruct");
static_assert(sizeof(AthenaBroadcastPlayersRemaining_C_PreConstruct) == 0x000001, "Wrong size on AthenaBroadcastPlayersRemaining_C_PreConstruct");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaBroadcastPlayersRemaining_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaBroadcastPlayersRemaining.AthenaBroadcastPlayersRemaining_C.UpdateMaxSquadSize
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcastPlayersRemaining_C_UpdateMaxSquadSize final
{
public:
	int32                                         MaxSquadSize;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastPlayersRemaining_C_UpdateMaxSquadSize) == 0x000004, "Wrong alignment on AthenaBroadcastPlayersRemaining_C_UpdateMaxSquadSize");
static_assert(sizeof(AthenaBroadcastPlayersRemaining_C_UpdateMaxSquadSize) == 0x000004, "Wrong size on AthenaBroadcastPlayersRemaining_C_UpdateMaxSquadSize");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_UpdateMaxSquadSize, MaxSquadSize) == 0x000000, "Member 'AthenaBroadcastPlayersRemaining_C_UpdateMaxSquadSize::MaxSquadSize' has a wrong offset!");

// Function AthenaBroadcastPlayersRemaining.AthenaBroadcastPlayersRemaining_C.UpdatePlayersLeft
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcastPlayersRemaining_C_UpdatePlayersLeft final
{
public:
	int32                                         InPlayersLeft;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastPlayersRemaining_C_UpdatePlayersLeft) == 0x000004, "Wrong alignment on AthenaBroadcastPlayersRemaining_C_UpdatePlayersLeft");
static_assert(sizeof(AthenaBroadcastPlayersRemaining_C_UpdatePlayersLeft) == 0x000004, "Wrong size on AthenaBroadcastPlayersRemaining_C_UpdatePlayersLeft");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_UpdatePlayersLeft, InPlayersLeft) == 0x000000, "Member 'AthenaBroadcastPlayersRemaining_C_UpdatePlayersLeft::InPlayersLeft' has a wrong offset!");

// Function AthenaBroadcastPlayersRemaining.AthenaBroadcastPlayersRemaining_C.UpdateTeamsLeft
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcastPlayersRemaining_C_UpdateTeamsLeft final
{
public:
	int32                                         InTeamsLeft;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastPlayersRemaining_C_UpdateTeamsLeft) == 0x000004, "Wrong alignment on AthenaBroadcastPlayersRemaining_C_UpdateTeamsLeft");
static_assert(sizeof(AthenaBroadcastPlayersRemaining_C_UpdateTeamsLeft) == 0x000004, "Wrong size on AthenaBroadcastPlayersRemaining_C_UpdateTeamsLeft");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_UpdateTeamsLeft, InTeamsLeft) == 0x000000, "Member 'AthenaBroadcastPlayersRemaining_C_UpdateTeamsLeft::InTeamsLeft' has a wrong offset!");

// Function AthenaBroadcastPlayersRemaining.AthenaBroadcastPlayersRemaining_C.UpdateTotalPlayers
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcastPlayersRemaining_C_UpdateTotalPlayers final
{
public:
	int32                                         InTotalPlayers;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastPlayersRemaining_C_UpdateTotalPlayers) == 0x000004, "Wrong alignment on AthenaBroadcastPlayersRemaining_C_UpdateTotalPlayers");
static_assert(sizeof(AthenaBroadcastPlayersRemaining_C_UpdateTotalPlayers) == 0x000004, "Wrong size on AthenaBroadcastPlayersRemaining_C_UpdateTotalPlayers");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_UpdateTotalPlayers, InTotalPlayers) == 0x000000, "Member 'AthenaBroadcastPlayersRemaining_C_UpdateTotalPlayers::InTotalPlayers' has a wrong offset!");

// Function AthenaBroadcastPlayersRemaining.AthenaBroadcastPlayersRemaining_C.UpdateTotalTeams
// 0x0004 (0x0004 - 0x0000)
struct AthenaBroadcastPlayersRemaining_C_UpdateTotalTeams final
{
public:
	int32                                         InTotalTeams;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastPlayersRemaining_C_UpdateTotalTeams) == 0x000004, "Wrong alignment on AthenaBroadcastPlayersRemaining_C_UpdateTotalTeams");
static_assert(sizeof(AthenaBroadcastPlayersRemaining_C_UpdateTotalTeams) == 0x000004, "Wrong size on AthenaBroadcastPlayersRemaining_C_UpdateTotalTeams");
static_assert(offsetof(AthenaBroadcastPlayersRemaining_C_UpdateTotalTeams, InTotalTeams) == 0x000000, "Member 'AthenaBroadcastPlayersRemaining_C_UpdateTotalTeams::InTotalTeams' has a wrong offset!");

}

