#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEventMatchStatusScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.ExecuteUbergraph_AthenaEventMatchStatusScreen
// 0x0310 (0x0310 - 0x0000)
struct AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_LongestEliminationText;               // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_DamageTakenText;                      // 0x0020(0x0018)(ConstParm)
	class FText                                   K2Node_Event_PiecesBuiltText;                      // 0x0038(0x0018)(ConstParm)
	class FText                                   K2Node_Event_DamageHealedText;                     // 0x0050(0x0018)(ConstParm)
	class FText                                   K2Node_Event_PiecesDestroyedText;                  // 0x0068(0x0018)(ConstParm)
	class FText                                   K2Node_Event_DamageInflictedText;                  // 0x0080(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ChestsLootedText;                     // 0x0098(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ShotsFiredText;                       // 0x00B0(0x0018)(ConstParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_SupplyDropsLootedText;                // 0x00D0(0x0018)(ConstParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F0(0x0018)()
	class FText                                   K2Node_Event_FastestKillText;                      // 0x0108(0x0018)(ConstParm)
	class FText                                   K2Node_Event_FastestKillTime;                      // 0x0120(0x0018)(ConstParm)
	class FText                                   K2Node_Event_MostKillsText;                        // 0x0138(0x0018)(ConstParm)
	class FText                                   K2Node_Event_MostKillsScore;                       // 0x0150(0x0018)(ConstParm)
	class FText                                   K2Node_Event_CircleRadiusText;                     // 0x0168(0x0018)(ConstParm)
	class FText                                   K2Node_Event_MatchTimeText;                        // 0x0180(0x0018)(ConstParm)
	class FText                                   K2Node_Event_LongestEliminationScore;              // 0x0198(0x0018)(ConstParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_GamePhaseTimeText;                    // 0x01B8(0x0018)(ConstParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_GamePhaseTimeTitleText;               // 0x01D8(0x0018)(ConstParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01F0(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_PlayersRemainingText;                 // 0x0210(0x0018)(ConstParm)
	class FText                                   K2Node_Event_TimeSinceLastKillText;                // 0x0228(0x0018)(ConstParm)
	class FText                                   K2Node_Event_GamePhaseText;                        // 0x0240(0x0018)(ConstParm)
	TArray<class UAthenaEventMatchStatusText_C*>  K2Node_MakeArray_Array;                            // 0x0258(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaEventMatchStatusText_C*          CallFunc_Array_Get_Item;                           // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAthenaMatchStatusTextPlayer_C*> K2Node_MakeArray_Array_1;                          // 0x0288(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData;                         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsDead;                            // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02C8(0x0018)()
	TArray<class UAthenaMatchStatusTextPlayer_C*> K2Node_MakeArray_Array_2;                          // 0x02E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAthenaMatchStatusTextPlayer_C*         CallFunc_Array_Get_Item_1;                         // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x02FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FE[0x2];                                      // 0x02FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMatchStatusTextPlayer_C*         CallFunc_Array_Get_Item_2;                         // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen) == 0x000310, "Wrong size on AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, EntryPoint) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_LongestEliminationText) == 0x000008, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_LongestEliminationText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_DamageTakenText) == 0x000020, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_DamageTakenText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_PiecesBuiltText) == 0x000038, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_PiecesBuiltText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_DamageHealedText) == 0x000050, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_DamageHealedText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_PiecesDestroyedText) == 0x000068, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_PiecesDestroyedText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_DamageInflictedText) == 0x000080, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_DamageInflictedText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_ChestsLootedText) == 0x000098, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_ChestsLootedText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_ShotsFiredText) == 0x0000B0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_ShotsFiredText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, Temp_int_Loop_Counter_Variable) == 0x0000C8, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_SupplyDropsLootedText) == 0x0000D0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_SupplyDropsLootedText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_FastestKillText) == 0x000108, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_FastestKillText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_FastestKillTime) == 0x000120, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_FastestKillTime' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_MostKillsText) == 0x000138, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_MostKillsText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_MostKillsScore) == 0x000150, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_MostKillsScore' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_CircleRadiusText) == 0x000168, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_CircleRadiusText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_MatchTimeText) == 0x000180, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_MatchTimeText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_LongestEliminationScore) == 0x000198, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_LongestEliminationScore' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, Temp_int_Loop_Counter_Variable_1) == 0x0001B0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_GamePhaseTimeText) == 0x0001B8, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_GamePhaseTimeText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001D0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_GamePhaseTimeTitleText) == 0x0001D8, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_GamePhaseTimeTitleText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0001F0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, Temp_int_Array_Index_Variable) == 0x000208, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_PlayersRemainingText) == 0x000210, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_PlayersRemainingText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_TimeSinceLastKillText) == 0x000228, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_TimeSinceLastKillText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_GamePhaseText) == 0x000240, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_GamePhaseText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_MakeArray_Array) == 0x000258, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Array_Length_ReturnValue) == 0x000268, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, Temp_int_Array_Index_Variable_1) == 0x00026C, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000270, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Array_Get_Item) == 0x000278, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, Temp_int_Loop_Counter_Variable_2) == 0x000280, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_MakeArray_Array_1) == 0x000288, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Array_Length_ReturnValue_1) == 0x000298, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Add_IntInt_ReturnValue_2) == 0x00029C, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002A0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_InPlayerData) == 0x0002A8, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_Event_bInIsDead) == 0x0002B0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_Event_bInIsDead' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_IsValid_ReturnValue) == 0x0002B1, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_GetPlayerName_ReturnValue) == 0x0002B8, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x0002C8, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, K2Node_MakeArray_Array_2) == 0x0002E0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Array_Get_Item_1) == 0x0002F0, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Array_Length_ReturnValue_2) == 0x0002F8, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002FC, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0002FD, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, Temp_int_Array_Index_Variable_2) == 0x000300, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen, CallFunc_Array_Get_Item_2) == 0x000308, "Member 'AthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.NewStatUpdate1Pulse
// 0x0028 (0x0028 - 0x0000)
struct AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse final
{
public:
	class UAthenaEventMatchStatusText_C*          TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          SkipTextUpdate;                                    // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse) == 0x000028, "Wrong size on AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse, TargetWidget) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse::TargetWidget' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse, InText) == 0x000008, "Member 'AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse::InText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse, SkipTextUpdate) == 0x000020, "Member 'AthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse::SkipTextUpdate' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.NewStatUpdate3Pulse
// 0x0028 (0x0028 - 0x0000)
struct AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse final
{
public:
	class UAthenaEventMatchStatusText_C*          TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          SkipTextUpdate;                                    // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse) == 0x000028, "Wrong size on AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse, TargetWidget) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse::TargetWidget' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse, InText) == 0x000008, "Member 'AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse::InText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse, SkipTextUpdate) == 0x000020, "Member 'AthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse::SkipTextUpdate' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.NewTopPlayer
// 0x0020 (0x0020 - 0x0000)
struct AthenaEventMatchStatusScreen_C_NewTopPlayer final
{
public:
	class UAthenaMatchStatusTextPlayer_C*         TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_NewTopPlayer) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_NewTopPlayer");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_NewTopPlayer) == 0x000020, "Wrong size on AthenaEventMatchStatusScreen_C_NewTopPlayer");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewTopPlayer, TargetWidget) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_NewTopPlayer::TargetWidget' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewTopPlayer, InText) == 0x000008, "Member 'AthenaEventMatchStatusScreen_C_NewTopPlayer::InText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.NewTopScore
// 0x0020 (0x0020 - 0x0000)
struct AthenaEventMatchStatusScreen_C_NewTopScore final
{
public:
	class UAthenaEventMatchStatusText_C*          TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_NewTopScore) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_NewTopScore");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_NewTopScore) == 0x000020, "Wrong size on AthenaEventMatchStatusScreen_C_NewTopScore");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewTopScore, TargetWidget) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_NewTopScore::TargetWidget' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_NewTopScore, InText) == 0x000008, "Member 'AthenaEventMatchStatusScreen_C_NewTopScore::InText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.OnPlayerDeadStateChanged_BP
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInIsDead;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP) == 0x000010, "Wrong size on AthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP, InPlayerData) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP, bInIsDead) == 0x000008, "Member 'AthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP::bInIsDead' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateChestsLootedText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateChestsLootedText final
{
public:
	class FText                                   ChestsLootedText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateChestsLootedText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateChestsLootedText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateChestsLootedText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateChestsLootedText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateChestsLootedText, ChestsLootedText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateChestsLootedText::ChestsLootedText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateCircleRadiusText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateCircleRadiusText final
{
public:
	class FText                                   CircleRadiusText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateCircleRadiusText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateCircleRadiusText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateCircleRadiusText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateCircleRadiusText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateCircleRadiusText, CircleRadiusText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateCircleRadiusText::CircleRadiusText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateDamageHealedText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateDamageHealedText final
{
public:
	class FText                                   DamageHealedText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateDamageHealedText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateDamageHealedText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateDamageHealedText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateDamageHealedText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateDamageHealedText, DamageHealedText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateDamageHealedText::DamageHealedText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateDamageInflictedText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateDamageInflictedText final
{
public:
	class FText                                   DamageInflictedText;                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateDamageInflictedText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateDamageInflictedText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateDamageInflictedText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateDamageInflictedText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateDamageInflictedText, DamageInflictedText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateDamageInflictedText::DamageInflictedText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateDamageTakenText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateDamageTakenText final
{
public:
	class FText                                   DamageTakenText;                                   // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateDamageTakenText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateDamageTakenText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateDamageTakenText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateDamageTakenText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateDamageTakenText, DamageTakenText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateDamageTakenText::DamageTakenText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateFastestKillText
// 0x0030 (0x0030 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateFastestKillText final
{
public:
	class FText                                   FastestKillText;                                   // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   FastestKillTime;                                   // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateFastestKillText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateFastestKillText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateFastestKillText) == 0x000030, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateFastestKillText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateFastestKillText, FastestKillText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateFastestKillText::FastestKillText' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateFastestKillText, FastestKillTime) == 0x000018, "Member 'AthenaEventMatchStatusScreen_C_UpdateFastestKillText::FastestKillTime' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateGamePhaseText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateGamePhaseText final
{
public:
	class FText                                   GamePhaseText;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateGamePhaseText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateGamePhaseText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateGamePhaseText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateGamePhaseText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateGamePhaseText, GamePhaseText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateGamePhaseText::GamePhaseText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateGamePhaseTimeText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeText final
{
public:
	class FText                                   GamePhaseTimeText;                                 // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeText, GamePhaseTimeText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeText::GamePhaseTimeText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateGamePhaseTimeTitleText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeTitleText final
{
public:
	class FText                                   GamePhaseTimeTitleText;                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeTitleText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeTitleText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeTitleText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeTitleText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeTitleText, GamePhaseTimeTitleText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeTitleText::GamePhaseTimeTitleText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateLongestEliminationScore
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateLongestEliminationScore final
{
public:
	class FText                                   LongestEliminationScore;                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateLongestEliminationScore) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateLongestEliminationScore");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateLongestEliminationScore) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateLongestEliminationScore");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateLongestEliminationScore, LongestEliminationScore) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateLongestEliminationScore::LongestEliminationScore' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateLongestEliminationText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateLongestEliminationText final
{
public:
	class FText                                   LongestEliminationText;                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateLongestEliminationText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateLongestEliminationText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateLongestEliminationText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateLongestEliminationText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateLongestEliminationText, LongestEliminationText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateLongestEliminationText::LongestEliminationText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateMatchTimeText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateMatchTimeText final
{
public:
	class FText                                   MatchTimeText;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateMatchTimeText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateMatchTimeText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateMatchTimeText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateMatchTimeText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateMatchTimeText, MatchTimeText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateMatchTimeText::MatchTimeText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateMostKillsScore
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateMostKillsScore final
{
public:
	class FText                                   MostKillsScore;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateMostKillsScore) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateMostKillsScore");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateMostKillsScore) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateMostKillsScore");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateMostKillsScore, MostKillsScore) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateMostKillsScore::MostKillsScore' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateMostKillsText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateMostKillsText final
{
public:
	class FText                                   MostKillsText;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateMostKillsText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateMostKillsText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateMostKillsText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateMostKillsText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateMostKillsText, MostKillsText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateMostKillsText::MostKillsText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdatePiecesBuiltText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdatePiecesBuiltText final
{
public:
	class FText                                   PiecesBuiltText;                                   // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdatePiecesBuiltText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdatePiecesBuiltText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdatePiecesBuiltText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdatePiecesBuiltText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdatePiecesBuiltText, PiecesBuiltText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdatePiecesBuiltText::PiecesBuiltText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdatePiecesDestroyedText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdatePiecesDestroyedText final
{
public:
	class FText                                   PiecesDestroyedText;                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdatePiecesDestroyedText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdatePiecesDestroyedText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdatePiecesDestroyedText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdatePiecesDestroyedText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdatePiecesDestroyedText, PiecesDestroyedText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdatePiecesDestroyedText::PiecesDestroyedText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdatePlayersRemainingText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdatePlayersRemainingText final
{
public:
	class FText                                   PlayersRemainingText;                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdatePlayersRemainingText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdatePlayersRemainingText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdatePlayersRemainingText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdatePlayersRemainingText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdatePlayersRemainingText, PlayersRemainingText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdatePlayersRemainingText::PlayersRemainingText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateShotsFiredText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateShotsFiredText final
{
public:
	class FText                                   ShotsFiredText;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateShotsFiredText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateShotsFiredText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateShotsFiredText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateShotsFiredText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateShotsFiredText, ShotsFiredText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateShotsFiredText::ShotsFiredText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateSupplyDropsLootedText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateSupplyDropsLootedText final
{
public:
	class FText                                   SupplyDropsLootedText;                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateSupplyDropsLootedText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateSupplyDropsLootedText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateSupplyDropsLootedText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateSupplyDropsLootedText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateSupplyDropsLootedText, SupplyDropsLootedText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateSupplyDropsLootedText::SupplyDropsLootedText' has a wrong offset!");

// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateTimeSinceLastKillText
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchStatusScreen_C_UpdateTimeSinceLastKillText final
{
public:
	class FText                                   TimeSinceLastKillText;                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaEventMatchStatusScreen_C_UpdateTimeSinceLastKillText) == 0x000008, "Wrong alignment on AthenaEventMatchStatusScreen_C_UpdateTimeSinceLastKillText");
static_assert(sizeof(AthenaEventMatchStatusScreen_C_UpdateTimeSinceLastKillText) == 0x000018, "Wrong size on AthenaEventMatchStatusScreen_C_UpdateTimeSinceLastKillText");
static_assert(offsetof(AthenaEventMatchStatusScreen_C_UpdateTimeSinceLastKillText, TimeSinceLastKillText) == 0x000000, "Member 'AthenaEventMatchStatusScreen_C_UpdateTimeSinceLastKillText::TimeSinceLastKillText' has a wrong offset!");

}

