#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastPlayerStatusTG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastPlayerStatusTG.AthenaBroadcastPlayerStatusTG_C
// 0x0370 (0x0738 - 0x03C8)
class UAthenaBroadcastPlayerStatusTG_C final : public UAthenaSpectatorPlayerWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ElimScale;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TeammateEliminated;                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpectatedEliminated;                               // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TeammateDowned;                                    // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpectatedDowned;                                   // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            BackgroundSwitcher;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DbnoStateImage;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ElimBackgroundSizeBox;                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                ElimCount;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ElimCountSB;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ElimIcon;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EliminatedIcon;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ElimSizeBox;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          FollowedPlayerElimBackground;                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBasicGradientFill_C*                   FollowedPlayerGradient;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorHitPointBar_C*          HealthBar;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              HitPointBarScaleBox;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               HitPointElimIconOverlay;                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlayerNameSizeBox;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorHitPointBar_C*          ShieldBar;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleCommonButton_C*                  SimpleCommonButton;                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SquadId;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          SquadIdBorder;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SquadIdSB;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          SquadMateBackground;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StatusExtensionOverlay;                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsFollowedPlayer;                                 // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPipMode;                                          // 0x04B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x6];                                      // 0x04B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         FollowedPlayerNameFont_NoPip;                      // 0x04B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         FollowedPlayerNameFont_Pip;                        // 0x0508(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SquadmatePlayerNameFont;                           // 0x0558(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         KillsFont_NoPip;                                   // 0x05A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         KillsFont_Pip;                                     // 0x05F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FLinearColor                           FollowedPlayerNormalGradientColor1;                // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FollowedPlayerNormalGradientColor2;                // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FollowedPlayerNormalElimBackgroundColor;           // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterial>               DbnoIcon;                                          // 0x0678(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterial>               ReviveIcon;                                        // 0x06A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FLinearColor                           FollowedPlayerEliminatedGradientColor1;            // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FollowedPlayerEliminatedGradientColor2;            // 0x06D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FollowedPlayerEliminatedElimBackgroundColor;       // 0x06E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DesiredFollowedPlayerGradientColor1;               // 0x06F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DesiredFollowedPlayerGradientColor2;               // 0x0708(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DesiredFollowedPlayerElimBackgroundColor;          // 0x0718(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DesiredSquadMateBackgroundColor;                   // 0x0728(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_HandlePlaylistExtensionWidgetCreated(class UUserWidget* Widget, EUIExtensionSlot SlotType);
	void ClearTextWidgets();
	void ExecuteUbergraph_AthenaBroadcastPlayerStatusTG(int32 EntryPoint);
	void OnBeingRevivedStateChanged(bool bIsBeingRevived);
	void OnDBNOStateChanged(bool bIsDBNO);
	void OnDeadStateChanged(bool bIsDead);
	void OnDisconnectedChanged(bool bIsDisconnected);
	void OnEliminatedStateChanged(bool bIsEliminated);
	void OnKillScoreChanged(int32 KillScore);
	void OnPipModeChanged(bool bPipModeEnabled);
	void OnPlayerDataChanged(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnPlayerNameChanged(const class FString& PlayerName_0);
	void OnSquadIdChanged(uint8 SquadId_0);
	void OnSquadIdVisibilityChanged(bool bVisible);
	void OnTeamColorChanged(const struct FLinearColor& TeamColor);
	void PreConstruct(bool IsDesignTime);
	void RefreshFollowedPlayerBackground(const struct FLinearColor& GradientColor1, const struct FLinearColor& GradientColor2, const struct FLinearColor& ElimBackgroundColor);
	void SequenceEvent__ENTRYPOINTAthenaBroadcastPlayerStatusTG(class UBasicGradientFill_C* Target);
	void SequenceEvent__ENTRYPOINTAthenaBroadcastPlayerStatusTG_0(class UBasicGradientFill_C* Target);
	void SetWidgetMode(bool bIsFollowedPlayer_0, bool bPipMode_0);
	void UpdateDbnoIcon();
	void UpdateFromMinigameTeamId(const class UFortMinigameTeamIdentification* MinigameTeamId);
	void UpdateGradientFill(class UBasicGradientFill_C* Target);
	void UpdateStyle();
	void WidgetAnimationEvt_SpectatedDowned_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_SpectatedEliminated_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_TeammateDowned_K2Node_WidgetAnimationEvent_3();
	void WidgetAnimationEvt_TeammateEliminated_K2Node_WidgetAnimationEvent_4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcastPlayerStatusTG_C">();
	}
	static class UAthenaBroadcastPlayerStatusTG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastPlayerStatusTG_C>();
	}
};
static_assert(alignof(UAthenaBroadcastPlayerStatusTG_C) == 0x000008, "Wrong alignment on UAthenaBroadcastPlayerStatusTG_C");
static_assert(sizeof(UAthenaBroadcastPlayerStatusTG_C) == 0x000738, "Wrong size on UAthenaBroadcastPlayerStatusTG_C");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, UberGraphFrame) == 0x0003C8, "Member 'UAthenaBroadcastPlayerStatusTG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, ElimScale) == 0x0003D0, "Member 'UAthenaBroadcastPlayerStatusTG_C::ElimScale' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, TeammateEliminated) == 0x0003D8, "Member 'UAthenaBroadcastPlayerStatusTG_C::TeammateEliminated' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, SpectatedEliminated) == 0x0003E0, "Member 'UAthenaBroadcastPlayerStatusTG_C::SpectatedEliminated' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, TeammateDowned) == 0x0003E8, "Member 'UAthenaBroadcastPlayerStatusTG_C::TeammateDowned' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, SpectatedDowned) == 0x0003F0, "Member 'UAthenaBroadcastPlayerStatusTG_C::SpectatedDowned' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, BackgroundSwitcher) == 0x0003F8, "Member 'UAthenaBroadcastPlayerStatusTG_C::BackgroundSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, DbnoStateImage) == 0x000400, "Member 'UAthenaBroadcastPlayerStatusTG_C::DbnoStateImage' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, ElimBackgroundSizeBox) == 0x000408, "Member 'UAthenaBroadcastPlayerStatusTG_C::ElimBackgroundSizeBox' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, ElimCount) == 0x000410, "Member 'UAthenaBroadcastPlayerStatusTG_C::ElimCount' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, ElimCountSB) == 0x000418, "Member 'UAthenaBroadcastPlayerStatusTG_C::ElimCountSB' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, ElimIcon) == 0x000420, "Member 'UAthenaBroadcastPlayerStatusTG_C::ElimIcon' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, EliminatedIcon) == 0x000428, "Member 'UAthenaBroadcastPlayerStatusTG_C::EliminatedIcon' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, ElimSizeBox) == 0x000430, "Member 'UAthenaBroadcastPlayerStatusTG_C::ElimSizeBox' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerElimBackground) == 0x000438, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerElimBackground' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerGradient) == 0x000440, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerGradient' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, HealthBar) == 0x000448, "Member 'UAthenaBroadcastPlayerStatusTG_C::HealthBar' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, HitPointBarScaleBox) == 0x000450, "Member 'UAthenaBroadcastPlayerStatusTG_C::HitPointBarScaleBox' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, HitPointElimIconOverlay) == 0x000458, "Member 'UAthenaBroadcastPlayerStatusTG_C::HitPointElimIconOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, PlayerName) == 0x000460, "Member 'UAthenaBroadcastPlayerStatusTG_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, PlayerNameSizeBox) == 0x000468, "Member 'UAthenaBroadcastPlayerStatusTG_C::PlayerNameSizeBox' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, ShieldBar) == 0x000470, "Member 'UAthenaBroadcastPlayerStatusTG_C::ShieldBar' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, SimpleCommonButton) == 0x000478, "Member 'UAthenaBroadcastPlayerStatusTG_C::SimpleCommonButton' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, SizeBox) == 0x000480, "Member 'UAthenaBroadcastPlayerStatusTG_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, SquadId) == 0x000488, "Member 'UAthenaBroadcastPlayerStatusTG_C::SquadId' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, SquadIdBorder) == 0x000490, "Member 'UAthenaBroadcastPlayerStatusTG_C::SquadIdBorder' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, SquadIdSB) == 0x000498, "Member 'UAthenaBroadcastPlayerStatusTG_C::SquadIdSB' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, SquadMateBackground) == 0x0004A0, "Member 'UAthenaBroadcastPlayerStatusTG_C::SquadMateBackground' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, StatusExtensionOverlay) == 0x0004A8, "Member 'UAthenaBroadcastPlayerStatusTG_C::StatusExtensionOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, bIsFollowedPlayer) == 0x0004B0, "Member 'UAthenaBroadcastPlayerStatusTG_C::bIsFollowedPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, bPipMode) == 0x0004B1, "Member 'UAthenaBroadcastPlayerStatusTG_C::bPipMode' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerNameFont_NoPip) == 0x0004B8, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerNameFont_NoPip' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerNameFont_Pip) == 0x000508, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerNameFont_Pip' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, SquadmatePlayerNameFont) == 0x000558, "Member 'UAthenaBroadcastPlayerStatusTG_C::SquadmatePlayerNameFont' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, KillsFont_NoPip) == 0x0005A8, "Member 'UAthenaBroadcastPlayerStatusTG_C::KillsFont_NoPip' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, KillsFont_Pip) == 0x0005F8, "Member 'UAthenaBroadcastPlayerStatusTG_C::KillsFont_Pip' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerNormalGradientColor1) == 0x000648, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerNormalGradientColor1' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerNormalGradientColor2) == 0x000658, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerNormalGradientColor2' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerNormalElimBackgroundColor) == 0x000668, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerNormalElimBackgroundColor' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, DbnoIcon) == 0x000678, "Member 'UAthenaBroadcastPlayerStatusTG_C::DbnoIcon' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, ReviveIcon) == 0x0006A0, "Member 'UAthenaBroadcastPlayerStatusTG_C::ReviveIcon' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerEliminatedGradientColor1) == 0x0006C8, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerEliminatedGradientColor1' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerEliminatedGradientColor2) == 0x0006D8, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerEliminatedGradientColor2' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, FollowedPlayerEliminatedElimBackgroundColor) == 0x0006E8, "Member 'UAthenaBroadcastPlayerStatusTG_C::FollowedPlayerEliminatedElimBackgroundColor' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, DesiredFollowedPlayerGradientColor1) == 0x0006F8, "Member 'UAthenaBroadcastPlayerStatusTG_C::DesiredFollowedPlayerGradientColor1' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, DesiredFollowedPlayerGradientColor2) == 0x000708, "Member 'UAthenaBroadcastPlayerStatusTG_C::DesiredFollowedPlayerGradientColor2' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, DesiredFollowedPlayerElimBackgroundColor) == 0x000718, "Member 'UAthenaBroadcastPlayerStatusTG_C::DesiredFollowedPlayerElimBackgroundColor' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastPlayerStatusTG_C, DesiredSquadMateBackgroundColor) == 0x000728, "Member 'UAthenaBroadcastPlayerStatusTG_C::DesiredSquadMateBackgroundColor' has a wrong offset!");

}

