#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorMapPlayerListRow

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.ExecuteUbergraph_AthenaSpectatorMapPlayerListRow
// 0x0028 (0x0028 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDead;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDisconnected;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInRelevancy;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorMapPlayerListState                  CallFunc_GetPlayerListState_PlayerListState;       // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_EventScore;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow) == 0x000008, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow) == 0x000028, "Wrong size on AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, EntryPoint) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, Temp_bool_Variable) == 0x000004, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, Temp_byte_Variable) == 0x000005, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, Temp_byte_Variable_1) == 0x000006, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, Temp_bool_Variable_1) == 0x000007, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, Temp_byte_Variable_2) == 0x000008, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, Temp_byte_Variable_3) == 0x000009, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, K2Node_Event_IsDesignTime) == 0x00000A, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, K2Node_Event_bIsDead) == 0x00000B, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::K2Node_Event_bIsDead' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, K2Node_Event_bIsDisconnected) == 0x00000C, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::K2Node_Event_bIsDisconnected' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, K2Node_Event_bIsInRelevancy) == 0x00000D, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::K2Node_Event_bIsInRelevancy' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, K2Node_Event_bVisible) == 0x00000E, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, CallFunc_GetPlayerListState_PlayerListState) == 0x00000F, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::CallFunc_GetPlayerListState_PlayerListState' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, K2Node_Select_Default) == 0x000010, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, K2Node_Event_InPlayerData) == 0x000018, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::K2Node_Event_InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, K2Node_Event_EventScore) == 0x000020, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::K2Node_Event_EventScore' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow, K2Node_Select_Default_1) == 0x000025, "Member 'AthenaSpectatorMapPlayerListRow_C_ExecuteUbergraph_AthenaSpectatorMapPlayerListRow::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.OnDeadStateChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_OnDeadStateChanged final
{
public:
	bool                                          bIsDead;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_OnDeadStateChanged) == 0x000001, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_OnDeadStateChanged");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_OnDeadStateChanged) == 0x000001, "Wrong size on AthenaSpectatorMapPlayerListRow_C_OnDeadStateChanged");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_OnDeadStateChanged, bIsDead) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_OnDeadStateChanged::bIsDead' has a wrong offset!");

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.OnDisconnectedChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_OnDisconnectedChanged final
{
public:
	bool                                          bIsDisconnected;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_OnDisconnectedChanged) == 0x000001, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_OnDisconnectedChanged");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_OnDisconnectedChanged) == 0x000001, "Wrong size on AthenaSpectatorMapPlayerListRow_C_OnDisconnectedChanged");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_OnDisconnectedChanged, bIsDisconnected) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_OnDisconnectedChanged::bIsDisconnected' has a wrong offset!");

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.OnEventScoreChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_OnEventScoreChanged final
{
public:
	int32                                         EventScore;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_OnEventScoreChanged) == 0x000004, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_OnEventScoreChanged");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_OnEventScoreChanged) == 0x000004, "Wrong size on AthenaSpectatorMapPlayerListRow_C_OnEventScoreChanged");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_OnEventScoreChanged, EventScore) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_OnEventScoreChanged::EventScore' has a wrong offset!");

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.OnIsInRelevancyChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_OnIsInRelevancyChanged final
{
public:
	bool                                          bIsInRelevancy;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_OnIsInRelevancyChanged) == 0x000001, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_OnIsInRelevancyChanged");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_OnIsInRelevancyChanged) == 0x000001, "Wrong size on AthenaSpectatorMapPlayerListRow_C_OnIsInRelevancyChanged");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_OnIsInRelevancyChanged, bIsInRelevancy) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_OnIsInRelevancyChanged::bIsInRelevancy' has a wrong offset!");

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.OnPlayerDataChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_OnPlayerDataChanged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_OnPlayerDataChanged) == 0x000008, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_OnPlayerDataChanged");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_OnPlayerDataChanged) == 0x000008, "Wrong size on AthenaSpectatorMapPlayerListRow_C_OnPlayerDataChanged");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_OnPlayerDataChanged, InPlayerData) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_OnPlayerDataChanged::InPlayerData' has a wrong offset!");

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.OnSquadIdVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_OnSquadIdVisibilityChanged final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_OnSquadIdVisibilityChanged) == 0x000001, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_OnSquadIdVisibilityChanged");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_OnSquadIdVisibilityChanged) == 0x000001, "Wrong size on AthenaSpectatorMapPlayerListRow_C_OnSquadIdVisibilityChanged");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_OnSquadIdVisibilityChanged, bVisible) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_OnSquadIdVisibilityChanged::bVisible' has a wrong offset!");

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_PreConstruct");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_PreConstruct) == 0x000001, "Wrong size on AthenaSpectatorMapPlayerListRow_C_PreConstruct");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.UpdateStyle
// 0x0010 (0x0010 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_UpdateStyle final
{
public:
	ESpectatorMapPlayerListState                  PlayerListState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorMapPlayerListState                  Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default_1;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle) == 0x000008, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_UpdateStyle");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle) == 0x000010, "Wrong size on AthenaSpectatorMapPlayerListRow_C_UpdateStyle");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle, PlayerListState) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_UpdateStyle::PlayerListState' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle, Temp_bool_Variable) == 0x000001, "Member 'AthenaSpectatorMapPlayerListRow_C_UpdateStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'AthenaSpectatorMapPlayerListRow_C_UpdateStyle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle, Temp_byte_Variable) == 0x000003, "Member 'AthenaSpectatorMapPlayerListRow_C_UpdateStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle, Temp_byte_Variable_1) == 0x000004, "Member 'AthenaSpectatorMapPlayerListRow_C_UpdateStyle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle, Temp_byte_Variable_2) == 0x000005, "Member 'AthenaSpectatorMapPlayerListRow_C_UpdateStyle::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle, K2Node_Select_Default) == 0x000006, "Member 'AthenaSpectatorMapPlayerListRow_C_UpdateStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_UpdateStyle, K2Node_Select_Default_1) == 0x000008, "Member 'AthenaSpectatorMapPlayerListRow_C_UpdateStyle::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C.GetPlayerListState
// 0x0018 (0x0018 - 0x0000)
struct AthenaSpectatorMapPlayerListRow_C_GetPlayerListState final
{
public:
	ESpectatorMapPlayerListState                  PlayerListState;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorMapPlayerListState                  Local_State;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorMapPlayerListState                  Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorMapPlayerListState                  Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemotePlayerViewData*            CallFunc_GetPlayerData_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEliminated_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInRelevancy_ReturnValue;             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorMapPlayerListState                  K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState) == 0x000008, "Wrong alignment on AthenaSpectatorMapPlayerListRow_C_GetPlayerListState");
static_assert(sizeof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState) == 0x000018, "Wrong size on AthenaSpectatorMapPlayerListRow_C_GetPlayerListState");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, PlayerListState) == 0x000000, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::PlayerListState' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, Local_State) == 0x000001, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::Local_State' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, Temp_bool_Variable) == 0x000002, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, Temp_byte_Variable) == 0x000003, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, Temp_byte_Variable_1) == 0x000004, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, CallFunc_GetPlayerData_ReturnValue) == 0x000008, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, CallFunc_GetIsEliminated_ReturnValue) == 0x000010, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::CallFunc_GetIsEliminated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, CallFunc_GetIsInRelevancy_ReturnValue) == 0x000012, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::CallFunc_GetIsInRelevancy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorMapPlayerListRow_C_GetPlayerListState, K2Node_Select_Default) == 0x000013, "Member 'AthenaSpectatorMapPlayerListRow_C_GetPlayerListState::K2Node_Select_Default' has a wrong offset!");

}

