#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryDragDrop

#include "Basic.hpp"

#include "AthenaDragDropAction_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaInventoryDragDrop.AthenaInventoryDragDrop_C
// 0x0008 (0x0098 - 0x0090)
class UAthenaInventoryDragDrop_C final : public UDragDropOperation
{
public:
	bool                                          SplitTheStack;                                     // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsFromCreativeInventory;                          // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InstigatorSlotIndex;                               // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ShowDropIcon(EAthenaDragDropAction Drop_Action);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryDragDrop_C">();
	}
	static class UAthenaInventoryDragDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryDragDrop_C>();
	}
};
static_assert(alignof(UAthenaInventoryDragDrop_C) == 0x000008, "Wrong alignment on UAthenaInventoryDragDrop_C");
static_assert(sizeof(UAthenaInventoryDragDrop_C) == 0x000098, "Wrong size on UAthenaInventoryDragDrop_C");
static_assert(offsetof(UAthenaInventoryDragDrop_C, SplitTheStack) == 0x000090, "Member 'UAthenaInventoryDragDrop_C::SplitTheStack' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragDrop_C, bIsFromCreativeInventory) == 0x000091, "Member 'UAthenaInventoryDragDrop_C::bIsFromCreativeInventory' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragDrop_C, InstigatorSlotIndex) == 0x000094, "Member 'UAthenaInventoryDragDrop_C::InstigatorSlotIndex' has a wrong offset!");

}

