#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastStormStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastStormStatus.AthenaBroadcastStormStatus_C
// 0x0020 (0x0348 - 0x0328)
class UAthenaBroadcastStormStatus_C final : public UAthenaBroadcastMatchStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaBroadcastGameTimeWidget_C*       AthenaBroadcastGameTimeWidget;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentStormPhaseText;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               StormPhaseSB;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaBroadcastStormStatus(int32 EntryPoint);
	void OnStormPhaseChanged(int32 StormPhase);
	void SetMinigameOverride(class AFortMinigame* MinigameOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcastStormStatus_C">();
	}
	static class UAthenaBroadcastStormStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastStormStatus_C>();
	}
};
static_assert(alignof(UAthenaBroadcastStormStatus_C) == 0x000008, "Wrong alignment on UAthenaBroadcastStormStatus_C");
static_assert(sizeof(UAthenaBroadcastStormStatus_C) == 0x000348, "Wrong size on UAthenaBroadcastStormStatus_C");
static_assert(offsetof(UAthenaBroadcastStormStatus_C, UberGraphFrame) == 0x000328, "Member 'UAthenaBroadcastStormStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastStormStatus_C, AthenaBroadcastGameTimeWidget) == 0x000330, "Member 'UAthenaBroadcastStormStatus_C::AthenaBroadcastGameTimeWidget' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastStormStatus_C, CurrentStormPhaseText) == 0x000338, "Member 'UAthenaBroadcastStormStatus_C::CurrentStormPhaseText' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastStormStatus_C, StormPhaseSB) == 0x000340, "Member 'UAthenaBroadcastStormStatus_C::StormPhaseSB' has a wrong offset!");

}

