#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEventMatchActiveGridScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaEventMatchActiveGridScreen.AthenaEventMatchActiveGridScreen_C.CalculateRectangleGridHeight
// 0x0020 (0x0020 - 0x0000)
struct AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight final
{
public:
	int32                                         NumElements;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GridHeight;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_GridHeight;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight) == 0x000004, "Wrong alignment on AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight");
static_assert(sizeof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight) == 0x000020, "Wrong size on AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight, NumElements) == 0x000000, "Member 'AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight::NumElements' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight, GridHeight) == 0x000004, "Member 'AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight::GridHeight' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight, Local_GridHeight) == 0x000008, "Member 'AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight::Local_GridHeight' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight, Temp_int_Variable) == 0x00000C, "Member 'AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight, CallFunc_Multiply_IntInt_ReturnValue) == 0x000010, "Member 'AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000014, "Member 'AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaEventMatchActiveGridScreen_C_CalculateRectangleGridHeight::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaEventMatchActiveGridScreen.AthenaEventMatchActiveGridScreen_C.ExecuteUbergraph_AthenaEventMatchActiveGridScreen
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldResizeGrid_bShouldResize;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ShouldResizeGrid_NumColumns;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldResizeGrid_bShouldResize_1;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ShouldResizeGrid_NumColumns_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen) == 0x000004, "Wrong alignment on AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen");
static_assert(sizeof(AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen) == 0x000018, "Wrong size on AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen, EntryPoint) == 0x000000, "Member 'AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen, CallFunc_ShouldResizeGrid_bShouldResize) == 0x000004, "Member 'AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen::CallFunc_ShouldResizeGrid_bShouldResize' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen, CallFunc_ShouldResizeGrid_NumColumns) == 0x000008, "Member 'AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen::CallFunc_ShouldResizeGrid_NumColumns' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen, CallFunc_ShouldResizeGrid_bShouldResize_1) == 0x00000C, "Member 'AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen::CallFunc_ShouldResizeGrid_bShouldResize_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen, CallFunc_ShouldResizeGrid_NumColumns_1) == 0x000010, "Member 'AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen::CallFunc_ShouldResizeGrid_NumColumns_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen, CallFunc_IsActivated_ReturnValue) == 0x000014, "Member 'AthenaEventMatchActiveGridScreen_C_ExecuteUbergraph_AthenaEventMatchActiveGridScreen::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function AthenaEventMatchActiveGridScreen.AthenaEventMatchActiveGridScreen_C.ResetGrid
// 0x0060 (0x0060 - 0x0000)
struct AthenaEventMatchActiveGridScreen_C_ResetGrid final
{
public:
	int32                                         InNumColumns;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_Column;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_Row;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaEventMatchPlayerGridTeamWidget_C* K2Node_DynamicCast_AsAthena_Event_Match_Player_Grid_Team_Widget; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchActiveGridScreen_C_ResetGrid) == 0x000008, "Wrong alignment on AthenaEventMatchActiveGridScreen_C_ResetGrid");
static_assert(sizeof(AthenaEventMatchActiveGridScreen_C_ResetGrid) == 0x000060, "Wrong size on AthenaEventMatchActiveGridScreen_C_ResetGrid");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, InNumColumns) == 0x000000, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::InNumColumns' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, Local_Column) == 0x000004, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::Local_Column' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, Local_Row) == 0x000008, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::Local_Row' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, Temp_int_Variable) == 0x000010, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000028, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, K2Node_DynamicCast_AsAthena_Event_Match_Player_Grid_Team_Widget) == 0x000030, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::K2Node_DynamicCast_AsAthena_Event_Match_Player_Grid_Team_Widget' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000054, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ResetGrid, Temp_int_Variable_1) == 0x000058, "Member 'AthenaEventMatchActiveGridScreen_C_ResetGrid::Temp_int_Variable_1' has a wrong offset!");

// Function AthenaEventMatchActiveGridScreen.AthenaEventMatchActiveGridScreen_C.ShouldResizeGrid
// 0x006C (0x006C - 0x0000)
struct AthenaEventMatchActiveGridScreen_C_ShouldResizeGrid final
{
public:
	bool                                          bShouldResize;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumColumns;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_NumColumns;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_NumActiveTeams;                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Local_ShouldResize;                                // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateRectangleGridHeight_GridHeight;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalculateRectangleGridHeight_GridHeight_1; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Sqrt_ReturnValue_1;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchActiveGridScreen_C_ShouldResizeGrid) == 0x000004, "Wrong alignment on AthenaEventMatchActiveGridScreen_C_ShouldResizeGrid");
static_assert(sizeof(AthenaEventMatchActiveGridScreen_C_ShouldResizeGrid) == 0x00006C, "Wrong size on AthenaEventMatchActiveGridScreen_C_ShouldResizeGrid");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ShouldResizeGrid, bShouldResize) == 0x000000, "Member 'AthenaEventMatchActiveGridScreen_C_ShouldResizeGrid::bShouldResize' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchActiveGridScreen_C_ShouldResizeGrid, NumColumns) == 0x000004, "Member 'AthenaEventMatchActiveGridScreen_C_ShouldResizeGrid::NumColumns' has a wrong offset!");
