#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Player_CoolCarpet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PopOutStates_structs.hpp"
#include "Athena_Player_SneakySnowmanV2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Player_CoolCarpet.Athena_Player_CoolCarpet_C
// 0x0100 (0x0D90 - 0x0C90)
class AAthena_Player_CoolCarpet_C final : public AAthena_Player_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Player_CoolCarpet_C;         // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ShadowInsert;                                   // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap1;                               // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap2;                               // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ShrinkBox_Rotation_B702562648A4C4CB590675BD0D3E005C; // 0x0CB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShrinkBox_Shrinkage_B702562648A4C4CB590675BD0D3E005C; // 0x0CB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ShrinkBox__Direction_B702562648A4C4CB590675BD0D3E005C; // 0x0CB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB9[0x7];                                      // 0x0CB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ShrinkBox;                                         // 0x0CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grow_Box_Growth_53FD69EF4E6B5DECD0D74DBB0BDDAA26;  // 0x0CC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Grow_Box__Direction_53FD69EF4E6B5DECD0D74DBB0BDDAA26; // 0x0CCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCD[0x3];                                      // 0x0CCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Grow_Box;                                          // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Rotation_A659A2B4463C7B7008A67988DEB011BE; // 0x0CD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_A659A2B4463C7B7008A67988DEB011BE; // 0x0CDC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CDD[0x3];                                      // 0x0CDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlreadyJumpedOut;                                  // 0x0CE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE9[0x7];                                      // 0x0CE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Fake_CoolCarpet_C*              CastedFakeActor;                                   // 0x0CF0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MovementEventsBound;                               // 0x0CF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF9[0x7];                                      // 0x0CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             OnFootstepSound;                                   // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnLandedSound;                                     // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnJumpedSound;                                     // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HolsterId;                                         // 0x0D18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatInt;                                            // 0x0D1C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         PopOutOnWindUp;                                    // 0x0D20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         AllowPopOut;                                       // 0x0D48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Swimming_0;                                        // 0x0D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopOutStates                                 PopState;                                          // 0x0D71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlapsClosed;                                       // 0x0D72(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D73[0x5];                                      // 0x0D73(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WindUpEndTimer;                                    // 0x0D78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PoppedFromWindUp;                                  // 0x0D80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DidWindUp;                                         // 0x0D81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PoppedFromStand;                                   // 0x0D82(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Firing;                                            // 0x0D83(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirePressed;                                       // 0x0D84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D85[0x3];                                      // 0x0D85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           StopFiringTimer;                                   // 0x0D88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ADS_Client(bool AimDownsights);
	void Bind_to_Movement_Events();
	void ChangePopState(EPopOutStates PopState_0);
	void Cleanup(class AActor* DestroyedActor);
	void CloseFlaps();
	void CustomEvent(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ExecuteUbergraph_Athena_Player_CoolCarpet(int32 EntryPoint);
	void FirePressed_Client(class AFortWeapon* Weapon);
	void FireReleased_Client(class AFortWeapon* Weapon);
	void GetMaterialInt(int32* MatInt_0);
	void Grow_Box__FinishedFunc();
	void Grow_Box__UpdateFunc();
	void JumpedOut();
	void JustAttached();
	void MovementUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void OnGaveSneakySnowman_1();
	void OnPlayerFootstep();
	void OnPlayerLanded(const struct FHitResult& Hit);
	void OnPlayerMovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnPopStateChanged(EPopOutStates PopState_0);
	void OnRep_MatInt();
	void OnRep_PopState();
	void OnStartedUsingFake();
	void OnStoppedUsingFake();
	void OnWeaponChange();
	void OpenFlaps();
	void OpenFlaps_Multicast();
	void OwningClient_ADS();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Server_BlockPopOut();
	void Set_Flaps_Visible_Multicast();
	void SetMatInt(class AActor* Prop);
	void SetPopState_Multicast(EPopOutStates PopState_0);
	void SetPopState_Server(EPopOutStates PopState_0);
	void ShrinkBox__FinishedFunc();
	void ShrinkBox__UpdateFunc();
	void StopFiring();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Unbind_from_Movement_Events();
	void WeaponChangeClient();
	void Wobble(float Strength, bool MoveUpAndDown);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Player_CoolCarpet_C">();
	}
	static class AAthena_Player_CoolCarpet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Player_CoolCarpet_C>();
	}
};
static_assert(alignof(AAthena_Player_CoolCarpet_C) == 0x000008, "Wrong alignment on AAthena_Player_CoolCarpet_C");
static_assert(sizeof(AAthena_Player_CoolCarpet_C) == 0x000D90, "Wrong size on AAthena_Player_CoolCarpet_C");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, UberGraphFrame_Athena_Player_CoolCarpet_C) == 0x000C90, "Member 'AAthena_Player_CoolCarpet_C::UberGraphFrame_Athena_Player_CoolCarpet_C' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, SM_ShadowInsert) == 0x000C98, "Member 'AAthena_Player_CoolCarpet_C::SM_ShadowInsert' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, SM_CoolCarpet_Flap1) == 0x000CA0, "Member 'AAthena_Player_CoolCarpet_C::SM_CoolCarpet_Flap1' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, SM_CoolCarpet_Flap2) == 0x000CA8, "Member 'AAthena_Player_CoolCarpet_C::SM_CoolCarpet_Flap2' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, ShrinkBox_Rotation_B702562648A4C4CB590675BD0D3E005C) == 0x000CB0, "Member 'AAthena_Player_CoolCarpet_C::ShrinkBox_Rotation_B702562648A4C4CB590675BD0D3E005C' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, ShrinkBox_Shrinkage_B702562648A4C4CB590675BD0D3E005C) == 0x000CB4, "Member 'AAthena_Player_CoolCarpet_C::ShrinkBox_Shrinkage_B702562648A4C4CB590675BD0D3E005C' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, ShrinkBox__Direction_B702562648A4C4CB590675BD0D3E005C) == 0x000CB8, "Member 'AAthena_Player_CoolCarpet_C::ShrinkBox__Direction_B702562648A4C4CB590675BD0D3E005C' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, ShrinkBox) == 0x000CC0, "Member 'AAthena_Player_CoolCarpet_C::ShrinkBox' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Grow_Box_Growth_53FD69EF4E6B5DECD0D74DBB0BDDAA26) == 0x000CC8, "Member 'AAthena_Player_CoolCarpet_C::Grow_Box_Growth_53FD69EF4E6B5DECD0D74DBB0BDDAA26' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Grow_Box__Direction_53FD69EF4E6B5DECD0D74DBB0BDDAA26) == 0x000CCC, "Member 'AAthena_Player_CoolCarpet_C::Grow_Box__Direction_53FD69EF4E6B5DECD0D74DBB0BDDAA26' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Grow_Box) == 0x000CD0, "Member 'AAthena_Player_CoolCarpet_C::Grow_Box' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Timeline_1_Rotation_A659A2B4463C7B7008A67988DEB011BE) == 0x000CD8, "Member 'AAthena_Player_CoolCarpet_C::Timeline_1_Rotation_A659A2B4463C7B7008A67988DEB011BE' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Timeline_1__Direction_A659A2B4463C7B7008A67988DEB011BE) == 0x000CDC, "Member 'AAthena_Player_CoolCarpet_C::Timeline_1__Direction_A659A2B4463C7B7008A67988DEB011BE' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Timeline_1) == 0x000CE0, "Member 'AAthena_Player_CoolCarpet_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, AlreadyJumpedOut) == 0x000CE8, "Member 'AAthena_Player_CoolCarpet_C::AlreadyJumpedOut' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, CastedFakeActor) == 0x000CF0, "Member 'AAthena_Player_CoolCarpet_C::CastedFakeActor' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, MovementEventsBound) == 0x000CF8, "Member 'AAthena_Player_CoolCarpet_C::MovementEventsBound' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, OnFootstepSound) == 0x000D00, "Member 'AAthena_Player_CoolCarpet_C::OnFootstepSound' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, OnLandedSound) == 0x000D08, "Member 'AAthena_Player_CoolCarpet_C::OnLandedSound' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, OnJumpedSound) == 0x000D10, "Member 'AAthena_Player_CoolCarpet_C::OnJumpedSound' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, HolsterId) == 0x000D18, "Member 'AAthena_Player_CoolCarpet_C::HolsterId' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, MatInt) == 0x000D1C, "Member 'AAthena_Player_CoolCarpet_C::MatInt' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, PopOutOnWindUp) == 0x000D20, "Member 'AAthena_Player_CoolCarpet_C::PopOutOnWindUp' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, AllowPopOut) == 0x000D48, "Member 'AAthena_Player_CoolCarpet_C::AllowPopOut' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Swimming_0) == 0x000D70, "Member 'AAthena_Player_CoolCarpet_C::Swimming_0' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, PopState) == 0x000D71, "Member 'AAthena_Player_CoolCarpet_C::PopState' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, FlapsClosed) == 0x000D72, "Member 'AAthena_Player_CoolCarpet_C::FlapsClosed' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, WindUpEndTimer) == 0x000D78, "Member 'AAthena_Player_CoolCarpet_C::WindUpEndTimer' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, PoppedFromWindUp) == 0x000D80, "Member 'AAthena_Player_CoolCarpet_C::PoppedFromWindUp' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, DidWindUp) == 0x000D81, "Member 'AAthena_Player_CoolCarpet_C::DidWindUp' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, PoppedFromStand) == 0x000D82, "Member 'AAthena_Player_CoolCarpet_C::PoppedFromStand' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Firing) == 0x000D83, "Member 'AAthena_Player_CoolCarpet_C::Firing' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, FirePressed) == 0x000D84, "Member 'AAthena_Player_CoolCarpet_C::FirePressed' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, StopFiringTimer) == 0x000D88, "Member 'AAthena_Player_CoolCarpet_C::StopFiringTimer' has a wrong offset!");

}

