#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemIconLoadout

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.ExecuteUbergraph_AthenaItemIconLoadout
// 0x00D8 (0x00D8 - 0x0000)
struct AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   K2Node_Event_ItemRarity;                           // 0x001B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    K2Node_Event_RarityItemData;                       // 0x0020(0x0080)(ConstParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasAmmoIcon;                         // 0x00CA(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout) == 0x000008, "Wrong alignment on AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout");
static_assert(sizeof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout) == 0x0000D8, "Wrong size on AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, EntryPoint) == 0x000000, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_bool_Variable) == 0x000004, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable) == 0x000010, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable_1) == 0x000011, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_bool_Variable_1) == 0x000012, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable_2) == 0x000013, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable_3) == 0x000014, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_bool_Variable_2) == 0x000015, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable_4) == 0x000016, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable_5) == 0x000017, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_bool_Variable_3) == 0x000018, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable_6) == 0x000019, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable_7) == 0x00001A, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, K2Node_Event_ItemRarity) == 0x00001B, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::K2Node_Event_ItemRarity' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, K2Node_Event_RarityItemData) == 0x000020, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::K2Node_Event_RarityItemData' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000A0, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000A8, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x0000B0, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable_8) == 0x0000B8, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x0000C0, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_byte_Variable_9) == 0x0000C8, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, Temp_bool_Variable_4) == 0x0000C9, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, K2Node_Event_bHasAmmoIcon) == 0x0000CA, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::K2Node_Event_bHasAmmoIcon' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, K2Node_Event_IsDesignTime) == 0x0000CB, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, K2Node_Select_Default) == 0x0000CC, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, K2Node_Select_Default_1) == 0x0000CD, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, K2Node_Select_Default_2) == 0x0000CE, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, K2Node_Select_Default_3) == 0x0000CF, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, CallFunc_BooleanOR_ReturnValue) == 0x0000D0, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout, K2Node_Select_Default_4) == 0x0000D1, "Member 'AthenaItemIconLoadout_C_ExecuteUbergraph_AthenaItemIconLoadout::K2Node_Select_Default_4' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.OnAmmoIconUpdated
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemIconLoadout_C_OnAmmoIconUpdated final
{
public:
	bool                                          bHasAmmoIcon;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_OnAmmoIconUpdated) == 0x000001, "Wrong alignment on AthenaItemIconLoadout_C_OnAmmoIconUpdated");
static_assert(sizeof(AthenaItemIconLoadout_C_OnAmmoIconUpdated) == 0x000001, "Wrong size on AthenaItemIconLoadout_C_OnAmmoIconUpdated");
static_assert(offsetof(AthenaItemIconLoadout_C_OnAmmoIconUpdated, bHasAmmoIcon) == 0x000000, "Member 'AthenaItemIconLoadout_C_OnAmmoIconUpdated::bHasAmmoIcon' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.OnItemRarityUpdated
// 0x0088 (0x0088 - 0x0000)
struct AthenaItemIconLoadout_C_OnItemRarityUpdated final
{
public:
	EFortRarity                                   ItemRarity;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    RarityItemData;                                    // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaItemIconLoadout_C_OnItemRarityUpdated) == 0x000008, "Wrong alignment on AthenaItemIconLoadout_C_OnItemRarityUpdated");
static_assert(sizeof(AthenaItemIconLoadout_C_OnItemRarityUpdated) == 0x000088, "Wrong size on AthenaItemIconLoadout_C_OnItemRarityUpdated");
static_assert(offsetof(AthenaItemIconLoadout_C_OnItemRarityUpdated, ItemRarity) == 0x000000, "Member 'AthenaItemIconLoadout_C_OnItemRarityUpdated::ItemRarity' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_OnItemRarityUpdated, RarityItemData) == 0x000008, "Member 'AthenaItemIconLoadout_C_OnItemRarityUpdated::RarityItemData' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemIconLoadout_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaItemIconLoadout_C_PreConstruct");
static_assert(sizeof(AthenaItemIconLoadout_C_PreConstruct) == 0x000001, "Wrong size on AthenaItemIconLoadout_C_PreConstruct");
static_assert(offsetof(AthenaItemIconLoadout_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaItemIconLoadout_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.RecipeHoverState
// 0x0018 (0x0018 - 0x0000)
struct AthenaItemIconLoadout_C_RecipeHoverState final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_RecipeHoverState) == 0x000008, "Wrong alignment on AthenaItemIconLoadout_C_RecipeHoverState");
static_assert(sizeof(AthenaItemIconLoadout_C_RecipeHoverState) == 0x000018, "Wrong size on AthenaItemIconLoadout_C_RecipeHoverState");
static_assert(offsetof(AthenaItemIconLoadout_C_RecipeHoverState, IsHovered_0) == 0x000000, "Member 'AthenaItemIconLoadout_C_RecipeHoverState::IsHovered_0' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_RecipeHoverState, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'AthenaItemIconLoadout_C_RecipeHoverState::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_RecipeHoverState, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'AthenaItemIconLoadout_C_RecipeHoverState::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.ResetAnims
// 0x0040 (0x0040 - 0x0000)
struct AthenaItemIconLoadout_C_ResetAnims final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_ResetAnims) == 0x000008, "Wrong alignment on AthenaItemIconLoadout_C_ResetAnims");
static_assert(sizeof(AthenaItemIconLoadout_C_ResetAnims) == 0x000040, "Wrong size on AthenaItemIconLoadout_C_ResetAnims");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetAnims, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaItemIconLoadout_C_ResetAnims::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetAnims, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaItemIconLoadout_C_ResetAnims::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetAnims, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaItemIconLoadout_C_ResetAnims::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetAnims, K2Node_MakeArray_Array) == 0x000010, "Member 'AthenaItemIconLoadout_C_ResetAnims::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetAnims, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'AthenaItemIconLoadout_C_ResetAnims::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetAnims, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaItemIconLoadout_C_ResetAnims::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetAnims, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'AthenaItemIconLoadout_C_ResetAnims::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetAnims, CallFunc_GetEndTime_ReturnValue) == 0x000034, "Member 'AthenaItemIconLoadout_C_ResetAnims::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetAnims, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'AthenaItemIconLoadout_C_ResetAnims::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.ResetHoveredState
// 0x0010 (0x0010 - 0x0000)
struct AthenaItemIconLoadout_C_ResetHoveredState final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_ResetHoveredState) == 0x000008, "Wrong alignment on AthenaItemIconLoadout_C_ResetHoveredState");
static_assert(sizeof(AthenaItemIconLoadout_C_ResetHoveredState) == 0x000010, "Wrong size on AthenaItemIconLoadout_C_ResetHoveredState");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetHoveredState, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'AthenaItemIconLoadout_C_ResetHoveredState::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetHoveredState, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaItemIconLoadout_C_ResetHoveredState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.ResetSelectedState
// 0x0010 (0x0010 - 0x0000)
struct AthenaItemIconLoadout_C_ResetSelectedState final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_ResetSelectedState) == 0x000008, "Wrong alignment on AthenaItemIconLoadout_C_ResetSelectedState");
static_assert(sizeof(AthenaItemIconLoadout_C_ResetSelectedState) == 0x000010, "Wrong size on AthenaItemIconLoadout_C_ResetSelectedState");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetSelectedState, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'AthenaItemIconLoadout_C_ResetSelectedState::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_ResetSelectedState, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaItemIconLoadout_C_ResetSelectedState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.SetHoveredState
// 0x0018 (0x0018 - 0x0000)
struct AthenaItemIconLoadout_C_SetHoveredState final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_SetHoveredState) == 0x000008, "Wrong alignment on AthenaItemIconLoadout_C_SetHoveredState");
static_assert(sizeof(AthenaItemIconLoadout_C_SetHoveredState) == 0x000018, "Wrong size on AthenaItemIconLoadout_C_SetHoveredState");
static_assert(offsetof(AthenaItemIconLoadout_C_SetHoveredState, bIsHovered) == 0x000000, "Member 'AthenaItemIconLoadout_C_SetHoveredState::bIsHovered' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_SetHoveredState, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'AthenaItemIconLoadout_C_SetHoveredState::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_SetHoveredState, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'AthenaItemIconLoadout_C_SetHoveredState::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.SetRecipeHoverStateEndtime
// 0x0010 (0x0010 - 0x0000)
struct AthenaItemIconLoadout_C_SetRecipeHoverStateEndtime final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_SetRecipeHoverStateEndtime) == 0x000008, "Wrong alignment on AthenaItemIconLoadout_C_SetRecipeHoverStateEndtime");
static_assert(sizeof(AthenaItemIconLoadout_C_SetRecipeHoverStateEndtime) == 0x000010, "Wrong size on AthenaItemIconLoadout_C_SetRecipeHoverStateEndtime");
static_assert(offsetof(AthenaItemIconLoadout_C_SetRecipeHoverStateEndtime, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'AthenaItemIconLoadout_C_SetRecipeHoverStateEndtime::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_SetRecipeHoverStateEndtime, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaItemIconLoadout_C_SetRecipeHoverStateEndtime::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaItemIconLoadout.AthenaItemIconLoadout_C.SetSelectedState
// 0x0018 (0x0018 - 0x0000)
struct AthenaItemIconLoadout_C_SetSelectedState final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemIconLoadout_C_SetSelectedState) == 0x000008, "Wrong alignment on AthenaItemIconLoadout_C_SetSelectedState");
static_assert(sizeof(AthenaItemIconLoadout_C_SetSelectedState) == 0x000018, "Wrong size on AthenaItemIconLoadout_C_SetSelectedState");
static_assert(offsetof(AthenaItemIconLoadout_C_SetSelectedState, bIsSelected) == 0x000000, "Member 'AthenaItemIconLoadout_C_SetSelectedState::bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaItemIconLoadout_C_SetSelectedState, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'AthenaItemIconLoadout_C_SetSelectedState::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
