#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcasterMapSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C
// 0x0080 (0x0480 - 0x0400)
class UAthenaBroadcasterMapSettings_C final : public UFortBroadcasterMapSettings
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatorSelectorReplaySettings_C*       BusPathsRotator;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonBox;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             NameZoomVisibility;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       VehicleIconsRotator;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       WeaponTracersRotator;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UCommonButtonLegacy*, class UClass*> MapIconVisibility;                                 // 0x0430(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BP_HandleMapIconAdded(class UFortSpectateClickableMapIcon* MapIcon);
	void BP_OnActivated();
	void ExecuteUbergraph_AthenaBroadcasterMapSettings(int32 EntryPoint);
	void Map_Icon_Added(class UFortSpectateClickableMapIcon* Icon);
	void OnMapIconClicked(class UCommonButtonLegacy* ButtonClicked);
	void PreConstruct(bool IsDesignTime);
	void Refresh_Options();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcasterMapSettings_C">();
	}
	static class UAthenaBroadcasterMapSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcasterMapSettings_C>();
	}
};
static_assert(alignof(UAthenaBroadcasterMapSettings_C) == 0x000008, "Wrong alignment on UAthenaBroadcasterMapSettings_C");
static_assert(sizeof(UAthenaBroadcasterMapSettings_C) == 0x000480, "Wrong size on UAthenaBroadcasterMapSettings_C");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, UberGraphFrame) == 0x000400, "Member 'UAthenaBroadcasterMapSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, BusPathsRotator) == 0x000408, "Member 'UAthenaBroadcasterMapSettings_C::BusPathsRotator' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, ButtonBox) == 0x000410, "Member 'UAthenaBroadcasterMapSettings_C::ButtonBox' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, NameZoomVisibility) == 0x000418, "Member 'UAthenaBroadcasterMapSettings_C::NameZoomVisibility' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, VehicleIconsRotator) == 0x000420, "Member 'UAthenaBroadcasterMapSettings_C::VehicleIconsRotator' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, WeaponTracersRotator) == 0x000428, "Member 'UAthenaBroadcasterMapSettings_C::WeaponTracersRotator' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, MapIconVisibility) == 0x000430, "Member 'UAthenaBroadcasterMapSettings_C::MapIconVisibility' has a wrong offset!");

}

