#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_ControllerDisconnectedModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_ControllerDisconnectedModal.Athena_ControllerDisconnectedModal_C
// 0x0040 (0x0450 - 0x0410)
class UAthena_ControllerDisconnectedModal_C final : public UAthenaControllerDisconnectedModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_164;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_66;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Down;                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Up;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_Athena_ControllerDisconnectedModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_ControllerDisconnectedModal_C">();
	}
	static class UAthena_ControllerDisconnectedModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_ControllerDisconnectedModal_C>();
	}
};
static_assert(alignof(UAthena_ControllerDisconnectedModal_C) == 0x000008, "Wrong alignment on UAthena_ControllerDisconnectedModal_C");
static_assert(sizeof(UAthena_ControllerDisconnectedModal_C) == 0x000450, "Wrong size on UAthena_ControllerDisconnectedModal_C");
static_assert(offsetof(UAthena_ControllerDisconnectedModal_C, UberGraphFrame) == 0x000410, "Member 'UAthena_ControllerDisconnectedModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthena_ControllerDisconnectedModal_C, Intro) == 0x000418, "Member 'UAthena_ControllerDisconnectedModal_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthena_ControllerDisconnectedModal_C, CommonActionWidget_164) == 0x000420, "Member 'UAthena_ControllerDisconnectedModal_C::CommonActionWidget_164' has a wrong offset!");
static_assert(offsetof(UAthena_ControllerDisconnectedModal_C, Image_66) == 0x000428, "Member 'UAthena_ControllerDisconnectedModal_C::Image_66' has a wrong offset!");
static_assert(offsetof(UAthena_ControllerDisconnectedModal_C, Image_Separator_Down) == 0x000430, "Member 'UAthena_ControllerDisconnectedModal_C::Image_Separator_Down' has a wrong offset!");
static_assert(offsetof(UAthena_ControllerDisconnectedModal_C, Image_Separator_Up) == 0x000438, "Member 'UAthena_ControllerDisconnectedModal_C::Image_Separator_Up' has a wrong offset!");
static_assert(offsetof(UAthena_ControllerDisconnectedModal_C, Lightbox) == 0x000440, "Member 'UAthena_ControllerDisconnectedModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthena_ControllerDisconnectedModal_C, ProgressSpinner) == 0x000448, "Member 'UAthena_ControllerDisconnectedModal_C::ProgressSpinner' has a wrong offset!");

}

