#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUD_PickupItemWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaHUD-PickupItemWidget.AthenaHUD-PickupItemWidget_C.ExecuteUbergraph_AthenaHUD-PickupItemWidget
// 0x0004 (0x0004 - 0x0000)
struct AthenaHUD_PickupItemWidget_C_ExecuteUbergraph_AthenaHUD_PickupItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUD_PickupItemWidget_C_ExecuteUbergraph_AthenaHUD_PickupItemWidget) == 0x000004, "Wrong alignment on AthenaHUD_PickupItemWidget_C_ExecuteUbergraph_AthenaHUD_PickupItemWidget");
static_assert(sizeof(AthenaHUD_PickupItemWidget_C_ExecuteUbergraph_AthenaHUD_PickupItemWidget) == 0x000004, "Wrong size on AthenaHUD_PickupItemWidget_C_ExecuteUbergraph_AthenaHUD_PickupItemWidget");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_ExecuteUbergraph_AthenaHUD_PickupItemWidget, EntryPoint) == 0x000000, "Member 'AthenaHUD_PickupItemWidget_C_ExecuteUbergraph_AthenaHUD_PickupItemWidget::EntryPoint' has a wrong offset!");

// Function AthenaHUD-PickupItemWidget.AthenaHUD-PickupItemWidget_C.InitializeInteractionFailureText
// 0x0018 (0x0018 - 0x0000)
struct AthenaHUD_PickupItemWidget_C_InitializeInteractionFailureText final
{
public:
	class FText                                   InteractErrorText;                                 // 0x0000(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(AthenaHUD_PickupItemWidget_C_InitializeInteractionFailureText) == 0x000008, "Wrong alignment on AthenaHUD_PickupItemWidget_C_InitializeInteractionFailureText");
static_assert(sizeof(AthenaHUD_PickupItemWidget_C_InitializeInteractionFailureText) == 0x000018, "Wrong size on AthenaHUD_PickupItemWidget_C_InitializeInteractionFailureText");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeInteractionFailureText, InteractErrorText) == 0x000000, "Member 'AthenaHUD_PickupItemWidget_C_InitializeInteractionFailureText::InteractErrorText' has a wrong offset!");

// Function AthenaHUD-PickupItemWidget.AthenaHUD-PickupItemWidget_C.InitializeItemData
// 0x0020 (0x0020 - 0x0000)
struct AthenaHUD_PickupItemWidget_C_InitializeItemData final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUD_PickupItemWidget_C_InitializeItemData) == 0x000008, "Wrong alignment on AthenaHUD_PickupItemWidget_C_InitializeItemData");
static_assert(sizeof(AthenaHUD_PickupItemWidget_C_InitializeItemData) == 0x000020, "Wrong size on AthenaHUD_PickupItemWidget_C_InitializeItemData");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeItemData, Temp_bool_Variable) == 0x000000, "Member 'AthenaHUD_PickupItemWidget_C_InitializeItemData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeItemData, Temp_object_Variable) == 0x000008, "Member 'AthenaHUD_PickupItemWidget_C_InitializeItemData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeItemData, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AthenaHUD_PickupItemWidget_C_InitializeItemData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeItemData, Temp_bool_Variable_1) == 0x000011, "Member 'AthenaHUD_PickupItemWidget_C_InitializeItemData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeItemData, Temp_byte_Variable) == 0x000012, "Member 'AthenaHUD_PickupItemWidget_C_InitializeItemData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeItemData, Temp_byte_Variable_1) == 0x000013, "Member 'AthenaHUD_PickupItemWidget_C_InitializeItemData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeItemData, K2Node_Select_Default) == 0x000014, "Member 'AthenaHUD_PickupItemWidget_C_InitializeItemData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeItemData, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'AthenaHUD_PickupItemWidget_C_InitializeItemData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_InitializeItemData, K2Node_Select_Default_1) == 0x000018, "Member 'AthenaHUD_PickupItemWidget_C_InitializeItemData::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaHUD-PickupItemWidget.AthenaHUD-PickupItemWidget_C.SetPickup
// 0x0008 (0x0008 - 0x0000)
struct AthenaHUD_PickupItemWidget_C_SetPickup final
{
public:
	class AFortPickup*                            NewPickup;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUD_PickupItemWidget_C_SetPickup) == 0x000008, "Wrong alignment on AthenaHUD_PickupItemWidget_C_SetPickup");
static_assert(sizeof(AthenaHUD_PickupItemWidget_C_SetPickup) == 0x000008, "Wrong size on AthenaHUD_PickupItemWidget_C_SetPickup");
static_assert(offsetof(AthenaHUD_PickupItemWidget_C_SetPickup, NewPickup) == 0x000000, "Member 'AthenaHUD_PickupItemWidget_C_SetPickup::NewPickup' has a wrong offset!");

}

