#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPlayerInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaPlayerInfo.AthenaPlayerInfo_C
// 0x0020 (0x0340 - 0x0320)
class UAthenaPlayerInfo_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         _Horizontal_Box__Player_Info;                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeaderImage;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPlayerName;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_AthenaPlayerInfo(int32 EntryPoint);
	void HandlePlayerStateChanged(const struct FFortTeamMemberInfo& PlayerInfo);
	void UpdateLocalPlayerInfo(struct FFortTeamMemberInfo& Player_Info);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaPlayerInfo_C">();
	}
	static class UAthenaPlayerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaPlayerInfo_C>();
	}
};
static_assert(alignof(UAthenaPlayerInfo_C) == 0x000008, "Wrong alignment on UAthenaPlayerInfo_C");
static_assert(sizeof(UAthenaPlayerInfo_C) == 0x000340, "Wrong size on UAthenaPlayerInfo_C");
static_assert(offsetof(UAthenaPlayerInfo_C, UberGraphFrame) == 0x000320, "Member 'UAthenaPlayerInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerInfo_C, _Horizontal_Box__Player_Info) == 0x000328, "Member 'UAthenaPlayerInfo_C::_Horizontal_Box__Player_Info' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerInfo_C, LeaderImage) == 0x000330, "Member 'UAthenaPlayerInfo_C::LeaderImage' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerInfo_C, TextPlayerName) == 0x000338, "Member 'UAthenaPlayerInfo_C::TextPlayerName' has a wrong offset!");

}

