#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDBottomBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHUDBottomBar.AthenaHUDBottomBar_C
// 0x0020 (0x0300 - 0x02E0)
class UAthenaHUDBottomBar_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_BottomBorder;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBoundActionBar*                  BoundActionBar;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaHUDBottomBar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHUDBottomBar_C">();
	}
	static class UAthenaHUDBottomBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDBottomBar_C>();
	}
};
static_assert(alignof(UAthenaHUDBottomBar_C) == 0x000008, "Wrong alignment on UAthenaHUDBottomBar_C");
static_assert(sizeof(UAthenaHUDBottomBar_C) == 0x000300, "Wrong size on UAthenaHUDBottomBar_C");
static_assert(offsetof(UAthenaHUDBottomBar_C, UberGraphFrame) == 0x0002E0, "Member 'UAthenaHUDBottomBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBottomBar_C, Border_BottomBorder) == 0x0002E8, "Member 'UAthenaHUDBottomBar_C::Border_BottomBorder' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBottomBar_C, BoundActionBar) == 0x0002F0, "Member 'UAthenaHUDBottomBar_C::BoundActionBar' has a wrong offset!");
static_assert(offsetof(UAthenaHUDBottomBar_C, SafeZone_1) == 0x0002F8, "Member 'UAthenaHUDBottomBar_C::SafeZone_1' has a wrong offset!");

}

