#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastKillFeedItem

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastKillFeedItem.AthenaBroadcastKillFeedItem_C
// 0x0018 (0x0420 - 0x0408)
class UAthenaBroadcastKillFeedItem_C final : public UAthenaBroadcastKillFeedItemBase
{
public:
	class UWidgetAnimation*                       SlideUp;                                           // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideFadeOut;                                      // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideFadeIn;                                       // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcastKillFeedItem_C">();
	}
	static class UAthenaBroadcastKillFeedItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastKillFeedItem_C>();
	}
};
static_assert(alignof(UAthenaBroadcastKillFeedItem_C) == 0x000008, "Wrong alignment on UAthenaBroadcastKillFeedItem_C");
static_assert(sizeof(UAthenaBroadcastKillFeedItem_C) == 0x000420, "Wrong size on UAthenaBroadcastKillFeedItem_C");
static_assert(offsetof(UAthenaBroadcastKillFeedItem_C, SlideUp) == 0x000408, "Member 'UAthenaBroadcastKillFeedItem_C::SlideUp' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastKillFeedItem_C, SlideFadeOut) == 0x000410, "Member 'UAthenaBroadcastKillFeedItem_C::SlideFadeOut' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastKillFeedItem_C, SlideFadeIn) == 0x000418, "Member 'UAthenaBroadcastKillFeedItem_C::SlideFadeIn' has a wrong offset!");

}

