#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_Commerce_StoreShelves_10

#include "Basic.hpp"

#include "Athena_Prop_ParentBuildingContainerBlueprint_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_Commerce_StoreShelves_10.Athena_Prop_Commerce_StoreShelves_10_C
// 0x0018 (0x0F70 - 0x0F58)
class AAthena_Prop_Commerce_StoreShelves_10_C final : public AAthena_Prop_ParentBuildingContainerBlueprint_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Prop_Commerce_StoreShelves_10_C; // 0x0F58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0F60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0F68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Prop_Commerce_StoreShelves_10(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_Commerce_StoreShelves_10_C">();
	}
	static class AAthena_Prop_Commerce_StoreShelves_10_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_Commerce_StoreShelves_10_C>();
	}
};
static_assert(alignof(AAthena_Prop_Commerce_StoreShelves_10_C) == 0x000008, "Wrong alignment on AAthena_Prop_Commerce_StoreShelves_10_C");
static_assert(sizeof(AAthena_Prop_Commerce_StoreShelves_10_C) == 0x000F70, "Wrong size on AAthena_Prop_Commerce_StoreShelves_10_C");
static_assert(offsetof(AAthena_Prop_Commerce_StoreShelves_10_C, UberGraphFrame_Athena_Prop_Commerce_StoreShelves_10_C) == 0x000F58, "Member 'AAthena_Prop_Commerce_StoreShelves_10_C::UberGraphFrame_Athena_Prop_Commerce_StoreShelves_10_C' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Commerce_StoreShelves_10_C, SpotLight1) == 0x000F60, "Member 'AAthena_Prop_Commerce_StoreShelves_10_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Commerce_StoreShelves_10_C, SpotLight) == 0x000F68, "Member 'AAthena_Prop_Commerce_StoreShelves_10_C::SpotLight' has a wrong offset!");

}

