#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorBuildCountWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaSpectatorBuildCountWidget.AthenaSpectatorBuildCountWidget_C.ExecuteUbergraph_AthenaSpectatorBuildCountWidget
// 0x0050 (0x0050 - 0x0000)
struct AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OldCount;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewCount;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorBuildCountType                      Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0028(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget) == 0x000008, "Wrong alignment on AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget");
static_assert(sizeof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget) == 0x000050, "Wrong size on AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, EntryPoint) == 0x000000, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, K2Node_Event_OldCount) == 0x000004, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::K2Node_Event_OldCount' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, K2Node_Event_NewCount) == 0x000008, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::K2Node_Event_NewCount' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000D, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, Temp_byte_Variable) == 0x000020, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget, K2Node_Select_Default) == 0x000028, "Member 'AthenaSpectatorBuildCountWidget_C_ExecuteUbergraph_AthenaSpectatorBuildCountWidget::K2Node_Select_Default' has a wrong offset!");

// Function AthenaSpectatorBuildCountWidget.AthenaSpectatorBuildCountWidget_C.OnBuildCountChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaSpectatorBuildCountWidget_C_OnBuildCountChanged final
{
public:
	int32                                         OldCount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorBuildCountWidget_C_OnBuildCountChanged) == 0x000004, "Wrong alignment on AthenaSpectatorBuildCountWidget_C_OnBuildCountChanged");
static_assert(sizeof(AthenaSpectatorBuildCountWidget_C_OnBuildCountChanged) == 0x000008, "Wrong size on AthenaSpectatorBuildCountWidget_C_OnBuildCountChanged");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_OnBuildCountChanged, OldCount) == 0x000000, "Member 'AthenaSpectatorBuildCountWidget_C_OnBuildCountChanged::OldCount' has a wrong offset!");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_OnBuildCountChanged, NewCount) == 0x000004, "Member 'AthenaSpectatorBuildCountWidget_C_OnBuildCountChanged::NewCount' has a wrong offset!");

// Function AthenaSpectatorBuildCountWidget.AthenaSpectatorBuildCountWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpectatorBuildCountWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpectatorBuildCountWidget_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaSpectatorBuildCountWidget_C_PreConstruct");
static_assert(sizeof(AthenaSpectatorBuildCountWidget_C_PreConstruct) == 0x000001, "Wrong size on AthenaSpectatorBuildCountWidget_C_PreConstruct");
static_assert(offsetof(AthenaSpectatorBuildCountWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaSpectatorBuildCountWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

