#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMarkerDetails

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.ExecuteUbergraph_AthenaMarkerDetails
// 0x03C8 (0x03C8 - 0x0000)
struct AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	TDelegate<void(class UUserWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_UserWidget;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortActorMarkerInterface> K2Node_DynamicCast_AsFort_Actor_Marker_Interface;  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x0060(0x0018)()
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWorldMarkerData                   K2Node_Event_MarkerData;                           // 0x00B0(0x0160)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x0220(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMarkerActions                            Temp_byte_Variable;                                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMarkerActions                            Temp_byte_Variable_4;                              // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMarkerActions                            K2Node_Event_MarkerAction;                         // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0258(0x0018)()
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarkedActorDisplayInfo                CallFunc_GetMarkedItemDetails_DisplayInfo;         // 0x0280(0x0098)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_3;                  // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_2;                 // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0394(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CreateWidgetAsync*     CallFunc_CreateWidgetAsync_ReturnValue;            // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails");
static_assert(sizeof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails) == 0x0003C8, "Wrong size on AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, EntryPoint) == 0x000000, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_text_Variable) == 0x000008, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_CustomEvent_UserWidget) == 0x000030, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_CustomEvent_UserWidget' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_object_Variable) == 0x000038, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_DynamicCast_AsFort_Actor_Marker_Interface) == 0x000040, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_DynamicCast_AsFort_Actor_Marker_Interface' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_text_Variable_1) == 0x000060, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_MakeColor_ReturnValue) == 0x000078, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_MakeColor_ReturnValue_1) == 0x000088, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_MakeColor_ReturnValue_2) == 0x0000A0, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_MakeColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_Event_MarkerData) == 0x0000B0, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_Event_MarkerData' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_SwitchEnum_CmpSuccess) == 0x000210, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_Event_IsDesignTime) == 0x000211, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000218, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_text_Variable_2) == 0x000220, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000238, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_byte_Variable) == 0x000240, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_byte_Variable_1) == 0x000241, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_byte_Variable_2) == 0x000242, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_byte_Variable_3) == 0x000243, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_byte_Variable_4) == 0x000244, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000248, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_Event_MarkerAction) == 0x000250, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_Event_MarkerAction' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_Select_Default) == 0x000251, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_Select_Default_1) == 0x000258, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_CustomEvent_Loaded) == 0x000270, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_GetVisibility_ReturnValue) == 0x000278, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_GetMarkedItemDetails_DisplayInfo) == 0x000280, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_GetMarkedItemDetails_DisplayInfo' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000318, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_Not_PreBool_ReturnValue) == 0x000319, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000320, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_DynamicCast_AsTexture_2D) == 0x000328, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_DynamicCast_bSuccess_1) == 0x000330, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000338, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_IsValid_ReturnValue_1) == 0x000340, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_DynamicCast_AsTexture_2D_1) == 0x000348, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_DynamicCast_bSuccess_2) == 0x000350, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_BreakColor_R) == 0x000354, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_BreakColor_G) == 0x000358, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_BreakColor_B) == 0x00035C, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_BreakColor_A) == 0x000360, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000364, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000368, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00036C, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x000370, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_MakeColor_ReturnValue_3) == 0x000378, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_MakeColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_DynamicCast_AsTexture_2D_2) == 0x000388, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_DynamicCast_AsTexture_2D_2' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_DynamicCast_bSuccess_3) == 0x000390, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_CreateDelegate_OutputDelegate_1) == 0x000394, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_CreateWidgetAsync_ReturnValue) == 0x0003A0, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_CreateWidgetAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_IsValid_ReturnValue_2) == 0x0003A8, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0003A9, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, Temp_object_Variable_1) == 0x0003B0, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0003B8, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, CallFunc_AddChild_ReturnValue) == 0x0003C0, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.GetMarkedItemDetails
// 0x0130 (0x0130 - 0x0000)
struct AthenaMarkerDetails_C_GetMarkedItemDetails final
{
public:
	struct FMarkedActorDisplayInfo                DisplayInfo;                                       // 0x0000(0x0098)(Parm, OutParm)
	struct FMarkedActorDisplayInfo                CallFunc_GetDisplayInfoForMarkerData_ReturnValue;  // 0x0098(0x0098)()
};
static_assert(alignof(AthenaMarkerDetails_C_GetMarkedItemDetails) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_GetMarkedItemDetails");
static_assert(sizeof(AthenaMarkerDetails_C_GetMarkedItemDetails) == 0x000130, "Wrong size on AthenaMarkerDetails_C_GetMarkedItemDetails");
static_assert(offsetof(AthenaMarkerDetails_C_GetMarkedItemDetails, DisplayInfo) == 0x000000, "Member 'AthenaMarkerDetails_C_GetMarkedItemDetails::DisplayInfo' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_GetMarkedItemDetails, CallFunc_GetDisplayInfoForMarkerData_ReturnValue) == 0x000098, "Member 'AthenaMarkerDetails_C_GetMarkedItemDetails::CallFunc_GetDisplayInfoForMarkerData_ReturnValue' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.OnComplete_115418894655482D94CA63BE09CDFFAF
// 0x0008 (0x0008 - 0x0000)
struct AthenaMarkerDetails_C_OnComplete_115418894655482D94CA63BE09CDFFAF final
{
public:
	class UUserWidget*                            UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMarkerDetails_C_OnComplete_115418894655482D94CA63BE09CDFFAF) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_OnComplete_115418894655482D94CA63BE09CDFFAF");
static_assert(sizeof(AthenaMarkerDetails_C_OnComplete_115418894655482D94CA63BE09CDFFAF) == 0x000008, "Wrong size on AthenaMarkerDetails_C_OnComplete_115418894655482D94CA63BE09CDFFAF");
static_assert(offsetof(AthenaMarkerDetails_C_OnComplete_115418894655482D94CA63BE09CDFFAF, UserWidget) == 0x000000, "Member 'AthenaMarkerDetails_C_OnComplete_115418894655482D94CA63BE09CDFFAF::UserWidget' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE
// 0x0008 (0x0008 - 0x0000)
struct AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE");
static_assert(sizeof(AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE) == 0x000008, "Wrong size on AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE");
static_assert(offsetof(AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE, Loaded) == 0x000000, "Member 'AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE::Loaded' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaMarkerDetails_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMarkerDetails_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaMarkerDetails_C_PreConstruct");
static_assert(sizeof(AthenaMarkerDetails_C_PreConstruct) == 0x000001, "Wrong size on AthenaMarkerDetails_C_PreConstruct");
static_assert(offsetof(AthenaMarkerDetails_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaMarkerDetails_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.SetDisplayText
// 0x0030 (0x0030 - 0x0000)
struct AthenaMarkerDetails_C_SetDisplayText final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(AthenaMarkerDetails_C_SetDisplayText) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_SetDisplayText");
static_assert(sizeof(AthenaMarkerDetails_C_SetDisplayText) == 0x000030, "Wrong size on AthenaMarkerDetails_C_SetDisplayText");
static_assert(offsetof(AthenaMarkerDetails_C_SetDisplayText, NewText) == 0x000000, "Member 'AthenaMarkerDetails_C_SetDisplayText::NewText' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_SetDisplayText, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'AthenaMarkerDetails_C_SetDisplayText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.SetLineColor
// 0x0010 (0x0010 - 0x0000)
struct AthenaMarkerDetails_C_SetLineColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMarkerDetails_C_SetLineColor) == 0x000004, "Wrong alignment on AthenaMarkerDetails_C_SetLineColor");
static_assert(sizeof(AthenaMarkerDetails_C_SetLineColor) == 0x000010, "Wrong size on AthenaMarkerDetails_C_SetLineColor");
static_assert(offsetof(AthenaMarkerDetails_C_SetLineColor, NewColor) == 0x000000, "Member 'AthenaMarkerDetails_C_SetLineColor::NewColor' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.Show
// 0x0001 (0x0001 - 0x0000)
struct AthenaMarkerDetails_C_Show final
{
public:
	bool                                          Show_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMarkerDetails_C_Show) == 0x000001, "Wrong alignment on AthenaMarkerDetails_C_Show");
static_assert(sizeof(AthenaMarkerDetails_C_Show) == 0x000001, "Wrong size on AthenaMarkerDetails_C_Show");
static_assert(offsetof(AthenaMarkerDetails_C_Show, Show_0) == 0x000000, "Member 'AthenaMarkerDetails_C_Show::Show_0' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.UpdateMarkerAction
// 0x0001 (0x0001 - 0x0000)
struct AthenaMarkerDetails_C_UpdateMarkerAction final
{
public:
	EFortMarkerActions                            MarkerAction;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMarkerDetails_C_UpdateMarkerAction) == 0x000001, "Wrong alignment on AthenaMarkerDetails_C_UpdateMarkerAction");
static_assert(sizeof(AthenaMarkerDetails_C_UpdateMarkerAction) == 0x000001, "Wrong size on AthenaMarkerDetails_C_UpdateMarkerAction");
static_assert(offsetof(AthenaMarkerDetails_C_UpdateMarkerAction, MarkerAction) == 0x000000, "Member 'AthenaMarkerDetails_C_UpdateMarkerAction::MarkerAction' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.UpdateMarkerData
// 0x0160 (0x0160 - 0x0000)
struct AthenaMarkerDetails_C_UpdateMarkerData final
{
public:
	struct FFortWorldMarkerData                   MarkerData;                                        // 0x0000(0x0160)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMarkerDetails_C_UpdateMarkerData) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_UpdateMarkerData");
static_assert(sizeof(AthenaMarkerDetails_C_UpdateMarkerData) == 0x000160, "Wrong size on AthenaMarkerDetails_C_UpdateMarkerData");
static_assert(offsetof(AthenaMarkerDetails_C_UpdateMarkerData, MarkerData) == 0x000000, "Member 'AthenaMarkerDetails_C_UpdateMarkerData::MarkerData' has a wrong offset!");

}

