#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLowFuelWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AthenaGenericWarning_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLowFuelWarning.AthenaLowFuelWarning_C
// 0x0068 (0x0398 - 0x0330)
class UAthenaLowFuelWarning_C final : public UAthenaGenericWarning_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   LowFuelMessage;                                    // 0x0338(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInterface*                     LowFuelMaterial;                                   // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LowFuelPercent;                                    // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutOfFuelMessage;                                  // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInterface*                     OutOfFuelMaterial;                                 // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     MyVehicle;                                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> MyVehicleInterface;                                // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaLowFuelWarning(int32 EntryPoint);
	void OnEnterVehicleDriver_Bind();
	void OnEnterVehiclePassenger_Bind();
	void OnExitVehicle_Bind();
	void OnFuelAboveThreshold_Bind();
	void OnFuelBelowThreshold_Bind();
	void OnNotOutOfFuel_Bind();
	void OnOutOfFuel_Bind();
	void PreConstruct(bool IsDesignTime);
	void UnbindDelegates();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLowFuelWarning_C">();
	}
	static class UAthenaLowFuelWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLowFuelWarning_C>();
	}
};
static_assert(alignof(UAthenaLowFuelWarning_C) == 0x000008, "Wrong alignment on UAthenaLowFuelWarning_C");
static_assert(sizeof(UAthenaLowFuelWarning_C) == 0x000398, "Wrong size on UAthenaLowFuelWarning_C");
static_assert(offsetof(UAthenaLowFuelWarning_C, UberGraphFrame) == 0x000330, "Member 'UAthenaLowFuelWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLowFuelWarning_C, LowFuelMessage) == 0x000338, "Member 'UAthenaLowFuelWarning_C::LowFuelMessage' has a wrong offset!");
static_assert(offsetof(UAthenaLowFuelWarning_C, LowFuelMaterial) == 0x000350, "Member 'UAthenaLowFuelWarning_C::LowFuelMaterial' has a wrong offset!");
static_assert(offsetof(UAthenaLowFuelWarning_C, LowFuelPercent) == 0x000358, "Member 'UAthenaLowFuelWarning_C::LowFuelPercent' has a wrong offset!");
static_assert(offsetof(UAthenaLowFuelWarning_C, OutOfFuelMessage) == 0x000360, "Member 'UAthenaLowFuelWarning_C::OutOfFuelMessage' has a wrong offset!");
static_assert(offsetof(UAthenaLowFuelWarning_C, OutOfFuelMaterial) == 0x000378, "Member 'UAthenaLowFuelWarning_C::OutOfFuelMaterial' has a wrong offset!");
static_assert(offsetof(UAthenaLowFuelWarning_C, MyVehicle) == 0x000380, "Member 'UAthenaLowFuelWarning_C::MyVehicle' has a wrong offset!");
static_assert(offsetof(UAthenaLowFuelWarning_C, MyVehicleInterface) == 0x000388, "Member 'UAthenaLowFuelWarning_C::MyVehicleInterface' has a wrong offset!");

}

