#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_SilkyBingo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_SilkyBingo.Athena_Prop_SilkyBingo_C.Apply Water if Curie Enabled
// 0x0118 (0x0118 - 0x0000)
struct Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0030(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsCurieActive_ReturnValue;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled) == 0x000008, "Wrong alignment on Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled");
static_assert(sizeof(Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled) == 0x000118, "Wrong size on Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled, Instigator_0) == 0x000000, "Member 'Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled::Instigator_0' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled, Target) == 0x000008, "Member 'Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled::Target' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled, CallFunc_MakeHitResult_ReturnValue) == 0x000030, "Member 'Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled, CallFunc_IsCurieActive_ReturnValue) == 0x000110, "Member 'Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled::CallFunc_IsCurieActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled, CallFunc_IsDedicatedServer_ReturnValue) == 0x000111, "Member 'Athena_Prop_SilkyBingo_C_Apply_Water_if_Curie_Enabled::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function Athena_Prop_SilkyBingo.Athena_Prop_SilkyBingo_C.Distance Check for Camera Lens Effect
// 0x0080 (0x0080 - 0x0000)
struct Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect) == 0x000008, "Wrong alignment on Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect");
static_assert(sizeof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect) == 0x000080, "Wrong size on Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, Instigator_0) == 0x000000, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::Instigator_0' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, ReturnValue) == 0x000008, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BreakVector_X) == 0x000040, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BreakVector_Y) == 0x000044, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BreakVector_Z) == 0x000048, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BreakVector_X_1) == 0x00004C, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BreakVector_Y_1) == 0x000050, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BreakVector_Z_1) == 0x000054, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Add_FloatFloat_ReturnValue) == 0x000058, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00005C, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000060, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Less_FloatFloat_ReturnValue) == 0x000061, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000064, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000068, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00006C, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00006D, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BooleanOR_ReturnValue) == 0x00006E, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000070, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000074, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000078, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000079, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BooleanOR_ReturnValue_1) == 0x00007A, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BooleanOR_ReturnValue_2) == 0x00007B, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BooleanOR_ReturnValue_3) == 0x00007C, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect, CallFunc_BooleanOR_ReturnValue_4) == 0x00007D, "Member 'Athena_Prop_SilkyBingo_C_Distance_Check_for_Camera_Lens_Effect::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");

// Function Athena_Prop_SilkyBingo.Athena_Prop_SilkyBingo_C.ExecuteUbergraph_Athena_Prop_SilkyBingo
// 0x0400 (0x0400 - 0x0000)
struct Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_1;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0040(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x0078(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0168(0x0018)()
	bool                                          CallFunc_ShouldAllowDeathEffects_ReturnValue;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x01A8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x01E0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x02D0(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0380(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue; // 0x03E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo) == 0x000008, "Wrong alignment on Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo");
static_assert(sizeof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo) == 0x000400, "Wrong size on Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, EntryPoint) == 0x000000, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, Temp_object_Variable) == 0x000020, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000030, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_Damage_1) == 0x000038, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_DamageTags_1) == 0x000040, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_Momentum_1) == 0x000060, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_HitInfo_1) == 0x000078, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_InstigatedBy_1) == 0x000158, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_DamageCauser_1) == 0x000160, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_EffectContext_1) == 0x000168, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_ShouldAllowDeathEffects_ReturnValue) == 0x000180, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_ShouldAllowDeathEffects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000188, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_Damage) == 0x0001A0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_DamageTags) == 0x0001A8, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_Momentum) == 0x0001C8, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_HitInfo) == 0x0001E0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_InstigatedBy) == 0x0002C0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_DamageCauser) == 0x0002C8, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_Event_EffectContext) == 0x0002D0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, Temp_int_Array_Index_Variable) == 0x0002E8, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0002F0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_BreakVector_X) == 0x000308, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_BreakVector_Y) == 0x00030C, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_BreakVector_Z) == 0x000310, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000314, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_MakeRotator_ReturnValue) == 0x000318, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000330, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_GetActorScale3D_ReturnValue) == 0x000338, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_VSize_ReturnValue) == 0x000350, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_GetActorScale3D_ReturnValue_1) == 0x000358, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000370, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_BreakVector_X_1) == 0x000374, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_BreakVector_Y_1) == 0x000378, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_BreakVector_Z_1) == 0x00037C, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_SphereOverlapActors_OutActors) == 0x000380, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_SphereOverlapActors_ReturnValue) == 0x000390, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000394, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_Array_Get_Item) == 0x000398, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_Array_Length_ReturnValue) == 0x0003A0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_IsValid_ReturnValue) == 0x0003A4, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0003A8, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0003AC, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_MakeVector_ReturnValue) == 0x0003B0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_DynamicCast_AsFort_Pawn) == 0x0003C8, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, K2Node_DynamicCast_bSuccess) == 0x0003D0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x0003D8, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0003E0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue) == 0x0003E8, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, Temp_int_Loop_Counter_Variable) == 0x0003F0, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_Less_IntInt_ReturnValue) == 0x0003F4, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo, CallFunc_Add_IntInt_ReturnValue) == 0x0003F8, "Member 'Athena_Prop_SilkyBingo_C_ExecuteUbergraph_Athena_Prop_SilkyBingo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Athena_Prop_SilkyBingo.Athena_Prop_SilkyBingo_C.OnDeathPlayEffects
// 0x0148 (0x0148 - 0x0000)
struct Athena_Prop_SilkyBingo_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Athena_Prop_SilkyBingo_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Athena_Prop_SilkyBingo_C_OnDeathPlayEffects");
static_assert(sizeof(Athena_Prop_SilkyBingo_C_OnDeathPlayEffects) == 0x000148, "Wrong size on Athena_Prop_SilkyBingo_C_OnDeathPlayEffects");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Athena_Prop_SilkyBingo_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Athena_Prop_SilkyBingo_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Athena_Prop_SilkyBingo_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathPlayEffects, HitInfo) == 0x000040, "Member 'Athena_Prop_SilkyBingo_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathPlayEffects, InstigatedBy) == 0x000120, "Member 'Athena_Prop_SilkyBingo_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathPlayEffects, DamageCauser) == 0x000128, "Member 'Athena_Prop_SilkyBingo_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathPlayEffects, EffectContext) == 0x000130, "Member 'Athena_Prop_SilkyBingo_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Athena_Prop_SilkyBingo.Athena_Prop_SilkyBingo_C.OnDeathServer
// 0x0148 (0x0148 - 0x0000)
struct Athena_Prop_SilkyBingo_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Athena_Prop_SilkyBingo_C_OnDeathServer) == 0x000008, "Wrong alignment on Athena_Prop_SilkyBingo_C_OnDeathServer");
static_assert(sizeof(Athena_Prop_SilkyBingo_C_OnDeathServer) == 0x000148, "Wrong size on Athena_Prop_SilkyBingo_C_OnDeathServer");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathServer, Damage) == 0x000000, "Member 'Athena_Prop_SilkyBingo_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathServer, DamageTags) == 0x000008, "Member 'Athena_Prop_SilkyBingo_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathServer, Momentum) == 0x000028, "Member 'Athena_Prop_SilkyBingo_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathServer, HitInfo) == 0x000040, "Member 'Athena_Prop_SilkyBingo_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathServer, InstigatedBy) == 0x000120, "Member 'Athena_Prop_SilkyBingo_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathServer, DamageCauser) == 0x000128, "Member 'Athena_Prop_SilkyBingo_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_OnDeathServer, EffectContext) == 0x000130, "Member 'Athena_Prop_SilkyBingo_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function Athena_Prop_SilkyBingo.Athena_Prop_SilkyBingo_C.ShouldDie
// 0x0020 (0x0020 - 0x0000)
struct Athena_Prop_SilkyBingo_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_SilkyBingo_C_ShouldDie) == 0x000008, "Wrong alignment on Athena_Prop_SilkyBingo_C_ShouldDie");
static_assert(sizeof(Athena_Prop_SilkyBingo_C_ShouldDie) == 0x000020, "Wrong size on Athena_Prop_SilkyBingo_C_ShouldDie");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ShouldDie, Damage) == 0x000000, "Member 'Athena_Prop_SilkyBingo_C_ShouldDie::Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ShouldDie, EventInstigator) == 0x000008, "Member 'Athena_Prop_SilkyBingo_C_ShouldDie::EventInstigator' has a wrong offset!");
static_assert(offsetof(Athena_Prop_SilkyBingo_C_ShouldDie, DamageCauser) == 0x000010, "Member 'Athena_Prop_SilkyBingo_C_ShouldDie::DamageCauser' has a wrong offset!");
