#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastMapPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaBroadcastMapPanel.AthenaBroadcastMapPanel_C.BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaBroadcastMapPanel_C_BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBroadcastMapPanel_C_BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on AthenaBroadcastMapPanel_C_BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(AthenaBroadcastMapPanel_C_BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on AthenaBroadcastMapPanel_C_BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(AthenaBroadcastMapPanel_C_BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'AthenaBroadcastMapPanel_C_BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastMapPanel_C_BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'AthenaBroadcastMapPanel_C_BndEvt__LHSSwitcher_K2Node_ComponentBoundEvent_3_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function AthenaBroadcastMapPanel.AthenaBroadcastMapPanel_C.ExecuteUbergraph_AthenaBroadcastMapPanel
// 0x00F0 (0x00F0 - 0x0000)
struct AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0030(0x00C0)()
};
static_assert(alignof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel) == 0x000010, "Wrong alignment on AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel");
static_assert(sizeof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel) == 0x0000F0, "Wrong size on AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel");
static_assert(offsetof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel, EntryPoint) == 0x000000, "Member 'AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel, Temp_bool_Variable) == 0x000004, "Member 'AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000008, "Member 'AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000010, "Member 'AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000014, "Member 'AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000018, "Member 'AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel, K2Node_Select_Default) == 0x000030, "Member 'AthenaBroadcastMapPanel_C_ExecuteUbergraph_AthenaBroadcastMapPanel::K2Node_Select_Default' has a wrong offset!");

}

