#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEventMatchPlayerGridPlayerWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AthenaEventMatchPlayerGridStatus_structs.hpp"


namespace SDK::Params
{

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget
// 0x00F0 (0x00F0 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_9;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InHealth_1;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InHealthMax_1;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_8;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InShield_1;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InShieldMax_1;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_7;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDBNO;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_6;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDead;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_5;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsBeingRevived;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_4;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 K2Node_Event_InPlayerState;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_3;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InHealth;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InHealthMax;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_2;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InShield;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InShieldMax;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_1;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDisconnected;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAliveAndNotInAircraft_bAliveAndNotInAircraft; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAliveAndNotInAircraft_bAliveAndNotInAircraft_1; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaRemotePlayerViewData*            K2Node_Event_InPlayerData_10;                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_InPlayerName;                         // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget) == 0x0000F0, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, EntryPoint) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_9) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_9' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InHealth_1) == 0x000010, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InHealth_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InHealthMax_1) == 0x000014, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InHealthMax_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_8) == 0x000018, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_8' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InShield_1) == 0x000020, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InShield_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InShieldMax_1) == 0x000024, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InShieldMax_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_7) == 0x000028, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_7' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_bIsDBNO) == 0x000030, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_bIsDBNO' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_6) == 0x000038, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_6' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_bIsDead) == 0x000040, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_bIsDead' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_5) == 0x000048, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_5' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_bIsBeingRevived) == 0x000050, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_bIsBeingRevived' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_4) == 0x000058, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_4' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerState) == 0x000060, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerState' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_3) == 0x000068, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_3' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InHealth) == 0x000070, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InHealth' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InHealthMax) == 0x000074, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InHealthMax' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_2) == 0x000078, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_2' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InShield) == 0x000080, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InShield' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InShieldMax) == 0x000084, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InShieldMax' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_1) == 0x000088, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_bIsDisconnected) == 0x000090, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_bIsDisconnected' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_IsDesignTime) == 0x000091, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, CallFunc_IsAliveAndNotInAircraft_bAliveAndNotInAircraft) == 0x0000A0, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::CallFunc_IsAliveAndNotInAircraft_bAliveAndNotInAircraft' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A8, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, CallFunc_IsAliveAndNotInAircraft_bAliveAndNotInAircraft_1) == 0x0000B0, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::CallFunc_IsAliveAndNotInAircraft_bAliveAndNotInAircraft_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData) == 0x0000B8, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerData_10) == 0x0000C0, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerData_10' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, K2Node_Event_InPlayerName) == 0x0000C8, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::K2Node_Event_InPlayerName' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.IsAliveAndNotInAircraft
// 0x0007 (0x0007 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft final
{
public:
	bool                                          bAliveAndNotInAircraft;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInAircraft_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEliminated_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft) == 0x000001, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft) == 0x000007, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft, bAliveAndNotInAircraft) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft::bAliveAndNotInAircraft' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft, CallFunc_GetInAircraft_ReturnValue) == 0x000002, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft::CallFunc_GetInAircraft_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft, CallFunc_GetIsEliminated_ReturnValue) == 0x000004, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft::CallFunc_GetIsEliminated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft, CallFunc_Not_PreBool_ReturnValue_1) == 0x000005, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsAliveAndNotInAircraft::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.IsGamePreAircraft
// 0x0020 (0x0020 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft final
{
public:
	bool                                          bIsGamePreAircraft;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft) == 0x000020, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft, bIsGamePreAircraft) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft::bIsGamePreAircraft' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000010, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft, CallFunc_Less_ByteByte_ReturnValue) == 0x000019, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_IsGamePreAircraft::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnBeingRevivedStateChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnBeingRevivedStateChanged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBeingRevived;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnBeingRevivedStateChanged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnBeingRevivedStateChanged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnBeingRevivedStateChanged) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnBeingRevivedStateChanged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnBeingRevivedStateChanged, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnBeingRevivedStateChanged::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnBeingRevivedStateChanged, bIsBeingRevived) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnBeingRevivedStateChanged::bIsBeingRevived' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnDBNOStateChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnDBNOStateChanged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDBNO;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDBNOStateChanged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnDBNOStateChanged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDBNOStateChanged) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnDBNOStateChanged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDBNOStateChanged, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnDBNOStateChanged::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDBNOStateChanged, bIsDBNO) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnDBNOStateChanged::bIsDBNO' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnDeadStateChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnDeadStateChanged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDead;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDeadStateChanged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnDeadStateChanged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDeadStateChanged) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnDeadStateChanged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDeadStateChanged, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnDeadStateChanged::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDeadStateChanged, bIsDead) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnDeadStateChanged::bIsDead' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnDisconnectedChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnDisconnectedChanged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDisconnected;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDisconnectedChanged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnDisconnectedChanged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDisconnectedChanged) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnDisconnectedChanged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDisconnectedChanged, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnDisconnectedChanged::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnDisconnectedChanged, bIsDisconnected) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnDisconnectedChanged::bIsDisconnected' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnGridSizeChanged
// 0x0024 (0x0024 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged final
{
public:
	int32                                         InGridSize;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged) == 0x000004, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged) == 0x000024, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, InGridSize) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::InGridSize' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, Temp_bool_Variable) == 0x000004, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, Temp_byte_Variable) == 0x00000C, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, Temp_byte_Variable_1) == 0x00000D, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000E, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000010, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, CallFunc_FMax_ReturnValue) == 0x00001C, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged, K2Node_Select_Default) == 0x000021, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnGridSizeChanged::K2Node_Select_Default' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnHealthDamaged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InHealth;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InHealthMax;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged, InHealth) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged::InHealth' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged, InHealthMax) == 0x00000C, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthDamaged::InHealthMax' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnHealthHealed
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InHealth;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InHealthMax;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed, InHealth) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed::InHealth' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed, InHealthMax) == 0x00000C, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnHealthHealed::InHealthMax' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnPlayerDataChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerDataChanged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerDataChanged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerDataChanged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerDataChanged) == 0x000008, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerDataChanged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerDataChanged, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerDataChanged::InPlayerData' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnPlayerNameChanged
// 0x0018 (0x0018 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerNameChanged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InPlayerName;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerNameChanged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerNameChanged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerNameChanged) == 0x000018, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerNameChanged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerNameChanged, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerNameChanged::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerNameChanged, InPlayerName) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerNameChanged::InPlayerName' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnPlayerStateChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerStateChanged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 InPlayerState;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerStateChanged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerStateChanged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerStateChanged) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerStateChanged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerStateChanged, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerStateChanged::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerStateChanged, InPlayerState) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnPlayerStateChanged::InPlayerState' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnShieldDamaged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InShield;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InShieldMax;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged, InShield) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged::InShield' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged, InShieldMax) == 0x00000C, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldDamaged::InShieldMax' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.OnShieldHealed
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed final
{
public:
	class UAthenaRemotePlayerViewData*            InPlayerData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InShield;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InShieldMax;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed, InPlayerData) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed::InPlayerData' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed, InShield) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed::InShield' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed, InShieldMax) == 0x00000C, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_OnShieldHealed::InShieldMax' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_PreConstruct");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_PreConstruct) == 0x000001, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_PreConstruct");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.SetEliminationsVisibility
// 0x0005 (0x0005 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility) == 0x000001, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility) == 0x000005, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility, bVisible) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility::bVisible' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility, Temp_byte_Variable) == 0x000001, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility, Temp_bool_Variable) == 0x000003, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility, K2Node_Select_Default) == 0x000004, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_SetEliminationsVisibility::K2Node_Select_Default' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.SetupBackgrounds
// 0x0010 (0x0010 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_SetupBackgrounds final
{
public:
	TArray<class UCommonBorder*>                  K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_SetupBackgrounds) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_SetupBackgrounds");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_SetupBackgrounds) == 0x000010, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_SetupBackgrounds");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_SetupBackgrounds, K2Node_MakeArray_Array) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_SetupBackgrounds::K2Node_MakeArray_Array' has a wrong offset!");

// Function AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C.UpdateBackground
// 0x0038 (0x0038 - 0x0000)
struct AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground final
{
public:
	class UCommonBorder*                          Local_BackgroundToShow;                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonBorder*                          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground) == 0x000008, "Wrong alignment on AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground");
static_assert(sizeof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground) == 0x000038, "Wrong size on AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, Local_BackgroundToShow) == 0x000000, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::Local_BackgroundToShow' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, Temp_byte_Variable) == 0x000008, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, Temp_byte_Variable_1) == 0x000009, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, Temp_bool_Variable) == 0x000018, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, CallFunc_Array_Get_Item) == 0x000020, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'AthenaEventMatchPlayerGridPlayerWidget_C_UpdateBackground::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
