#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaReadyUpTooltipTickWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaReadyUpTooltipTickWidget.AthenaReadyUpTooltipTickWidget_C
// 0x0020 (0x0320 - 0x0300)
class UAthenaReadyUpTooltipTickWidget_C final : public UAthenaReadyUpTooltipTickWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ready;                                             // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Tick;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Tick_Shadow;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_AthenaReadyUpTooltipTickWidget(int32 EntryPoint);
	void OnSetPartyMember(class UFortPartyMember* NewPartyMember);
	void PreConstruct(bool IsDesignTime);
	void SetReadiness(bool bIsReady);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaReadyUpTooltipTickWidget_C">();
	}
	static class UAthenaReadyUpTooltipTickWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaReadyUpTooltipTickWidget_C>();
	}
};
static_assert(alignof(UAthenaReadyUpTooltipTickWidget_C) == 0x000008, "Wrong alignment on UAthenaReadyUpTooltipTickWidget_C");
static_assert(sizeof(UAthenaReadyUpTooltipTickWidget_C) == 0x000320, "Wrong size on UAthenaReadyUpTooltipTickWidget_C");
static_assert(offsetof(UAthenaReadyUpTooltipTickWidget_C, UberGraphFrame) == 0x000300, "Member 'UAthenaReadyUpTooltipTickWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipTickWidget_C, Ready) == 0x000308, "Member 'UAthenaReadyUpTooltipTickWidget_C::Ready' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipTickWidget_C, Image_Tick) == 0x000310, "Member 'UAthenaReadyUpTooltipTickWidget_C::Image_Tick' has a wrong offset!");
static_assert(offsetof(UAthenaReadyUpTooltipTickWidget_C, Image_Tick_Shadow) == 0x000318, "Member 'UAthenaReadyUpTooltipTickWidget_C::Image_Tick_Shadow' has a wrong offset!");

}

