#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUD

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHUD.AthenaHUD_C
// 0x00F0 (0x06F8 - 0x0608)
class UAthenaHUD_C final : public UAthenaHUDBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           AboveStormMessageSlotBox;                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDetachRCPawn_C*                  AthenaDetachRCPawn;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaRespawnTimer_C*                  AthenaRespawnTimer;                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderPersistentHUDContainer;                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CenterTopVerticalBox;                              // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Main;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              PersistentHUD;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              PersistentHUDScale;                                // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PrimaryContentOverlay;                             // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URCPawn_ExpirationProgressBar_C*        RCPawn_ExpirationProgressBar;                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_PrimaryContent;                           // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_SecondaryContent;                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SecondaryContentOverlay;                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SlightlyRightOfCrosshairSlot;                      // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CursorModeEnabled;                                 // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameInfoBoxDefaultHUDTags;                         // 0x0688(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FVector2D>   PlaylistOffsetMap;                                 // 0x06A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AllowCursorModeWhenDead(bool* Allow);
	void BindDelegates();
	void CheckHUDElementVisibility(struct FGameplayTagContainer& HiddenHUDElementTags, const struct FGameplayTag& HUDElementTagToCheck, class UWidget*& HUDElement);
	void Construct();
	void Destruct();
	void EndMatchSpectateLayout(class FName Placement);
	void ExecuteUbergraph_AthenaHUD(int32 EntryPoint);
	void HandleAircraftModeChanged();
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
	void HandleFocusChat();
	void HandleInputMethodChanged(ECommonInputType InputType);
	void HandleKeybindsChanged();
	void HandleLocalPawnSet();
	void HandlePawnSet();
	void HandlePawnSet_RCPawnVisibilityUpdates(ESlateVisibility InVisibility);
	void HandlePawnSet_VisibilityUpdates(bool& bHideElements);
	void HandleRevived();
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* NewSpectatorPawn);
	void IsInVehicleOstrich(class UObject* Object, bool* bSuccess);
	void On_Placement_Changed();
	void On_Player_Died(const struct FFortPlayerDeathReport& DeathReport);
	void OnDisplayGameOver();
	void OnExtensionWidgetCreated(EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnExtensionWidgetRemoved(EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnHUDScaleChanged(float HUDScale);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnPawnSet();
	void OnReady_9A1EB0104B65CF2D28BDDEB47E4CADCF(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnRevived();
	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, const class FText& FailureText);
	void Prepare_Game_Over();
	void PrepareToShowEndGameUI();
	void ProcessPawnChangeForRCPawn(class UObject* Object);
	void SetupCameraMode();
	void ToggleChat(bool Show);
	void UpdateCursorModeVisibility(class FName CursorMode);

	void IsClientNotifiedOfWin(bool* bClientWon, bool* bTeamWon) const;
	void WidgetContainsChildClass(class UPanelWidget* WidgetToCheckChildren, class UClass* ContainsClass, bool* bContainsChild) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHUD_C">();
	}
	static class UAthenaHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUD_C>();
	}
};
static_assert(alignof(UAthenaHUD_C) == 0x000008, "Wrong alignment on UAthenaHUD_C");
static_assert(sizeof(UAthenaHUD_C) == 0x0006F8, "Wrong size on UAthenaHUD_C");
static_assert(offsetof(UAthenaHUD_C, UberGraphFrame) == 0x000608, "Member 'UAthenaHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, AboveStormMessageSlotBox) == 0x000610, "Member 'UAthenaHUD_C::AboveStormMessageSlotBox' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, AthenaDetachRCPawn) == 0x000618, "Member 'UAthenaHUD_C::AthenaDetachRCPawn' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, AthenaRespawnTimer) == 0x000620, "Member 'UAthenaHUD_C::AthenaRespawnTimer' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, BorderPersistentHUDContainer) == 0x000628, "Member 'UAthenaHUD_C::BorderPersistentHUDContainer' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, CenterTopVerticalBox) == 0x000630, "Member 'UAthenaHUD_C::CenterTopVerticalBox' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, Overlay_Main) == 0x000638, "Member 'UAthenaHUD_C::Overlay_Main' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, PersistentHUD) == 0x000640, "Member 'UAthenaHUD_C::PersistentHUD' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, PersistentHUDScale) == 0x000648, "Member 'UAthenaHUD_C::PersistentHUDScale' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, PrimaryContentOverlay) == 0x000650, "Member 'UAthenaHUD_C::PrimaryContentOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, RCPawn_ExpirationProgressBar) == 0x000658, "Member 'UAthenaHUD_C::RCPawn_ExpirationProgressBar' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, ScaleBox_PrimaryContent) == 0x000660, "Member 'UAthenaHUD_C::ScaleBox_PrimaryContent' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, ScaleBox_SecondaryContent) == 0x000668, "Member 'UAthenaHUD_C::ScaleBox_SecondaryContent' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, SecondaryContentOverlay) == 0x000670, "Member 'UAthenaHUD_C::SecondaryContentOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, SlightlyRightOfCrosshairSlot) == 0x000678, "Member 'UAthenaHUD_C::SlightlyRightOfCrosshairSlot' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, CursorModeEnabled) == 0x000680, "Member 'UAthenaHUD_C::CursorModeEnabled' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, GameInfoBoxDefaultHUDTags) == 0x000688, "Member 'UAthenaHUD_C::GameInfoBoxDefaultHUDTags' has a wrong offset!");
static_assert(offsetof(UAthenaHUD_C, PlaylistOffsetMap) == 0x0006A8, "Member 'UAthenaHUD_C::PlaylistOffsetMap' has a wrong offset!");

}

