#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchStatsPartial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchStatsPartial.AthenaMatchStatsPartial_C
// 0x0050 (0x0330 - 0x02E0)
class UAthenaMatchStatsPartial_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_FlatBG;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlacementLine;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlacementText;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RewardsSwitcher;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchStatsGrid_C*                      StatsGrid;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WaitingForMatchToFinish;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXpMatchProgression_C*                  XpMatchProgression;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaPlayerMatchReport*               MatchReport;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Destruct();
	void ExecuteUbergraph_AthenaMatchStatsPartial(int32 EntryPoint);
	void OnRewardsAvailable();
	void OnStatsAvailable();
	void OnTeamStatsAvailable();
	void Play_Xp_Rewards();
	void SetMatchReport(class UAthenaPlayerMatchReport* Report);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchStatsPartial_C">();
	}
	static class UAthenaMatchStatsPartial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchStatsPartial_C>();
	}
};
static_assert(alignof(UAthenaMatchStatsPartial_C) == 0x000008, "Wrong alignment on UAthenaMatchStatsPartial_C");
static_assert(sizeof(UAthenaMatchStatsPartial_C) == 0x000330, "Wrong size on UAthenaMatchStatsPartial_C");
static_assert(offsetof(UAthenaMatchStatsPartial_C, UberGraphFrame) == 0x0002E0, "Member 'UAthenaMatchStatsPartial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, Image_FlatBG) == 0x0002E8, "Member 'UAthenaMatchStatsPartial_C::Image_FlatBG' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, PlacementLine) == 0x0002F0, "Member 'UAthenaMatchStatsPartial_C::PlacementLine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, PlacementText) == 0x0002F8, "Member 'UAthenaMatchStatsPartial_C::PlacementText' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, ProgressSpinner) == 0x000300, "Member 'UAthenaMatchStatsPartial_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, RewardsSwitcher) == 0x000308, "Member 'UAthenaMatchStatsPartial_C::RewardsSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, StatsGrid) == 0x000310, "Member 'UAthenaMatchStatsPartial_C::StatsGrid' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, WaitingForMatchToFinish) == 0x000318, "Member 'UAthenaMatchStatsPartial_C::WaitingForMatchToFinish' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, XpMatchProgression) == 0x000320, "Member 'UAthenaMatchStatsPartial_C::XpMatchProgression' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, MatchReport) == 0x000328, "Member 'UAthenaMatchStatsPartial_C::MatchReport' has a wrong offset!");

}

