#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_SoccerGame

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_SoccerGameTypes_structs.hpp"


namespace SDK::Params
{

// Function Athena_SoccerGame.Athena_SoccerGame_C.BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Athena_SoccerGame_C_BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Athena_SoccerGame_C_BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.CheckAndHandleBallOverlap
// 0x0078 (0x0078 - 0x0000)
struct Athena_SoccerGame_C_CheckAndHandleBallOverlap final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasBallOverlap;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Toy_SoccerBall_Base_C*               K2Node_DynamicCast_AsB_Toy_Soccer_Ball_Base;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_Soccerball_C*                   K2Node_DynamicCast_AsAthena_Soccerball;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_SoccerGame_C_CheckAndHandleBallOverlap) == 0x000008, "Wrong alignment on Athena_SoccerGame_C_CheckAndHandleBallOverlap");
static_assert(sizeof(Athena_SoccerGame_C_CheckAndHandleBallOverlap) == 0x000078, "Wrong size on Athena_SoccerGame_C_CheckAndHandleBallOverlap");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, Actor) == 0x000000, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::Actor' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, bWasBallOverlap) == 0x000008, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::bWasBallOverlap' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, K2Node_DynamicCast_AsB_Toy_Soccer_Ball_Base) == 0x000010, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::K2Node_DynamicCast_AsB_Toy_Soccer_Ball_Base' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000040, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, K2Node_DynamicCast_AsAthena_Soccerball) == 0x000048, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::K2Node_DynamicCast_AsAthena_Soccerball' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, CallFunc_GetPlayerPawn_ReturnValue) == 0x000058, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_CheckAndHandleBallOverlap, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'Athena_SoccerGame_C_CheckAndHandleBallOverlap::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.EvaluateScore
// 0x0003 (0x0003 - 0x0000)
struct Athena_SoccerGame_C_EvaluateScore final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_SoccerGame_C_EvaluateScore) == 0x000001, "Wrong alignment on Athena_SoccerGame_C_EvaluateScore");
static_assert(sizeof(Athena_SoccerGame_C_EvaluateScore) == 0x000003, "Wrong size on Athena_SoccerGame_C_EvaluateScore");
static_assert(offsetof(Athena_SoccerGame_C_EvaluateScore, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'Athena_SoccerGame_C_EvaluateScore::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_EvaluateScore, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000001, "Member 'Athena_SoccerGame_C_EvaluateScore::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_EvaluateScore, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000002, "Member 'Athena_SoccerGame_C_EvaluateScore::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.ExecuteUbergraph_Athena_SoccerGame
// 0x0358 (0x0358 - 0x0000)
struct Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0098(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0198(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CheckAndHandleBallOverlap_bWasBallOverlap; // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAndHandleBallOverlap_bWasBallOverlap_1; // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SoccerGameTypes                             Temp_byte_Variable;                                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x02C8(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x02F0(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0330(0x0020)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame) == 0x000008, "Wrong alignment on Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame");
static_assert(sizeof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame) == 0x000358, "Wrong size on Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, EntryPoint) == 0x000000, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_Add_VectorVector_ReturnValue) == 0x000020, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000040, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_GetWeaponData_ReturnValue) == 0x000048, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_GetWeaponData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_HasAuthority_ReturnValue) == 0x000050, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000058, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_GetQuestManager_ReturnValue) == 0x000060, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000078, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000080, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000088, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000090, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000094, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000098, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000178, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_OtherActor) == 0x000180, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_OtherComp) == 0x000188, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000190, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_bFromSweep) == 0x000194, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_ComponentBoundEvent_SweepResult) == 0x000198, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_CheckAndHandleBallOverlap_bWasBallOverlap) == 0x000278, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_CheckAndHandleBallOverlap_bWasBallOverlap' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_CheckAndHandleBallOverlap_bWasBallOverlap_1) == 0x000279, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_CheckAndHandleBallOverlap_bWasBallOverlap_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_HasAuthority_ReturnValue_1) == 0x00027A, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000280, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, Temp_byte_Variable) == 0x000298, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_HasAuthority_ReturnValue_2) == 0x000299, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0002A0, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_GetGameState_ReturnValue) == 0x0002A8, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_Select_Default) == 0x0002B0, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0002B8, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_DynamicCast_bSuccess) == 0x0002C0, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x0002C8, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_HasTag_ReturnValue) == 0x0002E8, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_CustomEvent_PlaylistName) == 0x0002EC, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, K2Node_CustomEvent_PlaylistContextTags) == 0x0002F0, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_HasTag_ReturnValue_1) == 0x000310, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000318, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_HasAuthority_ReturnValue_3) == 0x000320, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_GetQuestManager_ReturnValue_1) == 0x000328, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000330, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000350, "Member 'Athena_SoccerGame_C_ExecuteUbergraph_Athena_SoccerGame::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.InitializeGoal
// 0x0108 (0x0108 - 0x0000)
struct Athena_SoccerGame_C_InitializeGoal final
{
public:
	class UBoxComponent*                          GoalOverlapComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                GoalLocation;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHide;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0028(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Athena_SoccerGame_C_InitializeGoal) == 0x000008, "Wrong alignment on Athena_SoccerGame_C_InitializeGoal");
static_assert(sizeof(Athena_SoccerGame_C_InitializeGoal) == 0x000108, "Wrong size on Athena_SoccerGame_C_InitializeGoal");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoal, GoalOverlapComponent) == 0x000000, "Member 'Athena_SoccerGame_C_InitializeGoal::GoalOverlapComponent' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoal, GoalLocation) == 0x000008, "Member 'Athena_SoccerGame_C_InitializeGoal::GoalLocation' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoal, ShouldHide) == 0x000020, "Member 'Athena_SoccerGame_C_InitializeGoal::ShouldHide' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoal, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000028, "Member 'Athena_SoccerGame_C_InitializeGoal::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.InitializeGoalCollision
// 0x0010 (0x0010 - 0x0000)
struct Athena_SoccerGame_C_InitializeGoalCollision final
{
public:
	class UBoxComponent*                          GoalOverlapComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_SoccerGame_C_InitializeGoalCollision) == 0x000008, "Wrong alignment on Athena_SoccerGame_C_InitializeGoalCollision");
static_assert(sizeof(Athena_SoccerGame_C_InitializeGoalCollision) == 0x000010, "Wrong size on Athena_SoccerGame_C_InitializeGoalCollision");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoalCollision, GoalOverlapComponent) == 0x000000, "Member 'Athena_SoccerGame_C_InitializeGoalCollision::GoalOverlapComponent' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoalCollision, Hide) == 0x000008, "Member 'Athena_SoccerGame_C_InitializeGoalCollision::Hide' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoalCollision, Temp_bool_Variable) == 0x000009, "Member 'Athena_SoccerGame_C_InitializeGoalCollision::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoalCollision, Temp_byte_Variable) == 0x00000A, "Member 'Athena_SoccerGame_C_InitializeGoalCollision::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoalCollision, Temp_byte_Variable_1) == 0x00000B, "Member 'Athena_SoccerGame_C_InitializeGoalCollision::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeGoalCollision, K2Node_Select_Default) == 0x00000C, "Member 'Athena_SoccerGame_C_InitializeGoalCollision::K2Node_Select_Default' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.InitializeSign
// 0x00F8 (0x00F8 - 0x0000)
struct Athena_SoccerGame_C_InitializeSign final
{
public:
	bool                                          ShouldHide;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0018(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Athena_SoccerGame_C_InitializeSign) == 0x000008, "Wrong alignment on Athena_SoccerGame_C_InitializeSign");
static_assert(sizeof(Athena_SoccerGame_C_InitializeSign) == 0x0000F8, "Wrong size on Athena_SoccerGame_C_InitializeSign");
static_assert(offsetof(Athena_SoccerGame_C_InitializeSign, ShouldHide) == 0x000000, "Member 'Athena_SoccerGame_C_InitializeSign::ShouldHide' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeSign, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Athena_SoccerGame_C_InitializeSign::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeSign, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'Athena_SoccerGame_C_InitializeSign::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_InitializeSign, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000018, "Member 'Athena_SoccerGame_C_InitializeSign::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.OnRep_Score_Team_A
// 0x0020 (0x0020 - 0x0000)
struct Athena_SoccerGame_C_OnRep_Score_Team_A final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_SoccerGame_C_OnRep_Score_Team_A) == 0x000004, "Wrong alignment on Athena_SoccerGame_C_OnRep_Score_Team_A");
static_assert(sizeof(Athena_SoccerGame_C_OnRep_Score_Team_A) == 0x000020, "Wrong size on Athena_SoccerGame_C_OnRep_Score_Team_A");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_A, Temp_bool_Variable) == 0x000000, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_A::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_A, Temp_float_Variable) == 0x000004, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_A::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_A, Temp_float_Variable_1) == 0x000008, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_A::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_A, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_A::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_A, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000010, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_A::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_A, K2Node_Select_Default) == 0x000014, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_A::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_A, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_A::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_A, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_A::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.OnRep_Score_Team_B
// 0x0020 (0x0020 - 0x0000)
struct Athena_SoccerGame_C_OnRep_Score_Team_B final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_SoccerGame_C_OnRep_Score_Team_B) == 0x000004, "Wrong alignment on Athena_SoccerGame_C_OnRep_Score_Team_B");
static_assert(sizeof(Athena_SoccerGame_C_OnRep_Score_Team_B) == 0x000020, "Wrong size on Athena_SoccerGame_C_OnRep_Score_Team_B");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_B, Temp_bool_Variable) == 0x000000, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_B::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_B, Temp_float_Variable) == 0x000004, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_B::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_B, Temp_float_Variable_1) == 0x000008, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_B::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_B, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_B::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_B, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000010, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_B::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_B, K2Node_Select_Default) == 0x000014, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_B::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_B, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_B::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_Score_Team_B, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'Athena_SoccerGame_C_OnRep_Score_Team_B::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.OnRep_ScoreLocation
// 0x0018 (0x0018 - 0x0000)
struct Athena_SoccerGame_C_OnRep_ScoreLocation final
{
public:
	E_SoccerGameTypes                             Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_SoccerGame_C_OnRep_ScoreLocation) == 0x000008, "Wrong alignment on Athena_SoccerGame_C_OnRep_ScoreLocation");
static_assert(sizeof(Athena_SoccerGame_C_OnRep_ScoreLocation) == 0x000018, "Wrong size on Athena_SoccerGame_C_OnRep_ScoreLocation");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_ScoreLocation, Temp_byte_Variable) == 0x000000, "Member 'Athena_SoccerGame_C_OnRep_ScoreLocation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_ScoreLocation, K2Node_Select_Default) == 0x000008, "Member 'Athena_SoccerGame_C_OnRep_ScoreLocation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_ScoreLocation, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000010, "Member 'Athena_SoccerGame_C_OnRep_ScoreLocation::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function Athena_SoccerGame.Athena_SoccerGame_C.OnRep_WinningTeam
// 0x00D0 (0x00D0 - 0x0000)
struct Athena_SoccerGame_C_OnRep_WinningTeam final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SoccerGameTypes                             Temp_byte_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_SoccerGame_C_OnRep_WinningTeam) == 0x000008, "Wrong alignment on Athena_SoccerGame_C_OnRep_WinningTeam");
static_assert(sizeof(Athena_SoccerGame_C_OnRep_WinningTeam) == 0x0000D0, "Wrong size on Athena_SoccerGame_C_OnRep_WinningTeam");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_WinningTeam, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'Athena_SoccerGame_C_OnRep_WinningTeam::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_WinningTeam, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000018, "Member 'Athena_SoccerGame_C_OnRep_WinningTeam::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_WinningTeam, CallFunc_HasAuthority_ReturnValue) == 0x000030, "Member 'Athena_SoccerGame_C_OnRep_WinningTeam::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_WinningTeam, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'Athena_SoccerGame_C_OnRep_WinningTeam::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_SoccerGame_C_OnRep_WinningTeam, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000050, "Member 'Athena_SoccerGame_C_OnRep_WinningTeam::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
