#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaServerAddress

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaServerAddress.AthenaServerAddress_C.ExecuteUbergraph_AthenaServerAddress
// 0x0004 (0x0004 - 0x0000)
struct AthenaServerAddress_C_ExecuteUbergraph_AthenaServerAddress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaServerAddress_C_ExecuteUbergraph_AthenaServerAddress) == 0x000004, "Wrong alignment on AthenaServerAddress_C_ExecuteUbergraph_AthenaServerAddress");
static_assert(sizeof(AthenaServerAddress_C_ExecuteUbergraph_AthenaServerAddress) == 0x000004, "Wrong size on AthenaServerAddress_C_ExecuteUbergraph_AthenaServerAddress");
static_assert(offsetof(AthenaServerAddress_C_ExecuteUbergraph_AthenaServerAddress, EntryPoint) == 0x000000, "Member 'AthenaServerAddress_C_ExecuteUbergraph_AthenaServerAddress::EntryPoint' has a wrong offset!");

// Function AthenaServerAddress.AthenaServerAddress_C.UpdateServerAddress
// 0x0048 (0x0048 - 0x0000)
struct AthenaServerAddress_C_UpdateServerAddress final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSessionConnectString_ReturnValue;      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaServerAddress_C_UpdateServerAddress) == 0x000008, "Wrong alignment on AthenaServerAddress_C_UpdateServerAddress");
static_assert(sizeof(AthenaServerAddress_C_UpdateServerAddress) == 0x000048, "Wrong size on AthenaServerAddress_C_UpdateServerAddress");
static_assert(offsetof(AthenaServerAddress_C_UpdateServerAddress, Temp_byte_Variable) == 0x000000, "Member 'AthenaServerAddress_C_UpdateServerAddress::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaServerAddress_C_UpdateServerAddress, Temp_byte_Variable_1) == 0x000001, "Member 'AthenaServerAddress_C_UpdateServerAddress::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaServerAddress_C_UpdateServerAddress, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaServerAddress_C_UpdateServerAddress::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaServerAddress_C_UpdateServerAddress, Temp_bool_Variable) == 0x000010, "Member 'AthenaServerAddress_C_UpdateServerAddress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaServerAddress_C_UpdateServerAddress, CallFunc_GetSessionConnectString_ReturnValue) == 0x000018, "Member 'AthenaServerAddress_C_UpdateServerAddress::CallFunc_GetSessionConnectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaServerAddress_C_UpdateServerAddress, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'AthenaServerAddress_C_UpdateServerAddress::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaServerAddress_C_UpdateServerAddress, CallFunc_TextIsEmpty_ReturnValue) == 0x000040, "Member 'AthenaServerAddress_C_UpdateServerAddress::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaServerAddress_C_UpdateServerAddress, K2Node_Select_Default) == 0x000041, "Member 'AthenaServerAddress_C_UpdateServerAddress::K2Node_Select_Default' has a wrong offset!");

}

