#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Fake_SNeakySnowmanV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Fake_SNeakySnowmanV2.Athena_Fake_SneakySnowmanV2_C
// 0x0028 (0x0998 - 0x0970)
class AAthena_Fake_SneakySnowmanV2_C : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0970(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pivot;                                             // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_SneakySnowmanV2_C*       MyOwner;                                           // 0x0988(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Clipping;                                          // 0x0990(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void ExecuteUbergraph_Athena_Fake_SneakySnowmanV2(int32 EntryPoint);

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	bool BlueprintGetInteractionTime(const class AFortPawn* InteractingPawn, float* OutInteractionTime, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Fake_SneakySnowmanV2_C">();
	}
	static class AAthena_Fake_SneakySnowmanV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Fake_SneakySnowmanV2_C>();
	}
};
static_assert(alignof(AAthena_Fake_SneakySnowmanV2_C) == 0x000008, "Wrong alignment on AAthena_Fake_SneakySnowmanV2_C");
static_assert(sizeof(AAthena_Fake_SneakySnowmanV2_C) == 0x000998, "Wrong size on AAthena_Fake_SneakySnowmanV2_C");
static_assert(offsetof(AAthena_Fake_SneakySnowmanV2_C, UberGraphFrame) == 0x000970, "Member 'AAthena_Fake_SneakySnowmanV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_SneakySnowmanV2_C, StaticMesh) == 0x000978, "Member 'AAthena_Fake_SneakySnowmanV2_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_SneakySnowmanV2_C, Pivot) == 0x000980, "Member 'AAthena_Fake_SneakySnowmanV2_C::Pivot' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_SneakySnowmanV2_C, MyOwner) == 0x000988, "Member 'AAthena_Fake_SneakySnowmanV2_C::MyOwner' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_SneakySnowmanV2_C, Clipping) == 0x000990, "Member 'AAthena_Fake_SneakySnowmanV2_C::Clipping' has a wrong offset!");

}

