#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUD

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaHUD.AthenaHUD_C.AllowCursorModeWhenDead
// 0x0020 (0x0020 - 0x0000)
struct AthenaHUD_C_AllowCursorModeWhenDead final
{
public:
	bool                                          Allow;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetForceAllowCameraMode_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUD_C_AllowCursorModeWhenDead) == 0x000008, "Wrong alignment on AthenaHUD_C_AllowCursorModeWhenDead");
static_assert(sizeof(AthenaHUD_C_AllowCursorModeWhenDead) == 0x000020, "Wrong size on AthenaHUD_C_AllowCursorModeWhenDead");
static_assert(offsetof(AthenaHUD_C_AllowCursorModeWhenDead, Allow) == 0x000000, "Member 'AthenaHUD_C_AllowCursorModeWhenDead::Allow' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_AllowCursorModeWhenDead, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaHUD_C_AllowCursorModeWhenDead::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_AllowCursorModeWhenDead, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'AthenaHUD_C_AllowCursorModeWhenDead::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_AllowCursorModeWhenDead, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaHUD_C_AllowCursorModeWhenDead::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_AllowCursorModeWhenDead, CallFunc_GetForceAllowCameraMode_ReturnValue) == 0x000019, "Member 'AthenaHUD_C_AllowCursorModeWhenDead::CallFunc_GetForceAllowCameraMode_ReturnValue' has a wrong offset!");

// Function AthenaHUD.AthenaHUD_C.BindDelegates
// 0x0018 (0x0018 - 0x0000)
struct AthenaHUD_C_BindDelegates final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUD_C_BindDelegates) == 0x000008, "Wrong alignment on AthenaHUD_C_BindDelegates");
static_assert(sizeof(AthenaHUD_C_BindDelegates) == 0x000018, "Wrong size on AthenaHUD_C_BindDelegates");
static_assert(offsetof(AthenaHUD_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaHUD_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_BindDelegates, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AthenaHUD_C_BindDelegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AthenaHUD.AthenaHUD_C.CheckHUDElementVisibility
// 0x0058 (0x0058 - 0x0000)
struct AthenaHUD_C_CheckHUDElementVisibility final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           HUDElementTagToCheck;                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                HUDElement;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0030(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUD_C_CheckHUDElementVisibility) == 0x000008, "Wrong alignment on AthenaHUD_C_CheckHUDElementVisibility");
static_assert(sizeof(AthenaHUD_C_CheckHUDElementVisibility) == 0x000058, "Wrong size on AthenaHUD_C_CheckHUDElementVisibility");
static_assert(offsetof(AthenaHUD_C_CheckHUDElementVisibility, HiddenHUDElementTags) == 0x000000, "Member 'AthenaHUD_C_CheckHUDElementVisibility::HiddenHUDElementTags' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_CheckHUDElementVisibility, HUDElementTagToCheck) == 0x000020, "Member 'AthenaHUD_C_CheckHUDElementVisibility::HUDElementTagToCheck' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_CheckHUDElementVisibility, HUDElement) == 0x000028, "Member 'AthenaHUD_C_CheckHUDElementVisibility::HUDElement' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_CheckHUDElementVisibility, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000030, "Member 'AthenaHUD_C_CheckHUDElementVisibility::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_CheckHUDElementVisibility, CallFunc_HasAnyTags_ReturnValue) == 0x000050, "Member 'AthenaHUD_C_CheckHUDElementVisibility::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_CheckHUDElementVisibility, CallFunc_IsVisible_ReturnValue) == 0x000051, "Member 'AthenaHUD_C_CheckHUDElementVisibility::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function AthenaHUD.AthenaHUD_C.EndMatchSpectateLayout
// 0x0004 (0x0004 - 0x0000)
struct AthenaHUD_C_EndMatchSpectateLayout final
{
public:
	class FName                                   Placement;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUD_C_EndMatchSpectateLayout) == 0x000004, "Wrong alignment on AthenaHUD_C_EndMatchSpectateLayout");
static_assert(sizeof(AthenaHUD_C_EndMatchSpectateLayout) == 0x000004, "Wrong size on AthenaHUD_C_EndMatchSpectateLayout");
static_assert(offsetof(AthenaHUD_C_EndMatchSpectateLayout, Placement) == 0x000000, "Member 'AthenaHUD_C_EndMatchSpectateLayout::Placement' has a wrong offset!");

// Function AthenaHUD.AthenaHUD_C.ExecuteUbergraph_AthenaHUD
// 0x0450 (0x0450 - 0x0000)
struct AthenaHUD_C_ExecuteUbergraph_AthenaHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0038(0x0020)()
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_InputType;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena_1; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_FailedReason;                   // 0x00C8(0x0020)()
	class FText                                   K2Node_CustomEvent_FailureText;                    // 0x00E8(0x0018)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0110(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0118(0x0020)(ConstParm)
	struct FFortPlayerDeathReport                 K2Node_CustomEvent_DeathReport;                    // 0x0138(0x0098)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HUDScale;                             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIExtensionSlot                              K2Node_Event_ExtensionSlot_1;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget_1;                             // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0200(0x0020)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena_2; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena_3; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTouchInputPlatform_ReturnValue;         // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTagContainer& FailedReason, class FText& FailureText)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0244(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0254(0x0004)(NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_3;                 // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingDynamicUI_ReturnValue;             // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_4;                 // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingDynamicUI_ReturnValue_1;           // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABattleMapPawnLive* NewSpectatorPawn)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x02AC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_5;                 // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue_1;          // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_6;                 // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_7;                 // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_8;                 // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCursorModeEnabled;                   // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ActionName;                           // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_CustomWidget;                         // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_9;                 // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x02FC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientNotifiedOfWin_bClientWon;         // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientNotifiedOfWin_bTeamWon;           // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllowCursorModeWhenDead_Allow;            // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_10;                // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUISubsystemLegacy*               CallFunc_GetContext_ReturnValue_11;                // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManagerLegacy*              CallFunc_GetInputManager_ReturnValue;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_12;                // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputMode                                Temp_byte_Variable;                                // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputMode                                Temp_byte_Variable_1;                              // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0333(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WidgetPlacement)>  K2Node_CreateDelegate_OutputDelegate_6;            // 0x0334(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortInputMode                                K2Node_Select_Default;                             // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Placement;                      // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x034C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetZoneCompleted_ReturnValue;             // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetZoneCompleted_ReturnValue_1;           // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIExtensionSlot                              K2Node_Event_ExtensionSlot;                        // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38B[0x5];                                      // 0x038B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x039B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAthenaCountdown_C*>             CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x03A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCountdown_C*                     CallFunc_Array_Get_Item_1;                         // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA[0x6];                                      // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue_2;          // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_13;                // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_14;                // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue_1;                // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_15;                // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x03F8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_16;                // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_17;                // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_18;                // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FFortPlayerDeathReport& DeathReport)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0420(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x042D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x042E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42F[0x1];                                      // 0x042F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Map_Find_Value;                           // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPickerContext*                     CallFunc_GetContext_ReturnValue_19;                // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD) == 0x000008, "Wrong alignment on AthenaHUD_C_ExecuteUbergraph_AthenaHUD");
static_assert(sizeof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD) == 0x000450, "Wrong size on AthenaHUD_C_ExecuteUbergraph_AthenaHUD");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, EntryPoint) == 0x000000, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_bool_Variable) == 0x000010, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000018, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_object_Variable) == 0x000020, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_object_Variable_1) == 0x000030, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_struct_Variable) == 0x000038, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000058, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_int_Array_Index_Variable) == 0x000078, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CustomEvent_InputType) == 0x000088, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CustomEvent_InputType' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000089, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetOwningPlayer_ReturnValue) == 0x000090, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000098, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A4, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000B0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_DynamicCast_AsFort_Player_Controller_Athena_1) == 0x0000B8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_DynamicCast_AsFort_Player_Controller_Athena_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CustomEvent_FailedReason) == 0x0000C8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CustomEvent_FailedReason' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CustomEvent_FailureText) == 0x0000E8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CustomEvent_FailureText' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_HasTag_ReturnValue) == 0x000100, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CustomEvent_GameState) == 0x000108, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CustomEvent_Playlist) == 0x000110, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CustomEvent_PlaylistContextTags) == 0x000118, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CustomEvent_DeathReport) == 0x000138, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CustomEvent_DeathReport' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_Event_HUDScale) == 0x0001DC, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_Event_HUDScale' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001E0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_int_Loop_Counter_Variable_1) == 0x0001E4, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_Event_ExtensionSlot_1) == 0x0001E8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_Event_ExtensionSlot_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_Event_Widget_1) == 0x0001F0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_Event_Widget_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_SwitchEnum_CmpSuccess) == 0x0001F8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001FC, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000200, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000220, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_DynamicCast_AsFort_Player_Controller_Athena_2) == 0x000228, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_DynamicCast_AsFort_Player_Controller_Athena_2' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_DynamicCast_bSuccess_2) == 0x000230, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_DynamicCast_AsFort_Player_Controller_Athena_3) == 0x000238, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_DynamicCast_AsFort_Player_Controller_Athena_3' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_DynamicCast_bSuccess_3) == 0x000240, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_IsTouchInputPlatform_ReturnValue) == 0x000241, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_IsTouchInputPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CreateDelegate_OutputDelegate_3) == 0x000244, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_int_Array_Index_Variable_1) == 0x000250, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Array_Get_Item) == 0x000254, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000258, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_1) == 0x000260, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_AddChildToOverlay_ReturnValue) == 0x000268, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000270, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000278, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_2) == 0x000280, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_3) == 0x000288, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_IsUsingDynamicUI_ReturnValue) == 0x000290, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_IsUsingDynamicUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_AddChildToVerticalBox_ReturnValue_2) == 0x000298, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_AddChildToVerticalBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_4) == 0x0002A0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_IsUsingDynamicUI_ReturnValue_1) == 0x0002A8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_IsUsingDynamicUI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002AC, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_5) == 0x0002B8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_AddChildToOverlay_ReturnValue_1) == 0x0002C0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_AddChildToOverlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_6) == 0x0002C8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_7) == 0x0002D0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_8) == 0x0002D8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_Event_bCursorModeEnabled) == 0x0002E0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_Event_bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_Event_ActionName) == 0x0002E4, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_Event_ActionName' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_Event_CustomWidget) == 0x0002E8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_Event_CustomWidget' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_9) == 0x0002F0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_NotEqual_NameName_ReturnValue) == 0x0002F8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002FC, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_IsClientNotifiedOfWin_bClientWon) == 0x000308, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_IsClientNotifiedOfWin_bClientWon' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_IsClientNotifiedOfWin_bTeamWon) == 0x000309, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_IsClientNotifiedOfWin_bTeamWon' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_AllowCursorModeWhenDead_Allow) == 0x00030A, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_AllowCursorModeWhenDead_Allow' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Not_PreBool_ReturnValue) == 0x00030B, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_10) == 0x000310, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_11) == 0x000318, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetInputManager_ReturnValue) == 0x000320, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetContext_ReturnValue_12) == 0x000328, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetContext_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_byte_Variable) == 0x000330, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000331, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_byte_Variable_1) == 0x000332, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_bool_Variable_1) == 0x000333, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CreateDelegate_OutputDelegate_6) == 0x000334, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_Select_Default) == 0x000340, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CustomEvent_Placement) == 0x000344, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CustomEvent_Placement' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000348, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_CreateDelegate_OutputDelegate_7) == 0x00034C, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000358, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000360, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_MakeStruct_Margin) == 0x000368, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_MakeStruct_Margin_1) == 0x000378, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetZoneCompleted_ReturnValue) == 0x000388, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetZoneCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetZoneCompleted_ReturnValue_1) == 0x000389, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetZoneCompleted_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_Event_ExtensionSlot) == 0x00038A, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_Event_ExtensionSlot' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_Event_Widget) == 0x000390, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_BooleanOR_ReturnValue) == 0x000398, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, K2Node_SwitchEnum_CmpSuccess_1) == 0x000399, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_BooleanOR_ReturnValue_1) == 0x00039A, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_BooleanAND_ReturnValue) == 0x00039B, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_RemoveChild_ReturnValue) == 0x00039C, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0003A0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, Temp_bool_True_if_break_was_hit_Variable) == 0x0003B0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Array_Get_Item_1) == 0x0003B8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003C0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Array_Length_ReturnValue_1) == 0x0003C4, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_BooleanAND_ReturnValue_1) == 0x0003C8, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003C9, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUD_C_ExecuteUbergraph_AthenaHUD, CallFunc_AddChildToOverlay_ReturnValue_2) == 0x0003D0, "Member 'AthenaHUD_C_ExecuteUbergraph_AthenaHUD::CallFunc_AddChildToOverlay_ReturnValue_2' has a wrong offset!");
