#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_Prop_Bear

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_Prop_Bear.Athena_Prop_Prop_Bear_C.ExecuteUbergraph_Athena_Prop_Prop_Bear
// 0x0158 (0x0158 - 0x0000)
struct Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0018(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0050(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0140(0x0018)()
};
static_assert(alignof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear) == 0x000008, "Wrong alignment on Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear");
static_assert(sizeof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear) == 0x000158, "Wrong size on Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, EntryPoint) == 0x000000, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000008, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, K2Node_Event_Damage) == 0x000010, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, K2Node_Event_DamageTags) == 0x000018, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, K2Node_Event_Momentum) == 0x000038, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, K2Node_Event_HitInfo) == 0x000050, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, K2Node_Event_InstigatedBy) == 0x000130, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, K2Node_Event_DamageCauser) == 0x000138, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear, K2Node_Event_EffectContext) == 0x000140, "Member 'Athena_Prop_Prop_Bear_C_ExecuteUbergraph_Athena_Prop_Prop_Bear::K2Node_Event_EffectContext' has a wrong offset!");

// Function Athena_Prop_Prop_Bear.Athena_Prop_Prop_Bear_C.OnDeathServer
// 0x0148 (0x0148 - 0x0000)
struct Athena_Prop_Prop_Bear_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Athena_Prop_Prop_Bear_C_OnDeathServer) == 0x000008, "Wrong alignment on Athena_Prop_Prop_Bear_C_OnDeathServer");
static_assert(sizeof(Athena_Prop_Prop_Bear_C_OnDeathServer) == 0x000148, "Wrong size on Athena_Prop_Prop_Bear_C_OnDeathServer");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_OnDeathServer, Damage) == 0x000000, "Member 'Athena_Prop_Prop_Bear_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_OnDeathServer, DamageTags) == 0x000008, "Member 'Athena_Prop_Prop_Bear_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_OnDeathServer, Momentum) == 0x000028, "Member 'Athena_Prop_Prop_Bear_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_OnDeathServer, HitInfo) == 0x000040, "Member 'Athena_Prop_Prop_Bear_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_OnDeathServer, InstigatedBy) == 0x000120, "Member 'Athena_Prop_Prop_Bear_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_OnDeathServer, DamageCauser) == 0x000128, "Member 'Athena_Prop_Prop_Bear_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Prop_Bear_C_OnDeathServer, EffectContext) == 0x000130, "Member 'Athena_Prop_Prop_Bear_C_OnDeathServer::EffectContext' has a wrong offset!");

}

