#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaRespawnTimer

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaRespawnTimer.AthenaRespawnTimer_C.AddExtensionWidget_BP
// 0x0008 (0x0008 - 0x0000)
struct AthenaRespawnTimer_C_AddExtensionWidget_BP final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaRespawnTimer_C_AddExtensionWidget_BP) == 0x000008, "Wrong alignment on AthenaRespawnTimer_C_AddExtensionWidget_BP");
static_assert(sizeof(AthenaRespawnTimer_C_AddExtensionWidget_BP) == 0x000008, "Wrong size on AthenaRespawnTimer_C_AddExtensionWidget_BP");
static_assert(offsetof(AthenaRespawnTimer_C_AddExtensionWidget_BP, Widget) == 0x000000, "Member 'AthenaRespawnTimer_C_AddExtensionWidget_BP::Widget' has a wrong offset!");

// Function AthenaRespawnTimer.AthenaRespawnTimer_C.ExecuteUbergraph_AthenaRespawnTimer
// 0x0068 (0x0068 - 0x0000)
struct AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Event_Widget;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShouldPlayRespawnTimerSFX_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFadeOut;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_FadeTime;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bFadeOut, float FadeTime)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bFadeOut, float FadeTime)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer) == 0x000008, "Wrong alignment on AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer");
static_assert(sizeof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer) == 0x000068, "Wrong size on AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, EntryPoint) == 0x000000, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, K2Node_Event_Widget) == 0x000008, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_GetGameStateAthena_ReturnValue) == 0x000020, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_GetShouldPlayRespawnTimerSFX_ReturnValue) == 0x000029, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_GetShouldPlayRespawnTimerSFX_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000030, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, K2Node_CustomEvent_bFadeOut) == 0x000038, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::K2Node_CustomEvent_bFadeOut' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, K2Node_CustomEvent_FadeTime) == 0x00003C, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::K2Node_CustomEvent_FadeTime' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000058, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AthenaRespawnTimer.AthenaRespawnTimer_C.On Audio Fade Change Event
// 0x0008 (0x0008 - 0x0000)
struct AthenaRespawnTimer_C_On_Audio_Fade_Change_Event final
{
public:
	bool                                          bFadeOut;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaRespawnTimer_C_On_Audio_Fade_Change_Event) == 0x000004, "Wrong alignment on AthenaRespawnTimer_C_On_Audio_Fade_Change_Event");
static_assert(sizeof(AthenaRespawnTimer_C_On_Audio_Fade_Change_Event) == 0x000008, "Wrong size on AthenaRespawnTimer_C_On_Audio_Fade_Change_Event");
static_assert(offsetof(AthenaRespawnTimer_C_On_Audio_Fade_Change_Event, bFadeOut) == 0x000000, "Member 'AthenaRespawnTimer_C_On_Audio_Fade_Change_Event::bFadeOut' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_On_Audio_Fade_Change_Event, FadeTime) == 0x000004, "Member 'AthenaRespawnTimer_C_On_Audio_Fade_Change_Event::FadeTime' has a wrong offset!");

}

