#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryDragVisual

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "AthenaDragDropAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryDragVisual.AthenaInventoryDragVisual_C
// 0x0030 (0x02F8 - 0x02C8)
class UAthenaInventoryDragVisual_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DropImage;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DropImageContainer;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaItemIconLoadout_C*               ItemIcon;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaInventoryDragVisual(int32 EntryPoint);
	void ShowDropIcon(EAthenaDragDropAction Drop_Action);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryDragVisual_C">();
	}
	static class UAthenaInventoryDragVisual_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryDragVisual_C>();
	}
};
static_assert(alignof(UAthenaInventoryDragVisual_C) == 0x000008, "Wrong alignment on UAthenaInventoryDragVisual_C");
static_assert(sizeof(UAthenaInventoryDragVisual_C) == 0x0002F8, "Wrong size on UAthenaInventoryDragVisual_C");
static_assert(offsetof(UAthenaInventoryDragVisual_C, UberGraphFrame) == 0x0002C8, "Member 'UAthenaInventoryDragVisual_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, DropImage) == 0x0002D0, "Member 'UAthenaInventoryDragVisual_C::DropImage' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, DropImageContainer) == 0x0002D8, "Member 'UAthenaInventoryDragVisual_C::DropImageContainer' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, ItemIcon) == 0x0002E0, "Member 'UAthenaInventoryDragVisual_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, Shadow) == 0x0002E8, "Member 'UAthenaInventoryDragVisual_C::Shadow' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, Item) == 0x0002F0, "Member 'UAthenaInventoryDragVisual_C::Item' has a wrong offset!");

}

