#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemIconResource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemIconResource.AthenaItemIconResource_C
// 0x0058 (0x0380 - 0x0328)
class UAthenaItemIconResource_C final : public UAthenaItemIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select;                                            // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Empty;                                       // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AlphaLift;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Populated;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         RandomFloat_Top;                                   // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Left;                                  // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Right;                                 // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomFloat_Bottom;                                // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasValidItem;                                     // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_AthenaItemIconResource(int32 EntryPoint);
	void IntroAnim();
	void OnPostItemToRepresentChanged(const class UFortItem* ItemToRepresent);
	void RandomizeAngleFloats();
	void ResetAnims();
	void SetFontMaterial();
	void SetHoveredState(bool bIsHovered);
	void SetSelectedState(bool bIsSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemIconResource_C">();
	}
	static class UAthenaItemIconResource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemIconResource_C>();
	}
};
static_assert(alignof(UAthenaItemIconResource_C) == 0x000008, "Wrong alignment on UAthenaItemIconResource_C");
static_assert(sizeof(UAthenaItemIconResource_C) == 0x000380, "Wrong size on UAthenaItemIconResource_C");
static_assert(offsetof(UAthenaItemIconResource_C, UberGraphFrame) == 0x000328, "Member 'UAthenaItemIconResource_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, Select) == 0x000330, "Member 'UAthenaItemIconResource_C::Select' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, Hover_Empty) == 0x000338, "Member 'UAthenaItemIconResource_C::Hover_Empty' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, Intro) == 0x000340, "Member 'UAthenaItemIconResource_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, Hover) == 0x000348, "Member 'UAthenaItemIconResource_C::Hover' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, AlphaLift) == 0x000350, "Member 'UAthenaItemIconResource_C::AlphaLift' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, Empty) == 0x000358, "Member 'UAthenaItemIconResource_C::Empty' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, Populated) == 0x000360, "Member 'UAthenaItemIconResource_C::Populated' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, RandomFloat_Top) == 0x000368, "Member 'UAthenaItemIconResource_C::RandomFloat_Top' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, RandomFloat_Left) == 0x00036C, "Member 'UAthenaItemIconResource_C::RandomFloat_Left' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, RandomFloat_Right) == 0x000370, "Member 'UAthenaItemIconResource_C::RandomFloat_Right' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, RandomFloat_Bottom) == 0x000374, "Member 'UAthenaItemIconResource_C::RandomFloat_Bottom' has a wrong offset!");
static_assert(offsetof(UAthenaItemIconResource_C, bHasValidItem) == 0x000378, "Member 'UAthenaItemIconResource_C::bHasValidItem' has a wrong offset!");

}

