#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaFunctionLibrary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaFunctionLibrary.AthenaFunctionLibrary_C.AllOnSameTeam
// 0x0040 (0x0040 - 0x0000)
struct AthenaFunctionLibrary_C_AllOnSameTeam final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorArray;                                        // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _Result;                                           // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFunctionLibrary_C_AllOnSameTeam) == 0x000008, "Wrong alignment on AthenaFunctionLibrary_C_AllOnSameTeam");
static_assert(sizeof(AthenaFunctionLibrary_C_AllOnSameTeam) == 0x000040, "Wrong size on AthenaFunctionLibrary_C_AllOnSameTeam");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, Actor) == 0x000000, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::Actor' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, ActorArray) == 0x000008, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::ActorArray' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, __WorldContext) == 0x000018, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, Result) == 0x000020, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::Result' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, _Result) == 0x000021, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::_Result' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, Temp_int_Array_Index_Variable) == 0x000028, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, CallFunc_Array_Get_Item) == 0x000030, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, CallFunc_OnSameTeam_ReturnValue) == 0x000038, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_AllOnSameTeam, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'AthenaFunctionLibrary_C_AllOnSameTeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaFunctionLibrary.AthenaFunctionLibrary_C.CreateEnvironmentalKnockbackExplosion
// 0x02A0 (0x02A0 - 0x0000)
struct AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion final
{
public:
	struct FVector                                ExplosionSourcePoint;                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExplosionRadius;                                   // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinKnockbackAngle;                                 // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Reverse;                                           // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpecificActor;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _Reverse;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VecToCurrentActor;                                 // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MinKnockbackAngle;                                // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Intensity;                                        // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 _CurrentActorBeingLaunched;                        // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Radius;                                           // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _SourcePoint;                                      // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0090(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0238(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_SelectVector_ReturnValue_3;               // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0260(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion) == 0x000008, "Wrong alignment on AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion");
static_assert(sizeof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion) == 0x0002A0, "Wrong size on AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, ExplosionSourcePoint) == 0x000000, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::ExplosionSourcePoint' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, ExplosionRadius) == 0x000018, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::ExplosionRadius' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, Intensity) == 0x00001C, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::Intensity' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, MinKnockbackAngle) == 0x000020, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::MinKnockbackAngle' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, Reverse) == 0x000024, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::Reverse' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, SpecificActor) == 0x000028, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::SpecificActor' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, __WorldContext) == 0x000030, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, _Reverse) == 0x000038, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::_Reverse' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, VecToCurrentActor) == 0x000040, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::VecToCurrentActor' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, _MinKnockbackAngle) == 0x000058, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::_MinKnockbackAngle' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, _Intensity) == 0x00005C, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::_Intensity' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, _CurrentActorBeingLaunched) == 0x000060, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::_CurrentActorBeingLaunched' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, _Radius) == 0x000068, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::_Radius' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, _SourcePoint) == 0x000070, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::_SourcePoint' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, Temp_int_Array_Index_Variable) == 0x000088, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_IsValid_ReturnValue) == 0x00008C, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, Temp_object_Variable) == 0x000090, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_VSize_ReturnValue) == 0x0000A0, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Normal_ReturnValue) == 0x0000A8, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_SelectVector_ReturnValue) == 0x0000C8, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Add_IntInt_ReturnValue) == 0x0000E0, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_VSize_ReturnValue_1) == 0x0000E4, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000E8, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, K2Node_DynamicCast_AsFort_Pawn) == 0x0000F0, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000FC, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x000100, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000108, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00010C, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_GetActorUpVector_ReturnValue) == 0x000110, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_GetActorBounds_Origin) == 0x000128, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_GetActorBounds_BoxExtent) == 0x000140, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x000158, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Dot_VectorVector_ReturnValue) == 0x000170, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Cross_VectorVector_ReturnValue) == 0x000178, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_DegAcos_ReturnValue) == 0x000190, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_RotateAngleAxis_ReturnValue) == 0x000198, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001B0, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0001B4, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_NegateVector_ReturnValue) == 0x0001B8, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x0001D0, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Dot_VectorVector_ReturnValue_2) == 0x0001E8, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Dot_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0001EC, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001F0, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_SelectVector_ReturnValue_1) == 0x000208, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_SelectVector_ReturnValue_2) == 0x000220, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_SelectVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, K2Node_MakeArray_Array) == 0x000238, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_SelectVector_ReturnValue_3) == 0x000248, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_SelectVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_SphereOverlapActors_OutActors) == 0x000260, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_SphereOverlapActors_ReturnValue) == 0x000270, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000278, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Array_Get_Item) == 0x000290, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Array_Length_ReturnValue) == 0x000298, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion, CallFunc_Less_IntInt_ReturnValue) == 0x00029C, "Member 'AthenaFunctionLibrary_C_CreateEnvironmentalKnockbackExplosion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaFunctionLibrary.AthenaFunctionLibrary_C.GetActorMeshExtents
// 0x0198 (0x0198 - 0x0000)
struct AthenaFunctionLibrary_C_GetActorMeshExtents final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoundingBoxExtents;                                // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurrentMin;                                        // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurrentMax;                                        // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue;               // 0x00B8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_2;                       // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFunctionLibrary_C_GetActorMeshExtents) == 0x000008, "Wrong alignment on AthenaFunctionLibrary_C_GetActorMeshExtents");
static_assert(sizeof(AthenaFunctionLibrary_C_GetActorMeshExtents) == 0x000198, "Wrong size on AthenaFunctionLibrary_C_GetActorMeshExtents");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, Actor) == 0x000000, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::Actor' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, __WorldContext) == 0x000008, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, BoundingBoxExtents) == 0x000010, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::BoundingBoxExtents' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CurrentMin) == 0x000028, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CurrentMin' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CurrentMax) == 0x000040, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CurrentMax' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_GetActorBounds_Origin) == 0x000058, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_GetActorBounds_BoxExtent) == 0x000070, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000088, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A0, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_IsVisible_ReturnValue) == 0x0000B0, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_Not_PreBool_ReturnValue) == 0x0000B1, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_GetBoundingBox_ReturnValue) == 0x0000B8, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_GetBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, Temp_int_Loop_Counter_Variable) == 0x0000F0, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_X) == 0x0000F4, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_Y) == 0x0000F8, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_Z) == 0x0000FC, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_Add_IntInt_ReturnValue) == 0x000104, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_X_1) == 0x000108, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_Y_1) == 0x00010C, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_Z_1) == 0x000110, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000114, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000118, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_X_2) == 0x000130, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_Y_2) == 0x000134, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_Z_2) == 0x000138, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_X_3) == 0x00013C, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_Y_3) == 0x000140, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_BreakVector_Z_3) == 0x000144, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_FMax_ReturnValue) == 0x000148, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_FMin_ReturnValue) == 0x00014C, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_FMin_ReturnValue_1) == 0x000150, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_FMin_ReturnValue_2) == 0x000154, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_FMin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_FMax_ReturnValue_1) == 0x000158, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_MakeVector_ReturnValue) == 0x000160, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_FMax_ReturnValue_2) == 0x000178, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetActorMeshExtents, CallFunc_MakeVector_ReturnValue_1) == 0x000180, "Member 'AthenaFunctionLibrary_C_GetActorMeshExtents::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function AthenaFunctionLibrary.AthenaFunctionLibrary_C.GetPlayerGroundedZ
// 0x0040 (0x0040 - 0x0000)
struct AthenaFunctionLibrary_C_GetPlayerGroundedZ final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ground_Z;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFunctionLibrary_C_GetPlayerGroundedZ) == 0x000008, "Wrong alignment on AthenaFunctionLibrary_C_GetPlayerGroundedZ");
static_assert(sizeof(AthenaFunctionLibrary_C_GetPlayerGroundedZ) == 0x000040, "Wrong size on AthenaFunctionLibrary_C_GetPlayerGroundedZ");
static_assert(offsetof(AthenaFunctionLibrary_C_GetPlayerGroundedZ, PlayerPawn) == 0x000000, "Member 'AthenaFunctionLibrary_C_GetPlayerGroundedZ::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetPlayerGroundedZ, __WorldContext) == 0x000008, "Member 'AthenaFunctionLibrary_C_GetPlayerGroundedZ::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetPlayerGroundedZ, Ground_Z) == 0x000010, "Member 'AthenaFunctionLibrary_C_GetPlayerGroundedZ::Ground_Z' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetPlayerGroundedZ, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'AthenaFunctionLibrary_C_GetPlayerGroundedZ::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetPlayerGroundedZ, CallFunc_BreakVector_X) == 0x000030, "Member 'AthenaFunctionLibrary_C_GetPlayerGroundedZ::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetPlayerGroundedZ, CallFunc_BreakVector_Y) == 0x000034, "Member 'AthenaFunctionLibrary_C_GetPlayerGroundedZ::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetPlayerGroundedZ, CallFunc_BreakVector_Z) == 0x000038, "Member 'AthenaFunctionLibrary_C_GetPlayerGroundedZ::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_GetPlayerGroundedZ, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00003C, "Member 'AthenaFunctionLibrary_C_GetPlayerGroundedZ::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function AthenaFunctionLibrary.AthenaFunctionLibrary_C.MakeSimpleFortEffectContext
// 0x0060 (0x0060 - 0x0000)
struct AthenaFunctionLibrary_C_MakeSimpleFortEffectContext final
{
public:
	class AActor*                                 Instigator;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Damage_Source;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeFortEffectContext_ReturnValue;        // 0x0048(0x0018)()
};
static_assert(alignof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext) == 0x000008, "Wrong alignment on AthenaFunctionLibrary_C_MakeSimpleFortEffectContext");
static_assert(sizeof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext) == 0x000060, "Wrong size on AthenaFunctionLibrary_C_MakeSimpleFortEffectContext");
static_assert(offsetof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext, Instigator) == 0x000000, "Member 'AthenaFunctionLibrary_C_MakeSimpleFortEffectContext::Instigator' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext, Damage_Source) == 0x000008, "Member 'AthenaFunctionLibrary_C_MakeSimpleFortEffectContext::Damage_Source' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext, __WorldContext) == 0x000010, "Member 'AthenaFunctionLibrary_C_MakeSimpleFortEffectContext::__WorldContext' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext, ReturnValue) == 0x000018, "Member 'AthenaFunctionLibrary_C_MakeSimpleFortEffectContext::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000030, "Member 'AthenaFunctionLibrary_C_MakeSimpleFortEffectContext::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext, K2Node_DynamicCast_AsFort_Ability_System_Component) == 0x000038, "Member 'AthenaFunctionLibrary_C_MakeSimpleFortEffectContext::K2Node_DynamicCast_AsFort_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AthenaFunctionLibrary_C_MakeSimpleFortEffectContext::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaFunctionLibrary_C_MakeSimpleFortEffectContext, CallFunc_MakeFortEffectContext_ReturnValue) == 0x000048, "Member 'AthenaFunctionLibrary_C_MakeSimpleFortEffectContext::CallFunc_MakeFortEffectContext_ReturnValue' has a wrong offset!");

// Function AthenaFunctionLibrary.AthenaFunctionLibrary_C.RowToBool
// 0x0050 (0x0050 - 0x0000)
struct AthenaFunctionLibrary_C_RowToBool final
{
public:
	struct FScalableFloat                         Input;                                             // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Level;                                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
