#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_BeachBall

#include "Basic.hpp"


namespace SDK::Params
{

// Function Athena_BeachBall.Athena_BeachBall_C.ExecuteUbergraph_Athena_BeachBall
// 0x0020 (0x0020 - 0x0000)
struct Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall) == 0x000008, "Wrong alignment on Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall");
static_assert(sizeof(Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall) == 0x000020, "Wrong size on Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall");
static_assert(offsetof(Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall, EntryPoint) == 0x000000, "Member 'Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall, K2Node_Event_OtherActor) == 0x000008, "Member 'Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall, K2Node_DynamicCast_AsFort_Pawn) == 0x000010, "Member 'Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Athena_BeachBall_C_ExecuteUbergraph_Athena_BeachBall::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Athena_BeachBall.Athena_BeachBall_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Athena_BeachBall_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_BeachBall_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Athena_BeachBall_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Athena_BeachBall_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Athena_BeachBall_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Athena_BeachBall_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Athena_BeachBall_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

