#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioParameterComponent

#include "Basic.hpp"

#include "AudioExtensions_structs.hpp"


namespace SDK::Params
{

// Function AudioParameterComponent.AudioParameterComponent_C.FindOrAddGetIndex
// 0x00B0 (0x00B0 - 0x0000)
struct AudioParameterComponent_C_FindOrAddGetIndex final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAudioParameter                        K2Node_MakeStruct_AudioParameter;                  // 0x0008(0x0090)()
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_FindOrAddGetIndex) == 0x000008, "Wrong alignment on AudioParameterComponent_C_FindOrAddGetIndex");
static_assert(sizeof(AudioParameterComponent_C_FindOrAddGetIndex) == 0x0000B0, "Wrong size on AudioParameterComponent_C_FindOrAddGetIndex");
static_assert(offsetof(AudioParameterComponent_C_FindOrAddGetIndex, Name_0) == 0x000000, "Member 'AudioParameterComponent_C_FindOrAddGetIndex::Name_0' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_FindOrAddGetIndex, Index_0) == 0x000004, "Member 'AudioParameterComponent_C_FindOrAddGetIndex::Index_0' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_FindOrAddGetIndex, K2Node_MakeStruct_AudioParameter) == 0x000008, "Member 'AudioParameterComponent_C_FindOrAddGetIndex::K2Node_MakeStruct_AudioParameter' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_FindOrAddGetIndex, CallFunc_Array_LastIndex_ReturnValue) == 0x000098, "Member 'AudioParameterComponent_C_FindOrAddGetIndex::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_FindOrAddGetIndex, Temp_int_Variable) == 0x00009C, "Member 'AudioParameterComponent_C_FindOrAddGetIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_FindOrAddGetIndex, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'AudioParameterComponent_C_FindOrAddGetIndex::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_FindOrAddGetIndex, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A4, "Member 'AudioParameterComponent_C_FindOrAddGetIndex::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_FindOrAddGetIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A5, "Member 'AudioParameterComponent_C_FindOrAddGetIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_FindOrAddGetIndex, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'AudioParameterComponent_C_FindOrAddGetIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AudioParameterComponent.AudioParameterComponent_C.GetParameters
// 0x0018 (0x0018 - 0x0000)
struct AudioParameterComponent_C_GetParameters final
{
public:
	TArray<struct FAudioParameter>                Parameters_0;                                      // 0x0000(0x0010)(Parm, OutParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_GetParameters) == 0x000008, "Wrong alignment on AudioParameterComponent_C_GetParameters");
static_assert(sizeof(AudioParameterComponent_C_GetParameters) == 0x000018, "Wrong size on AudioParameterComponent_C_GetParameters");
static_assert(offsetof(AudioParameterComponent_C_GetParameters, Parameters_0) == 0x000000, "Member 'AudioParameterComponent_C_GetParameters::Parameters_0' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetParameters, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AudioParameterComponent_C_GetParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetParameters, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'AudioParameterComponent_C_GetParameters::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AudioParameterComponent.AudioParameterComponent_C.GetRootParameterComponent
// 0x0048 (0x0048 - 0x0000)
struct AudioParameterComponent_C_GetRootParameterComponent final
{
public:
	class UAudioParameterComponent_C*             Component;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioParameterComponent_C*             CurrentValidComp;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentValidRoot;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentRoot;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioParameterComponent_C*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_GetRootParameterComponent) == 0x000008, "Wrong alignment on AudioParameterComponent_C_GetRootParameterComponent");
static_assert(sizeof(AudioParameterComponent_C_GetRootParameterComponent) == 0x000048, "Wrong size on AudioParameterComponent_C_GetRootParameterComponent");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, Component) == 0x000000, "Member 'AudioParameterComponent_C_GetRootParameterComponent::Component' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, CurrentValidComp) == 0x000008, "Member 'AudioParameterComponent_C_GetRootParameterComponent::CurrentValidComp' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, CurrentValidRoot) == 0x000010, "Member 'AudioParameterComponent_C_GetRootParameterComponent::CurrentValidRoot' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, CurrentRoot) == 0x000018, "Member 'AudioParameterComponent_C_GetRootParameterComponent::CurrentRoot' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'AudioParameterComponent_C_GetRootParameterComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AudioParameterComponent_C_GetRootParameterComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000030, "Member 'AudioParameterComponent_C_GetRootParameterComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'AudioParameterComponent_C_GetRootParameterComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'AudioParameterComponent_C_GetRootParameterComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_GetRootParameterComponent, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'AudioParameterComponent_C_GetRootParameterComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function AudioParameterComponent.AudioParameterComponent_C.SetBoolParameter
// 0x0008 (0x0008 - 0x0000)
struct AudioParameterComponent_C_SetBoolParameter final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_SetBoolParameter) == 0x000004, "Wrong alignment on AudioParameterComponent_C_SetBoolParameter");
static_assert(sizeof(AudioParameterComponent_C_SetBoolParameter) == 0x000008, "Wrong size on AudioParameterComponent_C_SetBoolParameter");
static_assert(offsetof(AudioParameterComponent_C_SetBoolParameter, Name_0) == 0x000000, "Member 'AudioParameterComponent_C_SetBoolParameter::Name_0' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetBoolParameter, Value) == 0x000004, "Member 'AudioParameterComponent_C_SetBoolParameter::Value' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetBoolParameter, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'AudioParameterComponent_C_SetBoolParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetBoolParameter, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'AudioParameterComponent_C_SetBoolParameter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AudioParameterComponent.AudioParameterComponent_C.SetBoolParameterInternal
// 0x000C (0x000C - 0x0000)
struct AudioParameterComponent_C_SetBoolParameterInternal final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindOrAddGetIndex_Index;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_SetBoolParameterInternal) == 0x000004, "Wrong alignment on AudioParameterComponent_C_SetBoolParameterInternal");
static_assert(sizeof(AudioParameterComponent_C_SetBoolParameterInternal) == 0x00000C, "Wrong size on AudioParameterComponent_C_SetBoolParameterInternal");
static_assert(offsetof(AudioParameterComponent_C_SetBoolParameterInternal, Name_0) == 0x000000, "Member 'AudioParameterComponent_C_SetBoolParameterInternal::Name_0' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetBoolParameterInternal, Value) == 0x000004, "Member 'AudioParameterComponent_C_SetBoolParameterInternal::Value' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetBoolParameterInternal, CallFunc_FindOrAddGetIndex_Index) == 0x000008, "Member 'AudioParameterComponent_C_SetBoolParameterInternal::CallFunc_FindOrAddGetIndex_Index' has a wrong offset!");

// Function AudioParameterComponent.AudioParameterComponent_C.SetFloatParameter
// 0x000C (0x000C - 0x0000)
struct AudioParameterComponent_C_SetFloatParameter final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_SetFloatParameter) == 0x000004, "Wrong alignment on AudioParameterComponent_C_SetFloatParameter");
static_assert(sizeof(AudioParameterComponent_C_SetFloatParameter) == 0x00000C, "Wrong size on AudioParameterComponent_C_SetFloatParameter");
static_assert(offsetof(AudioParameterComponent_C_SetFloatParameter, Name_0) == 0x000000, "Member 'AudioParameterComponent_C_SetFloatParameter::Name_0' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetFloatParameter, Value) == 0x000004, "Member 'AudioParameterComponent_C_SetFloatParameter::Value' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetFloatParameter, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AudioParameterComponent_C_SetFloatParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetFloatParameter, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'AudioParameterComponent_C_SetFloatParameter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AudioParameterComponent.AudioParameterComponent_C.SetFloatParameterInternal
// 0x000C (0x000C - 0x0000)
struct AudioParameterComponent_C_SetFloatParameterInternal final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindOrAddGetIndex_Index;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_SetFloatParameterInternal) == 0x000004, "Wrong alignment on AudioParameterComponent_C_SetFloatParameterInternal");
static_assert(sizeof(AudioParameterComponent_C_SetFloatParameterInternal) == 0x00000C, "Wrong size on AudioParameterComponent_C_SetFloatParameterInternal");
static_assert(offsetof(AudioParameterComponent_C_SetFloatParameterInternal, Name_0) == 0x000000, "Member 'AudioParameterComponent_C_SetFloatParameterInternal::Name_0' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetFloatParameterInternal, Value) == 0x000004, "Member 'AudioParameterComponent_C_SetFloatParameterInternal::Value' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetFloatParameterInternal, CallFunc_FindOrAddGetIndex_Index) == 0x000008, "Member 'AudioParameterComponent_C_SetFloatParameterInternal::CallFunc_FindOrAddGetIndex_Index' has a wrong offset!");

// Function AudioParameterComponent.AudioParameterComponent_C.SetIntParameter
// 0x000C (0x000C - 0x0000)
struct AudioParameterComponent_C_SetIntParameter final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_SetIntParameter) == 0x000004, "Wrong alignment on AudioParameterComponent_C_SetIntParameter");
static_assert(sizeof(AudioParameterComponent_C_SetIntParameter) == 0x00000C, "Wrong size on AudioParameterComponent_C_SetIntParameter");
static_assert(offsetof(AudioParameterComponent_C_SetIntParameter, Name_0) == 0x000000, "Member 'AudioParameterComponent_C_SetIntParameter::Name_0' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetIntParameter, Value) == 0x000004, "Member 'AudioParameterComponent_C_SetIntParameter::Value' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetIntParameter, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AudioParameterComponent_C_SetIntParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetIntParameter, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'AudioParameterComponent_C_SetIntParameter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AudioParameterComponent.AudioParameterComponent_C.SetIntParameterInternal
// 0x000C (0x000C - 0x0000)
struct AudioParameterComponent_C_SetIntParameterInternal final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindOrAddGetIndex_Index;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_SetIntParameterInternal) == 0x000004, "Wrong alignment on AudioParameterComponent_C_SetIntParameterInternal");
static_assert(sizeof(AudioParameterComponent_C_SetIntParameterInternal) == 0x00000C, "Wrong size on AudioParameterComponent_C_SetIntParameterInternal");
static_assert(offsetof(AudioParameterComponent_C_SetIntParameterInternal, Name_0) == 0x000000, "Member 'AudioParameterComponent_C_SetIntParameterInternal::Name_0' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetIntParameterInternal, Value) == 0x000004, "Member 'AudioParameterComponent_C_SetIntParameterInternal::Value' has a wrong offset!");
static_assert(offsetof(AudioParameterComponent_C_SetIntParameterInternal, CallFunc_FindOrAddGetIndex_Index) == 0x000008, "Member 'AudioParameterComponent_C_SetIntParameterInternal::CallFunc_FindOrAddGetIndex_Index' has a wrong offset!");

// Function AudioParameterComponent.AudioParameterComponent_C.UpdateRootParameterComponent
// 0x0008 (0x0008 - 0x0000)
struct AudioParameterComponent_C_UpdateRootParameterComponent final
{
public:
	class UAudioParameterComponent_C*             CallFunc_GetRootParameterComponent_Component;      // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioParameterComponent_C_UpdateRootParameterComponent) == 0x000008, "Wrong alignment on AudioParameterComponent_C_UpdateRootParameterComponent");
static_assert(sizeof(AudioParameterComponent_C_UpdateRootParameterComponent) == 0x000008, "Wrong size on AudioParameterComponent_C_UpdateRootParameterComponent");
static_assert(offsetof(AudioParameterComponent_C_UpdateRootParameterComponent, CallFunc_GetRootParameterComponent_Component) == 0x000000, "Member 'AudioParameterComponent_C_UpdateRootParameterComponent::CallFunc_GetRootParameterComponent_Component' has a wrong offset!");

}

