#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup.B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C.ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup
// 0x0100 (0x0100 - 0x0000)
struct B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_New_Transform;                        // 0x0010(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup) == 0x000010, "Wrong alignment on B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup");
static_assert(sizeof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup) == 0x000100, "Wrong size on B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, EntryPoint) == 0x000000, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, K2Node_Event_New_Transform) == 0x000010, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::K2Node_Event_New_Transform' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_IsServer_ReturnValue) == 0x000070, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_BreakTransform_Location) == 0x000078, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_BreakTransform_Rotation) == 0x000090, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_BreakTransform_Scale) == 0x0000A8, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_BreakVector_X) == 0x0000C0, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_BreakVector_Y) == 0x0000C4, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_BreakVector_Z) == 0x0000C8, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000CC, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_RowToBool_ReturnValue) == 0x0000E8, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup, CallFunc_K2_SpawnPickupInWorld_ReturnValue) == 0x0000F0, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_ExecuteUbergraph_B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup::CallFunc_K2_SpawnPickupInWorld_ReturnValue' has a wrong offset!");

// Function B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup.B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C.SpawnActor
// 0x0060 (0x0060 - 0x0000)
struct B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_SpawnActor final
{
public:
	struct FTransform                             New_Transform;                                     // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_SpawnActor) == 0x000010, "Wrong alignment on B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_SpawnActor");
static_assert(sizeof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_SpawnActor) == 0x000060, "Wrong size on B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_SpawnActor");
static_assert(offsetof(B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_SpawnActor, New_Transform) == 0x000000, "Member 'B_ActorSpawner_BGA_ValetMod_OffRoadTire_Pickup_C_SpawnActor::New_Transform' has a wrong offset!");

}

