#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Artemis_StealthGrass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Artemis_StealthGrass.B_Artemis_StealthGrass_C.BlueprintModifyIncomingDamage
// 0x0060 (0x0060 - 0x0000)
struct B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InTags;                                            // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0028(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AController*                            EventInstigator;                                   // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BlueprintModifyIncomingDamage_ReturnValue; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage) == 0x000008, "Wrong alignment on B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage");
static_assert(sizeof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage) == 0x000060, "Wrong size on B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage");
static_assert(offsetof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage, Damage) == 0x000000, "Member 'B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage::Damage' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage, InTags) == 0x000008, "Member 'B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage::InTags' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage, EffectContext) == 0x000028, "Member 'B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage::EffectContext' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage, EventInstigator) == 0x000040, "Member 'B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage::EventInstigator' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage, DamageCauser) == 0x000048, "Member 'B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage, ReturnValue) == 0x000050, "Member 'B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage, CallFunc_BlueprintModifyIncomingDamage_ReturnValue) == 0x000054, "Member 'B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage::CallFunc_BlueprintModifyIncomingDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage, CallFunc_HasAnyTags_ReturnValue) == 0x000058, "Member 'B_Artemis_StealthGrass_C_BlueprintModifyIncomingDamage::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");

// Function B_Artemis_StealthGrass.B_Artemis_StealthGrass_C.BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_Artemis_StealthGrass.B_Artemis_StealthGrass_C.BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_Artemis_StealthGrass_C_BndEvt__B_Artemis_StealthGrass_CylinderOverlapVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function B_Artemis_StealthGrass.B_Artemis_StealthGrass_C.CalculateTraceOriginWorldSpace
// 0x0150 (0x0150 - 0x0000)
struct B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace final
{
public:
	int32                                         LoopIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceVolumeBoxExtentScaledX;                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceVolumeBoxExtent;                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMod_Remainder;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x0054(0x0008)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0080(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace) == 0x000010, "Wrong alignment on B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace");
static_assert(sizeof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace) == 0x000150, "Wrong size on B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, LoopIndex) == 0x000000, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::LoopIndex' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, TraceVolumeBoxExtentScaledX) == 0x000004, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::TraceVolumeBoxExtentScaledX' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, TraceVolumeBoxExtent) == 0x000008, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::TraceVolumeBoxExtent' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, ReturnValue) == 0x000020, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_FFloor_ReturnValue) == 0x000038, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00003C, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000040, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_FMod_Remainder) == 0x000044, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_FMod_ReturnValue) == 0x000048, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000050, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_MakeRandomStream_ReturnValue) == 0x000054, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x00005C, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_BreakVector2D_X) == 0x000060, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_BreakVector2D_Y) == 0x000064, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x000068, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00006C, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000070, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_GetTransform_ReturnValue) == 0x000080, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_BreakVector_X) == 0x0000E0, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_BreakVector_Y) == 0x0000E4, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_BreakVector_Z) == 0x0000E8, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000EC, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_FTrunc64_ReturnValue) == 0x0000F0, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_FTrunc64_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000F8, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue) == 0x0000FC, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000100, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Add_FloatFloat_ReturnValue) == 0x000104, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000108, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00010C, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000110, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000114, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_MakeVector_ReturnValue) == 0x000118, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace, CallFunc_TransformLocation_ReturnValue) == 0x000130, "Member 'B_Artemis_StealthGrass_C_CalculateTraceOriginWorldSpace::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");

// Function B_Artemis_StealthGrass.B_Artemis_StealthGrass_C.ExecuteUbergraph_B_Artemis_StealthGrass
// 0x01A0 (0x01A0 - 0x0000)
struct B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AB_Artemis_StealthGrass_C*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	class AB_Artemis_StealthGrass_C*              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0058(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x018C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass) == 0x000008, "Wrong alignment on B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass");
static_assert(sizeof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass) == 0x0001A0, "Wrong size on B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, EntryPoint) == 0x000000, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, Temp_int_Array_Index_Variable) == 0x000004, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_Array_Get_Item) == 0x000018, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_Event_EndPlayReason) == 0x000028, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000038, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000040, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000048, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000050, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_bFromSweep) == 0x000054, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_SweepResult) == 0x000058, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000138, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_OtherActor) == 0x000140, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_OtherComp) == 0x000148, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000150, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000158, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x000168, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000178, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000180, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_IsValid_ReturnValue_1) == 0x000188, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00018C, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_GetValueAsBool_ReturnValue) == 0x000194, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass, CallFunc_RandomFloatInRange_ReturnValue) == 0x000198, "Member 'B_Artemis_StealthGrass_C_ExecuteUbergraph_B_Artemis_StealthGrass::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function B_Artemis_StealthGrass.B_Artemis_StealthGrass_C.InitializePreviewPlane
// 0x0158 (0x0158 - 0x0000)
struct B_Artemis_StealthGrass_C_InitializePreviewPlane final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0048(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue_1;         // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_StealthGrass_C_InitializePreviewPlane) == 0x000008, "Wrong alignment on B_Artemis_StealthGrass_C_InitializePreviewPlane");
static_assert(sizeof(B_Artemis_StealthGrass_C_InitializePreviewPlane) == 0x000158, "Wrong size on B_Artemis_StealthGrass_C_InitializePreviewPlane");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializePreviewPlane, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_Artemis_StealthGrass_C_InitializePreviewPlane::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializePreviewPlane, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x000008, "Member 'B_Artemis_StealthGrass_C_InitializePreviewPlane::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializePreviewPlane, CallFunc_BreakVector_X) == 0x000020, "Member 'B_Artemis_StealthGrass_C_InitializePreviewPlane::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializePreviewPlane, CallFunc_BreakVector_Y) == 0x000024, "Member 'B_Artemis_StealthGrass_C_InitializePreviewPlane::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializePreviewPlane, CallFunc_BreakVector_Z) == 0x000028, "Member 'B_Artemis_StealthGrass_C_InitializePreviewPlane::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializePreviewPlane, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'B_Artemis_StealthGrass_C_InitializePreviewPlane::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializePreviewPlane, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000048, "Member 'B_Artemis_StealthGrass_C_InitializePreviewPlane::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializePreviewPlane, CallFunc_GetScaledBoxExtent_ReturnValue_1) == 0x000128, "Member 'B_Artemis_StealthGrass_C_InitializePreviewPlane::CallFunc_GetScaledBoxExtent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializePreviewPlane, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000140, "Member 'B_Artemis_StealthGrass_C_InitializePreviewPlane::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

// Function B_Artemis_StealthGrass.B_Artemis_StealthGrass_C.InitializeRenderTarget
// 0x00B0 (0x00B0 - 0x0000)
struct B_Artemis_StealthGrass_C_InitializeRenderTarget final
{
public:
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasRenderTarget2D*                  CallFunc_CreateCanvasRenderTarget2D_ReturnValue;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_StealthGrass_C_InitializeRenderTarget) == 0x000008, "Wrong alignment on B_Artemis_StealthGrass_C_InitializeRenderTarget");
static_assert(sizeof(B_Artemis_StealthGrass_C_InitializeRenderTarget) == 0x0000B0, "Wrong size on B_Artemis_StealthGrass_C_InitializeRenderTarget");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_GetLocalBounds_Min) == 0x000000, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_GetLocalBounds_Max) == 0x000018, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000030, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_BreakVector_X) == 0x000048, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_BreakVector_Y) == 0x00004C, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_BreakVector_Z) == 0x000050, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_FMax_ReturnValue) == 0x000054, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_FMax_ReturnValue_1) == 0x000058, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000060, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000078, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00007C, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000090, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_BreakVector2D_X) == 0x000098, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_BreakVector2D_Y) == 0x00009C, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_FTrunc_ReturnValue) == 0x0000A0, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_FTrunc_ReturnValue_1) == 0x0000A4, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeRenderTarget, CallFunc_CreateCanvasRenderTarget2D_ReturnValue) == 0x0000A8, "Member 'B_Artemis_StealthGrass_C_InitializeRenderTarget::CallFunc_CreateCanvasRenderTarget2D_ReturnValue' has a wrong offset!");

// Function B_Artemis_StealthGrass.B_Artemis_StealthGrass_C.InitializeVolumes
// 0x0098 (0x0098 - 0x0000)
struct B_Artemis_StealthGrass_C_InitializeVolumes final
{
public:
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_StealthGrass_C_InitializeVolumes) == 0x000008, "Wrong alignment on B_Artemis_StealthGrass_C_InitializeVolumes");
static_assert(sizeof(B_Artemis_StealthGrass_C_InitializeVolumes) == 0x000098, "Wrong size on B_Artemis_StealthGrass_C_InitializeVolumes");
static_assert(offsetof(B_Artemis_StealthGrass_C_InitializeVolumes, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000000, "Member 'B_Artemis_StealthGrass_C_InitializeVolumes::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
