#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Artemis_FlopperSpawnWorld_Placement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function B_Artemis_FlopperSpawnWorld_Placement.B_Artemis_FlopperSpawnWorld_Placement_C.EQS Finished
// 0x0010 (0x0010 - 0x0000)
struct B_Artemis_FlopperSpawnWorld_Placement_C_EQS_Finished final
{
public:
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_FlopperSpawnWorld_Placement_C_EQS_Finished) == 0x000008, "Wrong alignment on B_Artemis_FlopperSpawnWorld_Placement_C_EQS_Finished");
static_assert(sizeof(B_Artemis_FlopperSpawnWorld_Placement_C_EQS_Finished) == 0x000010, "Wrong size on B_Artemis_FlopperSpawnWorld_Placement_C_EQS_Finished");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_EQS_Finished, QueryInstance_0) == 0x000000, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_EQS_Finished::QueryInstance_0' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_EQS_Finished, QueryStatus) == 0x000008, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_EQS_Finished::QueryStatus' has a wrong offset!");

// Function B_Artemis_FlopperSpawnWorld_Placement.B_Artemis_FlopperSpawnWorld_Placement_C.ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement
// 0x03D0 (0x03D0 - 0x0000)
struct B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_SpawnTransform;                 // 0x0010(0x0060)(IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_ItemIndex;                      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x00F8(0x0010)(ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_GetPoiGridTagsForLocation_ReturnValue;    // 0x0108(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FVector>                        CallFunc_GetQueryResultsAsLocations_ResultLocations; // 0x0170(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetQueryResultsAsLocations_ReturnValue;   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x01A0(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWaterSubsystem*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanTotalHeight_ReturnValue;          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0230(0x0060)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate;              // 0x0294(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x02D0(0x0020)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0308(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0310(0x0020)(ConstParm)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0350(0x0060)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x03B8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement) == 0x000010, "Wrong alignment on B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement");
static_assert(sizeof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement) == 0x0003D0, "Wrong size on B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, EntryPoint) == 0x000000, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_CustomEvent_SpawnTransform) == 0x000010, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_CustomEvent_SpawnTransform' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_CustomEvent_ItemIndex) == 0x000070, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_CustomEvent_ItemIndex' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_BreakTransform_Location) == 0x000078, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_BreakTransform_Rotation) == 0x000090, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_BreakTransform_Scale) == 0x0000A8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000C0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, Temp_int_Loop_Counter_Variable) == 0x0000C8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000CC, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, Temp_int_Variable) == 0x0000D4, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000D8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetGameState_ReturnValue) == 0x0000E0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0000E8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Map_Keys_Keys) == 0x0000F8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetPoiGridTagsForLocation_ReturnValue) == 0x000108, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetPoiGridTagsForLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Array_Length_ReturnValue) == 0x000128, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Less_IntInt_ReturnValue) == 0x00012C, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000130, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000134, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000138, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x000140, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_CustomEvent_QueryInstance) == 0x000148, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_CustomEvent_QueryStatus) == 0x000150, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_MakeRotator_ReturnValue) == 0x000158, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetQueryResultsAsLocations_ResultLocations) == 0x000170, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetQueryResultsAsLocations_ResultLocations' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetQueryResultsAsLocations_ReturnValue) == 0x000180, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetQueryResultsAsLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetGameState_ReturnValue_1) == 0x000188, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, Temp_int_Array_Index_Variable) == 0x000190, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_RunEQSQuery_ReturnValue) == 0x000198, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_HasTag_ReturnValue) == 0x0001A4, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, Temp_int_Variable_1) == 0x0001A8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Array_Length_ReturnValue_1) == 0x0001AC, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0001B0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0001B8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetOceanTotalHeight_ReturnValue) == 0x0001BC, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetOceanTotalHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_BreakVector_X) == 0x0001C0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_BreakVector_Y) == 0x0001C4, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_BreakVector_Z) == 0x0001C8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_BreakVector_X_1) == 0x0001CC, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_BreakVector_Y_1) == 0x0001D0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_BreakVector_Z_1) == 0x0001D4, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001D8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0001DC, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Array_Length_ReturnValue_2) == 0x0001E0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_MakeVector_ReturnValue) == 0x0001E8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000200, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Add_IntInt_ReturnValue_3) == 0x000204, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Add_IntInt_ReturnValue_4) == 0x000208, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00020C, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_MakeRotator_ReturnValue_1) == 0x000210, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_MakeTransform_ReturnValue) == 0x000230, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000290, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_CreateDelegate_OutputDelegate) == 0x000294, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Less_FloatFloat_ReturnValue) == 0x0002A0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0002A8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, Temp_object_Variable) == 0x0002B0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_IsValid_ReturnValue) == 0x0002B8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0002BC, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, Temp_object_Variable_1) == 0x0002C0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_FTrunc_ReturnValue) == 0x0002C8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, Temp_struct_Variable) == 0x0002D0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Conv_IntToBool_ReturnValue) == 0x0002F0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0002F4, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0002F8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0002FC, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_CustomEvent_GameState) == 0x000300, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_CustomEvent_Playlist) == 0x000308, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_CustomEvent_PlaylistContextTags) == 0x000310, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000330, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_MakeVector_ReturnValue_1) == 0x000338, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_MakeTransform_ReturnValue_1) == 0x000350, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x0003B0, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x0003B4, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003B8, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function B_Artemis_FlopperSpawnWorld_Placement.B_Artemis_FlopperSpawnWorld_Placement_C.FindCustomSplineLocations
// 0x0128 (0x0128 - 0x0000)
struct B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_FlopperSpawn_CustomSpline_C*         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMod_Remainder;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations) == 0x000008, "Wrong alignment on B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations");
static_assert(sizeof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations) == 0x000128, "Wrong size on B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, Temp_int_Array_Index_Variable) == 0x000000, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Array_Get_Item) == 0x000018, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_GetSplineLength_ReturnValue) == 0x000040, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_FMod_Remainder) == 0x000050, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_FMod_ReturnValue) == 0x000054, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000058, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000060, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, Temp_int_Variable) == 0x000064, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000068, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations, CallFunc_Add_VectorVector_ReturnValue) == 0x000080, "Member 'B_Artemis_FlopperSpawnWorld_Placement_C_FindCustomSplineLocations::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
