#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Artemis_FlopperSpawnWorld_Placement

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Artemis_FlopperSpawnWorld_Placement.B_Artemis_FlopperSpawnWorld_Placement_C
// 0x0280 (0x04F0 - 0x0270)
class AB_Artemis_FlopperSpawnWorld_Placement_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMinimapHiddenComponent*                MinimapHidden;                                     // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         HeightOffset;                                      // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_Enabled;                                       // 0x0298(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SpawnChanceMin;                                // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SpawnChanceMax;                                // 0x02E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         AmountSpawned;                                     // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        WaterBodyLocationsToSpawn;                         // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DistanceBetweenSpawnsRiverNarrow;                  // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RiverNarrowSpawnOffset;                            // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AArtemis_Waterbody_River_Parent_C*> RiversNarrow;                                      // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	float                                         DistanceBetweenSpawnsRiverWide;                    // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RiverWideSpawnOffset;                              // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AArtemis_Waterbody_River_Parent_C*> RiversWide;                                        // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	float                                         DistanceBetweenSpawnsLake;                         // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LakeSpawnOffset;                                   // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AArtemis_Waterbody_Lake_Parent_C*> Lakes;                                             // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	float                                         DistanceBetweenSpawnsIsland;                       // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IslandSpawnOffset;                                 // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AArtemis_Waterbody_Island_Parent_C*> Island;                                            // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	float                                         DistanceBetweenSpawnsOceanIsland;                  // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OceanIslandSpawnOffset;                            // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AWaterBodyIsland*>               OceansIslands;                                     // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	float                                         InitialSpawnVarience;                              // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplineLength;                                      // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitialDistanceOnSpline;                           // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceBetweenSpawnsCustomSpline;                 // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CustomSplineSpawnOffset;                           // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AB_FlopperSpawn_CustomSpline_C*> CustomSpawnerSpline;                               // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<struct FGameplayTag, class UClass*>      POI_SpawnerMap;                                    // 0x03C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 FlopperSpawner;                                    // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        FloodLocationsToSpawn;                             // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         WaterBodyAmountSpawned;                            // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OceanHeight;                                       // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         GridSize;                                          // 0x0440(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SpaceBetween;                                      // 0x0468(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTransform                             SpawnPoint;                                        // 0x0490(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void EQS_Finished(class UEnvQueryInstanceBlueprintWrapper* QueryInstance_0, EEnvQueryStatus QueryStatus);
	void ExecuteUbergraph_B_Artemis_FlopperSpawnWorld_Placement(int32 EntryPoint);
	void FindCustomSplineLocations();
	void FindIslandLocations();
	void FindLakeLocations();
	void FindOceanLocations();
	void FindRiverNarrowLocations();
	void FindRiverWideLocations();
	struct FVector GetNormal(class USplineComponent* Spline, float Distance);
	void OnReady_FDC1A68B4F1D24CA5D5C0EB7F4616663(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void ReceiveBeginPlay();
	void RollRarity(EFortRarity* RarityOut);
	void Spawn(const struct FTransform& SpawnTransform, int32 ItemIndex);
	void StartEQSSpawn();
	void StartWaterBodySpawn();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Artemis_FlopperSpawnWorld_Placement_C">();
	}
	static class AB_Artemis_FlopperSpawnWorld_Placement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Artemis_FlopperSpawnWorld_Placement_C>();
	}
};
static_assert(alignof(AB_Artemis_FlopperSpawnWorld_Placement_C) == 0x000010, "Wrong alignment on AB_Artemis_FlopperSpawnWorld_Placement_C");
static_assert(sizeof(AB_Artemis_FlopperSpawnWorld_Placement_C) == 0x0004F0, "Wrong size on AB_Artemis_FlopperSpawnWorld_Placement_C");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, UberGraphFrame) == 0x000270, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, MinimapHidden) == 0x000278, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::MinimapHidden' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, Billboard) == 0x000280, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::Billboard' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, DefaultSceneRoot) == 0x000288, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, HeightOffset) == 0x000290, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::HeightOffset' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, Row_Enabled) == 0x000298, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::Row_Enabled' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, Row_SpawnChanceMin) == 0x0002C0, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::Row_SpawnChanceMin' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, Row_SpawnChanceMax) == 0x0002E8, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::Row_SpawnChanceMax' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, AmountSpawned) == 0x000310, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::AmountSpawned' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, WaterBodyLocationsToSpawn) == 0x000318, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::WaterBodyLocationsToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, DistanceBetweenSpawnsRiverNarrow) == 0x000328, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::DistanceBetweenSpawnsRiverNarrow' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, RiverNarrowSpawnOffset) == 0x00032C, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::RiverNarrowSpawnOffset' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, RiversNarrow) == 0x000330, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::RiversNarrow' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, DistanceBetweenSpawnsRiverWide) == 0x000340, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::DistanceBetweenSpawnsRiverWide' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, RiverWideSpawnOffset) == 0x000344, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::RiverWideSpawnOffset' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, RiversWide) == 0x000348, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::RiversWide' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, DistanceBetweenSpawnsLake) == 0x000358, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::DistanceBetweenSpawnsLake' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, LakeSpawnOffset) == 0x00035C, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::LakeSpawnOffset' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, Lakes) == 0x000360, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::Lakes' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, DistanceBetweenSpawnsIsland) == 0x000370, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::DistanceBetweenSpawnsIsland' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, IslandSpawnOffset) == 0x000374, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::IslandSpawnOffset' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, Island) == 0x000378, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::Island' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, DistanceBetweenSpawnsOceanIsland) == 0x000388, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::DistanceBetweenSpawnsOceanIsland' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, OceanIslandSpawnOffset) == 0x00038C, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::OceanIslandSpawnOffset' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, OceansIslands) == 0x000390, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::OceansIslands' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, InitialSpawnVarience) == 0x0003A0, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::InitialSpawnVarience' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, SplineLength) == 0x0003A4, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::SplineLength' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, InitialDistanceOnSpline) == 0x0003A8, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::InitialDistanceOnSpline' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, DistanceBetweenSpawnsCustomSpline) == 0x0003AC, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::DistanceBetweenSpawnsCustomSpline' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, CustomSplineSpawnOffset) == 0x0003B0, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::CustomSplineSpawnOffset' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, CustomSpawnerSpline) == 0x0003B8, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::CustomSpawnerSpline' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, POI_SpawnerMap) == 0x0003C8, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::POI_SpawnerMap' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, FlopperSpawner) == 0x000418, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::FlopperSpawner' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, QueryInstance) == 0x000420, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::QueryInstance' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, FloodLocationsToSpawn) == 0x000428, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::FloodLocationsToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, WaterBodyAmountSpawned) == 0x000438, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::WaterBodyAmountSpawned' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, OceanHeight) == 0x00043C, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::OceanHeight' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, GridSize) == 0x000440, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::GridSize' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, SpaceBetween) == 0x000468, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::SpaceBetween' has a wrong offset!");
static_assert(offsetof(AB_Artemis_FlopperSpawnWorld_Placement_C, SpawnPoint) == 0x000490, "Member 'AB_Artemis_FlopperSpawnWorld_Placement_C::SpawnPoint' has a wrong offset!");

}

