#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Booty_Chest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_Booty_Chest.B_Athena_Booty_Chest_C
// 0x0100 (0x1120 - 0x1020)
class AB_Athena_Booty_Chest_C final : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1020(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Pirate_Chest_Sparkle;                            // 0x1028(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Chest_SmokeSheet;                                // 0x1030(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   TreasureLight;                                     // 0x1038(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Chest_Ambient_Sound;                               // 0x1040(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpInteactoIcon_157EAF334D38492A3E3FF5AA7597A4F8; // 0x1048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpObject_157EAF334D38492A3E3FF5AA7597A4F8; // 0x104C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileSelectedTL__Direction_157EAF334D38492A3E3FF5AA7597A4F8; // 0x1050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1051[0x7];                                     // 0x1051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileSelectedTL;                                  // 0x1058(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileOnInteractTL_LERP_74C15C554814C94C348232BDB02EF71B; // 0x1060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileOnInteractTL__Direction_74C15C554814C94C348232BDB02EF71B; // 0x1064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1065[0x3];                                     // 0x1065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileOnInteractTL;                                // 0x1068(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Loot_Effect;                                       // 0x1070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MIDs;                                              // 0x1078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MobileWiggleAmount;                                // 0x1088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108C[0x4];                                     // 0x108C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ChimeTimer;                                        // 0x1090(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ChestChimeVisualUpdate;                            // 0x1098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109C[0x4];                                     // 0x109C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MobileInteractionMaterial;                         // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MobileInteractIcon;                                // 0x10A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconLocation;                        // 0x10B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconScale;                           // 0x10C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DugUp;                                             // 0x10E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E1[0x3];                                     // 0x10E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TimesDug;                                          // 0x10E4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowSound;                                         // 0x10E8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E9[0x7];                                     // 0x10E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ChestCurrentLoc;                                   // 0x10F0(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ChestCurrentRot;                                   // 0x1108(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void Chime_Visual();
	void CleanupWiggleMIDs();
	void CreateMobileMIDs();
	void DisableBacchusHighlight();
	void EnableBacchusHighlight();
	void EnableGlows(bool On);
	void ExecuteUbergraph_B_Athena_Booty_Chest(int32 EntryPoint);
	void GetMaxAudibleDistance(float* Max_Distance);
	void Mobile_OnDisconnect();
	void Mobile_OnInteract();
	void Mobile_Outline_Off();
	void Mobile_Outline_On();
	void MobileOnInteractTL__FinishedFunc();
	void MobileOnInteractTL__UpdateFunc();
	void MobileSelectedTL__FinishedFunc();
	void MobileSelectedTL__UpdateFunc();
	void OnBeginSearch();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnLoot();
	void OnRep_ChestCurrentLoc();
	void OnRep_ChestCurrentRot();
	void OnRep_DugUp();
	void OnRep_TimesDug();
	void OnSetCustomDepthStencilValue(const TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);
	void OnSetSearched();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void SetLightVisibility(bool Visible);
	void SetVisibleMobileInteractIcon(bool Visible);
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void UserConstructionScript();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_Booty_Chest_C">();
	}
	static class AB_Athena_Booty_Chest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_Booty_Chest_C>();
	}
};
static_assert(alignof(AB_Athena_Booty_Chest_C) == 0x000008, "Wrong alignment on AB_Athena_Booty_Chest_C");
static_assert(sizeof(AB_Athena_Booty_Chest_C) == 0x001120, "Wrong size on AB_Athena_Booty_Chest_C");
static_assert(offsetof(AB_Athena_Booty_Chest_C, UberGraphFrame) == 0x001020, "Member 'AB_Athena_Booty_Chest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, P_Pirate_Chest_Sparkle) == 0x001028, "Member 'AB_Athena_Booty_Chest_C::P_Pirate_Chest_Sparkle' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, S_Chest_SmokeSheet) == 0x001030, "Member 'AB_Athena_Booty_Chest_C::S_Chest_SmokeSheet' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, TreasureLight) == 0x001038, "Member 'AB_Athena_Booty_Chest_C::TreasureLight' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, Chest_Ambient_Sound) == 0x001040, "Member 'AB_Athena_Booty_Chest_C::Chest_Ambient_Sound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileSelectedTL_LerpInteactoIcon_157EAF334D38492A3E3FF5AA7597A4F8) == 0x001048, "Member 'AB_Athena_Booty_Chest_C::MobileSelectedTL_LerpInteactoIcon_157EAF334D38492A3E3FF5AA7597A4F8' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileSelectedTL_LerpObject_157EAF334D38492A3E3FF5AA7597A4F8) == 0x00104C, "Member 'AB_Athena_Booty_Chest_C::MobileSelectedTL_LerpObject_157EAF334D38492A3E3FF5AA7597A4F8' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileSelectedTL__Direction_157EAF334D38492A3E3FF5AA7597A4F8) == 0x001050, "Member 'AB_Athena_Booty_Chest_C::MobileSelectedTL__Direction_157EAF334D38492A3E3FF5AA7597A4F8' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileSelectedTL) == 0x001058, "Member 'AB_Athena_Booty_Chest_C::MobileSelectedTL' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileOnInteractTL_LERP_74C15C554814C94C348232BDB02EF71B) == 0x001060, "Member 'AB_Athena_Booty_Chest_C::MobileOnInteractTL_LERP_74C15C554814C94C348232BDB02EF71B' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileOnInteractTL__Direction_74C15C554814C94C348232BDB02EF71B) == 0x001064, "Member 'AB_Athena_Booty_Chest_C::MobileOnInteractTL__Direction_74C15C554814C94C348232BDB02EF71B' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileOnInteractTL) == 0x001068, "Member 'AB_Athena_Booty_Chest_C::MobileOnInteractTL' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, Loot_Effect) == 0x001070, "Member 'AB_Athena_Booty_Chest_C::Loot_Effect' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MIDs) == 0x001078, "Member 'AB_Athena_Booty_Chest_C::MIDs' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileWiggleAmount) == 0x001088, "Member 'AB_Athena_Booty_Chest_C::MobileWiggleAmount' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, ChimeTimer) == 0x001090, "Member 'AB_Athena_Booty_Chest_C::ChimeTimer' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, ChestChimeVisualUpdate) == 0x001098, "Member 'AB_Athena_Booty_Chest_C::ChestChimeVisualUpdate' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileInteractionMaterial) == 0x0010A0, "Member 'AB_Athena_Booty_Chest_C::MobileInteractionMaterial' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileInteractIcon) == 0x0010A8, "Member 'AB_Athena_Booty_Chest_C::MobileInteractIcon' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileInteractIconLocation) == 0x0010B0, "Member 'AB_Athena_Booty_Chest_C::MobileInteractIconLocation' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, MobileInteractIconScale) == 0x0010C8, "Member 'AB_Athena_Booty_Chest_C::MobileInteractIconScale' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, DugUp) == 0x0010E0, "Member 'AB_Athena_Booty_Chest_C::DugUp' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, TimesDug) == 0x0010E4, "Member 'AB_Athena_Booty_Chest_C::TimesDug' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, ShowSound) == 0x0010E8, "Member 'AB_Athena_Booty_Chest_C::ShowSound' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, ChestCurrentLoc) == 0x0010F0, "Member 'AB_Athena_Booty_Chest_C::ChestCurrentLoc' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_Chest_C, ChestCurrentRot) == 0x001108, "Member 'AB_Athena_Booty_Chest_C::ChestCurrentRot' has a wrong offset!");

}

