#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_BuriedChest_Chest_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Tiered_Chest_Athena_Parent_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_BuriedChest_Chest_Parent.B_Athena_BuriedChest_Chest_Parent_C
// 0x0030 (0x1160 - 0x1130)
class AB_Athena_BuriedChest_Chest_Parent_C : public ATiered_Chest_Athena_Parent_C
{
public:
	bool                                          DugUp;                                             // 0x1129(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112A[0x2];                                     // 0x112A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TimesDug;                                          // 0x112C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ChestCurrentLoc;                                   // 0x1130(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ChestCurrentRot;                                   // 0x1148(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void OnRep_ChestCurrentLoc();
	void OnRep_ChestCurrentRot();
	void OnRep_DugUp();
	void OnRep_TimesDug();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void UserConstructionScript();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_BuriedChest_Chest_Parent_C">();
	}
	static class AB_Athena_BuriedChest_Chest_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_BuriedChest_Chest_Parent_C>();
	}
};
static_assert(alignof(AB_Athena_BuriedChest_Chest_Parent_C) == 0x000008, "Wrong alignment on AB_Athena_BuriedChest_Chest_Parent_C");
static_assert(sizeof(AB_Athena_BuriedChest_Chest_Parent_C) == 0x001160, "Wrong size on AB_Athena_BuriedChest_Chest_Parent_C");
static_assert(offsetof(AB_Athena_BuriedChest_Chest_Parent_C, DugUp) == 0x001129, "Member 'AB_Athena_BuriedChest_Chest_Parent_C::DugUp' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Chest_Parent_C, TimesDug) == 0x00112C, "Member 'AB_Athena_BuriedChest_Chest_Parent_C::TimesDug' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Chest_Parent_C, ChestCurrentLoc) == 0x001130, "Member 'AB_Athena_BuriedChest_Chest_Parent_C::ChestCurrentLoc' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Chest_Parent_C, ChestCurrentRot) == 0x001148, "Member 'AB_Athena_BuriedChest_Chest_Parent_C::ChestCurrentRot' has a wrong offset!");

}

