#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Booty_PickupSpawner

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_Booty_PickupSpawner.B_Athena_Booty_PickupSpawner_C
// 0x0038 (0x02A8 - 0x0270)
class AB_Athena_Booty_PickupSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AProp_Athena_Booty_C*                   PropRef;                                           // 0x0280(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AFortPickup*                            PickupToBind;                                      // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FGameplayTag                           T_BootyActive;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        MapRip;                                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             RipSound;                                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChestOpened(class ABuildingActor* SelfActor, class AFortPawn* InteractingPawn);
	void ExecuteUbergraph_B_Athena_Booty_PickupSpawner(int32 EntryPoint);
	void PassMapOnPickup(class AFortPickup* SelfActor, class AFortPawn* InteractingPawn, const class UFortWorldItemDefinition* WorldItemDefinition, const struct FVector& PickupLocation);
	void Play_Client_FX(const struct FVector& Loc, const struct FRotator& Rot);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_Booty_PickupSpawner_C">();
	}
	static class AB_Athena_Booty_PickupSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_Booty_PickupSpawner_C>();
	}
};
static_assert(alignof(AB_Athena_Booty_PickupSpawner_C) == 0x000008, "Wrong alignment on AB_Athena_Booty_PickupSpawner_C");
static_assert(sizeof(AB_Athena_Booty_PickupSpawner_C) == 0x0002A8, "Wrong size on AB_Athena_Booty_PickupSpawner_C");
static_assert(offsetof(AB_Athena_Booty_PickupSpawner_C, UberGraphFrame) == 0x000270, "Member 'AB_Athena_Booty_PickupSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_PickupSpawner_C, DefaultSceneRoot) == 0x000278, "Member 'AB_Athena_Booty_PickupSpawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_PickupSpawner_C, PropRef) == 0x000280, "Member 'AB_Athena_Booty_PickupSpawner_C::PropRef' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_PickupSpawner_C, PickupToBind) == 0x000288, "Member 'AB_Athena_Booty_PickupSpawner_C::PickupToBind' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_PickupSpawner_C, T_BootyActive) == 0x000290, "Member 'AB_Athena_Booty_PickupSpawner_C::T_BootyActive' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_PickupSpawner_C, MapRip) == 0x000298, "Member 'AB_Athena_Booty_PickupSpawner_C::MapRip' has a wrong offset!");
static_assert(offsetof(AB_Athena_Booty_PickupSpawner_C, RipSound) == 0x0002A0, "Member 'AB_Athena_Booty_PickupSpawner_C::RipSound' has a wrong offset!");

}

