#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Booty_PickupSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_Booty_PickupSpawner.B_Athena_Booty_PickupSpawner_C.ChestOpened
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_Booty_PickupSpawner_C_ChestOpened final
{
public:
	class ABuildingActor*                         SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              InteractingPawn;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Booty_PickupSpawner_C_ChestOpened) == 0x000008, "Wrong alignment on B_Athena_Booty_PickupSpawner_C_ChestOpened");
static_assert(sizeof(B_Athena_Booty_PickupSpawner_C_ChestOpened) == 0x000010, "Wrong size on B_Athena_Booty_PickupSpawner_C_ChestOpened");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ChestOpened, SelfActor) == 0x000000, "Member 'B_Athena_Booty_PickupSpawner_C_ChestOpened::SelfActor' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ChestOpened, InteractingPawn) == 0x000008, "Member 'B_Athena_Booty_PickupSpawner_C_ChestOpened::InteractingPawn' has a wrong offset!");

// Function B_Athena_Booty_PickupSpawner.B_Athena_Booty_PickupSpawner_C.ExecuteUbergraph_B_Athena_Booty_PickupSpawner
// 0x01C0 (0x01C0 - 0x0000)
struct B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0008(0x00B0)()
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            K2Node_CustomEvent_SelfActor_1;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_InteractingPawn_1;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortWorldItemDefinition*         K2Node_CustomEvent_WorldItemDefinition;            // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_PickupLocation;                 // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_CustomEvent_SelfActor;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_InteractingPawn;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Loc;                            // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rot;                            // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class AFortPickup* SelfActor, class AFortPawn* InteractingPawn, class UFortWorldItemDefinition* WorldItemDefinition, const struct FVector& PickupLocation)> K2Node_CreateDelegate_OutputDelegate;              // 0x0178(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABuildingActor* SelfActor, class AFortPawn* InteractingPawn)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner) == 0x000008, "Wrong alignment on B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner");
static_assert(sizeof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner) == 0x0001C0, "Wrong size on B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, EntryPoint) == 0x000000, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_MakeStruct_GameplayEventData) == 0x000008, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_IsServer_ReturnValue) == 0x0000B8, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CustomEvent_SelfActor_1) == 0x0000C0, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CustomEvent_SelfActor_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CustomEvent_InteractingPawn_1) == 0x0000C8, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CustomEvent_InteractingPawn_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CustomEvent_WorldItemDefinition) == 0x0000D0, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CustomEvent_WorldItemDefinition' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CustomEvent_PickupLocation) == 0x0000D8, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CustomEvent_PickupLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput) == 0x0000F0, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue) == 0x000100, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CustomEvent_SelfActor) == 0x000108, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CustomEvent_SelfActor' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CustomEvent_InteractingPawn) == 0x000110, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CustomEvent_InteractingPawn' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000118, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000130, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CustomEvent_Loc) == 0x000148, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CustomEvent_Loc' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CustomEvent_Rot) == 0x000160, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CustomEvent_Rot' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_BreakRotator_Roll) == 0x000184, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_BreakRotator_Pitch) == 0x000188, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_BreakRotator_Yaw) == 0x00018C, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_MakeRotator_ReturnValue) == 0x000190, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001A8, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B0, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner, CallFunc_IsValid_ReturnValue_1) == 0x0001BC, "Member 'B_Athena_Booty_PickupSpawner_C_ExecuteUbergraph_B_Athena_Booty_PickupSpawner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function B_Athena_Booty_PickupSpawner.B_Athena_Booty_PickupSpawner_C.PassMapOnPickup
// 0x0030 (0x0030 - 0x0000)
struct B_Athena_Booty_PickupSpawner_C_PassMapOnPickup final
{
public:
	class AFortPickup*                            SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              InteractingPawn;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortWorldItemDefinition*         WorldItemDefinition;                               // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PickupLocation;                                    // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Booty_PickupSpawner_C_PassMapOnPickup) == 0x000008, "Wrong alignment on B_Athena_Booty_PickupSpawner_C_PassMapOnPickup");
static_assert(sizeof(B_Athena_Booty_PickupSpawner_C_PassMapOnPickup) == 0x000030, "Wrong size on B_Athena_Booty_PickupSpawner_C_PassMapOnPickup");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_PassMapOnPickup, SelfActor) == 0x000000, "Member 'B_Athena_Booty_PickupSpawner_C_PassMapOnPickup::SelfActor' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_PassMapOnPickup, InteractingPawn) == 0x000008, "Member 'B_Athena_Booty_PickupSpawner_C_PassMapOnPickup::InteractingPawn' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_PassMapOnPickup, WorldItemDefinition) == 0x000010, "Member 'B_Athena_Booty_PickupSpawner_C_PassMapOnPickup::WorldItemDefinition' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_PassMapOnPickup, PickupLocation) == 0x000018, "Member 'B_Athena_Booty_PickupSpawner_C_PassMapOnPickup::PickupLocation' has a wrong offset!");

// Function B_Athena_Booty_PickupSpawner.B_Athena_Booty_PickupSpawner_C.Play Client FX
// 0x0030 (0x0030 - 0x0000)
struct B_Athena_Booty_PickupSpawner_C_Play_Client_FX final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot;                                               // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_Booty_PickupSpawner_C_Play_Client_FX) == 0x000008, "Wrong alignment on B_Athena_Booty_PickupSpawner_C_Play_Client_FX");
static_assert(sizeof(B_Athena_Booty_PickupSpawner_C_Play_Client_FX) == 0x000030, "Wrong size on B_Athena_Booty_PickupSpawner_C_Play_Client_FX");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_Play_Client_FX, Loc) == 0x000000, "Member 'B_Athena_Booty_PickupSpawner_C_Play_Client_FX::Loc' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_PickupSpawner_C_Play_Client_FX, Rot) == 0x000018, "Member 'B_Athena_Booty_PickupSpawner_C_Play_Client_FX::Rot' has a wrong offset!");

}

