#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Booty_Item

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_Booty_Item.B_Athena_Booty_Item_C.ExecuteUbergraph_B_Athena_Booty_Item
// 0x0038 (0x0038 - 0x0000)
struct B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item) == 0x000008, "Wrong alignment on B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item");
static_assert(sizeof(B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item) == 0x000038, "Wrong size on B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item");
static_assert(offsetof(B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item, EntryPoint) == 0x000000, "Member 'B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'B_Athena_Booty_Item_C_ExecuteUbergraph_B_Athena_Booty_Item::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

