#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CameraRainDrops_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_CameraRainDrops_01.B_CameraRainDrops_01_C
// 0x0020 (0x0380 - 0x0360)
class AB_CameraRainDrops_01_C final : public AEmitterCameraLensEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Alpha_Alpha_06897833405CC2B231B02C93C4E725A3;      // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Alpha__Direction_06897833405CC2B231B02C93C4E725A3; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Alpha;                                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_CameraRainDrops_01(int32 EntryPoint);
	void Alpha__UpdateFunc();
	void Alpha__FinishedFunc();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_CameraRainDrops_01_C">();
	}
	static class AB_CameraRainDrops_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_CameraRainDrops_01_C>();
	}
};
static_assert(alignof(AB_CameraRainDrops_01_C) == 0x000010, "Wrong alignment on AB_CameraRainDrops_01_C");
static_assert(sizeof(AB_CameraRainDrops_01_C) == 0x000380, "Wrong size on AB_CameraRainDrops_01_C");
static_assert(offsetof(AB_CameraRainDrops_01_C, UberGraphFrame) == 0x000360, "Member 'AB_CameraRainDrops_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_CameraRainDrops_01_C, Alpha_Alpha_06897833405CC2B231B02C93C4E725A3) == 0x000368, "Member 'AB_CameraRainDrops_01_C::Alpha_Alpha_06897833405CC2B231B02C93C4E725A3' has a wrong offset!");
static_assert(offsetof(AB_CameraRainDrops_01_C, Alpha__Direction_06897833405CC2B231B02C93C4E725A3) == 0x00036C, "Member 'AB_CameraRainDrops_01_C::Alpha__Direction_06897833405CC2B231B02C93C4E725A3' has a wrong offset!");
static_assert(offsetof(AB_CameraRainDrops_01_C, Alpha) == 0x000370, "Member 'AB_CameraRainDrops_01_C::Alpha' has a wrong offset!");

}

