#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CameraLens_Boat_Droplets

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_CameraLens_Boat_Droplets.B_CameraLens_Boat_Droplets_C
// 0x0020 (0x0380 - 0x0360)
class AB_CameraLens_Boat_Droplets_C final : public AEmitterCameraLensEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_Alpha_0C9ACFAF463718824428D0A86CC5D789; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_0C9ACFAF463718824428D0A86CC5D789; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_CameraLens_Boat_Droplets(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_CameraLens_Boat_Droplets_C">();
	}
	static class AB_CameraLens_Boat_Droplets_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_CameraLens_Boat_Droplets_C>();
	}
};
static_assert(alignof(AB_CameraLens_Boat_Droplets_C) == 0x000010, "Wrong alignment on AB_CameraLens_Boat_Droplets_C");
static_assert(sizeof(AB_CameraLens_Boat_Droplets_C) == 0x000380, "Wrong size on AB_CameraLens_Boat_Droplets_C");
static_assert(offsetof(AB_CameraLens_Boat_Droplets_C, UberGraphFrame) == 0x000360, "Member 'AB_CameraLens_Boat_Droplets_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_CameraLens_Boat_Droplets_C, Timeline_0_Alpha_0C9ACFAF463718824428D0A86CC5D789) == 0x000368, "Member 'AB_CameraLens_Boat_Droplets_C::Timeline_0_Alpha_0C9ACFAF463718824428D0A86CC5D789' has a wrong offset!");
static_assert(offsetof(AB_CameraLens_Boat_Droplets_C, Timeline_0__Direction_0C9ACFAF463718824428D0A86CC5D789) == 0x00036C, "Member 'AB_CameraLens_Boat_Droplets_C::Timeline_0__Direction_0C9ACFAF463718824428D0A86CC5D789' has a wrong offset!");
static_assert(offsetof(AB_CameraLens_Boat_Droplets_C, Timeline_0) == 0x000370, "Member 'AB_CameraLens_Boat_Droplets_C::Timeline_0' has a wrong offset!");

}

