#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CameraRainDrops_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_CameraRainDrops_01.B_CameraRainDrops_01_C.ExecuteUbergraph_B_CameraRainDrops_01
// 0x000C (0x000C - 0x0000)
struct B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01) == 0x000004, "Wrong alignment on B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01");
static_assert(sizeof(B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01) == 0x00000C, "Wrong size on B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01");
static_assert(offsetof(B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01, EntryPoint) == 0x000000, "Member 'B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01, CallFunc_GetRenderingDetailMode_ReturnValue) == 0x000004, "Member 'B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01::CallFunc_GetRenderingDetailMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'B_CameraRainDrops_01_C_ExecuteUbergraph_B_CameraRainDrops_01::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

