#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_ConsumableSmall_RealitySeed_Athena

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_ConsumableSmall_RealitySeed_Athena.B_ConsumableSmall_RealitySeed_Athena_C.ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena
// 0x00E0 (0x00E0 - 0x0000)
struct B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0008(0x00D0)(ContainsInstancedReference)
	bool                                          K2Node_Event_bVisible;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSetForLocalControllerOnly;           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena) == 0x000008, "Wrong alignment on B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena");
static_assert(sizeof(B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena) == 0x0000E0, "Wrong size on B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena");
static_assert(offsetof(B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena, EntryPoint) == 0x000000, "Member 'B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000008, "Member 'B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena, K2Node_Event_bVisible) == 0x0000D8, "Member 'B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena, K2Node_Event_bSetForLocalControllerOnly) == 0x0000D9, "Member 'B_ConsumableSmall_RealitySeed_Athena_C_ExecuteUbergraph_B_ConsumableSmall_RealitySeed_Athena::K2Node_Event_bSetForLocalControllerOnly' has a wrong offset!");

// Function B_ConsumableSmall_RealitySeed_Athena.B_ConsumableSmall_RealitySeed_Athena_C.OnWeaponVisibilityChanged
// 0x0002 (0x0002 - 0x0000)
struct B_ConsumableSmall_RealitySeed_Athena_C_OnWeaponVisibilityChanged final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSetForLocalControllerOnly;                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ConsumableSmall_RealitySeed_Athena_C_OnWeaponVisibilityChanged) == 0x000001, "Wrong alignment on B_ConsumableSmall_RealitySeed_Athena_C_OnWeaponVisibilityChanged");
static_assert(sizeof(B_ConsumableSmall_RealitySeed_Athena_C_OnWeaponVisibilityChanged) == 0x000002, "Wrong size on B_ConsumableSmall_RealitySeed_Athena_C_OnWeaponVisibilityChanged");
static_assert(offsetof(B_ConsumableSmall_RealitySeed_Athena_C_OnWeaponVisibilityChanged, bVisible) == 0x000000, "Member 'B_ConsumableSmall_RealitySeed_Athena_C_OnWeaponVisibilityChanged::bVisible' has a wrong offset!");
static_assert(offsetof(B_ConsumableSmall_RealitySeed_Athena_C_OnWeaponVisibilityChanged, bSetForLocalControllerOnly) == 0x000001, "Member 'B_ConsumableSmall_RealitySeed_Athena_C_OnWeaponVisibilityChanged::bSetForLocalControllerOnly' has a wrong offset!");

}

