#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CreatureAnimSoundLibraryContext

#include "Basic.hpp"

#include "SoundLibrary_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_CreatureAnimSoundLibraryContext.B_CreatureAnimSoundLibraryContext_C.PlaySound
// 0x00E8 (0x00E8 - 0x0000)
struct B_CreatureAnimSoundLibraryContext_C_PlaySound final
{
public:
	class USoundBase*                             sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundLibraryPlaySoundResult           OutResults;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          Temp_byte_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_Pawn_Wildlife_Parent_C*            K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetConverterPawn_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetBoolParameter_self_CastInput;          // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetBoolParameter_self_CastInput_1;        // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1;       // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreatureAnimSoundLibraryContext_C_PlaySound) == 0x000008, "Wrong alignment on B_CreatureAnimSoundLibraryContext_C_PlaySound");
static_assert(sizeof(B_CreatureAnimSoundLibraryContext_C_PlaySound) == 0x0000E8, "Wrong size on B_CreatureAnimSoundLibraryContext_C_PlaySound");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, sound) == 0x000000, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::sound' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, OutResults) == 0x000008, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::OutResults' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, ReturnValue) == 0x000030, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, Temp_float_Variable) == 0x000034, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_MatchesTag_ReturnValue) == 0x000038, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, Temp_float_Variable_1) == 0x00003C, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_SelectFloat_ReturnValue) == 0x000040, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, Temp_byte_Variable) == 0x000044, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent) == 0x000048, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue) == 0x000051, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000052, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_IsValid_ReturnValue) == 0x000053, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_GetConverterPawn_ReturnValue) == 0x000058, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_GetConverterPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_IsLocallyControlled_ReturnValue) == 0x000061, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000068, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, K2Node_Select_Default) == 0x000070, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000078, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000080, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_SetBoolParameter_self_CastInput) == 0x000088, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_SetBoolParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_SetFloatParameter_self_CastInput) == 0x000098, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_SetBoolParameter_self_CastInput_1) == 0x0000A8, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_SetBoolParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_GetMovementComponent_ReturnValue) == 0x0000B8, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000C0, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_VSize2D_ReturnValue) == 0x0000D0, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_MapRangeClamped_ReturnValue) == 0x0000D4, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureAnimSoundLibraryContext_C_PlaySound, CallFunc_SetFloatParameter_self_CastInput_1) == 0x0000D8, "Member 'B_CreatureAnimSoundLibraryContext_C_PlaySound::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");

}

