#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Decal_ClamberHighlight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Decal_ClamberHighlight.B_Decal_ClamberHighlight_C
// 0x0028 (0x02A0 - 0x0278)
class AB_Decal_ClamberHighlight_C final : public ADecalActor
{
public:
	class UMaterialInstanceDynamic*               Decal_MID;                                         // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_NotInRange;                                  // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_InRange;                                     // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void SetIsInRange(bool bInRange_);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Decal_ClamberHighlight_C">();
	}
	static class AB_Decal_ClamberHighlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Decal_ClamberHighlight_C>();
	}
};
static_assert(alignof(AB_Decal_ClamberHighlight_C) == 0x000008, "Wrong alignment on AB_Decal_ClamberHighlight_C");
static_assert(sizeof(AB_Decal_ClamberHighlight_C) == 0x0002A0, "Wrong size on AB_Decal_ClamberHighlight_C");
static_assert(offsetof(AB_Decal_ClamberHighlight_C, Decal_MID) == 0x000278, "Member 'AB_Decal_ClamberHighlight_C::Decal_MID' has a wrong offset!");
static_assert(offsetof(AB_Decal_ClamberHighlight_C, Color_NotInRange) == 0x000280, "Member 'AB_Decal_ClamberHighlight_C::Color_NotInRange' has a wrong offset!");
static_assert(offsetof(AB_Decal_ClamberHighlight_C, Color_InRange) == 0x000290, "Member 'AB_Decal_ClamberHighlight_C::Color_InRange' has a wrong offset!");

}

