#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Decal_Flopper_JellyFish

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_Decal_Flopper_JellyFish.B_Decal_Flopper_JellyFish_C.ExecuteUbergraph_B_Decal_Flopper_JellyFish
// 0x0004 (0x0004 - 0x0000)
struct B_Decal_Flopper_JellyFish_C_ExecuteUbergraph_B_Decal_Flopper_JellyFish final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Decal_Flopper_JellyFish_C_ExecuteUbergraph_B_Decal_Flopper_JellyFish) == 0x000004, "Wrong alignment on B_Decal_Flopper_JellyFish_C_ExecuteUbergraph_B_Decal_Flopper_JellyFish");
static_assert(sizeof(B_Decal_Flopper_JellyFish_C_ExecuteUbergraph_B_Decal_Flopper_JellyFish) == 0x000004, "Wrong size on B_Decal_Flopper_JellyFish_C_ExecuteUbergraph_B_Decal_Flopper_JellyFish");
static_assert(offsetof(B_Decal_Flopper_JellyFish_C_ExecuteUbergraph_B_Decal_Flopper_JellyFish, EntryPoint) == 0x000000, "Member 'B_Decal_Flopper_JellyFish_C_ExecuteUbergraph_B_Decal_Flopper_JellyFish::EntryPoint' has a wrong offset!");

// Function B_Decal_Flopper_JellyFish.B_Decal_Flopper_JellyFish_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct B_Decal_Flopper_JellyFish_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Decal_Flopper_JellyFish_C_UserConstructionScript) == 0x000008, "Wrong alignment on B_Decal_Flopper_JellyFish_C_UserConstructionScript");
static_assert(sizeof(B_Decal_Flopper_JellyFish_C_UserConstructionScript) == 0x000008, "Wrong size on B_Decal_Flopper_JellyFish_C_UserConstructionScript");
static_assert(offsetof(B_Decal_Flopper_JellyFish_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_Decal_Flopper_JellyFish_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

