#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Decal_Flopper_JellyFish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Decal_Flopper_JellyFish.B_Decal_Flopper_JellyFish_C
// 0x0020 (0x0298 - 0x0278)
class AB_Decal_Flopper_JellyFish_C final : public ADecalActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FadeIn_NewTrack_0_2F2CC4164B50B3516AA9909D745FF7CB; // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeIn__Direction_2F2CC4164B50B3516AA9909D745FF7CB; // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeIn;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Decal_MID;                                         // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Decal_Flopper_JellyFish(int32 EntryPoint);
	void FadeIn__FinishedFunc();
	void FadeIn__UpdateFunc();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Decal_Flopper_JellyFish_C">();
	}
	static class AB_Decal_Flopper_JellyFish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Decal_Flopper_JellyFish_C>();
	}
};
static_assert(alignof(AB_Decal_Flopper_JellyFish_C) == 0x000008, "Wrong alignment on AB_Decal_Flopper_JellyFish_C");
static_assert(sizeof(AB_Decal_Flopper_JellyFish_C) == 0x000298, "Wrong size on AB_Decal_Flopper_JellyFish_C");
static_assert(offsetof(AB_Decal_Flopper_JellyFish_C, UberGraphFrame) == 0x000278, "Member 'AB_Decal_Flopper_JellyFish_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Decal_Flopper_JellyFish_C, FadeIn_NewTrack_0_2F2CC4164B50B3516AA9909D745FF7CB) == 0x000280, "Member 'AB_Decal_Flopper_JellyFish_C::FadeIn_NewTrack_0_2F2CC4164B50B3516AA9909D745FF7CB' has a wrong offset!");
static_assert(offsetof(AB_Decal_Flopper_JellyFish_C, FadeIn__Direction_2F2CC4164B50B3516AA9909D745FF7CB) == 0x000284, "Member 'AB_Decal_Flopper_JellyFish_C::FadeIn__Direction_2F2CC4164B50B3516AA9909D745FF7CB' has a wrong offset!");
static_assert(offsetof(AB_Decal_Flopper_JellyFish_C, FadeIn) == 0x000288, "Member 'AB_Decal_Flopper_JellyFish_C::FadeIn' has a wrong offset!");
static_assert(offsetof(AB_Decal_Flopper_JellyFish_C, Decal_MID) == 0x000290, "Member 'AB_Decal_Flopper_JellyFish_C::Decal_MID' has a wrong offset!");

}

