#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_DMR_Athena_Weap

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_DMR_Athena_Weap.B_DMR_Athena_Weap_C.ExecuteUbergraph_B_DMR_Athena_Weap
// 0x0428 (0x0428 - 0x0000)
struct B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewIsTargeting;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_GetWeaponDataWeaponStatHandle_ReturnValue; // 0x0070(0x0010)(NoDestructor)
	struct FFortRangedWeaponStats                 CallFunc_GetRangedWeaponStatsRow_OutRow;           // 0x0080(0x0310)()
	bool                                          CallFunc_GetRangedWeaponStatsRow_ReturnValue;      // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsTargeting_ReturnValue;               // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x03F0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0400(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuartzGunfireEnabled_ReturnValue;       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuartzGunfireEnabled_ReturnValue_1;     // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40B[0x5];                                      // 0x040B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_Event_SpawnProjectile;                      // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Prj_Bullet_DMR_C*                    K2Node_DynamicCast_AsB_Prj_Bullet_DMR;             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap) == 0x000008, "Wrong alignment on B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap");
static_assert(sizeof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap) == 0x000428, "Wrong size on B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, EntryPoint) == 0x000000, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_Event_bNewIsTargeting) == 0x000004, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_Event_bNewIsTargeting' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Lerp_ReturnValue) == 0x00000C, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000014, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000018, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00001C, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_FInterpTo_ReturnValue) == 0x000024, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_IsServer_ReturnValue) == 0x000028, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, Temp_bool_Variable) == 0x000040, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000048, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000059, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x00005C, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x000060, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_FInterpTo_ReturnValue_1) == 0x000064, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_Event_bPersistentFire) == 0x000068, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_Event_bSecondaryFire) == 0x000069, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_GetWeaponDataWeaponStatHandle_ReturnValue) == 0x000070, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_GetWeaponDataWeaponStatHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_GetRangedWeaponStatsRow_OutRow) == 0x000080, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_GetRangedWeaponStatsRow_OutRow' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_GetRangedWeaponStatsRow_ReturnValue) == 0x000390, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_GetRangedWeaponStatsRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000394, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, Temp_bool_Has_Been_Initd_Variable) == 0x000398, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Lerp_ReturnValue_2) == 0x00039C, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_GetPlayerController_ReturnValue_1) == 0x0003A0, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_RandomFloatInRange_ReturnValue) == 0x0003A8, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Lerp_ReturnValue_3) == 0x0003AC, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_StartCameraShake_ReturnValue) == 0x0003B0, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0003B8, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_GetPlayerController_ReturnValue_2) == 0x0003C0, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_IsLocallyControlled_ReturnValue) == 0x0003C8, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_GetControlRotation_ReturnValue) == 0x0003D0, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_GetIsTargeting_ReturnValue) == 0x0003E8, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_GetIsTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_Lerp_ReturnValue_4) == 0x0003EC, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_CreateDelegate_OutputDelegate) == 0x0003F0, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000400, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_IsQuartzGunfireEnabled_ReturnValue) == 0x000408, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_IsQuartzGunfireEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, Temp_bool_IsClosed_Variable) == 0x000409, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_IsQuartzGunfireEnabled_ReturnValue_1) == 0x00040A, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_IsQuartzGunfireEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_Event_SpawnProjectile) == 0x000410, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_Event_SpawnProjectile' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_DynamicCast_AsB_Prj_Bullet_DMR) == 0x000418, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_DynamicCast_AsB_Prj_Bullet_DMR' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, K2Node_DynamicCast_bSuccess_1) == 0x000420, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000421, "Member 'B_DMR_Athena_Weap_C_ExecuteUbergraph_B_DMR_Athena_Weap::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");

// Function B_DMR_Athena_Weap.B_DMR_Athena_Weap_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_DMR_Athena_Weap_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DMR_Athena_Weap_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_DMR_Athena_Weap_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_DMR_Athena_Weap_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_DMR_Athena_Weap_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_DMR_Athena_Weap_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_DMR_Athena_Weap_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_DMR_Athena_Weap_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_DMR_Athena_Weap_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_DMR_Athena_Weap.B_DMR_Athena_Weap_C.OnSetTargeting
// 0x0001 (0x0001 - 0x0000)
struct B_DMR_Athena_Weap_C_OnSetTargeting final
{
public:
	bool                                          bNewIsTargeting;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DMR_Athena_Weap_C_OnSetTargeting) == 0x000001, "Wrong alignment on B_DMR_Athena_Weap_C_OnSetTargeting");
static_assert(sizeof(B_DMR_Athena_Weap_C_OnSetTargeting) == 0x000001, "Wrong size on B_DMR_Athena_Weap_C_OnSetTargeting");
static_assert(offsetof(B_DMR_Athena_Weap_C_OnSetTargeting, bNewIsTargeting) == 0x000000, "Member 'B_DMR_Athena_Weap_C_OnSetTargeting::bNewIsTargeting' has a wrong offset!");

// Function B_DMR_Athena_Weap.B_DMR_Athena_Weap_C.OnSpawnProjectile
// 0x0008 (0x0008 - 0x0000)
struct B_DMR_Athena_Weap_C_OnSpawnProjectile final
{
public:
	class AFortProjectileBase*                    SpawnProjectile;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DMR_Athena_Weap_C_OnSpawnProjectile) == 0x000008, "Wrong alignment on B_DMR_Athena_Weap_C_OnSpawnProjectile");
static_assert(sizeof(B_DMR_Athena_Weap_C_OnSpawnProjectile) == 0x000008, "Wrong size on B_DMR_Athena_Weap_C_OnSpawnProjectile");
static_assert(offsetof(B_DMR_Athena_Weap_C_OnSpawnProjectile, SpawnProjectile) == 0x000000, "Member 'B_DMR_Athena_Weap_C_OnSpawnProjectile::SpawnProjectile' has a wrong offset!");

// Function B_DMR_Athena_Weap.B_DMR_Athena_Weap_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_DMR_Athena_Weap_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DMR_Athena_Weap_C_ReceiveTick) == 0x000004, "Wrong alignment on B_DMR_Athena_Weap_C_ReceiveTick");
static_assert(sizeof(B_DMR_Athena_Weap_C_ReceiveTick) == 0x000004, "Wrong size on B_DMR_Athena_Weap_C_ReceiveTick");
static_assert(offsetof(B_DMR_Athena_Weap_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_DMR_Athena_Weap_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

