#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_DowntownTrashCan_BasketballMinigame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_DowntownTrashCan_BasketballMinigame.B_DowntownTrashCan_BasketballMinigame_C.BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_DowntownTrashCan_BasketballMinigame.B_DowntownTrashCan_BasketballMinigame_C.ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame
// 0x0178 (0x0178 - 0x0000)
struct B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0040(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_ToyBasketball_Base_C*                K2Node_DynamicCast_AsB_Toy_Basketball_Base;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame) == 0x000008, "Wrong alignment on B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame");
static_assert(sizeof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame) == 0x000178, "Wrong size on B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, EntryPoint) == 0x000000, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_GetActorUpVector_ReturnValue) == 0x000008, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000020, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_OtherActor) == 0x000028, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_OtherComp) == 0x000030, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000038, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_bFromSweep) == 0x00003C, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_SweepResult) == 0x000040, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000120, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_DynamicCast_AsB_Toy_Basketball_Base) == 0x000138, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_DynamicCast_AsB_Toy_Basketball_Base' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_HasAuthority_ReturnValue) == 0x000141, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000148, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_Add_VectorVector_ReturnValue) == 0x000160, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

}

