#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_EmotePreviewDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_EmotePreviewDisplay.B_EmotePreviewDisplay_C
// 0x0078 (0x0300 - 0x0288)
class AB_EmotePreviewDisplay_C final : public AFortEmotePreviewActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAthenaEmojiItemDefinition*             EmojiItemDefinition;                               // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Animation;                                         // 0x02A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         DanceOrEmojiItemDefinition;                        // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartSectionName;                                  // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnEmoteSetupFinished;                              // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAthenaShoutItemDefinition*             ShoutItemDefinition;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                DynamicallySpawnedSounds;                          // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void SpecialCaseShoutHandler();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PreviewEmote(const class UFortMontageItemDefinitionBase* Emote);
	void PerformSpecialAction(class FName ActionName);
	void OnLoaded_638F148342254A777E929B88915A8958(class UObject* Loaded);
	void ExecuteUbergraph_B_EmotePreviewDisplay(int32 EntryPoint);
	void CleanupDynamicSounds();
	void ApplyEmoteToPet(bool IsRemoval);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_EmotePreviewDisplay_C">();
	}
	static class AB_EmotePreviewDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_EmotePreviewDisplay_C>();
	}
};
static_assert(alignof(AB_EmotePreviewDisplay_C) == 0x000008, "Wrong alignment on AB_EmotePreviewDisplay_C");
static_assert(sizeof(AB_EmotePreviewDisplay_C) == 0x000300, "Wrong size on AB_EmotePreviewDisplay_C");
static_assert(offsetof(AB_EmotePreviewDisplay_C, UberGraphFrame) == 0x000288, "Member 'AB_EmotePreviewDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_EmotePreviewDisplay_C, Scene) == 0x000290, "Member 'AB_EmotePreviewDisplay_C::Scene' has a wrong offset!");
static_assert(offsetof(AB_EmotePreviewDisplay_C, EmojiItemDefinition) == 0x000298, "Member 'AB_EmotePreviewDisplay_C::EmojiItemDefinition' has a wrong offset!");
static_assert(offsetof(AB_EmotePreviewDisplay_C, Animation) == 0x0002A0, "Member 'AB_EmotePreviewDisplay_C::Animation' has a wrong offset!");
static_assert(offsetof(AB_EmotePreviewDisplay_C, DanceOrEmojiItemDefinition) == 0x0002C8, "Member 'AB_EmotePreviewDisplay_C::DanceOrEmojiItemDefinition' has a wrong offset!");
static_assert(offsetof(AB_EmotePreviewDisplay_C, StartSectionName) == 0x0002D0, "Member 'AB_EmotePreviewDisplay_C::StartSectionName' has a wrong offset!");
static_assert(offsetof(AB_EmotePreviewDisplay_C, OnEmoteSetupFinished) == 0x0002D8, "Member 'AB_EmotePreviewDisplay_C::OnEmoteSetupFinished' has a wrong offset!");
static_assert(offsetof(AB_EmotePreviewDisplay_C, ShoutItemDefinition) == 0x0002E8, "Member 'AB_EmotePreviewDisplay_C::ShoutItemDefinition' has a wrong offset!");
static_assert(offsetof(AB_EmotePreviewDisplay_C, DynamicallySpawnedSounds) == 0x0002F0, "Member 'AB_EmotePreviewDisplay_C::DynamicallySpawnedSounds' has a wrong offset!");

}

