#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FlopperSpawn_CustomSpline

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_FlopperSpawn_CustomSpline.B_FlopperSpawn_CustomSpline_C
// 0x0018 (0x0288 - 0x0270)
class AB_FlopperSpawn_CustomSpline_C final : public AActor
{
public:
	class UMinimapHiddenComponent*                MinimapHidden;                                     // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SplinePlacement;                                   // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_FlopperSpawn_CustomSpline_C">();
	}
	static class AB_FlopperSpawn_CustomSpline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_FlopperSpawn_CustomSpline_C>();
	}
};
static_assert(alignof(AB_FlopperSpawn_CustomSpline_C) == 0x000008, "Wrong alignment on AB_FlopperSpawn_CustomSpline_C");
static_assert(sizeof(AB_FlopperSpawn_CustomSpline_C) == 0x000288, "Wrong size on AB_FlopperSpawn_CustomSpline_C");
static_assert(offsetof(AB_FlopperSpawn_CustomSpline_C, MinimapHidden) == 0x000270, "Member 'AB_FlopperSpawn_CustomSpline_C::MinimapHidden' has a wrong offset!");
static_assert(offsetof(AB_FlopperSpawn_CustomSpline_C, SplinePlacement) == 0x000278, "Member 'AB_FlopperSpawn_CustomSpline_C::SplinePlacement' has a wrong offset!");
static_assert(offsetof(AB_FlopperSpawn_CustomSpline_C, DefaultSceneRoot) == 0x000280, "Member 'AB_FlopperSpawn_CustomSpline_C::DefaultSceneRoot' has a wrong offset!");

}

