#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_GasPump_Valet_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_GasPump_Valet_Component.B_GasPump_Valet_Component_C.ExecuteUbergraph_B_GasPump_Valet_Component
// 0x0050 (0x0050 - 0x0000)
struct B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameStateComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValet_GasPumpIndicatorManagerV2_C*     K2Node_DynamicCast_AsValet_Gas_Pump_Indicator_Manager_V2; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component) == 0x000008, "Wrong alignment on B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component");
static_assert(sizeof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component) == 0x000050, "Wrong size on B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, EntryPoint) == 0x000000, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetSubGame_ReturnValue) == 0x000010, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_HasAuthority_ReturnValue) == 0x000013, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000014, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000018, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, K2Node_SwitchEnum_CmpSuccess) == 0x00001D, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, K2Node_Event_EndPlayReason) == 0x00001E, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetOwner_ReturnValue_1) == 0x000020, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetGameStateAthena_ReturnValue) == 0x000028, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_HasAuthority_ReturnValue_1) == 0x000031, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, K2Node_DynamicCast_AsValet_Gas_Pump_Indicator_Manager_V2) == 0x000040, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::K2Node_DynamicCast_AsValet_Gas_Pump_Indicator_Manager_V2' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_IsValid_ReturnValue_3) == 0x000049, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function B_GasPump_Valet_Component.B_GasPump_Valet_Component_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct B_GasPump_Valet_Component_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_GasPump_Valet_Component_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on B_GasPump_Valet_Component_C_ReceiveEndPlay");
static_assert(sizeof(B_GasPump_Valet_Component_C_ReceiveEndPlay) == 0x000001, "Wrong size on B_GasPump_Valet_Component_C_ReceiveEndPlay");
static_assert(offsetof(B_GasPump_Valet_Component_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'B_GasPump_Valet_Component_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

