#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HeldObject_Snowball

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "BGA_HeldObject_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HeldObject_Snowball.B_HeldObject_Snowball_C
// 0x0140 (0x0CD0 - 0x0B90)
class AB_HeldObject_Snowball_C final : public ABGA_HeldObject_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_HeldObject_Snowball_C;            // 0x0B90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DropAnimation_Z_Pos_888F8AB94C79F6A9DEB3149DDCAC3D72; // 0x0BA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DropAnimation__Direction_888F8AB94C79F6A9DEB3149DDCAC3D72; // 0x0BA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA5[0x3];                                      // 0x0BA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DropAnimation;                                     // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SnowCheckTimer;                                    // 0x0BB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SnowballScale;                                     // 0x0BB8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BBC[0x4];                                      // 0x0BBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RotationRate;                                      // 0x0BC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         StartZPos;                                         // 0x0BD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasThrown;                                         // 0x0BDC(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDD[0x3];                                      // 0x0BDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaterScaleMultiplier;                              // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE4[0x4];                                      // 0x0BE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        LastHolder;                                        // 0x0BE8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Held;                                              // 0x0BF0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF1[0x7];                                      // 0x0BF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PlayerDamageMultiplier;                            // 0x0BF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         EnvDamageMultiplier;                               // 0x0C20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         GrowingSpeed;                                      // 0x0C48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxScale;                                          // 0x0C70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                LastPosition;                                      // 0x0C98(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Died;                                              // 0x0CB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasJustThrown;                                     // 0x0CB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoneDropping;                                      // 0x0CB2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB3[0x5];                                      // 0x0CB3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ImpactNormal;                                      // 0x0CB8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlowUp(class AFortPlayerPawn* LastHolder_0);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void BndEvt__Capsule_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__FortHeldObject_K2Node_ComponentBoundEvent_1_OnHeldObjectThrown__DelegateSignature();
	void BndEvt__FortHeldObject_K2Node_ComponentBoundEvent_2_OnHeldObjectDropped__DelegateSignature();
	void BndEvt__FortHeldObject_K2Node_ComponentBoundEvent_3_OnHeldObjectPlaced__DelegateSignature();
	void BndEvt__FortHeldObject_K2Node_ComponentBoundEvent_4_OnHeldObjectPickedUp__DelegateSignature();
	void BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_5_OnLinkedActorDisconnected__DelegateSignature();
	void DoDamageEffectTotarget(class AActor* HitActor);
	void DropAnimation__FinishedFunc();
	void DropAnimation__UpdateFunc();
	void EnterWater(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody);
	void EventSnowballDeath(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ExecuteUbergraph_B_HeldObject_Snowball(int32 EntryPoint);
	bool FilterByLOS(class AActor* ActorToCheck);
	void OnDamageCancelled(bool* ShouldCancel);
	void OnDamageCompleted(bool WasCancelled);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnHit(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void Play_Drop_Animation();
	void ReceiveBeginPlay();
	void Server_Only_Handle_Attach_To_Vehicle(const struct FVector& HitLoc, class UPrimitiveComponent* HitComponentToAttachTo_0);
	void Server_Only_Handle_Player_Controller_OnUnPossess(class APawn* PlayerPawn);
	void SetInstigator(class AFortPlayerPawn* Instigator_0);
	void StopDropping();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HeldObject_Snowball_C">();
	}
	static class AB_HeldObject_Snowball_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HeldObject_Snowball_C>();
	}
};
static_assert(alignof(AB_HeldObject_Snowball_C) == 0x000010, "Wrong alignment on AB_HeldObject_Snowball_C");
static_assert(sizeof(AB_HeldObject_Snowball_C) == 0x000CD0, "Wrong size on AB_HeldObject_Snowball_C");
static_assert(offsetof(AB_HeldObject_Snowball_C, UberGraphFrame_B_HeldObject_Snowball_C) == 0x000B90, "Member 'AB_HeldObject_Snowball_C::UberGraphFrame_B_HeldObject_Snowball_C' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, StaticMesh) == 0x000B98, "Member 'AB_HeldObject_Snowball_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, DropAnimation_Z_Pos_888F8AB94C79F6A9DEB3149DDCAC3D72) == 0x000BA0, "Member 'AB_HeldObject_Snowball_C::DropAnimation_Z_Pos_888F8AB94C79F6A9DEB3149DDCAC3D72' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, DropAnimation__Direction_888F8AB94C79F6A9DEB3149DDCAC3D72) == 0x000BA4, "Member 'AB_HeldObject_Snowball_C::DropAnimation__Direction_888F8AB94C79F6A9DEB3149DDCAC3D72' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, DropAnimation) == 0x000BA8, "Member 'AB_HeldObject_Snowball_C::DropAnimation' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, SnowCheckTimer) == 0x000BB0, "Member 'AB_HeldObject_Snowball_C::SnowCheckTimer' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, SnowballScale) == 0x000BB8, "Member 'AB_HeldObject_Snowball_C::SnowballScale' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, RotationRate) == 0x000BC0, "Member 'AB_HeldObject_Snowball_C::RotationRate' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, StartZPos) == 0x000BD8, "Member 'AB_HeldObject_Snowball_C::StartZPos' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, WasThrown) == 0x000BDC, "Member 'AB_HeldObject_Snowball_C::WasThrown' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, WaterScaleMultiplier) == 0x000BE0, "Member 'AB_HeldObject_Snowball_C::WaterScaleMultiplier' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, LastHolder) == 0x000BE8, "Member 'AB_HeldObject_Snowball_C::LastHolder' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, Held) == 0x000BF0, "Member 'AB_HeldObject_Snowball_C::Held' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, PlayerDamageMultiplier) == 0x000BF8, "Member 'AB_HeldObject_Snowball_C::PlayerDamageMultiplier' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, EnvDamageMultiplier) == 0x000C20, "Member 'AB_HeldObject_Snowball_C::EnvDamageMultiplier' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, GrowingSpeed) == 0x000C48, "Member 'AB_HeldObject_Snowball_C::GrowingSpeed' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, MaxScale) == 0x000C70, "Member 'AB_HeldObject_Snowball_C::MaxScale' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, LastPosition) == 0x000C98, "Member 'AB_HeldObject_Snowball_C::LastPosition' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, Died) == 0x000CB0, "Member 'AB_HeldObject_Snowball_C::Died' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, WasJustThrown) == 0x000CB1, "Member 'AB_HeldObject_Snowball_C::WasJustThrown' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, DoneDropping) == 0x000CB2, "Member 'AB_HeldObject_Snowball_C::DoneDropping' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Snowball_C, ImpactNormal) == 0x000CB8, "Member 'AB_HeldObject_Snowball_C::ImpactNormal' has a wrong offset!");

}

