#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HidingProp_Portapotty

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "B_HidingProp_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HidingProp_Portapotty.B_HidingProp_Portapotty_C
// 0x0060 (0x1330 - 0x12D0)
class AB_HidingProp_Portapotty_C final : public AB_HidingProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_HidingProp_Portapotty_C;          // 0x12D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_HidingProp_Portapotty;                           // 0x12D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Constr_Portapotty_Searched_Door;                   // 0x12E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DoorSwing_Float_8AE2ADB5454E824078EA239E1191664B;  // 0x12E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DoorSwing__Direction_8AE2ADB5454E824078EA239E1191664B; // 0x12EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12ED[0x3];                                     // 0x12ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DoorSwing;                                         // 0x12F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TeleportingTag;                                    // 0x12F8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12FC[0x4];                                     // 0x12FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCustomCharacterPart*>           DonutCharacterPartsToApply;                        // 0x1300(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UFortQuestItemDefinition*               DonutQuest;                                        // 0x1310(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               DonutGadget;                                       // 0x1318(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayDonutSound;                                    // 0x1320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1321[0x7];                                     // 0x1321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             DonutChangeCompleteSound;                          // 0x1328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DoorSwing__FinishedFunc();
	void DoorSwing__UpdateFunc();
	void DoorSwingAnim();
	void ExecuteUbergraph_B_HidingProp_Portapotty(int32 EntryPoint);
	void HidingPlayerCountChanged();
	void InteractEnter();
	void OnCurrentQuestsReady_1000E6E648CCAD899938C18A7CE97267(class UFortQuestManager* OwningQuestManager, bool bFoundAllQuestsOnProfile);
	void OnLoaded_3A158F7946A9198D94E107B013508851(class UObject* Loaded);
	void PlayDonutSoundForPlayer();
	void PlayDonutSoundMulticast();
	void ReceiveBeginPlay();
	void SetPlayDonutSoundBool(class AFortPlayerController* PlayerController);
	void StopHiding(const class AFortPawn* Pawn_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HidingProp_Portapotty_C">();
	}
	static class AB_HidingProp_Portapotty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HidingProp_Portapotty_C>();
	}
};
static_assert(alignof(AB_HidingProp_Portapotty_C) == 0x000008, "Wrong alignment on AB_HidingProp_Portapotty_C");
static_assert(sizeof(AB_HidingProp_Portapotty_C) == 0x001330, "Wrong size on AB_HidingProp_Portapotty_C");
static_assert(offsetof(AB_HidingProp_Portapotty_C, UberGraphFrame_B_HidingProp_Portapotty_C) == 0x0012D0, "Member 'AB_HidingProp_Portapotty_C::UberGraphFrame_B_HidingProp_Portapotty_C' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, P_HidingProp_Portapotty) == 0x0012D8, "Member 'AB_HidingProp_Portapotty_C::P_HidingProp_Portapotty' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, Constr_Portapotty_Searched_Door) == 0x0012E0, "Member 'AB_HidingProp_Portapotty_C::Constr_Portapotty_Searched_Door' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, DoorSwing_Float_8AE2ADB5454E824078EA239E1191664B) == 0x0012E8, "Member 'AB_HidingProp_Portapotty_C::DoorSwing_Float_8AE2ADB5454E824078EA239E1191664B' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, DoorSwing__Direction_8AE2ADB5454E824078EA239E1191664B) == 0x0012EC, "Member 'AB_HidingProp_Portapotty_C::DoorSwing__Direction_8AE2ADB5454E824078EA239E1191664B' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, DoorSwing) == 0x0012F0, "Member 'AB_HidingProp_Portapotty_C::DoorSwing' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, TeleportingTag) == 0x0012F8, "Member 'AB_HidingProp_Portapotty_C::TeleportingTag' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, DonutCharacterPartsToApply) == 0x001300, "Member 'AB_HidingProp_Portapotty_C::DonutCharacterPartsToApply' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, DonutQuest) == 0x001310, "Member 'AB_HidingProp_Portapotty_C::DonutQuest' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, DonutGadget) == 0x001318, "Member 'AB_HidingProp_Portapotty_C::DonutGadget' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, PlayDonutSound) == 0x001320, "Member 'AB_HidingProp_Portapotty_C::PlayDonutSound' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_Portapotty_C, DonutChangeCompleteSound) == 0x001328, "Member 'AB_HidingProp_Portapotty_C::DonutChangeCompleteSound' has a wrong offset!");

}

