#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HidingProp_WilliePete

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_HidingProp_WilliePete.B_HidingProp_WilliePete_C.BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_HidingProp_WilliePete_C_BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_HidingProp_WilliePete.B_HidingProp_WilliePete_C.ExecuteUbergraph_B_HidingProp_WilliePete
// 0x0C50 (0x0C50 - 0x0000)
struct B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TeleportingActor;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> K2Node_DynamicCast_AsFort_Projectile_Movement_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortProjectileMovementComponent*       CallFunc_GetFortProjectileMovementComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovementComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0078(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x01D0(0x00D0)(ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X_3;                          // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AE[0x2];                                      // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue; // 0x0308(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_2; // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0320(0x00D0)(ContainsInstancedReference)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x03F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x04B0(0x0020)()
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x04F8(0x00D0)(ContainsInstancedReference)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer_1;      // 0x05D0(0x0020)()
	bool                                          Temp_bool_Variable;                                // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F2[0x2];                                      // 0x05F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x05F4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0608(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0618(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_625[0x3];                                      // 0x0625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0628(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0708(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71A[0x6];                                      // 0x071A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72A[0x6];                                      // 0x072A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x0739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x073A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73B[0x5];                                      // 0x073B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0740(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0748(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTethered_ReturnValue;                   // 0x0759(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75A[0x6];                                      // 0x075A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0770(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x3];                                      // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_4;                          // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79C[0x4];                                      // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x07A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x07B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x07D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleForwardVector_ReturnValue;      // 0x07F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0810(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x0828(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActorPtrConst_ReturnValue;      // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0860(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_888[0x8];                                      // 0x0888(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0890(0x0060)(IsPlainOldData, NoDestructor)
	const class AFortPawn*                        K2Node_Event_Pawn;                                 // 0x08F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_909[0x7];                                      // 0x0909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0918(0x00B0)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x09C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x09CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9CB[0x5];                                      // 0x09CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D9[0x7];                                      // 0x09D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x09E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x09E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x09F0(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A11[0x7];                                      // 0x0A11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0A18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0A20(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0A28(0x0020)(ConstParm)
	class UFortProjectileMovementComponent*       Temp_object_Variable_2;                            // 0x0A48(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0A50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0A51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0A52(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0A53(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A54[0x4];                                      // 0x0A54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0A58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0A70(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7C[0x4];                                      // 0x0A7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0A80(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0B60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0B78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0B7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0B80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0B84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0B88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0B8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0B90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0BA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAC[0x4];                                      // 0x0BAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0BB0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0BC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0BCC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0BD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD4[0x4];                                      // 0x0BD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWaterSubsystem*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0BD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0BE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanTotalHeight_ReturnValue;          // 0x0BE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0BE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0C00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0C18(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWaterSubsystem*                        CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0C30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanBaseHeight_ReturnValue;           // 0x0C38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0C3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0C40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0C44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete) == 0x000010, "Wrong alignment on B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete");
static_assert(sizeof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete) == 0x000C50, "Wrong size on B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, EntryPoint) == 0x000000, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CustomEvent_DestroyedActor) == 0x000018, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CustomEvent_TeleportingActor) == 0x000020, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CustomEvent_TeleportingActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_AsFort_Projectile_Movement_Interface) == 0x000028, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_AsFort_Projectile_Movement_Interface' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortProjectileMovementComponent_ReturnValue) == 0x000040, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortProjectileMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000050, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000059, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_2) == 0x00005A, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_HasAuthority_ReturnValue) == 0x00005B, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00005C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BooleanAND_ReturnValue) == 0x00005D, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000078, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X) == 0x000158, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y) == 0x00015C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z) == 0x000160, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000164, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000168, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_1) == 0x000180, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_1) == 0x000184, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z_1) == 0x000188, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetForwardVector_ReturnValue) == 0x000190, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_2) == 0x0001A8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_2) == 0x0001AC, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z_2) == 0x0001B0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetForwardVector_ReturnValue_1) == 0x0001B8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0001D0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_3) == 0x0002A0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_3) == 0x0002A4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z_3) == 0x0002A8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_3) == 0x0002AC, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_RowToBool_ReturnValue) == 0x0002AD, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002B0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetActorUpVector_ReturnValue) == 0x0002B8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_HasAuthority_ReturnValue_1) == 0x0002D0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetValueAtLevel_ReturnValue) == 0x0002D4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002D8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002E0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x0002F8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x000300, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue) == 0x000308, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortAbilitySystemComponent_ReturnValue_2) == 0x000310, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000318, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000320, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetTransform_ReturnValue) == 0x0003F0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakTransform_Location) == 0x000450, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakTransform_Rotation) == 0x000468, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakTransform_Scale) == 0x000480, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000498, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x0004B0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0004D0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetQuestManager_ReturnValue) == 0x0004D8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0004E0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_MakeGameplayCueParameters_ReturnValue_2) == 0x0004F8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_MakeGameplayCueParameters_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0005C8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0005CC, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetOwnedGameplayTags_TagContainer_1) == 0x0005D0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetOwnedGameplayTags_TagContainer_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, Temp_bool_Variable) == 0x0005F0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_4) == 0x0005F1, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CreateDelegate_OutputDelegate_1) == 0x0005F4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_5) == 0x000600, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000608, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_OtherActor) == 0x000610, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_OtherComp) == 0x000618, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000620, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_bFromSweep) == 0x000624, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
