#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HollowBasePartyController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HollowBasePartyController.B_HollowBasePartyController_C
// 0x0018 (0x02C8 - 0x02B0)
class AB_HollowBasePartyController_C final : public AFortMediaStreamingRadio
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMediaSoundComponent*                   MediaSound;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bRadioIsActive;                                    // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StopRadio();
	void StartRadio();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_B_HollowBasePartyController(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HollowBasePartyController_C">();
	}
	static class AB_HollowBasePartyController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HollowBasePartyController_C>();
	}
};
static_assert(alignof(AB_HollowBasePartyController_C) == 0x000008, "Wrong alignment on AB_HollowBasePartyController_C");
static_assert(sizeof(AB_HollowBasePartyController_C) == 0x0002C8, "Wrong size on AB_HollowBasePartyController_C");
static_assert(offsetof(AB_HollowBasePartyController_C, UberGraphFrame) == 0x0002B0, "Member 'AB_HollowBasePartyController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_HollowBasePartyController_C, MediaSound) == 0x0002B8, "Member 'AB_HollowBasePartyController_C::MediaSound' has a wrong offset!");
static_assert(offsetof(AB_HollowBasePartyController_C, bRadioIsActive) == 0x0002C0, "Member 'AB_HollowBasePartyController_C::bRadioIsActive' has a wrong offset!");

}

