#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HollowBasePartyController

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_HollowBasePartyController.B_HollowBasePartyController_C.StopRadio
// 0x0008 (0x0008 - 0x0000)
struct B_HollowBasePartyController_C_StopRadio final
{
public:
	class UFortAudioAnalysisSubsystem*            CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HollowBasePartyController_C_StopRadio) == 0x000008, "Wrong alignment on B_HollowBasePartyController_C_StopRadio");
static_assert(sizeof(B_HollowBasePartyController_C_StopRadio) == 0x000008, "Wrong size on B_HollowBasePartyController_C_StopRadio");
static_assert(offsetof(B_HollowBasePartyController_C_StopRadio, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'B_HollowBasePartyController_C_StopRadio::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");

// Function B_HollowBasePartyController.B_HollowBasePartyController_C.StartRadio
// 0x0028 (0x0028 - 0x0000)
struct B_HollowBasePartyController_C_StartRadio final
{
public:
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortAudioAnalysisSubsystem*            CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HollowBasePartyController_C_StartRadio) == 0x000008, "Wrong alignment on B_HollowBasePartyController_C_StartRadio");
static_assert(sizeof(B_HollowBasePartyController_C_StartRadio) == 0x000028, "Wrong size on B_HollowBasePartyController_C_StartRadio");
static_assert(offsetof(B_HollowBasePartyController_C_StartRadio, CallFunc_GetDisplayName_ReturnValue) == 0x000000, "Member 'B_HollowBasePartyController_C_StartRadio::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HollowBasePartyController_C_StartRadio, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'B_HollowBasePartyController_C_StartRadio::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HollowBasePartyController_C_StartRadio, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000020, "Member 'B_HollowBasePartyController_C_StartRadio::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");

// Function B_HollowBasePartyController.B_HollowBasePartyController_C.ExecuteUbergraph_B_HollowBasePartyController
// 0x0004 (0x0004 - 0x0000)
struct B_HollowBasePartyController_C_ExecuteUbergraph_B_HollowBasePartyController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HollowBasePartyController_C_ExecuteUbergraph_B_HollowBasePartyController) == 0x000004, "Wrong alignment on B_HollowBasePartyController_C_ExecuteUbergraph_B_HollowBasePartyController");
static_assert(sizeof(B_HollowBasePartyController_C_ExecuteUbergraph_B_HollowBasePartyController) == 0x000004, "Wrong size on B_HollowBasePartyController_C_ExecuteUbergraph_B_HollowBasePartyController");
static_assert(offsetof(B_HollowBasePartyController_C_ExecuteUbergraph_B_HollowBasePartyController, EntryPoint) == 0x000000, "Member 'B_HollowBasePartyController_C_ExecuteUbergraph_B_HollowBasePartyController::EntryPoint' has a wrong offset!");

}

