#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HollowBasePartyController_MultiSpeaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HollowBasePartyController_MultiSpeaker.B_HollowBasePartyController_MultiSpeaker_C
// 0x0038 (0x02A8 - 0x0270)
class AB_HollowBasePartyController_MultiSpeaker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMusicPartyPropComponent_C*             MusicPartyPropComponent;                           // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Threshold_6B4F507B4441F359CDA700899C449B69; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_6B4F507B4441F359CDA700899C449B69; // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USourceEffectSimpleDelayPreset*         DelayFX;                                           // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USourceEffectFoldbackDistortionPreset*  DistFX;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__B_HollowBasePartyController_MultiSpeaker_MusicPartyPropComponent_K2Node_ComponentBoundEvent_0_OnSpeakerRemoved__DelegateSignature(class AActor* Speaker_Actor);
	void BndEvt__B_HollowBasePartyController_MultiSpeaker_MusicPartyPropComponent_K2Node_ComponentBoundEvent_1_OnAllSpeakersDestroyed__DelegateSignature(class AActor* Speaker_Actor);
	void BndEvt__B_HollowBasePartyController_MultiSpeaker_MusicPartyPropComponent_K2Node_ComponentBoundEvent_2_OnSpeakerDamaged__DelegateSignature(class AActor* Speaker_Actor);
	void ExecuteUbergraph_B_HollowBasePartyController_MultiSpeaker(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void Trigger_FX_Mod();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HollowBasePartyController_MultiSpeaker_C">();
	}
	static class AB_HollowBasePartyController_MultiSpeaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HollowBasePartyController_MultiSpeaker_C>();
	}
};
static_assert(alignof(AB_HollowBasePartyController_MultiSpeaker_C) == 0x000008, "Wrong alignment on AB_HollowBasePartyController_MultiSpeaker_C");
static_assert(sizeof(AB_HollowBasePartyController_MultiSpeaker_C) == 0x0002A8, "Wrong size on AB_HollowBasePartyController_MultiSpeaker_C");
static_assert(offsetof(AB_HollowBasePartyController_MultiSpeaker_C, UberGraphFrame) == 0x000270, "Member 'AB_HollowBasePartyController_MultiSpeaker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_HollowBasePartyController_MultiSpeaker_C, Audio) == 0x000278, "Member 'AB_HollowBasePartyController_MultiSpeaker_C::Audio' has a wrong offset!");
static_assert(offsetof(AB_HollowBasePartyController_MultiSpeaker_C, MusicPartyPropComponent) == 0x000280, "Member 'AB_HollowBasePartyController_MultiSpeaker_C::MusicPartyPropComponent' has a wrong offset!");
static_assert(offsetof(AB_HollowBasePartyController_MultiSpeaker_C, Timeline_Threshold_6B4F507B4441F359CDA700899C449B69) == 0x000288, "Member 'AB_HollowBasePartyController_MultiSpeaker_C::Timeline_Threshold_6B4F507B4441F359CDA700899C449B69' has a wrong offset!");
static_assert(offsetof(AB_HollowBasePartyController_MultiSpeaker_C, Timeline__Direction_6B4F507B4441F359CDA700899C449B69) == 0x00028C, "Member 'AB_HollowBasePartyController_MultiSpeaker_C::Timeline__Direction_6B4F507B4441F359CDA700899C449B69' has a wrong offset!");
static_assert(offsetof(AB_HollowBasePartyController_MultiSpeaker_C, Timeline) == 0x000290, "Member 'AB_HollowBasePartyController_MultiSpeaker_C::Timeline' has a wrong offset!");
static_assert(offsetof(AB_HollowBasePartyController_MultiSpeaker_C, DelayFX) == 0x000298, "Member 'AB_HollowBasePartyController_MultiSpeaker_C::DelayFX' has a wrong offset!");
static_assert(offsetof(AB_HollowBasePartyController_MultiSpeaker_C, DistFX) == 0x0002A0, "Member 'AB_HollowBasePartyController_MultiSpeaker_C::DistFX' has a wrong offset!");

}

