#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_LonelyDoor_Manager

#include "Basic.hpp"

#include "MeshNetwork_structs.hpp"


namespace SDK::Params
{

// Function B_LonelyDoor_Manager.B_LonelyDoor_Manager_C.DoorDamageReceived
// 0x0004 (0x0004 - 0x0000)
struct B_LonelyDoor_Manager_C_DoorDamageReceived final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LonelyDoor_Manager_C_DoorDamageReceived) == 0x000004, "Wrong alignment on B_LonelyDoor_Manager_C_DoorDamageReceived");
static_assert(sizeof(B_LonelyDoor_Manager_C_DoorDamageReceived) == 0x000004, "Wrong size on B_LonelyDoor_Manager_C_DoorDamageReceived");
static_assert(offsetof(B_LonelyDoor_Manager_C_DoorDamageReceived, Damage) == 0x000000, "Member 'B_LonelyDoor_Manager_C_DoorDamageReceived::Damage' has a wrong offset!");

// Function B_LonelyDoor_Manager.B_LonelyDoor_Manager_C.ExecuteUbergraph_B_LonelyDoor_Manager
// 0x00D8 (0x00D8 - 0x0000)
struct B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_MeshNetworkReady*      CallFunc_MeshNetworkReadyAsync_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 DamageAdded)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Damage_1;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Subtract_Int64Int64_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          K2Node_CustomEvent_NodeType;                       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMeshNetworkNodeType NodeType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMetaDataWithKey_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_MaxInt64_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Damage)>                 K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Damage;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DamageMultiplier;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         K2Node_CustomEvent_health;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         K2Node_CustomEvent_NewHealth;                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager) == 0x000008, "Wrong alignment on B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager");
static_assert(sizeof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager) == 0x0000D8, "Wrong size on B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, EntryPoint) == 0x000000, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_MeshNetworkReadyAsync_ReturnValue) == 0x000008, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_MeshNetworkReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000028, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000030, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CustomEvent_Damage_1) == 0x000044, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CustomEvent_Damage_1' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000048, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, Temp_byte_Variable) == 0x000050, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_Subtract_Int64Int64_ReturnValue) == 0x000058, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_Subtract_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CustomEvent_NodeType) == 0x000061, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CustomEvent_NodeType' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000080, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_GetMetaDataWithKey_ReturnValue) == 0x000088, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_GetMetaDataWithKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_MaxInt64_ReturnValue) == 0x000090, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_MaxInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CustomEvent_Damage) == 0x0000A4, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000A8, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CustomEvent_DamageMultiplier) == 0x0000AC, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CustomEvent_DamageMultiplier' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_FTrunc_ReturnValue) == 0x0000B4, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x0000B8, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, CallFunc_GetValueAsBool_ReturnValue) == 0x0000C0, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CustomEvent_health) == 0x0000C8, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CustomEvent_health' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager, K2Node_CustomEvent_NewHealth) == 0x0000D0, "Member 'B_LonelyDoor_Manager_C_ExecuteUbergraph_B_LonelyDoor_Manager::K2Node_CustomEvent_NewHealth' has a wrong offset!");

// Function B_LonelyDoor_Manager.B_LonelyDoor_Manager_C.MeshNet_LonelyDoor_OverrideHealth
// 0x0008 (0x0008 - 0x0000)
struct B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_OverrideHealth final
{
public:
	int64                                         NewHealth;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_OverrideHealth) == 0x000008, "Wrong alignment on B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_OverrideHealth");
static_assert(sizeof(B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_OverrideHealth) == 0x000008, "Wrong size on B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_OverrideHealth");
static_assert(offsetof(B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_OverrideHealth, NewHealth) == 0x000000, "Member 'B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_OverrideHealth::NewHealth' has a wrong offset!");

// Function B_LonelyDoor_Manager.B_LonelyDoor_Manager_C.MeshNet_LonelyDoor_SetDmgMultiplier
// 0x0004 (0x0004 - 0x0000)
struct B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_SetDmgMultiplier final
{
public:
	float                                         DamageMultiplier_0;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_SetDmgMultiplier) == 0x000004, "Wrong alignment on B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_SetDmgMultiplier");
static_assert(sizeof(B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_SetDmgMultiplier) == 0x000004, "Wrong size on B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_SetDmgMultiplier");
static_assert(offsetof(B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_SetDmgMultiplier, DamageMultiplier_0) == 0x000000, "Member 'B_LonelyDoor_Manager_C_MeshNet_LonelyDoor_SetDmgMultiplier::DamageMultiplier_0' has a wrong offset!");

// Function B_LonelyDoor_Manager.B_LonelyDoor_Manager_C.MeshNet_SetDefaultHealth
// 0x0008 (0x0008 - 0x0000)
struct B_LonelyDoor_Manager_C_MeshNet_SetDefaultHealth final
{
public:
	int64                                         Health;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LonelyDoor_Manager_C_MeshNet_SetDefaultHealth) == 0x000008, "Wrong alignment on B_LonelyDoor_Manager_C_MeshNet_SetDefaultHealth");
static_assert(sizeof(B_LonelyDoor_Manager_C_MeshNet_SetDefaultHealth) == 0x000008, "Wrong size on B_LonelyDoor_Manager_C_MeshNet_SetDefaultHealth");
static_assert(offsetof(B_LonelyDoor_Manager_C_MeshNet_SetDefaultHealth, Health) == 0x000000, "Member 'B_LonelyDoor_Manager_C_MeshNet_SetDefaultHealth::Health' has a wrong offset!");

// Function B_LonelyDoor_Manager.B_LonelyDoor_Manager_C.MeshNet_UpdateHealth
// 0x0004 (0x0004 - 0x0000)
struct B_LonelyDoor_Manager_C_MeshNet_UpdateHealth final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LonelyDoor_Manager_C_MeshNet_UpdateHealth) == 0x000004, "Wrong alignment on B_LonelyDoor_Manager_C_MeshNet_UpdateHealth");
static_assert(sizeof(B_LonelyDoor_Manager_C_MeshNet_UpdateHealth) == 0x000004, "Wrong size on B_LonelyDoor_Manager_C_MeshNet_UpdateHealth");
static_assert(offsetof(B_LonelyDoor_Manager_C_MeshNet_UpdateHealth, Damage) == 0x000000, "Member 'B_LonelyDoor_Manager_C_MeshNet_UpdateHealth::Damage' has a wrong offset!");

// Function B_LonelyDoor_Manager.B_LonelyDoor_Manager_C.OnReady_19C73EFF461B1ACB73EF9BA85007F49E
// 0x0001 (0x0001 - 0x0000)
struct B_LonelyDoor_Manager_C_OnReady_19C73EFF461B1ACB73EF9BA85007F49E final
{
public:
	EMeshNetworkNodeType                          NodeType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LonelyDoor_Manager_C_OnReady_19C73EFF461B1ACB73EF9BA85007F49E) == 0x000001, "Wrong alignment on B_LonelyDoor_Manager_C_OnReady_19C73EFF461B1ACB73EF9BA85007F49E");
static_assert(sizeof(B_LonelyDoor_Manager_C_OnReady_19C73EFF461B1ACB73EF9BA85007F49E) == 0x000001, "Wrong size on B_LonelyDoor_Manager_C_OnReady_19C73EFF461B1ACB73EF9BA85007F49E");
static_assert(offsetof(B_LonelyDoor_Manager_C_OnReady_19C73EFF461B1ACB73EF9BA85007F49E, NodeType) == 0x000000, "Member 'B_LonelyDoor_Manager_C_OnReady_19C73EFF461B1ACB73EF9BA85007F49E::NodeType' has a wrong offset!");

// Function B_LonelyDoor_Manager.B_LonelyDoor_Manager_C.OnRep_DefaultHealthValue
// 0x0003 (0x0003 - 0x0000)
struct B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue final
{
public:
	EMeshNetworkNodeType                          CallFunc_GetMeshNetworkNodeType_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue) == 0x000001, "Wrong alignment on B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue");
static_assert(sizeof(B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue) == 0x000003, "Wrong size on B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue");
static_assert(offsetof(B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue, CallFunc_GetMeshNetworkNodeType_ReturnValue) == 0x000000, "Member 'B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue::CallFunc_GetMeshNetworkNodeType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'B_LonelyDoor_Manager_C_OnRep_DefaultHealthValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function B_LonelyDoor_Manager.B_LonelyDoor_Manager_C.OnRep_DoorHealth
// 0x0004 (0x0004 - 0x0000)
struct B_LonelyDoor_Manager_C_OnRep_DoorHealth final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          CallFunc_GetMeshNetworkNodeType_ReturnValue;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LonelyDoor_Manager_C_OnRep_DoorHealth) == 0x000001, "Wrong alignment on B_LonelyDoor_Manager_C_OnRep_DoorHealth");
static_assert(sizeof(B_LonelyDoor_Manager_C_OnRep_DoorHealth) == 0x000004, "Wrong size on B_LonelyDoor_Manager_C_OnRep_DoorHealth");
static_assert(offsetof(B_LonelyDoor_Manager_C_OnRep_DoorHealth, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'B_LonelyDoor_Manager_C_OnRep_DoorHealth::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_OnRep_DoorHealth, CallFunc_NotEqual_Int64Int64_ReturnValue) == 0x000001, "Member 'B_LonelyDoor_Manager_C_OnRep_DoorHealth::CallFunc_NotEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_OnRep_DoorHealth, CallFunc_GetMeshNetworkNodeType_ReturnValue) == 0x000002, "Member 'B_LonelyDoor_Manager_C_OnRep_DoorHealth::CallFunc_GetMeshNetworkNodeType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LonelyDoor_Manager_C_OnRep_DoorHealth, K2Node_SwitchEnum_CmpSuccess) == 0x000003, "Member 'B_LonelyDoor_Manager_C_OnRep_DoorHealth::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

