#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Melee_Blade_Real

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function B_Melee_Blade_Real.B_Melee_Blade_Real_C.OnPlayImpactFX
// 0x00F0 (0x00F0 - 0x0000)
struct B_Melee_Blade_Real_C_OnPlayImpactFX final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              ImpactPhysicalSurface;                             // 0x00E0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     SpawnedPSC;                                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Melee_Blade_Real_C_OnPlayImpactFX) == 0x000008, "Wrong alignment on B_Melee_Blade_Real_C_OnPlayImpactFX");
static_assert(sizeof(B_Melee_Blade_Real_C_OnPlayImpactFX) == 0x0000F0, "Wrong size on B_Melee_Blade_Real_C_OnPlayImpactFX");
static_assert(offsetof(B_Melee_Blade_Real_C_OnPlayImpactFX, HitResult) == 0x000000, "Member 'B_Melee_Blade_Real_C_OnPlayImpactFX::HitResult' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_OnPlayImpactFX, ImpactPhysicalSurface) == 0x0000E0, "Member 'B_Melee_Blade_Real_C_OnPlayImpactFX::ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_OnPlayImpactFX, SpawnedPSC) == 0x0000E8, "Member 'B_Melee_Blade_Real_C_OnPlayImpactFX::SpawnedPSC' has a wrong offset!");

// Function B_Melee_Blade_Real.B_Melee_Blade_Real_C.ExecuteUbergraph_B_Melee_Blade_Real
// 0x0228 (0x0228 - 0x0000)
struct B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0008(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              K2Node_Event_ImpactPhysicalSurface;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     K2Node_Event_SpawnedPSC;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real) == 0x000008, "Wrong alignment on B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real");
static_assert(sizeof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real) == 0x000228, "Wrong size on B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, EntryPoint) == 0x000000, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, K2Node_Event_HitResult) == 0x000008, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, K2Node_Event_ImpactPhysicalSurface) == 0x0000E8, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::K2Node_Event_ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, K2Node_Event_SpawnedPSC) == 0x0000F0, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::K2Node_Event_SpawnedPSC' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000F8, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_bBlockingHit) == 0x000110, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_bInitialOverlap) == 0x000111, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_Time) == 0x000114, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_Distance) == 0x000118, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_Location) == 0x000120, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_ImpactPoint) == 0x000138, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_Normal) == 0x000150, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_ImpactNormal) == 0x000168, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_PhysMat) == 0x000180, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_HitActor) == 0x000188, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_HitComponent) == 0x000190, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_HitBoneName) == 0x000198, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_BoneName) == 0x00019C, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_HitItem) == 0x0001A0, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_ElementIndex) == 0x0001A4, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_FaceIndex) == 0x0001A8, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_TraceStart) == 0x0001B0, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_BreakHitResult_TraceEnd) == 0x0001C8, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001E0, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, K2Node_DynamicCast_AsFort_Pawn) == 0x0001F8, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000208, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000220, "Member 'B_Melee_Blade_Real_C_ExecuteUbergraph_B_Melee_Blade_Real::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

