#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_MeleeManager_Variant_Template_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CreativeMeleeHitOptions_structs.hpp"
#include "CreativeMeleeOptions_structs.hpp"


namespace SDK::Params
{

// Function B_MeleeManager_Variant_Template_Parent.B_MeleeManager_Variant_Template_Parent_C.Valid for Actor
// 0x0010 (0x0010 - 0x0000)
struct B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_Valid;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidTeam_Valid;                        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor) == 0x000008, "Wrong alignment on B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor");
static_assert(sizeof(B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor) == 0x000010, "Wrong size on B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor, Actor) == 0x000000, "Member 'B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor::Actor' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor, Valid) == 0x000008, "Member 'B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor::Valid' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor, CallFunc_IsValidClass_Valid) == 0x000009, "Member 'B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor::CallFunc_IsValidClass_Valid' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor, CallFunc_IsValidTeam_Valid) == 0x00000B, "Member 'B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor::CallFunc_IsValidTeam_Valid' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'B_MeleeManager_Variant_Template_Parent_C_Valid_for_Actor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function B_MeleeManager_Variant_Template_Parent.B_MeleeManager_Variant_Template_Parent_C.Priority Check And Set
// 0x0008 (0x0008 - 0x0000)
struct B_MeleeManager_Variant_Template_Parent_C_Priority_Check_And_Set final
{
public:
	int32                                         ModifierRank;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_MeleeManager_Variant_Template_Parent_C_Priority_Check_And_Set) == 0x000004, "Wrong alignment on B_MeleeManager_Variant_Template_Parent_C_Priority_Check_And_Set");
static_assert(sizeof(B_MeleeManager_Variant_Template_Parent_C_Priority_Check_And_Set) == 0x000008, "Wrong size on B_MeleeManager_Variant_Template_Parent_C_Priority_Check_And_Set");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Priority_Check_And_Set, ModifierRank) == 0x000000, "Member 'B_MeleeManager_Variant_Template_Parent_C_Priority_Check_And_Set::ModifierRank' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Priority_Check_And_Set, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'B_MeleeManager_Variant_Template_Parent_C_Priority_Check_And_Set::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function B_MeleeManager_Variant_Template_Parent.B_MeleeManager_Variant_Template_Parent_C.IsValidTeam
// 0x0020 (0x0020 - 0x0000)
struct B_MeleeManager_Variant_Template_Parent_C_IsValidTeam final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorPvPTeamIndex_TeamIndex;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActorPvPTeamIndex_ReturnValue;         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamValueAsIndex_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidTeamIndex_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTeamAny_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam) == 0x000008, "Wrong alignment on B_MeleeManager_Variant_Template_Parent_C_IsValidTeam");
static_assert(sizeof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam) == 0x000020, "Wrong size on B_MeleeManager_Variant_Template_Parent_C_IsValidTeam");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, Actor) == 0x000000, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::Actor' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, Valid) == 0x000008, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::Valid' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_GetActorPvPTeamIndex_TeamIndex) == 0x000009, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_GetActorPvPTeamIndex_TeamIndex' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_GetActorPvPTeamIndex_ReturnValue) == 0x00000A, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_GetActorPvPTeamIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000B, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_GetTeamValueAsIndex_ReturnValue) == 0x000014, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_GetTeamValueAsIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000018, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_IsValidTeamIndex_ReturnValue) == 0x000019, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_IsValidTeamIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00001A, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00001B, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidTeam, CallFunc_IsTeamAny_ReturnValue) == 0x00001C, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidTeam::CallFunc_IsTeamAny_ReturnValue' has a wrong offset!");

// Function B_MeleeManager_Variant_Template_Parent.B_MeleeManager_Variant_Template_Parent_C.IsValidClass
// 0x0040 (0x0040 - 0x0000)
struct B_MeleeManager_Variant_Template_Parent_C_IsValidClass final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          CallFunc_GetMinigameForActor_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       K2Node_DynamicCast_AsFort_Player_State;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetClassSlotForPlayer_ReturnValue;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass) == 0x000008, "Wrong alignment on B_MeleeManager_Variant_Template_Parent_C_IsValidClass");
static_assert(sizeof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass) == 0x000040, "Wrong size on B_MeleeManager_Variant_Template_Parent_C_IsValidClass");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, Actor) == 0x000000, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::Actor' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, Valid) == 0x000008, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::Valid' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_GetMinigameForActor_ReturnValue) == 0x000010, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_GetMinigameForActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000018, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, K2Node_DynamicCast_AsFort_Player_State) == 0x000028, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::K2Node_DynamicCast_AsFort_Player_State' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_GetClassSlotForPlayer_ReturnValue) == 0x000031, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_GetClassSlotForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_IsValid_ReturnValue_2) == 0x000032, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000033, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000034, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_Conv_IntToByte_ReturnValue) == 0x000035, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000036, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000037, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000038, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_IsValidClass, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'B_MeleeManager_Variant_Template_Parent_C_IsValidClass::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function B_MeleeManager_Variant_Template_Parent.B_MeleeManager_Variant_Template_Parent_C.GetCannonballImpactRadius
// 0x0008 (0x0008 - 0x0000)
struct B_MeleeManager_Variant_Template_Parent_C_GetCannonballImpactRadius final
{
public:
	float                                         CannonballImpactRadius_0;                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_MeleeManager_Variant_Template_Parent_C_GetCannonballImpactRadius) == 0x000004, "Wrong alignment on B_MeleeManager_Variant_Template_Parent_C_GetCannonballImpactRadius");
static_assert(sizeof(B_MeleeManager_Variant_Template_Parent_C_GetCannonballImpactRadius) == 0x000008, "Wrong size on B_MeleeManager_Variant_Template_Parent_C_GetCannonballImpactRadius");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_GetCannonballImpactRadius, CannonballImpactRadius_0) == 0x000000, "Member 'B_MeleeManager_Variant_Template_Parent_C_GetCannonballImpactRadius::CannonballImpactRadius_0' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_GetCannonballImpactRadius, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'B_MeleeManager_Variant_Template_Parent_C_GetCannonballImpactRadius::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function B_MeleeManager_Variant_Template_Parent.B_MeleeManager_Variant_Template_Parent_C.FindPerHitOptions
// 0x0044 (0x0044 - 0x0000)
struct B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions final
{
public:
	struct FGameplayTag                           HitTag;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FCreativeMeleeHitOptions               MeleeHitOptions;                                   // 0x0004(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCreativeMeleeHitOptions               K2Node_MakeStruct_CreativeMeleeHitOptions;         // 0x000C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_2;     // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_3;     // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_4;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreativeMeleeHitOptions               K2Node_MakeStruct_CreativeMeleeHitOptions_1;       // 0x001C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCreativeMeleeHitOptions               K2Node_MakeStruct_CreativeMeleeHitOptions_2;       // 0x0024(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCreativeMeleeHitOptions               K2Node_MakeStruct_CreativeMeleeHitOptions_3;       // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCreativeMeleeHitOptions               K2Node_MakeStruct_CreativeMeleeHitOptions_4;       // 0x0034(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCreativeMeleeHitOptions               K2Node_MakeStruct_CreativeMeleeHitOptions_5;       // 0x003C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions) == 0x000004, "Wrong alignment on B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions");
static_assert(sizeof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions) == 0x000044, "Wrong size on B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, HitTag) == 0x000000, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::HitTag' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, MeleeHitOptions) == 0x000004, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::MeleeHitOptions' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, K2Node_MakeStruct_CreativeMeleeHitOptions) == 0x00000C, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::K2Node_MakeStruct_CreativeMeleeHitOptions' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000014, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000015, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, CallFunc_EqualEqual_GameplayTag_ReturnValue_2) == 0x000016, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::CallFunc_EqualEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, CallFunc_EqualEqual_GameplayTag_ReturnValue_3) == 0x000017, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::CallFunc_EqualEqual_GameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, CallFunc_EqualEqual_GameplayTag_ReturnValue_4) == 0x000018, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::CallFunc_EqualEqual_GameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, K2Node_MakeStruct_CreativeMeleeHitOptions_1) == 0x00001C, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::K2Node_MakeStruct_CreativeMeleeHitOptions_1' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, K2Node_MakeStruct_CreativeMeleeHitOptions_2) == 0x000024, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::K2Node_MakeStruct_CreativeMeleeHitOptions_2' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, K2Node_MakeStruct_CreativeMeleeHitOptions_3) == 0x00002C, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::K2Node_MakeStruct_CreativeMeleeHitOptions_3' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, K2Node_MakeStruct_CreativeMeleeHitOptions_4) == 0x000034, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::K2Node_MakeStruct_CreativeMeleeHitOptions_4' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions, K2Node_MakeStruct_CreativeMeleeHitOptions_5) == 0x00003C, "Member 'B_MeleeManager_Variant_Template_Parent_C_FindPerHitOptions::K2Node_MakeStruct_CreativeMeleeHitOptions_5' has a wrong offset!");

// Function B_MeleeManager_Variant_Template_Parent.B_MeleeManager_Variant_Template_Parent_C.Accumulate
// 0x02E0 (0x02E0 - 0x0000)
struct B_MeleeManager_Variant_Template_Parent_C_Accumulate final
{
public:
	struct FCreativeMeleeOptions                  AccumulatedState;                                  // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 Target_Actor;                                      // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  PlayerController;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FCreativeMeleeHitOptions> local_Hit_Values;                                  // 0x00C8(0x0050)(Edit, BlueprintVisible)
	struct FCreativeMeleeOptions                  localaccumulator;                                  // 0x0118(0x00B8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Valid_for_Actor_Valid;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_4;                // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCannonballImpactRadius_CannonballImpactRadius; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_5;                // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_6;                // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_7;                // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0220(0x0020)()
	bool                                          CallFunc_TryActivateAbilitiesByTag_ReturnValue;    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_8;                // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_9;                // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_10;               // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_11;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0268(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0278(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCreativeMeleeHitOptions               CallFunc_FindPerHitOptions_MeleeHitOptions;        // 0x0280(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreativeMeleeHitOptions               CallFunc_Map_Find_Value;                           // 0x028C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCreativeMeleeHitOptions               K2Node_MakeStruct_CreativeMeleeHitOptions;         // 0x02C8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_12;               // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_13;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_8;             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_9;             // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_MeleeManager_Variant_Template_Parent_C_Accumulate) == 0x000008, "Wrong alignment on B_MeleeManager_Variant_Template_Parent_C_Accumulate");
static_assert(sizeof(B_MeleeManager_Variant_Template_Parent_C_Accumulate) == 0x0002E0, "Wrong size on B_MeleeManager_Variant_Template_Parent_C_Accumulate");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Accumulate, AccumulatedState) == 0x000000, "Member 'B_MeleeManager_Variant_Template_Parent_C_Accumulate::AccumulatedState' has a wrong offset!");
static_assert(offsetof(B_MeleeManager_Variant_Template_Parent_C_Accumulate, Target_Actor) == 0x0000B8, "Member 'B_MeleeManager_Variant_Template_Parent_C_Accumulate::Target_Actor' has a wrong offset!");
