#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_PetrolWeapon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "B_Ranged_Generic_Athena_Deprecated_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_PetrolWeapon.B_PetrolWeapon_C
// 0x0110 (0x1710 - 0x1600)
class AB_PetrolWeapon_C final : public AB_Ranged_Generic_Athena_Deprecated_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_PetrolWeapon_C;                   // 0x1600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        PourLoopSound;                                     // 0x1608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PourStopSound;                                     // 0x1610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortSplatterSourceComponent*           FortSplatterSource;                                // 0x1618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAmmoMod;                                     // 0x1620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1621[0x7];                                     // 0x1621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Petrol_Pickup_C*                   AttachedBGAActor;                                  // 0x1628(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachSocket;                                      // 0x1630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1634[0x4];                                     // 0x1634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AttachedBGAScale;                                  // 0x1638(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             AttachedBGARelativeTransform;                      // 0x1650(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortInventoryOwnerInterface> InventoryInterface;                                // 0x16B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  InventoryGUID;                                     // 0x16C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FuelLeaking;                                    // 0x16D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         IsShootableWhileHeld;                              // 0x16D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortWeapon*                            WeaponReference;                                   // 0x1700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowHUDKeyActions;                                 // 0x1708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1709[0x3];                                     // 0x1709(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag_InWindup;                                      // 0x170C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Added_B93A41134252056323F976A22CCF45FB();
	void BGADestroyedWhileHeld();
	void BindHolsterEvents();
	void ExecuteUbergraph_B_PetrolWeapon(int32 EntryPoint);
	void HUDKeyAction_Targeting(bool IsTargeting);
	void K2_OnUnEquip();
	void OnEquip_Copy_();
	void OnHolstered();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnRep_AttachedBGAActor();
	void OnSpawnProjectile(class AFortProjectileBase* SpawnProjectile);
	void OnStopWeaponFireFX();
	void OnUnEquip_Copy_();
	void OnUnholstered();
	void OnWeaponAttached();
	void ReceiveBeginPlay();
	void Removed_37103EFF43C9315C3003269E0216DE30();
	void ReplicateOnHolstered();
	void ReplicateOnUnholstered();
	void UnbindHolsterEvents();
	void UpdateAndAttachBGA();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_PetrolWeapon_C">();
	}
	static class AB_PetrolWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_PetrolWeapon_C>();
	}
};
static_assert(alignof(AB_PetrolWeapon_C) == 0x000010, "Wrong alignment on AB_PetrolWeapon_C");
static_assert(sizeof(AB_PetrolWeapon_C) == 0x001710, "Wrong size on AB_PetrolWeapon_C");
static_assert(offsetof(AB_PetrolWeapon_C, UberGraphFrame_B_PetrolWeapon_C) == 0x001600, "Member 'AB_PetrolWeapon_C::UberGraphFrame_B_PetrolWeapon_C' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, PourLoopSound) == 0x001608, "Member 'AB_PetrolWeapon_C::PourLoopSound' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, PourStopSound) == 0x001610, "Member 'AB_PetrolWeapon_C::PourStopSound' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, FortSplatterSource) == 0x001618, "Member 'AB_PetrolWeapon_C::FortSplatterSource' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, EnableAmmoMod) == 0x001620, "Member 'AB_PetrolWeapon_C::EnableAmmoMod' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, AttachedBGAActor) == 0x001628, "Member 'AB_PetrolWeapon_C::AttachedBGAActor' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, AttachSocket) == 0x001630, "Member 'AB_PetrolWeapon_C::AttachSocket' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, AttachedBGAScale) == 0x001638, "Member 'AB_PetrolWeapon_C::AttachedBGAScale' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, AttachedBGARelativeTransform) == 0x001650, "Member 'AB_PetrolWeapon_C::AttachedBGARelativeTransform' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, InventoryInterface) == 0x0016B0, "Member 'AB_PetrolWeapon_C::InventoryInterface' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, InventoryGUID) == 0x0016C0, "Member 'AB_PetrolWeapon_C::InventoryGUID' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, NS_FuelLeaking) == 0x0016D0, "Member 'AB_PetrolWeapon_C::NS_FuelLeaking' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, IsShootableWhileHeld) == 0x0016D8, "Member 'AB_PetrolWeapon_C::IsShootableWhileHeld' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, WeaponReference) == 0x001700, "Member 'AB_PetrolWeapon_C::WeaponReference' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, ShowHUDKeyActions) == 0x001708, "Member 'AB_PetrolWeapon_C::ShowHUDKeyActions' has a wrong offset!");
static_assert(offsetof(AB_PetrolWeapon_C, Tag_InWindup) == 0x00170C, "Member 'AB_PetrolWeapon_C::Tag_InWindup' has a wrong offset!");

}

