#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Pickups_Parent.B_Pickups_Parent_C
// 0x0168 (0x0548 - 0x03E0)
class AB_Pickups_Parent_C : public AFortPickupsParent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Root;                                              // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpInteactoIcon_FF208F9641BE589B76EF698B94309EA7; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpObject_FF208F9641BE589B76EF698B94309EA7; // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileSelectedTL__Direction_FF208F9641BE589B76EF698B94309EA7; // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileSelectedTL;                                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Static_Mesh_Pickup;                                // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Skeletal_Mesh_Pickup;                              // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    SkeletalOrStaticMeshAssetPrimitive;                // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentElementIndex;                               // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Tossed;                                            // 0x0424(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Component_Radius__Scaled_;                         // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         Component_Radius_Multiplier;                       // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   Outline_Rarity_Colors;                             // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	float                                         Component_Radius;                                  // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         Picked_Up_Delay_Before_Glow;                       // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         Picked_Up_Fade_In_Time;                            // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         Picked_Up_Hold_Time;                               // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         Picked_Up_Fade_Out_Time;                           // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         Picked_Up_Sweep_Speed;                             // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UParticleSystem*                        Picked_Up_Trail_PS;                                // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Sparkle_Spawn_Rate__Picked_Up_;                    // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	TArray<float>                                 Lifetime__Picked_Up_;                              // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	class UForceFeedbackEffect*                   PickupForceFeedback;                               // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Names_of_Materials_And_Parents_Exempt_from_Repartening; // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	bool                                          HasUniqueMaterialIds;                              // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               BackgroundParticleSystem;                          // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   BackgroundRarityColors;                            // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	float                                         Random_Rotation;                                   // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MobileSelectedOffset;                              // 0x04C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                MobileSelectedScale;                               // 0x04D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MobileInteractIcon;                                // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconLocation;                        // 0x04F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconScale;                           // 0x0510(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UMaterialInterface*                     MobileInteractionMaterial;                         // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          PickedUp;                                          // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MissionItemOutlineColor;                           // 0x0534(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyBackgroundVisualComponents();
	void DisableBacchusHighlight();
	void EnableBacchusHighlight();
	void ExecuteUbergraph_B_Pickups_Parent(int32 EntryPoint);
	void HideBackgroundAndSpotlight();
	void Mobile_Interation_Icon_Setup();
	void MobileSelectedTL__FinishedFunc();
	void MobileSelectedTL__UpdateFunc();
	void OnAboutToEnterBackpack(class AFortPawn* PickupTarget);
	void OnAttached();
	void OnPickedUp(class AFortPawn* PickupTarget);
	void OnTossed();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ScaleHologramTimingsForPvP();
	void SetActiveBackgroundParticleSystem(bool Active, bool Reset);
	void SetHiddenBackgroundVisualComponents(bool Hidden);
	void SetHologramPickedUpParams(bool Tier_0);
	void SetVisibleMobileInteractIcon(bool Visible);
	void SpawnPickedUpTrailPS();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pickups_Parent_C">();
	}
	static class AB_Pickups_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pickups_Parent_C>();
	}
};
static_assert(alignof(AB_Pickups_Parent_C) == 0x000008, "Wrong alignment on AB_Pickups_Parent_C");
static_assert(sizeof(AB_Pickups_Parent_C) == 0x000548, "Wrong size on AB_Pickups_Parent_C");
static_assert(offsetof(AB_Pickups_Parent_C, UberGraphFrame) == 0x0003E0, "Member 'AB_Pickups_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Root) == 0x0003E8, "Member 'AB_Pickups_Parent_C::Root' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileSelectedTL_LerpInteactoIcon_FF208F9641BE589B76EF698B94309EA7) == 0x0003F0, "Member 'AB_Pickups_Parent_C::MobileSelectedTL_LerpInteactoIcon_FF208F9641BE589B76EF698B94309EA7' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileSelectedTL_LerpObject_FF208F9641BE589B76EF698B94309EA7) == 0x0003F4, "Member 'AB_Pickups_Parent_C::MobileSelectedTL_LerpObject_FF208F9641BE589B76EF698B94309EA7' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileSelectedTL__Direction_FF208F9641BE589B76EF698B94309EA7) == 0x0003F8, "Member 'AB_Pickups_Parent_C::MobileSelectedTL__Direction_FF208F9641BE589B76EF698B94309EA7' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileSelectedTL) == 0x000400, "Member 'AB_Pickups_Parent_C::MobileSelectedTL' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Static_Mesh_Pickup) == 0x000408, "Member 'AB_Pickups_Parent_C::Static_Mesh_Pickup' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Skeletal_Mesh_Pickup) == 0x000410, "Member 'AB_Pickups_Parent_C::Skeletal_Mesh_Pickup' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, SkeletalOrStaticMeshAssetPrimitive) == 0x000418, "Member 'AB_Pickups_Parent_C::SkeletalOrStaticMeshAssetPrimitive' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, CurrentElementIndex) == 0x000420, "Member 'AB_Pickups_Parent_C::CurrentElementIndex' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Tossed) == 0x000424, "Member 'AB_Pickups_Parent_C::Tossed' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Component_Radius__Scaled_) == 0x000428, "Member 'AB_Pickups_Parent_C::Component_Radius__Scaled_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Component_Radius_Multiplier) == 0x00042C, "Member 'AB_Pickups_Parent_C::Component_Radius_Multiplier' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Outline_Rarity_Colors) == 0x000430, "Member 'AB_Pickups_Parent_C::Outline_Rarity_Colors' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Component_Radius) == 0x000440, "Member 'AB_Pickups_Parent_C::Component_Radius' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Picked_Up_Delay_Before_Glow) == 0x000444, "Member 'AB_Pickups_Parent_C::Picked_Up_Delay_Before_Glow' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Picked_Up_Fade_In_Time) == 0x000448, "Member 'AB_Pickups_Parent_C::Picked_Up_Fade_In_Time' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Picked_Up_Hold_Time) == 0x00044C, "Member 'AB_Pickups_Parent_C::Picked_Up_Hold_Time' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Picked_Up_Fade_Out_Time) == 0x000450, "Member 'AB_Pickups_Parent_C::Picked_Up_Fade_Out_Time' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Picked_Up_Sweep_Speed) == 0x000454, "Member 'AB_Pickups_Parent_C::Picked_Up_Sweep_Speed' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Picked_Up_Trail_PS) == 0x000458, "Member 'AB_Pickups_Parent_C::Picked_Up_Trail_PS' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Sparkle_Spawn_Rate__Picked_Up_) == 0x000460, "Member 'AB_Pickups_Parent_C::Sparkle_Spawn_Rate__Picked_Up_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Lifetime__Picked_Up_) == 0x000470, "Member 'AB_Pickups_Parent_C::Lifetime__Picked_Up_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, PickupForceFeedback) == 0x000480, "Member 'AB_Pickups_Parent_C::PickupForceFeedback' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Names_of_Materials_And_Parents_Exempt_from_Repartening) == 0x000488, "Member 'AB_Pickups_Parent_C::Names_of_Materials_And_Parents_Exempt_from_Repartening' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, HasUniqueMaterialIds) == 0x000498, "Member 'AB_Pickups_Parent_C::HasUniqueMaterialIds' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, BackgroundParticleSystem) == 0x0004A0, "Member 'AB_Pickups_Parent_C::BackgroundParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, BackgroundRarityColors) == 0x0004A8, "Member 'AB_Pickups_Parent_C::BackgroundRarityColors' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, Random_Rotation) == 0x0004B8, "Member 'AB_Pickups_Parent_C::Random_Rotation' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileSelectedOffset) == 0x0004C0, "Member 'AB_Pickups_Parent_C::MobileSelectedOffset' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileSelectedScale) == 0x0004D8, "Member 'AB_Pickups_Parent_C::MobileSelectedScale' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileInteractIcon) == 0x0004F0, "Member 'AB_Pickups_Parent_C::MobileInteractIcon' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileInteractIconLocation) == 0x0004F8, "Member 'AB_Pickups_Parent_C::MobileInteractIconLocation' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileInteractIconScale) == 0x000510, "Member 'AB_Pickups_Parent_C::MobileInteractIconScale' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MobileInteractionMaterial) == 0x000528, "Member 'AB_Pickups_Parent_C::MobileInteractionMaterial' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, PickedUp) == 0x000530, "Member 'AB_Pickups_Parent_C::PickedUp' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Parent_C, MissionItemOutlineColor) == 0x000534, "Member 'AB_Pickups_Parent_C::MissionItemOutlineColor' has a wrong offset!");

}

