#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Pickups_Parent.B_Pickups_Parent_C.ExecuteUbergraph_B_Pickups_Parent
// 0x0358 (0x0358 - 0x0000)
struct B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue_1;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0040(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            K2Node_DynamicCast_AsFort_Pickup;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMovementCapsuleHalfHeight_ReturnValue; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01C8(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_PickupTarget_1;                       // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_PickupTarget;                         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortIngredientItemDefinition*          K2Node_DynamicCast_AsFort_Ingredient_Item_Definition; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortResourceItemDefinition*            K2Node_DynamicCast_AsFort_Resource_Item_Definition; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_302[0x2];                                      // 0x0302(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0325(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      Temp_byte_Variable;                                // 0x0326(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0327(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue_2;                 // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x032E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F[0x1];                                      // 0x032F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent");
static_assert(sizeof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent) == 0x000358, "Wrong size on B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, EntryPoint) == 0x000000, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_float_Variable) == 0x000004, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_float_Variable_1) == 0x00000C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetSubGame_ReturnValue) == 0x000011, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetSubGame_ReturnValue_1) == 0x000013, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetSubGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_float_Variable_2) == 0x000014, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000030, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_float_Variable_3) == 0x000038, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000040, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetAttachParentActor_ReturnValue) == 0x000120, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000128, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_AsFort_Pickup) == 0x000140, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_AsFort_Pickup' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_BreakVector_X) == 0x00014C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_BreakVector_Y) == 0x000150, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_BreakVector_Z) == 0x000154, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetMovementCapsuleHalfHeight_ReturnValue) == 0x000158, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetMovementCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetComponentBounds_Origin) == 0x000160, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetComponentBounds_BoxExtent) == 0x000178, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetComponentBounds_SphereRadius) == 0x000190, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_BreakVector_X_1) == 0x000194, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_BreakVector_Y_1) == 0x000198, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_BreakVector_Z_1) == 0x00019C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001A0, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001A4, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001A8, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_MakeVector_ReturnValue) == 0x0001B0, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001C8, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_Event_DeltaSeconds) == 0x0002A8, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x0002AC, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_Event_PickupTarget_1) == 0x0002B0, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_Event_PickupTarget_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsLocallyControlled_ReturnValue) == 0x0002B8, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_BooleanAND_ReturnValue) == 0x0002B9, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetController_ReturnValue) == 0x0002C0, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsValid_ReturnValue_2) == 0x0002C8, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0002D0, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_bSuccess_1) == 0x0002D8, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_Event_PickupTarget) == 0x0002E0, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_Event_PickupTarget' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_AsFort_Ingredient_Item_Definition) == 0x0002E8, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_AsFort_Ingredient_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_bSuccess_2) == 0x0002F0, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_AsFort_Resource_Item_Definition) == 0x0002F8, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_AsFort_Resource_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_DynamicCast_bSuccess_3) == 0x000300, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000301, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_int_Variable) == 0x000304, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x000308, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x00030C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_float_Variable_4) == 0x000310, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Array_Get_Item) == 0x000318, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Array_LastIndex_ReturnValue) == 0x000320, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000324, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000325, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, Temp_byte_Variable) == 0x000326, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000327, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_Select_Default) == 0x000328, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_SwitchEnum_CmpSuccess_1) == 0x00032C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_GetSubGame_ReturnValue_2) == 0x00032D, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_GetSubGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, K2Node_SwitchEnum_CmpSuccess_2) == 0x00032E, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000330, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000348, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00034C, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000350, "Member 'B_Pickups_Parent_C_ExecuteUbergraph_B_Pickups_Parent::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.Mobile Interation Icon Setup
// 0x0038 (0x0038 - 0x0000)
struct B_Pickups_Parent_C_Mobile_Interation_Icon_Setup final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_Mobile_Interation_Icon_Setup) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_Mobile_Interation_Icon_Setup");
static_assert(sizeof(B_Pickups_Parent_C_Mobile_Interation_Icon_Setup) == 0x000038, "Wrong size on B_Pickups_Parent_C_Mobile_Interation_Icon_Setup");
static_assert(offsetof(B_Pickups_Parent_C_Mobile_Interation_Icon_Setup, Temp_int_Variable) == 0x000000, "Member 'B_Pickups_Parent_C_Mobile_Interation_Icon_Setup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_Mobile_Interation_Icon_Setup, Temp_object_Variable) == 0x000008, "Member 'B_Pickups_Parent_C_Mobile_Interation_Icon_Setup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_Mobile_Interation_Icon_Setup, Temp_object_Variable_1) == 0x000010, "Member 'B_Pickups_Parent_C_Mobile_Interation_Icon_Setup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_Mobile_Interation_Icon_Setup, Temp_object_Variable_2) == 0x000018, "Member 'B_Pickups_Parent_C_Mobile_Interation_Icon_Setup::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_Mobile_Interation_Icon_Setup, Temp_object_Variable_3) == 0x000020, "Member 'B_Pickups_Parent_C_Mobile_Interation_Icon_Setup::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_Mobile_Interation_Icon_Setup, Temp_object_Variable_4) == 0x000028, "Member 'B_Pickups_Parent_C_Mobile_Interation_Icon_Setup::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_Mobile_Interation_Icon_Setup, K2Node_Select_Default) == 0x000030, "Member 'B_Pickups_Parent_C_Mobile_Interation_Icon_Setup::K2Node_Select_Default' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.OnAboutToEnterBackpack
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_Parent_C_OnAboutToEnterBackpack final
{
public:
	class AFortPawn*                              PickupTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_OnAboutToEnterBackpack) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_OnAboutToEnterBackpack");
static_assert(sizeof(B_Pickups_Parent_C_OnAboutToEnterBackpack) == 0x000008, "Wrong size on B_Pickups_Parent_C_OnAboutToEnterBackpack");
static_assert(offsetof(B_Pickups_Parent_C_OnAboutToEnterBackpack, PickupTarget) == 0x000000, "Member 'B_Pickups_Parent_C_OnAboutToEnterBackpack::PickupTarget' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.OnPickedUp
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_Parent_C_OnPickedUp final
{
public:
	class AFortPawn*                              PickupTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_OnPickedUp) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_OnPickedUp");
static_assert(sizeof(B_Pickups_Parent_C_OnPickedUp) == 0x000008, "Wrong size on B_Pickups_Parent_C_OnPickedUp");
static_assert(offsetof(B_Pickups_Parent_C_OnPickedUp, PickupTarget) == 0x000000, "Member 'B_Pickups_Parent_C_OnPickedUp::PickupTarget' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Pickups_Parent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Pickups_Parent_C_ReceiveTick");
static_assert(sizeof(B_Pickups_Parent_C_ReceiveTick) == 0x000004, "Wrong size on B_Pickups_Parent_C_ReceiveTick");
static_assert(offsetof(B_Pickups_Parent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Pickups_Parent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.ScaleHologramTimingsForPvP
// 0x001C (0x001C - 0x0000)
struct B_Pickups_Parent_C_ScaleHologramTimingsForPvP final
{
public:
	float                                         PVP_TimeScale;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP) == 0x000004, "Wrong alignment on B_Pickups_Parent_C_ScaleHologramTimingsForPvP");
static_assert(sizeof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP) == 0x00001C, "Wrong size on B_Pickups_Parent_C_ScaleHologramTimingsForPvP");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, PVP_TimeScale) == 0x000000, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::PVP_TimeScale' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00000C, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000010, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_GetSubGame_ReturnValue) == 0x000014, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_ScaleHologramTimingsForPvP, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000018, "Member 'B_Pickups_Parent_C_ScaleHologramTimingsForPvP::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SetActiveBackgroundParticleSystem
// 0x0003 (0x0003 - 0x0000)
struct B_Pickups_Parent_C_SetActiveBackgroundParticleSystem final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Reset;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_SetActiveBackgroundParticleSystem) == 0x000001, "Wrong alignment on B_Pickups_Parent_C_SetActiveBackgroundParticleSystem");
static_assert(sizeof(B_Pickups_Parent_C_SetActiveBackgroundParticleSystem) == 0x000003, "Wrong size on B_Pickups_Parent_C_SetActiveBackgroundParticleSystem");
static_assert(offsetof(B_Pickups_Parent_C_SetActiveBackgroundParticleSystem, Active) == 0x000000, "Member 'B_Pickups_Parent_C_SetActiveBackgroundParticleSystem::Active' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetActiveBackgroundParticleSystem, Reset) == 0x000001, "Member 'B_Pickups_Parent_C_SetActiveBackgroundParticleSystem::Reset' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetActiveBackgroundParticleSystem, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'B_Pickups_Parent_C_SetActiveBackgroundParticleSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SetHiddenBackgroundVisualComponents
// 0x0001 (0x0001 - 0x0000)
struct B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents final
{
public:
	bool                                          Hidden;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents) == 0x000001, "Wrong alignment on B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents");
static_assert(sizeof(B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents) == 0x000001, "Wrong size on B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents");
static_assert(offsetof(B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents, Hidden) == 0x000000, "Member 'B_Pickups_Parent_C_SetHiddenBackgroundVisualComponents::Hidden' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SetHologramPickedUpParams
// 0x0070 (0x0070 - 0x0000)
struct B_Pickups_Parent_C_SetHologramPickedUpParams final
{
public:
	bool                                          Tier_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_3;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_SetHologramPickedUpParams) == 0x000008, "Wrong alignment on B_Pickups_Parent_C_SetHologramPickedUpParams");
static_assert(sizeof(B_Pickups_Parent_C_SetHologramPickedUpParams) == 0x000070, "Wrong size on B_Pickups_Parent_C_SetHologramPickedUpParams");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Tier_0) == 0x000000, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Tier_0' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Temp_int_Array_Index_Variable) == 0x000004, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Array_Get_Item) == 0x000018, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Less_IntInt_ReturnValue_1) == 0x000031, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000044, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000048, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Fraction_ReturnValue) == 0x00004C, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Fraction_ReturnValue_1) == 0x000050, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Fraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000058, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_GetGameTimeInSeconds_ReturnValue_2) == 0x00005C, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_GetGameTimeInSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000064, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetHologramPickedUpParams, CallFunc_GetGameTimeInSeconds_ReturnValue_3) == 0x000068, "Member 'B_Pickups_Parent_C_SetHologramPickedUpParams::CallFunc_GetGameTimeInSeconds_ReturnValue_3' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SetVisibleMobileInteractIcon
// 0x00A0 (0x00A0 - 0x0000)
struct B_Pickups_Parent_C_SetVisibleMobileInteractIcon final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0060)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon) == 0x000010, "Wrong alignment on B_Pickups_Parent_C_SetVisibleMobileInteractIcon");
static_assert(sizeof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon) == 0x0000A0, "Wrong size on B_Pickups_Parent_C_SetVisibleMobileInteractIcon");
static_assert(offsetof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon, Visible) == 0x000000, "Member 'B_Pickups_Parent_C_SetVisibleMobileInteractIcon::Visible' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'B_Pickups_Parent_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'B_Pickups_Parent_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'B_Pickups_Parent_C_SetVisibleMobileInteractIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_2) == 0x000008, "Member 'B_Pickups_Parent_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'B_Pickups_Parent_C_SetVisibleMobileInteractIcon::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'B_Pickups_Parent_C_SetVisibleMobileInteractIcon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_Parent_C_SetVisibleMobileInteractIcon, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'B_Pickups_Parent_C_SetVisibleMobileInteractIcon::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function B_Pickups_Parent.B_Pickups_Parent_C.SpawnPickedUpTrailPS
// 0x0030 (0x0030 - 0x0000)
struct B_Pickups_Parent_C_SpawnPickedUpTrailPS final
{
public:
	class UParticleSystemComponent*               TrailPS;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
