#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_CampsiteImprovement_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_CampsiteImprovement_Parent.B_Prj_Athena_CampsiteImprovement_Parent_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent_0;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent_0) == 0x000008, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent_0' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function B_Prj_Athena_CampsiteImprovement_Parent.B_Prj_Athena_CampsiteImprovement_Parent_C.DeployFailedFeedback
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_Athena_CampsiteImprovement_Parent_C_DeployFailedFeedback final
{
public:
	int32                                         FailReason;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_CampsiteImprovement_Parent_C_DeployFailedFeedback) == 0x000004, "Wrong alignment on B_Prj_Athena_CampsiteImprovement_Parent_C_DeployFailedFeedback");
static_assert(sizeof(B_Prj_Athena_CampsiteImprovement_Parent_C_DeployFailedFeedback) == 0x000004, "Wrong size on B_Prj_Athena_CampsiteImprovement_Parent_C_DeployFailedFeedback");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_DeployFailedFeedback, FailReason) == 0x000000, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_DeployFailedFeedback::FailReason' has a wrong offset!");

// Function B_Prj_Athena_CampsiteImprovement_Parent.B_Prj_Athena_CampsiteImprovement_Parent_C.ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent
// 0x0550 (0x0550 - 0x0000)
struct B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0008(0x0020)()
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x0028(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue;                    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0128(0x00D0)(ContainsInstancedReference)
	int32                                         Temp_int_Variable_1;                               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0280(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue;        // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x03E0(0x00D0)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_failReason;                     // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Select_Default;                             // 0x04C8(0x0020)(ConstParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Surface_Supports_Campsite_Deployment__validSurface; // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent) == 0x000008, "Wrong alignment on B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent");
static_assert(sizeof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent) == 0x000550, "Wrong size on B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000008, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Event_Hit_1) == 0x000028, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Event_Hit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, Temp_int_Variable) == 0x000108, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_IsInWater_ReturnValue) == 0x00010C, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_IsInWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000110, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000128, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, Temp_int_Variable_1) == 0x0001F8, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, Temp_bool_IsClosed_Variable) == 0x0001FC, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_ComponentBoundEvent_WaterBody) == 0x000200, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x000208, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x000210, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Event_MyComp) == 0x000218, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Event_Other) == 0x000220, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Event_OtherComp) == 0x000228, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Event_bSelfMoved) == 0x000230, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Event_HitLocation) == 0x000238, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Event_HitNormal) == 0x000250, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Event_NormalImpulse) == 0x000268, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Event_Hit) == 0x000280, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, Temp_bool_Has_Been_Initd_Variable) == 0x000360, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x000364, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_Greater_IntInt_ReturnValue) == 0x000368, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x00036C, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_IsServer_ReturnValue) == 0x000370, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, Temp_bool_Has_Been_Initd_Variable_1) == 0x000371, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000378, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_IsServer_ReturnValue_1) == 0x000390, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_BreakVector_X) == 0x000394, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_BreakVector_Y) == 0x000398, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_BreakVector_Z) == 0x00039C, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003A0, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_MakeVector_ReturnValue) == 0x0003A8, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0003C0, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_K2_SpawnPickupInWorld_ReturnValue) == 0x0003D8, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_K2_SpawnPickupInWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x0003E0, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0004B0, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_DynamicCast_bSuccess) == 0x0004B8, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_CustomEvent_failReason) == 0x0004BC, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_CustomEvent_failReason' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, Temp_bool_IsClosed_Variable_1) == 0x0004C0, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, K2Node_Select_Default) == 0x0004C8, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x0004E8, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0004F0, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_GetForwardVector_ReturnValue) == 0x000508, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_MakeRotFromZX_ReturnValue) == 0x000520, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000538, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_Surface_Supports_Campsite_Deployment__validSurface) == 0x000540, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_Surface_Supports_Campsite_Deployment__validSurface' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent, CallFunc_GetQuestManager_ReturnValue) == 0x000548, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ExecuteUbergraph_B_Prj_Athena_CampsiteImprovement_Parent::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_CampsiteImprovement_Parent.B_Prj_Athena_CampsiteImprovement_Parent_C.OnStop
// 0x00E0 (0x00E0 - 0x0000)
struct B_Prj_Athena_CampsiteImprovement_Parent_C_OnStop final
{
public:
	struct FHitResult                             Hit_0;                                             // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_CampsiteImprovement_Parent_C_OnStop) == 0x000008, "Wrong alignment on B_Prj_Athena_CampsiteImprovement_Parent_C_OnStop");
static_assert(sizeof(B_Prj_Athena_CampsiteImprovement_Parent_C_OnStop) == 0x0000E0, "Wrong size on B_Prj_Athena_CampsiteImprovement_Parent_C_OnStop");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_OnStop, Hit_0) == 0x000000, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_OnStop::Hit_0' has a wrong offset!");

// Function B_Prj_Athena_CampsiteImprovement_Parent.B_Prj_Athena_CampsiteImprovement_Parent_C.ReceiveHit
// 0x0148 (0x0148 - 0x0000)
struct B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0068(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit) == 0x000008, "Wrong alignment on B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit");
static_assert(sizeof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit) == 0x000148, "Wrong size on B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit, Other) == 0x000008, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit, OtherComp) == 0x000010, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit, HitLocation) == 0x000020, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit, HitNormal) == 0x000038, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit, NormalImpulse) == 0x000050, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit, Hit_0) == 0x000068, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_ReceiveHit::Hit_0' has a wrong offset!");

// Function B_Prj_Athena_CampsiteImprovement_Parent.B_Prj_Athena_CampsiteImprovement_Parent_C.SpawnBGA_
// 0x03B0 (0x03B0 - 0x0000)
struct B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_ final
{
public:
	struct FVector                                Normal;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HitComp;                                           // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pos;                                               // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FromWater;                                         // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit_0;                                             // 0x0048(0x00E0)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 ReturnValue;                                       // 0x0128(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  FailedReason;                                      // 0x0130(0x0020)(Edit, BlueprintVisible)
	class APlayerState*                           ImprovementOwner;                                  // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Campsite_C*                        TargetCampsite;                                    // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0290(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x02F8(0x0010)(ConstParm, ReferenceParm)
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Campsite_C*                        CallFunc_Spawn_And_Establish_New_Campsite_AsBGA_Campsite; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABGA_Campsite_C*>                CallFunc_Get_Nearby_Campsites_FriendlyCampsites;   // 0x0320(0x0010)(ReferenceParm)
	TArray<class ABGA_Campsite_C*>                CallFunc_Get_Nearby_Campsites_EnemyCampsites;      // 0x0330(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Campsite_C*                        CallFunc_Best_Squadmate_And_Campsite_To_Add_New_Tent_Campsite; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_Best_Squadmate_And_Campsite_To_Add_New_Tent_Player; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0360(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABGA_Campsite_C*>                CallFunc_Get_Nearby_Campsites_FriendlyCampsites_1; // 0x0378(0x0010)(ReferenceParm)
	TArray<class ABGA_Campsite_C*>                CallFunc_Get_Nearby_Campsites_EnemyCampsites_1;    // 0x0388(0x0010)(ReferenceParm)
	class ABGA_Campsite_C*                        CallFunc_BestCampsiteForNewImprovement_BestCampsite; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_) == 0x000010, "Wrong alignment on B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_");
static_assert(sizeof(B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_) == 0x0003B0, "Wrong size on B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_, Normal) == 0x000000, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_::Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_, HitActor) == 0x000018, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_::HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_, HitComp) == 0x000020, "Member 'B_Prj_Athena_CampsiteImprovement_Parent_C_SpawnBGA_::HitComp' has a wrong offset!");
