#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_BGASpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_BGASpawner.B_Prj_Athena_BGASpawner_C.WillBounceOffTarget
// 0x01E0 (0x01E0 - 0x0000)
struct B_Prj_Athena_BGASpawner_C_WillBounceOffTarget final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 K2Node_DynamicCast_AsBuilding_Gameplay_Actor;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget) == 0x000008, "Wrong alignment on B_Prj_Athena_BGASpawner_C_WillBounceOffTarget");
static_assert(sizeof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget) == 0x0001E0, "Wrong size on B_Prj_Athena_BGASpawner_C_WillBounceOffTarget");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, Hit) == 0x000000, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, ReturnValue) == 0x0000E0, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, Temp_bool_Variable) == 0x0000E1, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_bBlockingHit) == 0x0000E2, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000E3, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_Time) == 0x0000E4, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_Distance) == 0x0000E8, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_Location) == 0x0000F0, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_ImpactPoint) == 0x000108, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_Normal) == 0x000120, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_ImpactNormal) == 0x000138, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_PhysMat) == 0x000150, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_HitActor) == 0x000158, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_HitComponent) == 0x000160, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_HitBoneName) == 0x000168, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_BoneName) == 0x00016C, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_HitItem) == 0x000170, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_ElementIndex) == 0x000174, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_FaceIndex) == 0x000178, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_TraceStart) == 0x000180, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_BreakHitResult_TraceEnd) == 0x000198, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_ComponentHasTag_ReturnValue) == 0x0001B0, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0001B8, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0001C9, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, K2Node_DynamicCast_AsBuilding_Gameplay_Actor) == 0x0001D0, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::K2Node_DynamicCast_AsBuilding_Gameplay_Actor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_WillBounceOffTarget, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'B_Prj_Athena_BGASpawner_C_WillBounceOffTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function B_Prj_Athena_BGASpawner.B_Prj_Athena_BGASpawner_C.SpawnBGA_
// 0x03E0 (0x03E0 - 0x0000)
struct B_Prj_Athena_BGASpawner_C_SpawnBGA_ final
{
public:
	struct FVector                                Normal;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HitComp;                                           // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pos;                                               // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FromWater;                                         // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit;                                               // 0x0048(0x00E0)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 ReturnValue;                                       // 0x0128(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CheckForWater__PosAboveWater;             // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetOwnerWeapon_ReturnValue;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02A0(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0310(0x00B0)()
	class ABuildingGameplayActor*                 K2Node_DynamicCast_AsBuilding_Gameplay_Actor;      // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_WithGravity_Parent_C*       K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_BGASpawner_C_SpawnBGA_) == 0x000010, "Wrong alignment on B_Prj_Athena_BGASpawner_C_SpawnBGA_");
static_assert(sizeof(B_Prj_Athena_BGASpawner_C_SpawnBGA_) == 0x0003E0, "Wrong size on B_Prj_Athena_BGASpawner_C_SpawnBGA_");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, Normal) == 0x000000, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, HitActor) == 0x000018, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, HitComp) == 0x000020, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::HitComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, Pos) == 0x000028, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::Pos' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, FromWater) == 0x000040, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::FromWater' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, Hit) == 0x000048, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, ReturnValue) == 0x000128, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_BreakVector_X) == 0x000130, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_BreakVector_Y) == 0x000134, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_BreakVector_Z) == 0x000138, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000140, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_CheckForWater__PosAboveWater) == 0x000158, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_CheckForWater__PosAboveWater' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_BreakVector_X_1) == 0x000170, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_BreakVector_Y_1) == 0x000174, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_BreakVector_Z_1) == 0x000178, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x00017C, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00017D, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_SelectVector_ReturnValue) == 0x000180, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_GetOwner_ReturnValue) == 0x000198, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_GetOwnerWeapon_ReturnValue) == 0x0001A0, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_GetOwnerWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_MakeVector_ReturnValue) == 0x0001A8, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0001C0, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_GetInstigator_ReturnValue) == 0x0001D8, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_GetActorForwardVector_ReturnValue) == 0x0001E0, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x0001F8, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_MakeRotFromXZ_ReturnValue) == 0x000210, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_MakeRotFromXZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_SelectRotator_ReturnValue) == 0x000228, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000240, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000258, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_Add_VectorVector_ReturnValue) == 0x000270, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000288, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_MakeTransform_ReturnValue) == 0x0002A0, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000300, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, CallFunc_FinishSpawningActor_ReturnValue) == 0x000308, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, K2Node_MakeStruct_GameplayEventData) == 0x000310, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, K2Node_DynamicCast_AsBuilding_Gameplay_Actor) == 0x0003C0, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::K2Node_DynamicCast_AsBuilding_Gameplay_Actor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, K2Node_DynamicCast_bSuccess) == 0x0003C8, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent) == 0x0003D0, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_SpawnBGA_, K2Node_DynamicCast_bSuccess_1) == 0x0003D8, "Member 'B_Prj_Athena_BGASpawner_C_SpawnBGA_::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function B_Prj_Athena_BGASpawner.B_Prj_Athena_BGASpawner_C.ReceiveHit
// 0x0148 (0x0148 - 0x0000)
struct B_Prj_Athena_BGASpawner_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0068(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_BGASpawner_C_ReceiveHit) == 0x000008, "Wrong alignment on B_Prj_Athena_BGASpawner_C_ReceiveHit");
static_assert(sizeof(B_Prj_Athena_BGASpawner_C_ReceiveHit) == 0x000148, "Wrong size on B_Prj_Athena_BGASpawner_C_ReceiveHit");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_Athena_BGASpawner_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ReceiveHit, Other) == 0x000008, "Member 'B_Prj_Athena_BGASpawner_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ReceiveHit, OtherComp) == 0x000010, "Member 'B_Prj_Athena_BGASpawner_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'B_Prj_Athena_BGASpawner_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ReceiveHit, HitLocation) == 0x000020, "Member 'B_Prj_Athena_BGASpawner_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ReceiveHit, HitNormal) == 0x000038, "Member 'B_Prj_Athena_BGASpawner_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ReceiveHit, NormalImpulse) == 0x000050, "Member 'B_Prj_Athena_BGASpawner_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ReceiveHit, Hit) == 0x000068, "Member 'B_Prj_Athena_BGASpawner_C_ReceiveHit::Hit' has a wrong offset!");

// Function B_Prj_Athena_BGASpawner.B_Prj_Athena_BGASpawner_C.GetClosestPoint
// 0x00F0 (0x00F0 - 0x0000)
struct B_Prj_Athena_BGASpawner_C_GetClosestPoint final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartingPoint;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Point;                                             // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_BGASpawner_C_GetClosestPoint) == 0x000008, "Wrong alignment on B_Prj_Athena_BGASpawner_C_GetClosestPoint");
static_assert(sizeof(B_Prj_Athena_BGASpawner_C_GetClosestPoint) == 0x0000F0, "Wrong size on B_Prj_Athena_BGASpawner_C_GetClosestPoint");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, Component) == 0x000000, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::Component' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, StartingPoint) == 0x000008, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::StartingPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, Point) == 0x000020, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::Point' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x000050, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x000068, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000088, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, CallFunc_Normal_ReturnValue) == 0x000090, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A8, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_GetClosestPoint, CallFunc_SelectVector_ReturnValue) == 0x0000D8, "Member 'B_Prj_Athena_BGASpawner_C_GetClosestPoint::CallFunc_SelectVector_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_BGASpawner.B_Prj_Athena_BGASpawner_C.ExecuteUbergraph_B_Prj_Athena_BGASpawner
// 0x0348 (0x0348 - 0x0000)
struct B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0070(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActorSimulatePhysics_ReturnValue;      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_WithGravity_Parent_C*       K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPoint_Point;                    // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnBGA__ReturnValue;                    // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnBGA__ReturnValue_1;                  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner) == 0x000008, "Wrong alignment on B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner");
static_assert(sizeof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner) == 0x000348, "Wrong size on B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, K2Node_Event_MyComp) == 0x000008, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, K2Node_Event_Other) == 0x000010, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, K2Node_Event_OtherComp) == 0x000018, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, K2Node_Event_bSelfMoved) == 0x000020, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, K2Node_Event_HitLocation) == 0x000028, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, K2Node_Event_HitNormal) == 0x000040, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, K2Node_Event_NormalImpulse) == 0x000058, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, K2Node_Event_Hit) == 0x000070, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, Temp_bool_Has_Been_Initd_Variable) == 0x000150, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_bBlockingHit) == 0x000151, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_bInitialOverlap) == 0x000152, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_Time) == 0x000154, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_Distance) == 0x000158, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_Location) == 0x000160, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_Normal) == 0x000190, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A8, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_PhysMat) == 0x0001C0, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_HitActor) == 0x0001C8, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_HitComponent) == 0x0001D0, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_HitBoneName) == 0x0001D8, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_BoneName) == 0x0001DC, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'B_Prj_Athena_BGASpawner_C_ExecuteUbergraph_B_Prj_Athena_BGASpawner::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
