#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_ShockGrenade_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_ShockGrenade_Parent.B_Prj_Athena_ShockGrenade_Parent_C
// 0x0280 (0x0C70 - 0x09F0)
class AB_Prj_Athena_ShockGrenade_Parent_C : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortSoundIndicatorComponent*           FortSoundIndicator;                                // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BeepTimer;                                         // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Fuse_Particle;                                     // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ShockGrenadeMesh;                                  // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        GrenadeFuse_AudioComponent;                        // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Distance;                                   // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Explosion;                                       // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_DistantSound;                                  // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_CloseSound;                                    // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_GrenadeFuseSound;                              // 0x0A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0A50(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              Target;                                            // 0x0A68(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_BeepSound;                                     // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0A78(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StuckVehicle;                                      // 0x0A90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A91[0x7];                                      // 0x0A91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      DestroyObjectTypes;                                // 0x0A98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DestroyDistance;                                   // 0x0AA8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ShouldDestroy;                                     // 0x0AD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         LaunchVelocity;                                    // 0x0AF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ExplodeDelay;                                      // 0x0B20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         EnemiesTakeFallDamage;                             // 0x0B48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         AllPlayersTakeFallDamage;                          // 0x0B70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             Cue_StopSound;                                     // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ChestLootTableName;                                // 0x0BA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FeedbackCue;                                       // 0x0BA4(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HitWater;                                          // 0x0BA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA9[0x7];                                      // 0x0BA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Water_Debris_Explosion;                            // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_WaterExplosion;                                  // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     TargetVehicle;                                     // 0x0BC0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_KnockbackStatus;                                // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_BuildingPhysocs;                               // 0x0BD0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD4[0x4];                                      // 0x0BD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_BuildingImpulseMult;                           // 0x0BD8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraSystem*                         NS_Explosion;                                      // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NS_WaterExplosion;                                 // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_VehicleImpulseMult;                            // 0x0C10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_PhysicsPawnObjectMult;                         // 0x0C38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PhysicsPawnObjectForceModifier;                    // 0x0C60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C64[0x4];                                      // 0x0C64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            FortAIPawn;                                        // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileBounceDelegate__DelegateSignature(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	struct FVector CalculateLaunchVel(class AActor* Target_0);
	void ExecuteUbergraph_B_Prj_Athena_ShockGrenade_Parent(int32 EntryPoint);
	void GetLaunchOriginPoint(struct FVector* HitLocation_0);
	void Handle_Pawn_Detach_RC();
	void LaunchBuldingActors(class AActor* Actor);
	void LaunchFortAIPawn();
	void LaunchNonPawnActors(class AActor* Actor);
	void LaunchPlayerVehicle();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnStop(const struct FHitResult& Hit);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void QuestSendShockwaveTag();
	void ReceiveBeginPlay();
	void Stop_Rotation();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_ShockGrenade_Parent_C">();
	}
	static class AB_Prj_Athena_ShockGrenade_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_ShockGrenade_Parent_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_ShockGrenade_Parent_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_ShockGrenade_Parent_C");
static_assert(sizeof(AB_Prj_Athena_ShockGrenade_Parent_C) == 0x000C70, "Wrong size on AB_Prj_Athena_ShockGrenade_Parent_C");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, UberGraphFrame) == 0x0009F0, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, FortSoundIndicator) == 0x0009F8, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::FortSoundIndicator' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, BeepTimer) == 0x000A00, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::BeepTimer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Fuse_Particle) == 0x000A08, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Fuse_Particle' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, ShockGrenadeMesh) == 0x000A10, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::ShockGrenadeMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, RotatingMovement) == 0x000A18, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, GrenadeFuse_AudioComponent) == 0x000A20, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::GrenadeFuse_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Effect_Distance) == 0x000A28, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Effect_Distance' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, P_Explosion) == 0x000A30, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::P_Explosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Cue_DistantSound) == 0x000A38, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Cue_DistantSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Cue_CloseSound) == 0x000A40, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Cue_CloseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Cue_GrenadeFuseSound) == 0x000A48, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Cue_GrenadeFuseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, HitLocation) == 0x000A50, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Target) == 0x000A68, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Target' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Cue_BeepSound) == 0x000A70, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Cue_BeepSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, HitNormal) == 0x000A78, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::HitNormal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, StuckVehicle) == 0x000A90, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::StuckVehicle' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, DestroyObjectTypes) == 0x000A98, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::DestroyObjectTypes' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, DestroyDistance) == 0x000AA8, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::DestroyDistance' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, ShouldDestroy) == 0x000AD0, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::ShouldDestroy' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, LaunchVelocity) == 0x000AF8, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::LaunchVelocity' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, ExplodeDelay) == 0x000B20, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::ExplodeDelay' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, EnemiesTakeFallDamage) == 0x000B48, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::EnemiesTakeFallDamage' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, AllPlayersTakeFallDamage) == 0x000B70, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::AllPlayersTakeFallDamage' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Cue_StopSound) == 0x000B98, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Cue_StopSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, ChestLootTableName) == 0x000BA0, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::ChestLootTableName' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, FeedbackCue) == 0x000BA4, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::FeedbackCue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, HitWater) == 0x000BA8, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::HitWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Water_Debris_Explosion) == 0x000BB0, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Water_Debris_Explosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, P_WaterExplosion) == 0x000BB8, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::P_WaterExplosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, TargetVehicle) == 0x000BC0, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::TargetVehicle' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, GE_KnockbackStatus) == 0x000BC8, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::GE_KnockbackStatus' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Tag_BuildingPhysocs) == 0x000BD0, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Tag_BuildingPhysocs' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Row_BuildingImpulseMult) == 0x000BD8, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Row_BuildingImpulseMult' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, NS_Explosion) == 0x000C00, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::NS_Explosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, NS_WaterExplosion) == 0x000C08, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::NS_WaterExplosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Row_VehicleImpulseMult) == 0x000C10, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Row_VehicleImpulseMult' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, Row_PhysicsPawnObjectMult) == 0x000C38, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::Row_PhysicsPawnObjectMult' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, PhysicsPawnObjectForceModifier) == 0x000C60, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::PhysicsPawnObjectForceModifier' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ShockGrenade_Parent_C, FortAIPawn) == 0x000C68, "Member 'AB_Prj_Athena_ShockGrenade_Parent_C::FortAIPawn' has a wrong offset!");

}

