#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_AppleSun_

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_AppleSun_.B_Prj_Athena_AppleSun__C.BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0110 (0x0110 - 0x0000)
struct B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000110, "Wrong size on B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'B_Prj_Athena_AppleSun__C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function B_Prj_Athena_AppleSun_.B_Prj_Athena_AppleSun__C.ExecuteUbergraph_B_Prj_Athena_AppleSun_
// 0x0210 (0x0210 - 0x0000)
struct B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0038(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0118(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_) == 0x000008, "Wrong alignment on B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_");
static_assert(sizeof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_) == 0x000210, "Wrong size on B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_, K2Node_ComponentBoundEvent_Hit) == 0x000038, "Member 'B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_, K2Node_Event_Hit) == 0x000118, "Member 'B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_, CallFunc_ClampVectorSize_ReturnValue) == 0x0001F8, "Member 'B_Prj_Athena_AppleSun__C_ExecuteUbergraph_B_Prj_Athena_AppleSun_::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_AppleSun_.B_Prj_Athena_AppleSun__C.OnStop
// 0x00E0 (0x00E0 - 0x0000)
struct B_Prj_Athena_AppleSun__C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_AppleSun__C_OnStop) == 0x000008, "Wrong alignment on B_Prj_Athena_AppleSun__C_OnStop");
static_assert(sizeof(B_Prj_Athena_AppleSun__C_OnStop) == 0x0000E0, "Wrong size on B_Prj_Athena_AppleSun__C_OnStop");
static_assert(offsetof(B_Prj_Athena_AppleSun__C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Athena_AppleSun__C_OnStop::Hit' has a wrong offset!");

}

