#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Petrol

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Petrol.B_Prj_Petrol_C.Check If NoFuel Tag Present
// 0x0020 (0x0020 - 0x0000)
struct B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present final
{
public:
	class AFortAthenaVehicle*                     Vehicle_Actor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present) == 0x000008, "Wrong alignment on B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present");
static_assert(sizeof(B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present) == 0x000020, "Wrong size on B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present");
static_assert(offsetof(B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present, Vehicle_Actor) == 0x000000, "Member 'B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present::Vehicle_Actor' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000008, "Member 'B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000018, "Member 'B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present, CallFunc_GetValueAtLevel_ReturnValue) == 0x00001C, "Member 'B_Prj_Petrol_C_Check_If_NoFuel_Tag_Present::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");

// Function B_Prj_Petrol.B_Prj_Petrol_C.ExecuteUbergraph_B_Prj_Petrol
// 0x0400 (0x0400 - 0x0000)
struct B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0008(0x0020)()
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0038(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Petrol_Pickup_C*                   K2Node_DynamicCast_AsBGA_Petrol_Pickup;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00D0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsesVehicleFuelSystem_ReturnValue;        // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_ReturnValue;              // 0x01E0(0x0020)()
	class ABGA_Petrol_Pickup_C*                   K2Node_DynamicCast_AsBGA_Petrol_Pickup_1;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_PetrolWeapon_C*                      K2Node_DynamicCast_AsB_Petrol_Weapon;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x0240(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x2];                                      // 0x0342(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceBetweenActors_Distance;        // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetOwnerWeapon_ReturnValue;               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmmoCostPerFire_ReturnValue;           // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetOwnerWeapon_ReturnValue_1;             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_4;              // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol) == 0x000008, "Wrong alignment on B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol");
static_assert(sizeof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol) == 0x000400, "Wrong size on B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, EntryPoint) == 0x000000, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, Temp_struct_Variable) == 0x000008, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_HitActors) == 0x000028, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_HitResults) == 0x000038, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_Array_Get_Item) == 0x000050, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_AsBGA_Petrol_Pickup) == 0x000058, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_AsBGA_Petrol_Pickup' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_MyComp) == 0x000068, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_Other) == 0x000070, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_OtherComp) == 0x000078, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_bSelfMoved) == 0x000080, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_HitLocation) == 0x000088, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_HitNormal) == 0x0000A0, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_NormalImpulse) == 0x0000B8, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_Hit) == 0x0000D0, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x0001B0, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_AsFort_Vehicle_Interface_1) == 0x0001C8, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_AsFort_Vehicle_Interface_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_UsesVehicleFuelSystem_ReturnValue) == 0x0001D9, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_UsesVehicleFuelSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetGameplayTags_ReturnValue) == 0x0001E0, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_AsBGA_Petrol_Pickup_1) == 0x000200, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_AsBGA_Petrol_Pickup_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_bSuccess_3) == 0x000208, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_AsFort_Athena_Vehicle) == 0x000210, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_AsFort_Athena_Vehicle' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_bSuccess_4) == 0x000218, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetAttachParentActor_ReturnValue) == 0x000220, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_AsB_Petrol_Weapon) == 0x000228, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_AsB_Petrol_Weapon' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_DynamicCast_bSuccess_5) == 0x000230, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_IsValid_ReturnValue) == 0x000231, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetInstigator_ReturnValue) == 0x000238, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, K2Node_Event_Hit_1) == 0x000240, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::K2Node_Event_Hit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, Temp_bool_True_if_break_was_hit_Variable) == 0x000320, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000328, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_Not_PreBool_ReturnValue) == 0x000340, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_HasAuthority_ReturnValue) == 0x000341, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetDistanceBetweenActors_Distance) == 0x000344, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetDistanceBetweenActors_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_Less_FloatFloat_ReturnValue) == 0x000348, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, Temp_bool_Variable) == 0x000349, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00034A, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_BooleanOR_ReturnValue) == 0x00034B, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_Not_PreBool_ReturnValue_1) == 0x00034C, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_IsValid_ReturnValue_1) == 0x00034D, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetInstigator_ReturnValue_1) == 0x000350, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetValueAtLevel_ReturnValue) == 0x000358, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00035C, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_Round_ReturnValue) == 0x000360, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000364, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, Temp_int_Loop_Counter_Variable) == 0x000368, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_Less_IntInt_ReturnValue) == 0x00036C, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_Add_IntInt_ReturnValue) == 0x000370, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_BooleanAND_ReturnValue) == 0x000374, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetOwnerWeapon_ReturnValue) == 0x000378, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetOwnerWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_IsValid_ReturnValue_2) == 0x000380, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetAmmoCostPerFire_ReturnValue) == 0x000384, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetAmmoCostPerFire_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetOwnerWeapon_ReturnValue_1) == 0x000388, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetOwnerWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetSocketLocation_ReturnValue) == 0x000390, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0003A8, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetInstigator_ReturnValue_2) == 0x0003C0, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_K2_TeleportTo_ReturnValue) == 0x0003C8, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0003D0, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetInstigator_ReturnValue_3) == 0x0003D8, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetInstigator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetQuestManager_ReturnValue) == 0x0003E0, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0003E8, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetInstigator_ReturnValue_4) == 0x0003F0, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetInstigator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2) == 0x0003F8, "Member 'B_Prj_Petrol_C_ExecuteUbergraph_B_Prj_Petrol::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2' has a wrong offset!");

// Function B_Prj_Petrol.B_Prj_Petrol_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct B_Prj_Petrol_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors_0;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Petrol_C_OnExploded) == 0x000008, "Wrong alignment on B_Prj_Petrol_C_OnExploded");
static_assert(sizeof(B_Prj_Petrol_C_OnExploded) == 0x000020, "Wrong size on B_Prj_Petrol_C_OnExploded");
static_assert(offsetof(B_Prj_Petrol_C_OnExploded, HitActors_0) == 0x000000, "Member 'B_Prj_Petrol_C_OnExploded::HitActors_0' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_OnExploded, HitResults) == 0x000010, "Member 'B_Prj_Petrol_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_Petrol.B_Prj_Petrol_C.OnStop
// 0x00E0 (0x00E0 - 0x0000)
struct B_Prj_Petrol_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Petrol_C_OnStop) == 0x000008, "Wrong alignment on B_Prj_Petrol_C_OnStop");
static_assert(sizeof(B_Prj_Petrol_C_OnStop) == 0x0000E0, "Wrong size on B_Prj_Petrol_C_OnStop");
static_assert(offsetof(B_Prj_Petrol_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Petrol_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Petrol.B_Prj_Petrol_C.ReceiveHit
// 0x0148 (0x0148 - 0x0000)
struct B_Prj_Petrol_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0068(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Petrol_C_ReceiveHit) == 0x000008, "Wrong alignment on B_Prj_Petrol_C_ReceiveHit");
static_assert(sizeof(B_Prj_Petrol_C_ReceiveHit) == 0x000148, "Wrong size on B_Prj_Petrol_C_ReceiveHit");
static_assert(offsetof(B_Prj_Petrol_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_Petrol_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ReceiveHit, Other) == 0x000008, "Member 'B_Prj_Petrol_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ReceiveHit, OtherComp) == 0x000010, "Member 'B_Prj_Petrol_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'B_Prj_Petrol_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ReceiveHit, HitLocation) == 0x000020, "Member 'B_Prj_Petrol_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ReceiveHit, HitNormal) == 0x000038, "Member 'B_Prj_Petrol_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ReceiveHit, NormalImpulse) == 0x000050, "Member 'B_Prj_Petrol_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Petrol_C_ReceiveHit, Hit) == 0x000068, "Member 'B_Prj_Petrol_C_ReceiveHit::Hit' has a wrong offset!");

// Function B_Prj_Petrol.B_Prj_Petrol_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_Petrol_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Petrol_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Prj_Petrol_C_UserConstructionScript");
static_assert(sizeof(B_Prj_Petrol_C_UserConstructionScript) == 0x000004, "Wrong size on B_Prj_Petrol_C_UserConstructionScript");
static_assert(offsetof(B_Prj_Petrol_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'B_Prj_Petrol_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");

}

