#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Galileo_Lobster_Reflect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Galileo_Lobster_Reflect.B_Prj_Galileo_Lobster_Reflect_C
// 0x0080 (0x0BF0 - 0x0B70)
class AB_Prj_Galileo_Lobster_Reflect_C final : public AFortProjectileAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Galileo_Bun_Projectile_Glow;                     // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TracerMesh;                                        // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sniper_Rifle_SurfaceImpactSound;                   // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sniper_Rifle_PlayerImpactSound;                    // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalSize;                                         // 0x0B98(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ProjectileGravityScale;                            // 0x0BB0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UseGalileoBunTracer;                               // 0x0BD8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_BD9[0x7];                                      // 0x0BD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        GenericTracer;                                     // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            GenericMesh;                                       // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Galileo_Lobster_Reflect(int32 EntryPoint);
	void OnStop(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Galileo_Lobster_Reflect_C">();
	}
	static class AB_Prj_Galileo_Lobster_Reflect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Galileo_Lobster_Reflect_C>();
	}
};
static_assert(alignof(AB_Prj_Galileo_Lobster_Reflect_C) == 0x000008, "Wrong alignment on AB_Prj_Galileo_Lobster_Reflect_C");
static_assert(sizeof(AB_Prj_Galileo_Lobster_Reflect_C) == 0x000BF0, "Wrong size on AB_Prj_Galileo_Lobster_Reflect_C");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, UberGraphFrame) == 0x000B70, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, P_Galileo_Bun_Projectile_Glow) == 0x000B78, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::P_Galileo_Bun_Projectile_Glow' has a wrong offset!");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, TracerMesh) == 0x000B80, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::TracerMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, Sniper_Rifle_SurfaceImpactSound) == 0x000B88, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::Sniper_Rifle_SurfaceImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, Sniper_Rifle_PlayerImpactSound) == 0x000B90, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::Sniper_Rifle_PlayerImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, DecalSize) == 0x000B98, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::DecalSize' has a wrong offset!");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, ProjectileGravityScale) == 0x000BB0, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::ProjectileGravityScale' has a wrong offset!");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, UseGalileoBunTracer) == 0x000BD8, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::UseGalileoBunTracer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, GenericTracer) == 0x000BE0, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::GenericTracer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Galileo_Lobster_Reflect_C, GenericMesh) == 0x000BE8, "Member 'AB_Prj_Galileo_Lobster_Reflect_C::GenericMesh' has a wrong offset!");

}

