#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_FragGrenade

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "B_Prj_Athena_Grenade_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_FragGrenade.B_Prj_Athena_FragGrenade_C
// 0x0030 (0x0BB0 - 0x0B80)
class AB_Prj_Athena_FragGrenade_C final : public AB_Prj_Athena_Grenade_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_FragGrenade_C;         // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Object_FloatingInWater;                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SurfaceTypeSoundComponent_C*        BP_SurfaceTypeSoundComponent;                      // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PreExploWarning_PreExplo_E5859FFE443F57359EC2C0AB73DFA4CD; // 0x0B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PreExploWarning__Direction_E5859FFE443F57359EC2C0AB73DFA4CD; // 0x0B9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9D[0x3];                                      // 0x0B9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PreExploWarning;                                   // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FeedbackCue;                                       // 0x0BA8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_3_WaterInteractionOnExitWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsLastBody);
	void ExecuteUbergraph_B_Prj_Athena_FragGrenade(int32 EntryPoint);
	void FuseEnded();
	void OnBounce(const struct FHitResult& Hit);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void Pre_Explo_Audio_Tell();
	void PreExploWarning__FinishedFunc();
	void PreExploWarning__UpdateFunc();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_FragGrenade_C">();
	}
	static class AB_Prj_Athena_FragGrenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_FragGrenade_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_FragGrenade_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_FragGrenade_C");
static_assert(sizeof(AB_Prj_Athena_FragGrenade_C) == 0x000BB0, "Wrong size on AB_Prj_Athena_FragGrenade_C");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, UberGraphFrame_B_Prj_Athena_FragGrenade_C) == 0x000B80, "Member 'AB_Prj_Athena_FragGrenade_C::UberGraphFrame_B_Prj_Athena_FragGrenade_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, NS_Object_FloatingInWater) == 0x000B88, "Member 'AB_Prj_Athena_FragGrenade_C::NS_Object_FloatingInWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, BP_SurfaceTypeSoundComponent) == 0x000B90, "Member 'AB_Prj_Athena_FragGrenade_C::BP_SurfaceTypeSoundComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, PreExploWarning_PreExplo_E5859FFE443F57359EC2C0AB73DFA4CD) == 0x000B98, "Member 'AB_Prj_Athena_FragGrenade_C::PreExploWarning_PreExplo_E5859FFE443F57359EC2C0AB73DFA4CD' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, PreExploWarning__Direction_E5859FFE443F57359EC2C0AB73DFA4CD) == 0x000B9C, "Member 'AB_Prj_Athena_FragGrenade_C::PreExploWarning__Direction_E5859FFE443F57359EC2C0AB73DFA4CD' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, PreExploWarning) == 0x000BA0, "Member 'AB_Prj_Athena_FragGrenade_C::PreExploWarning' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_FragGrenade_C, FeedbackCue) == 0x000BA8, "Member 'AB_Prj_Athena_FragGrenade_C::FeedbackCue' has a wrong offset!");

}

