#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Consumable_Thrown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_Consumable_Thrown.B_Prj_Athena_Consumable_Thrown_C
// 0x00B8 (0x0AA8 - 0x09F0)
class AB_Prj_Athena_Consumable_Thrown_C : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Trail;                                     // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_Trail;                                          // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemDefinition;                                    // 0x0A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Projectile_Max_Lifetime;                           // 0x0A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasExploded_;                                     // 0x0A24(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A25[0x3];                                      // 0x0A25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Impact_Location;                                   // 0x0A28(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         FX_Linger_Time;                                    // 0x0A40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A44[0x4];                                      // 0x0A44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Lifespan_Timer;                                    // 0x0A48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPositionOffset;                               // 0x0A50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            PickUp;                                            // 0x0A68(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         SpawnFX;                                           // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         SpawnFX_Water;                                     // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         Bounce_Off_FX;                                     // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpawnSound;                                        // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Splash_Sound_;                                     // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterSpawnDelay;                                   // 0x0A98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9C[0x4];                                      // 0x0A9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ThrowSoundAttachedToPlayer;                        // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void Broadcast_Pickup_Projectile_Created();
	void Deactivate_Trail_FX_System();
	void ExecuteUbergraph_B_Prj_Athena_Consumable_Thrown(int32 EntryPoint);
	void Get_Spawned_Pickup_Optional_Owner_PC(class AFortPlayerController** Optional_Owner_PC);
	void Mark(class AActor* NewParam);
	void On_Pickup_Spawned(class AFortPickup* Spawned_Pickup);
	void OnBounce(const struct FHitResult& Hit);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnHomingPassedTarget();
	void OnReachedLockTargetDistanceThreshold();
	void OnRep_Impact_Location();
	void OnRep_Pickup();
	void OnStop(const struct FHitResult& Hit);
	void PlayThrowSound();
	void ReceiveBeginPlay();
	void SetItemDefinition(class UFortWorldItemDefinition* In_Item_Definition);
	void SpawnedItemFx();
	void SpawnItem();
	void Timeout();
	void WaterImpactItemFX();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_Consumable_Thrown_C">();
	}
	static class AB_Prj_Athena_Consumable_Thrown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_Consumable_Thrown_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_Consumable_Thrown_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_Consumable_Thrown_C");
static_assert(sizeof(AB_Prj_Athena_Consumable_Thrown_C) == 0x000AA8, "Wrong size on AB_Prj_Athena_Consumable_Thrown_C");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, UberGraphFrame) == 0x0009F0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Niagara_Trail) == 0x0009F8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Niagara_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SkeletalMesh) == 0x000A00, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, StaticMesh) == 0x000A08, "Member 'AB_Prj_Athena_Consumable_Thrown_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, FX_Trail) == 0x000A10, "Member 'AB_Prj_Athena_Consumable_Thrown_C::FX_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, ItemDefinition) == 0x000A18, "Member 'AB_Prj_Athena_Consumable_Thrown_C::ItemDefinition' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Projectile_Max_Lifetime) == 0x000A20, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Projectile_Max_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, bHasExploded_) == 0x000A24, "Member 'AB_Prj_Athena_Consumable_Thrown_C::bHasExploded_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Impact_Location) == 0x000A28, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Impact_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, FX_Linger_Time) == 0x000A40, "Member 'AB_Prj_Athena_Consumable_Thrown_C::FX_Linger_Time' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Lifespan_Timer) == 0x000A48, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Lifespan_Timer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnPositionOffset) == 0x000A50, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnPositionOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, PickUp) == 0x000A68, "Member 'AB_Prj_Athena_Consumable_Thrown_C::PickUp' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnFX) == 0x000A70, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnFX_Water) == 0x000A78, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnFX_Water' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Bounce_Off_FX) == 0x000A80, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Bounce_Off_FX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnSound) == 0x000A88, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Splash_Sound_) == 0x000A90, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Splash_Sound_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, WaterSpawnDelay) == 0x000A98, "Member 'AB_Prj_Athena_Consumable_Thrown_C::WaterSpawnDelay' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, ThrowSoundAttachedToPlayer) == 0x000AA0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::ThrowSoundAttachedToPlayer' has a wrong offset!");

}

