#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_WestSausage_Parallel_Athena

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Ranged_WestSausage_Parallel_Athena.B_Ranged_WestSausage_Parallel_Athena_C.AllowStopSwinging
// 0x0001 (0x0001 - 0x0000)
struct B_Ranged_WestSausage_Parallel_Athena_C_AllowStopSwinging final
{
public:
	bool                                          OutputPin;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_WestSausage_Parallel_Athena_C_AllowStopSwinging) == 0x000001, "Wrong alignment on B_Ranged_WestSausage_Parallel_Athena_C_AllowStopSwinging");
static_assert(sizeof(B_Ranged_WestSausage_Parallel_Athena_C_AllowStopSwinging) == 0x000001, "Wrong size on B_Ranged_WestSausage_Parallel_Athena_C_AllowStopSwinging");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_AllowStopSwinging, OutputPin) == 0x000000, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_AllowStopSwinging::OutputPin' has a wrong offset!");

// Function B_Ranged_WestSausage_Parallel_Athena.B_Ranged_WestSausage_Parallel_Athena_C.ApplyCooldown
// 0x0001 (0x0001 - 0x0000)
struct B_Ranged_WestSausage_Parallel_Athena_C_ApplyCooldown final
{
public:
	bool                                          Force;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_WestSausage_Parallel_Athena_C_ApplyCooldown) == 0x000001, "Wrong alignment on B_Ranged_WestSausage_Parallel_Athena_C_ApplyCooldown");
static_assert(sizeof(B_Ranged_WestSausage_Parallel_Athena_C_ApplyCooldown) == 0x000001, "Wrong size on B_Ranged_WestSausage_Parallel_Athena_C_ApplyCooldown");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_ApplyCooldown, Force) == 0x000000, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_ApplyCooldown::Force' has a wrong offset!");

// Function B_Ranged_WestSausage_Parallel_Athena.B_Ranged_WestSausage_Parallel_Athena_C.attach
// 0x0008 (0x0008 - 0x0000)
struct B_Ranged_WestSausage_Parallel_Athena_C_attach final
{
public:
	class ABGA_WestSausage_AttachmentPoint_C*     Attach_Point_BGA;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_WestSausage_Parallel_Athena_C_attach) == 0x000008, "Wrong alignment on B_Ranged_WestSausage_Parallel_Athena_C_attach");
static_assert(sizeof(B_Ranged_WestSausage_Parallel_Athena_C_attach) == 0x000008, "Wrong size on B_Ranged_WestSausage_Parallel_Athena_C_attach");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_attach, Attach_Point_BGA) == 0x000000, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_attach::Attach_Point_BGA' has a wrong offset!");

// Function B_Ranged_WestSausage_Parallel_Athena.B_Ranged_WestSausage_Parallel_Athena_C.CalculateChargeTime
// 0x0004 (0x0004 - 0x0000)
struct B_Ranged_WestSausage_Parallel_Athena_C_CalculateChargeTime final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateChargeTime) == 0x000004, "Wrong alignment on B_Ranged_WestSausage_Parallel_Athena_C_CalculateChargeTime");
static_assert(sizeof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateChargeTime) == 0x000004, "Wrong size on B_Ranged_WestSausage_Parallel_Athena_C_CalculateChargeTime");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateChargeTime, Time) == 0x000000, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateChargeTime::Time' has a wrong offset!");

// Function B_Ranged_WestSausage_Parallel_Athena.B_Ranged_WestSausage_Parallel_Athena_C.CalculateCooldownTime
// 0x0078 (0x0078 - 0x0000)
struct B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime final
{
public:
	float                                         Output;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime) == 0x000008, "Wrong alignment on B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime");
static_assert(sizeof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime) == 0x000078, "Wrong size on B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, Output) == 0x000000, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::Output' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000008, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000020, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_BreakVector2D_X) == 0x000024, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_MakeVector2D_ReturnValue_1) == 0x000030, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000040, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_BreakVector2D_X_1) == 0x000044, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_BreakVector2D_Y_1) == 0x000048, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x00004C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000050, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000054, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000058, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_FClamp_ReturnValue) == 0x000060, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_SelectFloat_ReturnValue) == 0x000064, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_FClamp_ReturnValue_1) == 0x000068, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_SelectFloat_ReturnValue_1) == 0x00006C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000070, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime, CallFunc_Add_FloatFloat_ReturnValue) == 0x000074, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateCooldownTime::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function B_Ranged_WestSausage_Parallel_Athena.B_Ranged_WestSausage_Parallel_Athena_C.CalculateDetachmentForce
// 0x0458 (0x0458 - 0x0000)
struct B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce final
{
public:
	struct FVector                                VectorToAttachPoint;                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Launch_;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LaunchVector_;                                     // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchVector;                                      // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         LaunchOverMinForce;                                // 0x0068(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         LaunchOverMaxForce;                                // 0x0090(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         MinZForceMultiplier;                               // 0x00B8(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         OverallMultiplier;                                 // 0x00E0(0x0028)(Edit, BlueprintVisible)
	bool                                          Launch;                                            // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VecToAttachPoint_Dir;                              // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VecToAttachPoint_Length;                           // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Swinging_CheckGrounded_Grounded_;         // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Swinging_CheckGrounded_HitNormal;         // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Swinging_CheckGrounded_Distance;          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_2;         // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_3;                     // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_3;         // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_4;         // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue;                     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue_1;                   // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue; // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_5;         // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_5;        // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_4;                     // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_5;                     // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_6;         // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x043D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43E[0x2];                                      // 0x043E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce) == 0x000008, "Wrong alignment on B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce");
static_assert(sizeof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce) == 0x000458, "Wrong size on B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, VectorToAttachPoint) == 0x000000, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::VectorToAttachPoint' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, Launch_) == 0x000018, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::Launch_' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, LaunchVector_) == 0x000020, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::LaunchVector_' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, ReturnValue) == 0x000038, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, LaunchVector) == 0x000050, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::LaunchVector' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, LaunchOverMinForce) == 0x000068, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::LaunchOverMinForce' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, LaunchOverMaxForce) == 0x000090, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::LaunchOverMaxForce' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, MinZForceMultiplier) == 0x0000B8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::MinZForceMultiplier' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, OverallMultiplier) == 0x0000E0, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::OverallMultiplier' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, Launch) == 0x000108, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::Launch' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, VecToAttachPoint_Dir) == 0x000110, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::VecToAttachPoint_Dir' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, VecToAttachPoint_Length) == 0x000128, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::VecToAttachPoint_Length' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_VSize_ReturnValue) == 0x00012C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000130, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Divide_VectorVector_ReturnValue) == 0x000148, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector2D_X) == 0x000160, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector2D_Y) == 0x000164, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector2D_X_1) == 0x000168, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector2D_Y_1) == 0x00016C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000170, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000174, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector2D_X_2) == 0x000178, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector2D_Y_2) == 0x00017C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000180, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_VSize_ReturnValue_1) == 0x000184, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_GetAttachParentActor_ReturnValue) == 0x000188, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_IsValid_ReturnValue) == 0x000190, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Swinging_CheckGrounded_Grounded_) == 0x000191, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Swinging_CheckGrounded_Grounded_' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Swinging_CheckGrounded_HitNormal) == 0x000198, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Swinging_CheckGrounded_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Swinging_CheckGrounded_Distance) == 0x0001B0, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Swinging_CheckGrounded_Distance' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x0001D0, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, Temp_struct_Variable) == 0x0001D8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001E8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FClamp_ReturnValue) == 0x0001EC, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_SelectFloat_ReturnValue) == 0x0001F0, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_GetValueAtLevel_ReturnValue) == 0x0001F4, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FClamp_ReturnValue_1) == 0x0001F8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x000200, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_SelectFloat_ReturnValue_1) == 0x000218, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00021C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000220, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000224, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Normal_ReturnValue) == 0x000228, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FClamp_ReturnValue_2) == 0x000240, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Conv_FloatToVector_ReturnValue_2) == 0x000248, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Conv_FloatToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, Temp_struct_Variable_1) == 0x000260, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000270, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector_X) == 0x000288, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector_Y) == 0x00028C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector_Z) == 0x000290, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FClamp_ReturnValue_3) == 0x000294, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Conv_FloatToVector_ReturnValue_3) == 0x000298, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Conv_FloatToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FMax_ReturnValue) == 0x0002B0, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0002B8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Conv_FloatToVector_ReturnValue_4) == 0x0002D0, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Conv_FloatToVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, Temp_bool_Variable) == 0x0002E8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0002F0, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Dot_VectorVector_ReturnValue) == 0x000308, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, K2Node_Select_Default) == 0x000310, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FTrunc64_ReturnValue) == 0x000320, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FTrunc64_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector2D_X_3) == 0x000328, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector2D_Y_3) == 0x00032C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Abs_ReturnValue) == 0x000330, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Subtract_FloatFloat_ReturnValue_4) == 0x000334, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Subtract_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FTrunc64_ReturnValue_1) == 0x000338, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FTrunc64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000340, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue) == 0x000344, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Add_FloatFloat_ReturnValue) == 0x000348, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Sqrt_ReturnValue) == 0x00034C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000350, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000354, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Conv_FloatToVector_ReturnValue_5) == 0x000358, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Conv_FloatToVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Subtract_FloatFloat_ReturnValue_5) == 0x000370, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Subtract_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000374, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FClamp_ReturnValue_4) == 0x000378, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FClamp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_SelectFloat_ReturnValue_2) == 0x00037C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FClamp_ReturnValue_5) == 0x000380, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FClamp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_SelectFloat_ReturnValue_3) == 0x000384, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000388, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00038C, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Conv_FloatToVector_ReturnValue_6) == 0x000390, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Conv_FloatToVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x0003A8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x0003C0, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0003D8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector_X_1) == 0x0003F0, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector_Y_1) == 0x0003F4, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector_Z_1) == 0x0003F8, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_FMax_ReturnValue_1) == 0x0003FC, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_MakeVector_ReturnValue) == 0x000400, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_Multiply_VectorVector_ReturnValue_5) == 0x000418, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_Multiply_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector_X_2) == 0x000430, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce, CallFunc_BreakVector_Y_2) == 0x000434, "Member 'B_Ranged_WestSausage_Parallel_Athena_C_CalculateDetachmentForce::CallFunc_BreakVector_Y_2' has a wrong offset!");
