#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_RealitySaplingsWeeds_Spawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_ActorSpawner_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_RealitySaplingsWeeds_Spawner.B_RealitySaplingsWeeds_Spawner_C
// 0x00F8 (0x0528 - 0x0430)
class AB_RealitySaplingsWeeds_Spawner_C final : public AB_ActorSpawner_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_RealitySaplingsWeeds_Spawner_C;   // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        LootDropDirection;                                 // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AB_SMA_Athena_RealitySapling_Parent_C*  Sapling;                                           // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FHitResult                             LastHit;                                           // 0x0448(0x00E0)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)

public:
	void ExecuteUbergraph_B_RealitySaplingsWeeds_Spawner(int32 EntryPoint);
	void ReceiveDestroyed();
	void ServerActorSpawned(class AActor* Actor);
	void StartEQSSpawnLoop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_RealitySaplingsWeeds_Spawner_C">();
	}
	static class AB_RealitySaplingsWeeds_Spawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_RealitySaplingsWeeds_Spawner_C>();
	}
};
static_assert(alignof(AB_RealitySaplingsWeeds_Spawner_C) == 0x000008, "Wrong alignment on AB_RealitySaplingsWeeds_Spawner_C");
static_assert(sizeof(AB_RealitySaplingsWeeds_Spawner_C) == 0x000528, "Wrong size on AB_RealitySaplingsWeeds_Spawner_C");
static_assert(offsetof(AB_RealitySaplingsWeeds_Spawner_C, UberGraphFrame_B_RealitySaplingsWeeds_Spawner_C) == 0x000430, "Member 'AB_RealitySaplingsWeeds_Spawner_C::UberGraphFrame_B_RealitySaplingsWeeds_Spawner_C' has a wrong offset!");
static_assert(offsetof(AB_RealitySaplingsWeeds_Spawner_C, LootDropDirection) == 0x000438, "Member 'AB_RealitySaplingsWeeds_Spawner_C::LootDropDirection' has a wrong offset!");
static_assert(offsetof(AB_RealitySaplingsWeeds_Spawner_C, Sapling) == 0x000440, "Member 'AB_RealitySaplingsWeeds_Spawner_C::Sapling' has a wrong offset!");
static_assert(offsetof(AB_RealitySaplingsWeeds_Spawner_C, LastHit) == 0x000448, "Member 'AB_RealitySaplingsWeeds_Spawner_C::LastHit' has a wrong offset!");

}

