#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_RealitySaplingsMushrooms_Spawner

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_RealitySaplingsMushrooms_Spawner.B_RealitySaplingsMushrooms_Spawner_C.ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner
// 0x0010 (0x0010 - 0x0000)
struct B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner) == 0x000008, "Wrong alignment on B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner");
static_assert(sizeof(B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner) == 0x000010, "Wrong size on B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner");
static_assert(offsetof(B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner, EntryPoint) == 0x000000, "Member 'B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner, K2Node_Event_Actor) == 0x000008, "Member 'B_RealitySaplingsMushrooms_Spawner_C_ExecuteUbergraph_B_RealitySaplingsMushrooms_Spawner::K2Node_Event_Actor' has a wrong offset!");

// Function B_RealitySaplingsMushrooms_Spawner.B_RealitySaplingsMushrooms_Spawner_C.ServerActorSpawned
// 0x0008 (0x0008 - 0x0000)
struct B_RealitySaplingsMushrooms_Spawner_C_ServerActorSpawned final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_RealitySaplingsMushrooms_Spawner_C_ServerActorSpawned) == 0x000008, "Wrong alignment on B_RealitySaplingsMushrooms_Spawner_C_ServerActorSpawned");
static_assert(sizeof(B_RealitySaplingsMushrooms_Spawner_C_ServerActorSpawned) == 0x000008, "Wrong size on B_RealitySaplingsMushrooms_Spawner_C_ServerActorSpawned");
static_assert(offsetof(B_RealitySaplingsMushrooms_Spawner_C_ServerActorSpawned, Actor) == 0x000000, "Member 'B_RealitySaplingsMushrooms_Spawner_C_ServerActorSpawned::Actor' has a wrong offset!");

}

