#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Shotgun_TwoShot_Athena

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_Shotgun_TwoShot_Athena.B_Shotgun_TwoShot_Athena_C.ExecuteUbergraph_B_Shotgun_TwoShot_Athena
// 0x0088 (0x0088 - 0x0000)
struct B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena) == 0x000008, "Wrong alignment on B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena");
static_assert(sizeof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena) == 0x000088, "Wrong size on B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, EntryPoint) == 0x000000, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000008, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CustomEvent_NotifyName_4) == 0x000020, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CustomEvent_NotifyName_3) == 0x000024, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CustomEvent_NotifyName_2) == 0x000040, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CustomEvent_NotifyName_1) == 0x000044, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_CustomEvent_NotifyName) == 0x000060, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, Temp_name_Variable) == 0x000064, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, Temp_bool_Has_Been_Initd_Variable) == 0x000068, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_Event_bPersistentFire) == 0x000069, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_Event_bSecondaryFire) == 0x00006A, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, CallFunc_GetInstigator_ReturnValue) == 0x000070, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000078, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, Temp_bool_IsClosed_Variable) == 0x000081, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena, CallFunc_PlayAnimMontage_ReturnValue) == 0x000084, "Member 'B_Shotgun_TwoShot_Athena_C_ExecuteUbergraph_B_Shotgun_TwoShot_Athena::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");

// Function B_Shotgun_TwoShot_Athena.B_Shotgun_TwoShot_Athena_C.OnBlendOut_5DFE770447D29FB412837FADDE29EB56
// 0x0004 (0x0004 - 0x0000)
struct B_Shotgun_TwoShot_Athena_C_OnBlendOut_5DFE770447D29FB412837FADDE29EB56 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Shotgun_TwoShot_Athena_C_OnBlendOut_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong alignment on B_Shotgun_TwoShot_Athena_C_OnBlendOut_5DFE770447D29FB412837FADDE29EB56");
static_assert(sizeof(B_Shotgun_TwoShot_Athena_C_OnBlendOut_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong size on B_Shotgun_TwoShot_Athena_C_OnBlendOut_5DFE770447D29FB412837FADDE29EB56");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_OnBlendOut_5DFE770447D29FB412837FADDE29EB56, NotifyName) == 0x000000, "Member 'B_Shotgun_TwoShot_Athena_C_OnBlendOut_5DFE770447D29FB412837FADDE29EB56::NotifyName' has a wrong offset!");

// Function B_Shotgun_TwoShot_Athena.B_Shotgun_TwoShot_Athena_C.OnCompleted_5DFE770447D29FB412837FADDE29EB56
// 0x0004 (0x0004 - 0x0000)
struct B_Shotgun_TwoShot_Athena_C_OnCompleted_5DFE770447D29FB412837FADDE29EB56 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Shotgun_TwoShot_Athena_C_OnCompleted_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong alignment on B_Shotgun_TwoShot_Athena_C_OnCompleted_5DFE770447D29FB412837FADDE29EB56");
static_assert(sizeof(B_Shotgun_TwoShot_Athena_C_OnCompleted_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong size on B_Shotgun_TwoShot_Athena_C_OnCompleted_5DFE770447D29FB412837FADDE29EB56");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_OnCompleted_5DFE770447D29FB412837FADDE29EB56, NotifyName) == 0x000000, "Member 'B_Shotgun_TwoShot_Athena_C_OnCompleted_5DFE770447D29FB412837FADDE29EB56::NotifyName' has a wrong offset!");

// Function B_Shotgun_TwoShot_Athena.B_Shotgun_TwoShot_Athena_C.OnInterrupted_5DFE770447D29FB412837FADDE29EB56
// 0x0004 (0x0004 - 0x0000)
struct B_Shotgun_TwoShot_Athena_C_OnInterrupted_5DFE770447D29FB412837FADDE29EB56 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Shotgun_TwoShot_Athena_C_OnInterrupted_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong alignment on B_Shotgun_TwoShot_Athena_C_OnInterrupted_5DFE770447D29FB412837FADDE29EB56");
static_assert(sizeof(B_Shotgun_TwoShot_Athena_C_OnInterrupted_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong size on B_Shotgun_TwoShot_Athena_C_OnInterrupted_5DFE770447D29FB412837FADDE29EB56");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_OnInterrupted_5DFE770447D29FB412837FADDE29EB56, NotifyName) == 0x000000, "Member 'B_Shotgun_TwoShot_Athena_C_OnInterrupted_5DFE770447D29FB412837FADDE29EB56::NotifyName' has a wrong offset!");

// Function B_Shotgun_TwoShot_Athena.B_Shotgun_TwoShot_Athena_C.OnNotifyBegin_5DFE770447D29FB412837FADDE29EB56
// 0x0004 (0x0004 - 0x0000)
struct B_Shotgun_TwoShot_Athena_C_OnNotifyBegin_5DFE770447D29FB412837FADDE29EB56 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Shotgun_TwoShot_Athena_C_OnNotifyBegin_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong alignment on B_Shotgun_TwoShot_Athena_C_OnNotifyBegin_5DFE770447D29FB412837FADDE29EB56");
static_assert(sizeof(B_Shotgun_TwoShot_Athena_C_OnNotifyBegin_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong size on B_Shotgun_TwoShot_Athena_C_OnNotifyBegin_5DFE770447D29FB412837FADDE29EB56");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_OnNotifyBegin_5DFE770447D29FB412837FADDE29EB56, NotifyName) == 0x000000, "Member 'B_Shotgun_TwoShot_Athena_C_OnNotifyBegin_5DFE770447D29FB412837FADDE29EB56::NotifyName' has a wrong offset!");

// Function B_Shotgun_TwoShot_Athena.B_Shotgun_TwoShot_Athena_C.OnNotifyEnd_5DFE770447D29FB412837FADDE29EB56
// 0x0004 (0x0004 - 0x0000)
struct B_Shotgun_TwoShot_Athena_C_OnNotifyEnd_5DFE770447D29FB412837FADDE29EB56 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Shotgun_TwoShot_Athena_C_OnNotifyEnd_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong alignment on B_Shotgun_TwoShot_Athena_C_OnNotifyEnd_5DFE770447D29FB412837FADDE29EB56");
static_assert(sizeof(B_Shotgun_TwoShot_Athena_C_OnNotifyEnd_5DFE770447D29FB412837FADDE29EB56) == 0x000004, "Wrong size on B_Shotgun_TwoShot_Athena_C_OnNotifyEnd_5DFE770447D29FB412837FADDE29EB56");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_OnNotifyEnd_5DFE770447D29FB412837FADDE29EB56, NotifyName) == 0x000000, "Member 'B_Shotgun_TwoShot_Athena_C_OnNotifyEnd_5DFE770447D29FB412837FADDE29EB56::NotifyName' has a wrong offset!");

// Function B_Shotgun_TwoShot_Athena.B_Shotgun_TwoShot_Athena_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_Shotgun_TwoShot_Athena_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Shotgun_TwoShot_Athena_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Shotgun_TwoShot_Athena_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Shotgun_TwoShot_Athena_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_Shotgun_TwoShot_Athena_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Shotgun_TwoShot_Athena_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Shotgun_TwoShot_Athena_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_Shotgun_TwoShot_Athena_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

}

