#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Stair_Reinforced_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_Stair_Reinforced_Athena.B_Stair_Reinforced_Athena_C.ExecuteUbergraph_B_Stair_Reinforced_Athena
// 0x08D0 (0x08D0 - 0x0000)
struct B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0030(0x00E0)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x0140(0x00E0)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x0230(0x00E0)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x0380(0x00E0)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0460(0x00E0)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_5;              // 0x0540(0x00E0)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_6;              // 0x0620(0x00E0)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_701[0x7];                                      // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0708(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71A[0x6];                                      // 0x071A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72A[0x6];                                      // 0x072A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0730(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0748(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0750(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0768(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0788(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x07A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x07C0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x08B0(0x0018)()
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x08C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena) == 0x000010, "Wrong alignment on B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena");
static_assert(sizeof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena) == 0x0008D0, "Wrong size on B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, EntryPoint) == 0x000000, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000008, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000020, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_MakeStruct_ParticleSysParam) == 0x000030, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000110, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, Temp_float_Variable) == 0x000114, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000118, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000120, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_MakeStruct_ParticleSysParam_1) == 0x000140, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_BreakVector_X) == 0x000220, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_BreakVector_Y) == 0x000224, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_BreakVector_Z) == 0x000228, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_MakeStruct_ParticleSysParam_2) == 0x000230, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000310, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000314, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_MakeVector_ReturnValue) == 0x000318, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_MakeVector_ReturnValue_1) == 0x000330, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000348, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000360, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_MakeStruct_ParticleSysParam_3) == 0x000380, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_MakeStruct_ParticleSysParam_4) == 0x000460, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_MakeStruct_ParticleSysParam_5) == 0x000540, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_MakeStruct_ParticleSysParam_5' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_MakeStruct_ParticleSysParam_6) == 0x000620, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_MakeStruct_ParticleSysParam_6' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, Temp_bool_IsClosed_Variable) == 0x000700, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_MakeArray_Array) == 0x000708, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, Temp_bool_Has_Been_Initd_Variable) == 0x000718, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_IsValid_ReturnValue) == 0x000719, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000720, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_IsValid_ReturnValue_1) == 0x000728, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_IsValid_ReturnValue_2) == 0x000729, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_GetCameraLocation_ReturnValue) == 0x000730, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000748, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000750, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000768, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_VSize_ReturnValue) == 0x000780, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_Event_Damage) == 0x000784, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_Event_DamageTags) == 0x000788, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_Event_Momentum) == 0x0007A8, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_Event_HitInfo) == 0x0007C0, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_Event_InstigatedBy) == 0x0008A0, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_Event_DamageCauser) == 0x0008A8, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, K2Node_Event_EffectContext) == 0x0008B0, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0008C8, "Member 'B_Stair_Reinforced_Athena_C_ExecuteUbergraph_B_Stair_Reinforced_Athena::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");

// Function B_Stair_Reinforced_Athena.B_Stair_Reinforced_Athena_C.OnDeathPlayEffects
// 0x0148 (0x0148 - 0x0000)
struct B_Stair_Reinforced_Athena_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(B_Stair_Reinforced_Athena_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on B_Stair_Reinforced_Athena_C_OnDeathPlayEffects");
static_assert(sizeof(B_Stair_Reinforced_Athena_C_OnDeathPlayEffects) == 0x000148, "Wrong size on B_Stair_Reinforced_Athena_C_OnDeathPlayEffects");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'B_Stair_Reinforced_Athena_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'B_Stair_Reinforced_Athena_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'B_Stair_Reinforced_Athena_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_OnDeathPlayEffects, HitInfo) == 0x000040, "Member 'B_Stair_Reinforced_Athena_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_OnDeathPlayEffects, InstigatedBy) == 0x000120, "Member 'B_Stair_Reinforced_Athena_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_OnDeathPlayEffects, DamageCauser) == 0x000128, "Member 'B_Stair_Reinforced_Athena_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_OnDeathPlayEffects, EffectContext) == 0x000130, "Member 'B_Stair_Reinforced_Athena_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function B_Stair_Reinforced_Athena.B_Stair_Reinforced_Athena_C.IsInteractionAllowedInCreative
// 0x0050 (0x0050 - 0x0000)
struct B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative final
{
public:
	class UObjectInteractionBehavior*             InteractionBehavior;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_SoftClassPathToSoftClassRef_ReturnValue; // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative) == 0x000008, "Wrong alignment on B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative");
static_assert(sizeof(B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative) == 0x000050, "Wrong size on B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative, InteractionBehavior) == 0x000000, "Member 'B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative::InteractionBehavior' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative, ReturnValue) == 0x000008, "Member 'B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative, CallFunc_Conv_SoftClassPathToSoftClassRef_ReturnValue) == 0x000018, "Member 'B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative::CallFunc_Conv_SoftClassPathToSoftClassRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000040, "Member 'B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000048, "Member 'B_Stair_Reinforced_Athena_C_IsInteractionAllowedInCreative::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function B_Stair_Reinforced_Athena.B_Stair_Reinforced_Athena_C.IsTargetableByLinearMover
// 0x0001 (0x0001 - 0x0000)
struct B_Stair_Reinforced_Athena_C_IsTargetableByLinearMover final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Stair_Reinforced_Athena_C_IsTargetableByLinearMover) == 0x000001, "Wrong alignment on B_Stair_Reinforced_Athena_C_IsTargetableByLinearMover");
static_assert(sizeof(B_Stair_Reinforced_Athena_C_IsTargetableByLinearMover) == 0x000001, "Wrong size on B_Stair_Reinforced_Athena_C_IsTargetableByLinearMover");
static_assert(offsetof(B_Stair_Reinforced_Athena_C_IsTargetableByLinearMover, ReturnValue) == 0x000000, "Member 'B_Stair_Reinforced_Athena_C_IsTargetableByLinearMover::ReturnValue' has a wrong offset!");

}

