#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_UtilityItem_Generic_Athena

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_UtilityItem_Generic_Athena.B_UtilityItem_Generic_Athena_C.ThrowConsumableHudActionKey_Visible
// 0x0001 (0x0001 - 0x0000)
struct B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Visible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Visible) == 0x000001, "Wrong alignment on B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Visible");
static_assert(sizeof(B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Visible) == 0x000001, "Wrong size on B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Visible");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Visible, Visible) == 0x000000, "Member 'B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Visible::Visible' has a wrong offset!");

// Function B_UtilityItem_Generic_Athena.B_UtilityItem_Generic_Athena_C.ThrowConsumableHudActionKey_Targeting
// 0x0001 (0x0001 - 0x0000)
struct B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Targeting final
{
public:
	bool                                          Targeting;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Targeting) == 0x000001, "Wrong alignment on B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Targeting");
static_assert(sizeof(B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Targeting) == 0x000001, "Wrong size on B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Targeting");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Targeting, Targeting) == 0x000000, "Member 'B_UtilityItem_Generic_Athena_C_ThrowConsumableHudActionKey_Targeting::Targeting' has a wrong offset!");

// Function B_UtilityItem_Generic_Athena.B_UtilityItem_Generic_Athena_C.ExecuteUbergraph_B_UtilityItem_Generic_Athena
// 0x0090 (0x0090 - 0x0000)
struct B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility;    // 0x0004(0x0008)(NoDestructor)
	bool                                          K2Node_CustomEvent_Targeting;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_1;  // 0x0010(0x0008)(NoDestructor)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_2;  // 0x0018(0x0008)(NoDestructor)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_3;  // 0x0020(0x0008)(NoDestructor)
	TArray<struct FWeaponHudKeyActionVisibility>  K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_4;  // 0x0038(0x0008)(NoDestructor)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_5;  // 0x0040(0x0008)(NoDestructor)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_6;  // 0x0048(0x0008)(NoDestructor)
	TArray<struct FWeaponHudKeyActionVisibility>  K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ConstParm, ReferenceParm)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_7;  // 0x0060(0x0008)(NoDestructor)
	TArray<struct FWeaponHudKeyActionVisibility>  K2Node_MakeArray_Array_2;                          // 0x0068(0x0010)(ConstParm, ReferenceParm)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_8;  // 0x0078(0x0008)(NoDestructor)
	TArray<struct FWeaponHudKeyActionVisibility>  K2Node_MakeArray_Array_3;                          // 0x0080(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena) == 0x000008, "Wrong alignment on B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena");
static_assert(sizeof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena) == 0x000090, "Wrong size on B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, EntryPoint) == 0x000000, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeStruct_WeaponHudKeyActionVisibility) == 0x000004, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeStruct_WeaponHudKeyActionVisibility' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_CustomEvent_Targeting) == 0x00000C, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_CustomEvent_Targeting' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_CustomEvent_Visible) == 0x00000D, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeStruct_WeaponHudKeyActionVisibility_1) == 0x000010, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeStruct_WeaponHudKeyActionVisibility_1' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeStruct_WeaponHudKeyActionVisibility_2) == 0x000018, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeStruct_WeaponHudKeyActionVisibility_2' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeStruct_WeaponHudKeyActionVisibility_3) == 0x000020, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeStruct_WeaponHudKeyActionVisibility_3' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeArray_Array) == 0x000028, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeStruct_WeaponHudKeyActionVisibility_4) == 0x000038, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeStruct_WeaponHudKeyActionVisibility_4' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeStruct_WeaponHudKeyActionVisibility_5) == 0x000040, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeStruct_WeaponHudKeyActionVisibility_5' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeStruct_WeaponHudKeyActionVisibility_6) == 0x000048, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeStruct_WeaponHudKeyActionVisibility_6' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeArray_Array_1) == 0x000050, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeStruct_WeaponHudKeyActionVisibility_7) == 0x000060, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeStruct_WeaponHudKeyActionVisibility_7' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeArray_Array_2) == 0x000068, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeStruct_WeaponHudKeyActionVisibility_8) == 0x000078, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeStruct_WeaponHudKeyActionVisibility_8' has a wrong offset!");
static_assert(offsetof(B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena, K2Node_MakeArray_Array_3) == 0x000080, "Member 'B_UtilityItem_Generic_Athena_C_ExecuteUbergraph_B_UtilityItem_Generic_Athena::K2Node_MakeArray_Array_3' has a wrong offset!");

}

