#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_WaffleTruck_Rocket_Slurp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_WaffleTruck_Rocket_Slurp.B_WaffleTruck_Rocket_Slurp_C.ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp
// 0x0280 (0x0280 - 0x0000)
struct B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_HealthPercent;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ShieldPercent;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxShield_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetShield_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0080(0x0060)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00E0(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_LockOnWidgetActor_SlurpBazooka_C* CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWaffleTruck_SlurpBazooka_HealthBar_C*  K2Node_DynamicCast_AsWaffle_Truck_Slurp_Bazooka_Health_Bar; // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_Event_SpawnProjectile;                      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTarget_self_CastInput;           // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingStyle_self_CastInput;            // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTimeUntilMaxTurnSpeed_self_CastInput; // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingLockTargetDistanceThreshold_self_CastInput; // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTurnSpeedMax_self_CastInput;     // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTurnSpeedMin_self_CastInput;     // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingKilled_ReturnValue;                // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Persistent_Fire;                      // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B[0x1];                                      // 0x026B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x026C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp) == 0x000010, "Wrong alignment on B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp");
static_assert(sizeof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp) == 0x000280, "Wrong size on B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, EntryPoint) == 0x000000, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_IsLocallyControlled_ReturnValue) == 0x000004, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000008, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_CustomEvent_HealthPercent) == 0x000014, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_CustomEvent_HealthPercent' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_CustomEvent_ShieldPercent) == 0x000018, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_CustomEvent_ShieldPercent' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_GetMaxShield_ReturnValue) == 0x00001C, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_GetMaxShield_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_GetShield_ReturnValue) == 0x000020, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_GetShield_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_GetMaxHealth_ReturnValue) == 0x000024, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_GetHealth_ReturnValue) == 0x00002C, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_IsServer_ReturnValue) == 0x000030, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000034, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000038, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_GetSocketLocation_ReturnValue) == 0x000048, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000080, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000E0, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001C0, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001C8, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001D0, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_GetUserWidgetObject_ReturnValue) == 0x0001D8, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_DynamicCast_AsWaffle_Truck_Slurp_Bazooka_Health_Bar) == 0x0001E0, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_DynamicCast_AsWaffle_Truck_Slurp_Bazooka_Health_Bar' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_DynamicCast_bSuccess_2) == 0x0001E8, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_IsValid_ReturnValue_1) == 0x0001E9, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_GetDistanceTo_ReturnValue) == 0x0001EC, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_RowToBool_ReturnValue) == 0x0001F0, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001F1, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_SelectFloat_ReturnValue) == 0x0001F4, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_Event_bPersistentFire) == 0x0001F8, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_Event_bSecondaryFire) == 0x0001F9, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_IsValid_ReturnValue_2) == 0x0001FA, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_Event_SpawnProjectile) == 0x000200, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_Event_SpawnProjectile' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_SetHomingTarget_self_CastInput) == 0x000208, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_SetHomingTarget_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_SetHomingStyle_self_CastInput) == 0x000218, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_SetHomingStyle_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_SetHomingTimeUntilMaxTurnSpeed_self_CastInput) == 0x000228, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_SetHomingTimeUntilMaxTurnSpeed_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_SetHomingLockTargetDistanceThreshold_self_CastInput) == 0x000238, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_SetHomingLockTargetDistanceThreshold_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_SetHomingTurnSpeedMax_self_CastInput) == 0x000248, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_SetHomingTurnSpeedMax_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_SetHomingTurnSpeedMin_self_CastInput) == 0x000258, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_SetHomingTurnSpeedMin_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_IsValid_ReturnValue_3) == 0x000268, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_IsBeingKilled_ReturnValue) == 0x000269, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_IsBeingKilled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_Event_Persistent_Fire) == 0x00026A, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_Event_Persistent_Fire' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, K2Node_CreateDelegate_OutputDelegate) == 0x00026C, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000278, "Member 'B_WaffleTruck_Rocket_Slurp_C_ExecuteUbergraph_B_WaffleTruck_Rocket_Slurp::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function B_WaffleTruck_Rocket_Slurp.B_WaffleTruck_Rocket_Slurp_C.Muzzle Flash FX
// 0x0001 (0x0001 - 0x0000)
struct B_WaffleTruck_Rocket_Slurp_C_Muzzle_Flash_FX final
{
public:
	bool                                          Persistent_Fire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WaffleTruck_Rocket_Slurp_C_Muzzle_Flash_FX) == 0x000001, "Wrong alignment on B_WaffleTruck_Rocket_Slurp_C_Muzzle_Flash_FX");
static_assert(sizeof(B_WaffleTruck_Rocket_Slurp_C_Muzzle_Flash_FX) == 0x000001, "Wrong size on B_WaffleTruck_Rocket_Slurp_C_Muzzle_Flash_FX");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_Muzzle_Flash_FX, Persistent_Fire) == 0x000000, "Member 'B_WaffleTruck_Rocket_Slurp_C_Muzzle_Flash_FX::Persistent_Fire' has a wrong offset!");

// Function B_WaffleTruck_Rocket_Slurp.B_WaffleTruck_Rocket_Slurp_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_WaffleTruck_Rocket_Slurp_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WaffleTruck_Rocket_Slurp_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_WaffleTruck_Rocket_Slurp_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_WaffleTruck_Rocket_Slurp_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_WaffleTruck_Rocket_Slurp_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_WaffleTruck_Rocket_Slurp_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_WaffleTruck_Rocket_Slurp_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_WaffleTruck_Rocket_Slurp.B_WaffleTruck_Rocket_Slurp_C.OnSpawnProjectile
// 0x0008 (0x0008 - 0x0000)
struct B_WaffleTruck_Rocket_Slurp_C_OnSpawnProjectile final
{
public:
	class AFortProjectileBase*                    SpawnProjectile;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WaffleTruck_Rocket_Slurp_C_OnSpawnProjectile) == 0x000008, "Wrong alignment on B_WaffleTruck_Rocket_Slurp_C_OnSpawnProjectile");
static_assert(sizeof(B_WaffleTruck_Rocket_Slurp_C_OnSpawnProjectile) == 0x000008, "Wrong size on B_WaffleTruck_Rocket_Slurp_C_OnSpawnProjectile");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_OnSpawnProjectile, SpawnProjectile) == 0x000000, "Member 'B_WaffleTruck_Rocket_Slurp_C_OnSpawnProjectile::SpawnProjectile' has a wrong offset!");

// Function B_WaffleTruck_Rocket_Slurp.B_WaffleTruck_Rocket_Slurp_C.SetHealthPercentClient
// 0x0008 (0x0008 - 0x0000)
struct B_WaffleTruck_Rocket_Slurp_C_SetHealthPercentClient final
{
public:
	float                                         HealthPercent_0;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShieldPercent;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WaffleTruck_Rocket_Slurp_C_SetHealthPercentClient) == 0x000004, "Wrong alignment on B_WaffleTruck_Rocket_Slurp_C_SetHealthPercentClient");
static_assert(sizeof(B_WaffleTruck_Rocket_Slurp_C_SetHealthPercentClient) == 0x000008, "Wrong size on B_WaffleTruck_Rocket_Slurp_C_SetHealthPercentClient");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_SetHealthPercentClient, HealthPercent_0) == 0x000000, "Member 'B_WaffleTruck_Rocket_Slurp_C_SetHealthPercentClient::HealthPercent_0' has a wrong offset!");
static_assert(offsetof(B_WaffleTruck_Rocket_Slurp_C_SetHealthPercentClient, ShieldPercent) == 0x000004, "Member 'B_WaffleTruck_Rocket_Slurp_C_SetHealthPercentClient::ShieldPercent' has a wrong offset!");

}

