#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Wall_Reinforced_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Wall_Reinforced_Athena.B_Wall_Reinforced_Athena_C
// 0x0028 (0x0FD8 - 0x0FB0)
class AB_Wall_Reinforced_Athena_C final : public ABuildingWall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0FB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSoftClassPath                         DeleteInteraction;                                 // 0x0FC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Wall_Reinforced_Athena(int32 EntryPoint);
	void OnBuildingCompleteCosmetic();
	void OnBuildingPlaced();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

	bool IsInteractionAllowedInCreative(class UObjectInteractionBehavior* InteractionBehavior) const;
	bool IsTargetableByLinearMover() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Wall_Reinforced_Athena_C">();
	}
	static class AB_Wall_Reinforced_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Wall_Reinforced_Athena_C>();
	}
};
static_assert(alignof(AB_Wall_Reinforced_Athena_C) == 0x000008, "Wrong alignment on AB_Wall_Reinforced_Athena_C");
static_assert(sizeof(AB_Wall_Reinforced_Athena_C) == 0x000FD8, "Wrong size on AB_Wall_Reinforced_Athena_C");
static_assert(offsetof(AB_Wall_Reinforced_Athena_C, UberGraphFrame) == 0x000FB0, "Member 'AB_Wall_Reinforced_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Wall_Reinforced_Athena_C, Audio) == 0x000FB8, "Member 'AB_Wall_Reinforced_Athena_C::Audio' has a wrong offset!");
static_assert(offsetof(AB_Wall_Reinforced_Athena_C, DeleteInteraction) == 0x000FC0, "Member 'AB_Wall_Reinforced_Athena_C::DeleteInteraction' has a wrong offset!");

}

