#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BallerV2HUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BallerV2HUD.BallerV2HUD_C
// 0x0110 (0x04C0 - 0x03B0)
class UBallerV2HUD_C final : public UFortAthenaVehicleDashboardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_SelfDestructMessaging;                        // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_LowFuel_Messaging;                            // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_BoostOff;                                     // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_BoostOn;                                      // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AdditonalOuterRing;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AdditonalOuterRing_1;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BoostGlow;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BoostGlowBorder;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FillBar;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_1;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_210;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Energy;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LargeCone;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NoEnergy_GlowPulse;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sparks;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sparks_1;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LargeGlow;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LargeGlow_1;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LargeGlow_2;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_5;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_BoostSparks;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Eject;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NoEnergy;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TriangleArrow;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningMessaging;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsLowFuel;                                         // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x04A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA[0x2];                                      // 0x04AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CachedFuel;                                        // 0x04AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoostSparksEndTranslation;                         // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoostSparksStartTranslation;                       // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoostGlowBorderScaleStart;                         // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoostGlowBorderScaleEnd;                           // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BallerV2HUD(int32 EntryPoint);
	void OnBoostFinished();
	void OnBoostStarted();
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel);
	void OnLowFuel();
	void OnOutOfFuel();
	void OnWidgetVisibilityChanged(bool bNewVisibility);
	void PreConstruct(bool IsDesignTime);
	void SetBoostFXCollapsed();
	void SetBoostState(bool bIsBoosting);
	void UpdateEmptyState();
	void UpdateLowFuelState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BallerV2HUD_C">();
	}
	static class UBallerV2HUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallerV2HUD_C>();
	}
};
static_assert(alignof(UBallerV2HUD_C) == 0x000008, "Wrong alignment on UBallerV2HUD_C");
static_assert(sizeof(UBallerV2HUD_C) == 0x0004C0, "Wrong size on UBallerV2HUD_C");
static_assert(offsetof(UBallerV2HUD_C, UberGraphFrame) == 0x0003B0, "Member 'UBallerV2HUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Anim_SelfDestructMessaging) == 0x0003B8, "Member 'UBallerV2HUD_C::Anim_SelfDestructMessaging' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Anim_LowFuel_Messaging) == 0x0003C0, "Member 'UBallerV2HUD_C::Anim_LowFuel_Messaging' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Anim_BoostOff) == 0x0003C8, "Member 'UBallerV2HUD_C::Anim_BoostOff' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Anim_BoostOn) == 0x0003D0, "Member 'UBallerV2HUD_C::Anim_BoostOn' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, AdditonalOuterRing) == 0x0003D8, "Member 'UBallerV2HUD_C::AdditonalOuterRing' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, AdditonalOuterRing_1) == 0x0003E0, "Member 'UBallerV2HUD_C::AdditonalOuterRing_1' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, BoostGlow) == 0x0003E8, "Member 'UBallerV2HUD_C::BoostGlow' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, BoostGlowBorder) == 0x0003F0, "Member 'UBallerV2HUD_C::BoostGlowBorder' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, FillBar) == 0x0003F8, "Member 'UBallerV2HUD_C::FillBar' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, HorizontalBox_1) == 0x000400, "Member 'UBallerV2HUD_C::HorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image) == 0x000408, "Member 'UBallerV2HUD_C::Image' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image_1) == 0x000410, "Member 'UBallerV2HUD_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image_3) == 0x000418, "Member 'UBallerV2HUD_C::Image_3' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image_4) == 0x000420, "Member 'UBallerV2HUD_C::Image_4' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image_210) == 0x000428, "Member 'UBallerV2HUD_C::Image_210' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image_Energy) == 0x000430, "Member 'UBallerV2HUD_C::Image_Energy' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image_LargeCone) == 0x000438, "Member 'UBallerV2HUD_C::Image_LargeCone' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image_NoEnergy_GlowPulse) == 0x000440, "Member 'UBallerV2HUD_C::Image_NoEnergy_GlowPulse' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image_Sparks) == 0x000448, "Member 'UBallerV2HUD_C::Image_Sparks' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Image_Sparks_1) == 0x000450, "Member 'UBallerV2HUD_C::Image_Sparks_1' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, LargeGlow) == 0x000458, "Member 'UBallerV2HUD_C::LargeGlow' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, LargeGlow_1) == 0x000460, "Member 'UBallerV2HUD_C::LargeGlow_1' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, LargeGlow_2) == 0x000468, "Member 'UBallerV2HUD_C::LargeGlow_2' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Overlay_5) == 0x000470, "Member 'UBallerV2HUD_C::Overlay_5' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Overlay_BoostSparks) == 0x000478, "Member 'UBallerV2HUD_C::Overlay_BoostSparks' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, SafeZone) == 0x000480, "Member 'UBallerV2HUD_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Text_Eject) == 0x000488, "Member 'UBallerV2HUD_C::Text_Eject' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, Text_NoEnergy) == 0x000490, "Member 'UBallerV2HUD_C::Text_NoEnergy' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, TriangleArrow) == 0x000498, "Member 'UBallerV2HUD_C::TriangleArrow' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, WarningMessaging) == 0x0004A0, "Member 'UBallerV2HUD_C::WarningMessaging' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, IsLowFuel) == 0x0004A8, "Member 'UBallerV2HUD_C::IsLowFuel' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, IsEmpty) == 0x0004A9, "Member 'UBallerV2HUD_C::IsEmpty' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, CachedFuel) == 0x0004AC, "Member 'UBallerV2HUD_C::CachedFuel' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, BoostSparksEndTranslation) == 0x0004B0, "Member 'UBallerV2HUD_C::BoostSparksEndTranslation' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, BoostSparksStartTranslation) == 0x0004B4, "Member 'UBallerV2HUD_C::BoostSparksStartTranslation' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, BoostGlowBorderScaleStart) == 0x0004B8, "Member 'UBallerV2HUD_C::BoostGlowBorderScaleStart' has a wrong offset!");
static_assert(offsetof(UBallerV2HUD_C, BoostGlowBorderScaleEnd) == 0x0004BC, "Member 'UBallerV2HUD_C::BoostGlowBorderScaleEnd' has a wrong offset!");

}

