#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicGradientFill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BasicGradientFill.BasicGradientFill_C
// 0x0048 (0x0310 - 0x02C8)
class UBasicGradientFill_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImageFill;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Color_1;                                           // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           Color_2;                                           // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              Brush_Size;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Rotation;                                          // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BasicGradientFill(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Brush_Size(const struct FVector2D& Brush_Size_0);
	void Set_Fill(const struct FLinearColor& Color_1_0, const struct FLinearColor& Color_2_0, float Rotation__0___1_);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BasicGradientFill_C">();
	}
	static class UBasicGradientFill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicGradientFill_C>();
	}
};
static_assert(alignof(UBasicGradientFill_C) == 0x000008, "Wrong alignment on UBasicGradientFill_C");
static_assert(sizeof(UBasicGradientFill_C) == 0x000310, "Wrong size on UBasicGradientFill_C");
static_assert(offsetof(UBasicGradientFill_C, UberGraphFrame) == 0x0002C8, "Member 'UBasicGradientFill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBasicGradientFill_C, ImageFill) == 0x0002D0, "Member 'UBasicGradientFill_C::ImageFill' has a wrong offset!");
static_assert(offsetof(UBasicGradientFill_C, Color_1) == 0x0002D8, "Member 'UBasicGradientFill_C::Color_1' has a wrong offset!");
static_assert(offsetof(UBasicGradientFill_C, Color_2) == 0x0002E8, "Member 'UBasicGradientFill_C::Color_2' has a wrong offset!");
static_assert(offsetof(UBasicGradientFill_C, Brush_Size) == 0x0002F8, "Member 'UBasicGradientFill_C::Brush_Size' has a wrong offset!");
static_assert(offsetof(UBasicGradientFill_C, Rotation) == 0x000308, "Member 'UBasicGradientFill_C::Rotation' has a wrong offset!");

}

