#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassBase

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_classes.hpp"
#include "BattlePassBase_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "BlueprintContext_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Class BattlePassBase.BattlePassLandingPageBase
// 0x0128 (0x0520 - 0x03F8)
class UBattlePassLandingPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x100];                                    // 0x03F8(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassLandingPageButton*           LastHoveredPageButton;                             // 0x04F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_500[0x20];                                     // 0x0500(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassLandingPageBase">();
	}
	static class UBattlePassLandingPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLandingPageBase>();
	}
};
static_assert(alignof(UBattlePassLandingPageBase) == 0x000008, "Wrong alignment on UBattlePassLandingPageBase");
static_assert(sizeof(UBattlePassLandingPageBase) == 0x000520, "Wrong size on UBattlePassLandingPageBase");
static_assert(offsetof(UBattlePassLandingPageBase, LastHoveredPageButton) == 0x0004F8, "Member 'UBattlePassLandingPageBase::LastHoveredPageButton' has a wrong offset!");

// Class BattlePassBase.BattlePassLandingPageButton
// 0x01F0 (0x11D0 - 0x0FE0)
class UBattlePassLandingPageButton final : public UCommonButtonBase
{
public:
	EBattlePassView                               SubPageType;                                       // 0x0FD8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBattlePassFeatures                           FeatureType;                                       // 0x0FD9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FDA[0x6];                                      // 0x0FDA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattlePassLandingPageEntryPreviewInfo PreviewInfo;                                       // 0x0FE0(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bNeedsBattlePass;                                  // 0x1018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1019[0x7];                                     // 0x1019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortChallengeBundleScheduleDefinition* DelayQuestSchedule;                                // 0x1020(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DelayDaysSinceSeasonStart;                         // 0x1028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_102C[0x4];                                     // 0x102C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    RequiredItem;                                      // 0x1030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBangWrapper_NUI*                   BangWrapper;                                       // 0x1038(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsesTelemetry;                                    // 0x1040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1041[0x3];                                     // 0x1041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              Telemetry_Size;                                    // 0x1044(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              Telemetry_Position;                                // 0x104C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1054[0x4];                                     // 0x1054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattlePassLandingPageButtonTexts      DefaultTexts;                                      // 0x1058(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FBattlePassLandingPageButtonTexts      DelayedTexts;                                      // 0x10A0(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FBattlePassLandingPageButtonTexts      SubscribedTexts;                                   // 0x10E8(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1130[0xA0];                                    // 0x1130(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDisplayDetailsUpdated(const struct FBattlePassLandingPageButtonDisplayDetails& NewDisplayDetails);
	void OnSubscriptionOwnershipUpdated(const bool bOwnsSubsciption);
	void OnSubscriptionTextureLoaded(class UTexture2D* Texture);

	const struct FBattlePassLandingPageButtonDisplayDetails GetBattlePassDisplayDetails() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassLandingPageButton">();
	}
	static class UBattlePassLandingPageButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLandingPageButton>();
	}
};
static_assert(alignof(UBattlePassLandingPageButton) == 0x000010, "Wrong alignment on UBattlePassLandingPageButton");
static_assert(sizeof(UBattlePassLandingPageButton) == 0x0011D0, "Wrong size on UBattlePassLandingPageButton");
static_assert(offsetof(UBattlePassLandingPageButton, SubPageType) == 0x000FD8, "Member 'UBattlePassLandingPageButton::SubPageType' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, FeatureType) == 0x000FD9, "Member 'UBattlePassLandingPageButton::FeatureType' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, PreviewInfo) == 0x000FE0, "Member 'UBattlePassLandingPageButton::PreviewInfo' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, bNeedsBattlePass) == 0x001018, "Member 'UBattlePassLandingPageButton::bNeedsBattlePass' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, DelayQuestSchedule) == 0x001020, "Member 'UBattlePassLandingPageButton::DelayQuestSchedule' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, DelayDaysSinceSeasonStart) == 0x001028, "Member 'UBattlePassLandingPageButton::DelayDaysSinceSeasonStart' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, RequiredItem) == 0x001030, "Member 'UBattlePassLandingPageButton::RequiredItem' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, BangWrapper) == 0x001038, "Member 'UBattlePassLandingPageButton::BangWrapper' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, bUsesTelemetry) == 0x001040, "Member 'UBattlePassLandingPageButton::bUsesTelemetry' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, Telemetry_Size) == 0x001044, "Member 'UBattlePassLandingPageButton::Telemetry_Size' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, Telemetry_Position) == 0x00104C, "Member 'UBattlePassLandingPageButton::Telemetry_Position' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, DefaultTexts) == 0x001058, "Member 'UBattlePassLandingPageButton::DefaultTexts' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, DelayedTexts) == 0x0010A0, "Member 'UBattlePassLandingPageButton::DelayedTexts' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, SubscribedTexts) == 0x0010E8, "Member 'UBattlePassLandingPageButton::SubscribedTexts' has a wrong offset!");

// Class BattlePassBase.FortBattlePassContext
// 0x0078 (0x00A8 - 0x0030)
class UFortBattlePassContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortPersistentResourceItemDefinition*> CustomizationPageSeasonalResources;                // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UFortPersistentResourceItemDefinition*> AllSeasonalResources;                              // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<ERewardPageType, struct FSeasonalResourceList> RewardPageSeasonalResources;                       // 0x0058(0x0050)(NativeAccessSpecifierPrivate)

public:
	bool CanPurchaseBattlePassLevel() const;
	class FText GetCurrentChapterAsText(const bool bFullText) const;
	class FText GetCurrentSeasonNumberAsText(const bool bFullText) const;
	class FText GetDefaultDisclaimerText() const;
	class FText GetLevelPurchaseDisclaimerText() const;
	TArray<struct FSeasonCurrencyMcpData> GetSeasonalCurrencies() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassContext">();
	}
	static class UFortBattlePassContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassContext>();
	}
};
static_assert(alignof(UFortBattlePassContext) == 0x000008, "Wrong alignment on UFortBattlePassContext");
static_assert(sizeof(UFortBattlePassContext) == 0x0000A8, "Wrong size on UFortBattlePassContext");
static_assert(offsetof(UFortBattlePassContext, CustomizationPageSeasonalResources) == 0x000038, "Member 'UFortBattlePassContext::CustomizationPageSeasonalResources' has a wrong offset!");
static_assert(offsetof(UFortBattlePassContext, AllSeasonalResources) == 0x000048, "Member 'UFortBattlePassContext::AllSeasonalResources' has a wrong offset!");
static_assert(offsetof(UFortBattlePassContext, RewardPageSeasonalResources) == 0x000058, "Member 'UFortBattlePassContext::RewardPageSeasonalResources' has a wrong offset!");

// Class BattlePassBase.BattlePassRewardPageBase
// 0x00F8 (0x04F0 - 0x03F8)
class UBattlePassRewardPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0xF8];                                     // 0x03F8(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassRewardPageBase">();
	}
	static class UBattlePassRewardPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassRewardPageBase>();
	}
};
static_assert(alignof(UBattlePassRewardPageBase) == 0x000008, "Wrong alignment on UBattlePassRewardPageBase");
static_assert(sizeof(UBattlePassRewardPageBase) == 0x0004F0, "Wrong size on UBattlePassRewardPageBase");

// Class BattlePassBase.BattlePassSubPageInterface
// 0x0000 (0x0028 - 0x0028)
class IBattlePassSubPageInterface final : public IInterface
{
public:
	void OnEnterSubPage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassSubPageInterface">();
	}
	static class IBattlePassSubPageInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBattlePassSubPageInterface>();
	}
};
static_assert(alignof(IBattlePassSubPageInterface) == 0x000008, "Wrong alignment on IBattlePassSubPageInterface");
static_assert(sizeof(IBattlePassSubPageInterface) == 0x000028, "Wrong size on IBattlePassSubPageInterface");

// Class BattlePassBase.BattlePassUIGameFeatureAction
// 0x0078 (0x00A0 - 0x0028)
class UBattlePassUIGameFeatureAction final : public UFortUIGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   BattlePassScreenClass;                             // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   BattlePassResourceWidgetClass;                     // 0x0050(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   BattlePassInfoModalClass;                          // 0x0078(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassUIGameFeatureAction">();
	}
	static class UBattlePassUIGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassUIGameFeatureAction>();
	}
};
static_assert(alignof(UBattlePassUIGameFeatureAction) == 0x000008, "Wrong alignment on UBattlePassUIGameFeatureAction");
static_assert(sizeof(UBattlePassUIGameFeatureAction) == 0x0000A0, "Wrong size on UBattlePassUIGameFeatureAction");
static_assert(offsetof(UBattlePassUIGameFeatureAction, BattlePassScreenClass) == 0x000028, "Member 'UBattlePassUIGameFeatureAction::BattlePassScreenClass' has a wrong offset!");
static_assert(offsetof(UBattlePassUIGameFeatureAction, BattlePassResourceWidgetClass) == 0x000050, "Member 'UBattlePassUIGameFeatureAction::BattlePassResourceWidgetClass' has a wrong offset!");
static_assert(offsetof(UBattlePassUIGameFeatureAction, BattlePassInfoModalClass) == 0x000078, "Member 'UBattlePassUIGameFeatureAction::BattlePassInfoModalClass' has a wrong offset!");

// Class BattlePassBase.FortBattlePassBulkBuyPageBase
// 0x0178 (0x0570 - 0x03F8)
class UFortBattlePassBulkBuyPageBase final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0xF8];                                     // 0x03F8(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Addition;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Subtraction;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       DynamicEntryBox_TilesEntries;                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_BottomButtons;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_BuyLevels;                                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_ClaimReward;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSeasonItemData_BattleStar*       SeasonData_BattleStar;                             // 0x0520(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSeasonItemDefinition*            SeasonItemDefinition;                              // 0x0528(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTile*                    FocusedReward;                                     // 0x0530(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_538[0x30];                                     // 0x0538(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_Pages;                                   // 0x0568(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleUserScrolled(float ScrollAmount);
	void OnCostChanged(const int32 Cost);
	void OnPageRangeChanged(const int32 FromPage, const int32 ToPage);
	void OnRewardCountChanged(const int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassBulkBuyPageBase">();
	}
	static class UFortBattlePassBulkBuyPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassBulkBuyPageBase>();
	}
};
static_assert(alignof(UFortBattlePassBulkBuyPageBase) == 0x000008, "Wrong alignment on UFortBattlePassBulkBuyPageBase");
static_assert(sizeof(UFortBattlePassBulkBuyPageBase) == 0x000570, "Wrong size on UFortBattlePassBulkBuyPageBase");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Button_Addition) == 0x0004F0, "Member 'UFortBattlePassBulkBuyPageBase::Button_Addition' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Button_Subtraction) == 0x0004F8, "Member 'UFortBattlePassBulkBuyPageBase::Button_Subtraction' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, DynamicEntryBox_TilesEntries) == 0x000500, "Member 'UFortBattlePassBulkBuyPageBase::DynamicEntryBox_TilesEntries' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Switcher_BottomButtons) == 0x000508, "Member 'UFortBattlePassBulkBuyPageBase::Switcher_BottomButtons' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Button_BuyLevels) == 0x000510, "Member 'UFortBattlePassBulkBuyPageBase::Button_BuyLevels' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Button_ClaimReward) == 0x000518, "Member 'UFortBattlePassBulkBuyPageBase::Button_ClaimReward' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, SeasonData_BattleStar) == 0x000520, "Member 'UFortBattlePassBulkBuyPageBase::SeasonData_BattleStar' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, SeasonItemDefinition) == 0x000528, "Member 'UFortBattlePassBulkBuyPageBase::SeasonItemDefinition' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, FocusedReward) == 0x000530, "Member 'UFortBattlePassBulkBuyPageBase::FocusedReward' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, ScrollBox_Pages) == 0x000568, "Member 'UFortBattlePassBulkBuyPageBase::ScrollBox_Pages' has a wrong offset!");

// Class BattlePassBase.FortBattlePassCheckBoxButton
// 0x0000 (0x0FE0 - 0x0FE0)
class UFortBattlePassCheckBoxButton final : public UCommonButtonBase
{
public:
	void OnStateChanged(const bool bNewIsChecked);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCheckBoxButton">();
	}
	static class UFortBattlePassCheckBoxButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCheckBoxButton>();
	}
};
static_assert(alignof(UFortBattlePassCheckBoxButton) == 0x000010, "Wrong alignment on UFortBattlePassCheckBoxButton");
static_assert(sizeof(UFortBattlePassCheckBoxButton) == 0x000FE0, "Wrong size on UFortBattlePassCheckBoxButton");

// Class BattlePassBase.FortBattlePassResourcesWidgetBase
// 0x0010 (0x02F0 - 0x02E0)
class UFortBattlePassResourcesWidgetBase : public UFortGlobalSeasonResourceWidget
{
public:
	TSubclassOf<class UFortBattlePassResourceCounter> ResourceCounterClass;                              // 0x02E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_ResourceCounters;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnShowMoreInfo(bool bShouldShowMoreInfo);
	void ShowResourcesInfoModal();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassResourcesWidgetBase">();
	}
	static class UFortBattlePassResourcesWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassResourcesWidgetBase>();
	}
};
static_assert(alignof(UFortBattlePassResourcesWidgetBase) == 0x000008, "Wrong alignment on UFortBattlePassResourcesWidgetBase");
static_assert(sizeof(UFortBattlePassResourcesWidgetBase) == 0x0002F0, "Wrong size on UFortBattlePassResourcesWidgetBase");
static_assert(offsetof(UFortBattlePassResourcesWidgetBase, ResourceCounterClass) == 0x0002E0, "Member 'UFortBattlePassResourcesWidgetBase::ResourceCounterClass' has a wrong offset!");
static_assert(offsetof(UFortBattlePassResourcesWidgetBase, EntryBox_ResourceCounters) == 0x0002E8, "Member 'UFortBattlePassResourcesWidgetBase::EntryBox_ResourceCounters' has a wrong offset!");

// Class BattlePassBase.FortBattlePassCurrencyPanel
// 0x0040 (0x0330 - 0x02F0)
class UFortBattlePassCurrencyPanel final : public UFortBattlePassResourcesWidgetBase
{
public:
	class UHorizontalBox*                         HBox_BattleStarContainer;                          // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_BattleStar;                                   // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         HBox_CustomSkinContainer;                          // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_CustomSkin;                                   // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x20];                                     // 0x0310(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCurrencyPanel">();
	}
	static class UFortBattlePassCurrencyPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCurrencyPanel>();
	}
};
static_assert(alignof(UFortBattlePassCurrencyPanel) == 0x000008, "Wrong alignment on UFortBattlePassCurrencyPanel");
static_assert(sizeof(UFortBattlePassCurrencyPanel) == 0x000330, "Wrong size on UFortBattlePassCurrencyPanel");
static_assert(offsetof(UFortBattlePassCurrencyPanel, HBox_BattleStarContainer) == 0x0002F0, "Member 'UFortBattlePassCurrencyPanel::HBox_BattleStarContainer' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCurrencyPanel, Text_BattleStar) == 0x0002F8, "Member 'UFortBattlePassCurrencyPanel::Text_BattleStar' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCurrencyPanel, HBox_CustomSkinContainer) == 0x000300, "Member 'UFortBattlePassCurrencyPanel::HBox_CustomSkinContainer' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCurrencyPanel, Text_CustomSkin) == 0x000308, "Member 'UFortBattlePassCurrencyPanel::Text_CustomSkin' has a wrong offset!");

// Class BattlePassBase.FortBattlePassCustomSkinCategoryTile
// 0x00B8 (0x0370 - 0x02B8)
class UFortBattlePassCustomSkinCategoryTile final : public UUserWidget
{
public:
	uint8                                         Pad_2B8[0x20];                                     // 0x02B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgressBar*                           ProgressBar;                                       // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Items;                         // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         Text_CategoryTitle;                                // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassTile*                    PreviewedTile;                                     // 0x02F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OwnedRewards;                                      // 0x02F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2FC[0x74];                                     // 0x02FC(0x0074)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FocusTile(const int32 Index_0);
	void OnLockedProgressUpdated(const int32 CurrentlyOwnedBeforeCategory, const int32 TotalRewardsBeforeCategory, const float LockedProgress);
	void OnLockedStateChanged(const bool bCategoryLocked);
	void OnOwnedTilesUpdated(const int32 CurrentlyOwnedRewards, const int32 TotalRewards, const float CategoryProgress);
	void SetPreviewedTile(const int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCustomSkinCategoryTile">();
	}
	static class UFortBattlePassCustomSkinCategoryTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCustomSkinCategoryTile>();
	}
};
static_assert(alignof(UFortBattlePassCustomSkinCategoryTile) == 0x000008, "Wrong alignment on UFortBattlePassCustomSkinCategoryTile");
static_assert(sizeof(UFortBattlePassCustomSkinCategoryTile) == 0x000370, "Wrong size on UFortBattlePassCustomSkinCategoryTile");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, ProgressBar) == 0x0002D8, "Member 'UFortBattlePassCustomSkinCategoryTile::ProgressBar' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, FortDynamicEntryBox_Items) == 0x0002E0, "Member 'UFortBattlePassCustomSkinCategoryTile::FortDynamicEntryBox_Items' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, Text_CategoryTitle) == 0x0002E8, "Member 'UFortBattlePassCustomSkinCategoryTile::Text_CategoryTitle' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, PreviewedTile) == 0x0002F0, "Member 'UFortBattlePassCustomSkinCategoryTile::PreviewedTile' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, OwnedRewards) == 0x0002F8, "Member 'UFortBattlePassCustomSkinCategoryTile::OwnedRewards' has a wrong offset!");

// Class BattlePassBase.FortBattlePassCustomSkinPageBase
// 0x0198 (0x0590 - 0x03F8)
class UFortBattlePassCustomSkinPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x178];                                    // 0x03F8(0x0178)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_Categories;                              // 0x0570(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Categories;                    // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_580[0x8];                                      // 0x0580(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassEnabledInputData*            EquipEnabledData;                                  // 0x0588(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCustomSkinPageBase">();
	}
	static class UFortBattlePassCustomSkinPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCustomSkinPageBase>();
	}
};
static_assert(alignof(UFortBattlePassCustomSkinPageBase) == 0x000008, "Wrong alignment on UFortBattlePassCustomSkinPageBase");
static_assert(sizeof(UFortBattlePassCustomSkinPageBase) == 0x000590, "Wrong size on UFortBattlePassCustomSkinPageBase");
static_assert(offsetof(UFortBattlePassCustomSkinPageBase, ScrollBox_Categories) == 0x000570, "Member 'UFortBattlePassCustomSkinPageBase::ScrollBox_Categories' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinPageBase, FortDynamicEntryBox_Categories) == 0x000578, "Member 'UFortBattlePassCustomSkinPageBase::FortDynamicEntryBox_Categories' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinPageBase, EquipEnabledData) == 0x000588, "Member 'UFortBattlePassCustomSkinPageBase::EquipEnabledData' has a wrong offset!");

// Class BattlePassBase.FortBattlePassPurchaseResourcesWidget
// 0x00B8 (0x04B0 - 0x03F8)
class UFortBattlePassPurchaseResourcesWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Addition;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BatchAddition;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Subtraction;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BatchSubtraction;                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_Purchase;                                   // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_GetVBucks;                                  // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ReloadMtx;                                  // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassCheckBoxButton*          CheckBox_Bundle;                                   // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseMobile;                                // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentLevel;                                      // 0x0450(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOfferActive;                                    // 0x0454(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentVBucks;                                     // 0x0458(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentBattleStars;                                // 0x045C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BatchNum;                                          // 0x0460(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentPage;                                       // 0x0464(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOfferUnavailable;                                 // 0x0468(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBundleLevel;                                    // 0x046C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxLevel;                                          // 0x0470(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxLevelPurchases;                                 // 0x0474(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BundleAmount;                                      // 0x0478(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    LevelPreviewItem;                                  // 0x0480(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_488[0x28];                                     // 0x0488(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const class FString& OfferId);
	void HandlePurchaseMultiComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const TArray<class FString>& OfferIdList);
	bool IsReloadMtxEnabled();
	void OnAmountChangeButtonClicked();
	void OnOfferUnavailable();
	void OnPurchaseAmountChanged(const int32 NewAmount, const int32 LevelsLeft);
	void OnTotalPriceChanged(const int32 NewPrice);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassPurchaseResourcesWidget">();
	}
	static class UFortBattlePassPurchaseResourcesWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassPurchaseResourcesWidget>();
	}
};
static_assert(alignof(UFortBattlePassPurchaseResourcesWidget) == 0x000008, "Wrong alignment on UFortBattlePassPurchaseResourcesWidget");
static_assert(sizeof(UFortBattlePassPurchaseResourcesWidget) == 0x0004B0, "Wrong size on UFortBattlePassPurchaseResourcesWidget");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_Addition) == 0x000400, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_Addition' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_BatchAddition) == 0x000408, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_BatchAddition' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_Subtraction) == 0x000410, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_Subtraction' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_BatchSubtraction) == 0x000418, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_BatchSubtraction' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_Purchase) == 0x000420, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_Purchase' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_GetVBucks) == 0x000428, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_GetVBucks' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_ReloadMtx) == 0x000430, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_ReloadMtx' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_Back) == 0x000438, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_Back' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, CheckBox_Bundle) == 0x000440, "Member 'UFortBattlePassPurchaseResourcesWidget::CheckBox_Bundle' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_CloseMobile) == 0x000448, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_CloseMobile' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, CurrentLevel) == 0x000450, "Member 'UFortBattlePassPurchaseResourcesWidget::CurrentLevel' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, bIsOfferActive) == 0x000454, "Member 'UFortBattlePassPurchaseResourcesWidget::bIsOfferActive' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, CurrentVBucks) == 0x000458, "Member 'UFortBattlePassPurchaseResourcesWidget::CurrentVBucks' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, CurrentBattleStars) == 0x00045C, "Member 'UFortBattlePassPurchaseResourcesWidget::CurrentBattleStars' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, BatchNum) == 0x000460, "Member 'UFortBattlePassPurchaseResourcesWidget::BatchNum' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, CurrentPage) == 0x000464, "Member 'UFortBattlePassPurchaseResourcesWidget::CurrentPage' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, bOfferUnavailable) == 0x000468, "Member 'UFortBattlePassPurchaseResourcesWidget::bOfferUnavailable' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, MaxBundleLevel) == 0x00046C, "Member 'UFortBattlePassPurchaseResourcesWidget::MaxBundleLevel' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, MaxLevel) == 0x000470, "Member 'UFortBattlePassPurchaseResourcesWidget::MaxLevel' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, MaxLevelPurchases) == 0x000474, "Member 'UFortBattlePassPurchaseResourcesWidget::MaxLevelPurchases' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, BundleAmount) == 0x000478, "Member 'UFortBattlePassPurchaseResourcesWidget::BundleAmount' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, LevelPreviewItem) == 0x000480, "Member 'UFortBattlePassPurchaseResourcesWidget::LevelPreviewItem' has a wrong offset!");

// Class BattlePassBase.FortBattlePassResourceCounter
// 0x0020 (0x0300 - 0x02E0)
class UFortBattlePassResourceCounter final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_ResourceName;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_ResourceIcon;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResourceCount;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPersistentResourceItemDefinition*  CurrentResource;                                   // 0x02F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassResourceCounter">();
	}
	static class UFortBattlePassResourceCounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassResourceCounter>();
	}
};
static_assert(alignof(UFortBattlePassResourceCounter) == 0x000008, "Wrong alignment on UFortBattlePassResourceCounter");
static_assert(sizeof(UFortBattlePassResourceCounter) == 0x000300, "Wrong size on UFortBattlePassResourceCounter");
static_assert(offsetof(UFortBattlePassResourceCounter, Text_ResourceName) == 0x0002E0, "Member 'UFortBattlePassResourceCounter::Text_ResourceName' has a wrong offset!");
static_assert(offsetof(UFortBattlePassResourceCounter, LazyImage_ResourceIcon) == 0x0002E8, "Member 'UFortBattlePassResourceCounter::LazyImage_ResourceIcon' has a wrong offset!");
static_assert(offsetof(UFortBattlePassResourceCounter, Text_ResourceCount) == 0x0002F0, "Member 'UFortBattlePassResourceCounter::Text_ResourceCount' has a wrong offset!");
static_assert(offsetof(UFortBattlePassResourceCounter, CurrentResource) == 0x0002F8, "Member 'UFortBattlePassResourceCounter::CurrentResource' has a wrong offset!");

// Class BattlePassBase.FortBattlePassRewardGrid
// 0x00D0 (0x04C8 - 0x03F8)
class UFortBattlePassRewardGrid final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x68];                                     // 0x03F8(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortBattlePassTileBase>    GridTileClass;                                     // 0x0460(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBattlePassTileBase>    GridEmptyTileClass;                                // 0x0468(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              GridCellPadding;                                   // 0x0470(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassRewardGridHeader*        PageHeader;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGridPanel*                             GridPanel_Rewards;                                 // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTileBase*                DefaultFocusTile;                                  // 0x0490(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UCommonButtonBase>       LastFocusedTile;                                   // 0x0498(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A0[0x28];                                     // 0x04A0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPageSelected();
	void OnPageUnselected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassRewardGrid">();
	}
	static class UFortBattlePassRewardGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassRewardGrid>();
	}
};
static_assert(alignof(UFortBattlePassRewardGrid) == 0x000008, "Wrong alignment on UFortBattlePassRewardGrid");
static_assert(sizeof(UFortBattlePassRewardGrid) == 0x0004C8, "Wrong size on UFortBattlePassRewardGrid");
static_assert(offsetof(UFortBattlePassRewardGrid, GridTileClass) == 0x000460, "Member 'UFortBattlePassRewardGrid::GridTileClass' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, GridEmptyTileClass) == 0x000468, "Member 'UFortBattlePassRewardGrid::GridEmptyTileClass' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, GridCellPadding) == 0x000470, "Member 'UFortBattlePassRewardGrid::GridCellPadding' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, PageHeader) == 0x000480, "Member 'UFortBattlePassRewardGrid::PageHeader' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, GridPanel_Rewards) == 0x000488, "Member 'UFortBattlePassRewardGrid::GridPanel_Rewards' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, DefaultFocusTile) == 0x000490, "Member 'UFortBattlePassRewardGrid::DefaultFocusTile' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, LastFocusedTile) == 0x000498, "Member 'UFortBattlePassRewardGrid::LastFocusedTile' has a wrong offset!");

// Class BattlePassBase.FortBattlePassRewardGridHeader
// 0x0008 (0x02C0 - 0x02B8)
class UFortBattlePassRewardGridHeader final : public UUserWidget
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBattlePassLevelSet(const int32 BattlePassLevel);
	void OnPageLocked(const int32 RequiredLevel, const int32 RequiredRewards);
	void OnPageNumberSet(const int32 InPageNumber);
	void OnPageUnlocked(const int32 PurchasedRewards, const int32 TotalRewards);
	void OnSetPageCustomName(const class FText& CustomName);
	void OnSetPageType(const ERewardPageType PageType);

	int32 GetPageNumber() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassRewardGridHeader">();
	}
	static class UFortBattlePassRewardGridHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassRewardGridHeader>();
	}
};
static_assert(alignof(UFortBattlePassRewardGridHeader) == 0x000008, "Wrong alignment on UFortBattlePassRewardGridHeader");
static_assert(sizeof(UFortBattlePassRewardGridHeader) == 0x0002C0, "Wrong size on UFortBattlePassRewardGridHeader");

// Class BattlePassBase.FortBattlePassTileBase
// 0x0050 (0x10B0 - 0x1060)
class UFortBattlePassTileBase : public UFortHoldableButton
{
public:
	class USizeBox*                               SizeBox_Content;                                   // 0x1060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UnitHeight;                                        // 0x1068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UnitWidth;                                         // 0x106C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1070[0x40];                                    // 0x1070(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPeeked();
	void OnRevealed();
	void OnSetRequiresBattlePass(const bool bRequiresBP);
	void OnSizeChanged(const struct FVector2D& NewSize);
	void OnStateChanged(const EBattlePassTileAvailabilityStates NewState);
	void SetSize(const EPageItemTileSize TileSize, const struct FVector2D& CellSpacing);
	void SetState(const EBattlePassTileAvailabilityStates NewState);

	const EBattlePassTileAvailabilityStates GetState() const;
	bool IsAvailable() const;
	bool IsLocked() const;
	bool IsOwned() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassTileBase">();
	}
	static class UFortBattlePassTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassTileBase>();
	}
};
static_assert(alignof(UFortBattlePassTileBase) == 0x000010, "Wrong alignment on UFortBattlePassTileBase");
static_assert(sizeof(UFortBattlePassTileBase) == 0x0010B0, "Wrong size on UFortBattlePassTileBase");
static_assert(offsetof(UFortBattlePassTileBase, SizeBox_Content) == 0x001060, "Member 'UFortBattlePassTileBase::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UFortBattlePassTileBase, UnitHeight) == 0x001068, "Member 'UFortBattlePassTileBase::UnitHeight' has a wrong offset!");
static_assert(offsetof(UFortBattlePassTileBase, UnitWidth) == 0x00106C, "Member 'UFortBattlePassTileBase::UnitWidth' has a wrong offset!");

// Class BattlePassBase.FortBattlePassTile
// 0x0070 (0x1120 - 0x10B0)
class UFortBattlePassTile final : public UFortBattlePassTileBase
{
public:
	uint8                                         Pad_10B0[0x10];                                    // 0x10B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLazyImage*                         Image_RewardItem;                                  // 0x10C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_Currency;                                    // 0x10C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10D0[0x50];                                    // 0x10D0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAffordabilityChanged(const bool bHasEnougCurrency);
	void OnHighlighted();
	void OnLockedProgressUpdated(const float Progress, const int32 CurrentlyOwnedRewards, const int32 NeededRewards);
	void OnLockedStateUpdated(const bool OwnsBattlePass, const bool ParentUnlocked, const bool HasRemainingPrerequisites, const bool bIsDelayed);
	void OnPreviewed();
	void OnSetCurrencyAndPrice(const EBattlePassCurrencyType Currency, const int32 Price);
	void OnSetTrack(const bool bIsFreeTrack, const bool bOwnsBattlePass);
	void OnTilePreviewCycled();
	void OnUnhighlighted();
	void OnUnpreviewed();

	bool HasPrerequisites() const;
	bool IsAffordable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassTile">();
	}
	static class UFortBattlePassTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassTile>();
	}
};
static_assert(alignof(UFortBattlePassTile) == 0x000010, "Wrong alignment on UFortBattlePassTile");
static_assert(sizeof(UFortBattlePassTile) == 0x001120, "Wrong size on UFortBattlePassTile");
static_assert(offsetof(UFortBattlePassTile, Image_RewardItem) == 0x0010C0, "Member 'UFortBattlePassTile::Image_RewardItem' has a wrong offset!");
static_assert(offsetof(UFortBattlePassTile, Image_Currency) == 0x0010C8, "Member 'UFortBattlePassTile::Image_Currency' has a wrong offset!");

// Class BattlePassBase.FortBattlePassTutorialTooltip
// 0x0010 (0x02F0 - 0x02E0)
class UFortBattlePassTutorialTooltip final : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Tooltip;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HideTooltip();
	void SetText(const class FText& Text);
	void SetTooltipEnabled(const bool bEnable);
	void ShowTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassTutorialTooltip">();
	}
	static class UFortBattlePassTutorialTooltip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassTutorialTooltip>();
	}
};
static_assert(alignof(UFortBattlePassTutorialTooltip) == 0x000008, "Wrong alignment on UFortBattlePassTutorialTooltip");
static_assert(sizeof(UFortBattlePassTutorialTooltip) == 0x0002F0, "Wrong size on UFortBattlePassTutorialTooltip");
static_assert(offsetof(UFortBattlePassTutorialTooltip, Text_Tooltip) == 0x0002E0, "Member 'UFortBattlePassTutorialTooltip::Text_Tooltip' has a wrong offset!");

}

