#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPageUnlockedToast

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.ApplyAdditionalStyling
// 0x0020 (0x0020 - 0x0000)
struct BattlePassPageUnlockedToast_C_ApplyAdditionalStyling final
{
public:
	class UClass*                                 NewLocalVar_2;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 NewLocalVar_1;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 NewLocalVar_0;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_ApplyAdditionalStyling) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_ApplyAdditionalStyling");
static_assert(sizeof(BattlePassPageUnlockedToast_C_ApplyAdditionalStyling) == 0x000020, "Wrong size on BattlePassPageUnlockedToast_C_ApplyAdditionalStyling");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ApplyAdditionalStyling, NewLocalVar_2) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_ApplyAdditionalStyling::NewLocalVar_2' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ApplyAdditionalStyling, NewLocalVar_1) == 0x000008, "Member 'BattlePassPageUnlockedToast_C_ApplyAdditionalStyling::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ApplyAdditionalStyling, NewLocalVar_0) == 0x000010, "Member 'BattlePassPageUnlockedToast_C_ApplyAdditionalStyling::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ApplyAdditionalStyling, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'BattlePassPageUnlockedToast_C_ApplyAdditionalStyling::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.ExecuteUbergraph_BattlePassPageUnlockedToast
// 0x0188 (0x0188 - 0x0000)
struct BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0058(0x0090)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E8(0x0090)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINotification*                    K2Node_Event_ToastNotification;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast");
static_assert(sizeof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast) == 0x000188, "Wrong size on BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast, EntryPoint) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast, K2Node_Event_MyGeometry) == 0x000018, "Member 'BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast, K2Node_Event_MouseEvent_1) == 0x000058, "Member 'BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast, K2Node_Event_MouseEvent) == 0x0000E8, "Member 'BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast, CallFunc_PlayAnimation_ReturnValue) == 0x000178, "Member 'BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast, K2Node_Event_ToastNotification) == 0x000180, "Member 'BattlePassPageUnlockedToast_C_ExecuteUbergraph_BattlePassPageUnlockedToast::K2Node_Event_ToastNotification' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.GetOpenButtonVisibility
// 0x0018 (0x0018 - 0x0000)
struct BattlePassPageUnlockedToast_C_GetOpenButtonVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_GetOpenButtonVisibility");
static_assert(sizeof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility) == 0x000018, "Wrong size on BattlePassPageUnlockedToast_C_GetOpenButtonVisibility");
static_assert(offsetof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility, ReturnValue) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_GetOpenButtonVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'BattlePassPageUnlockedToast_C_GetOpenButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'BattlePassPageUnlockedToast_C_GetOpenButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'BattlePassPageUnlockedToast_C_GetOpenButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'BattlePassPageUnlockedToast_C_GetOpenButtonVisibility::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility, CallFunc_IsInZone_ReturnValue) == 0x000010, "Member 'BattlePassPageUnlockedToast_C_GetOpenButtonVisibility::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BattlePassPageUnlockedToast_C_GetOpenButtonVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'BattlePassPageUnlockedToast_C_GetOpenButtonVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_GetOpenButtonVisibility, K2Node_Select_Default) == 0x000013, "Member 'BattlePassPageUnlockedToast_C_GetOpenButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.OnMouseEnter
// 0x00D0 (0x00D0 - 0x0000)
struct BattlePassPageUnlockedToast_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_OnMouseEnter) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_OnMouseEnter");
static_assert(sizeof(BattlePassPageUnlockedToast_C_OnMouseEnter) == 0x0000D0, "Wrong size on BattlePassPageUnlockedToast_C_OnMouseEnter");
static_assert(offsetof(BattlePassPageUnlockedToast_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'BattlePassPageUnlockedToast_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.OnMouseLeave
// 0x0090 (0x0090 - 0x0000)
struct BattlePassPageUnlockedToast_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_OnMouseLeave) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_OnMouseLeave");
static_assert(sizeof(BattlePassPageUnlockedToast_C_OnMouseLeave) == 0x000090, "Wrong size on BattlePassPageUnlockedToast_C_OnMouseLeave");
static_assert(offsetof(BattlePassPageUnlockedToast_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.OnSetToast
// 0x0008 (0x0008 - 0x0000)
struct BattlePassPageUnlockedToast_C_OnSetToast final
{
public:
	class UFortUINotification*                    ToastNotification_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_OnSetToast) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_OnSetToast");
static_assert(sizeof(BattlePassPageUnlockedToast_C_OnSetToast) == 0x000008, "Wrong size on BattlePassPageUnlockedToast_C_OnSetToast");
static_assert(offsetof(BattlePassPageUnlockedToast_C_OnSetToast, ToastNotification_0) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_OnSetToast::ToastNotification_0' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.SetImage
// 0x0040 (0x0040 - 0x0000)
struct BattlePassPageUnlockedToast_C_SetImage final
{
public:
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageOverride_ReturnValue;             // 0x0000(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTwitchNotification_C*                  K2Node_DynamicCast_AsTwitch_Notification;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_SetImage) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_SetImage");
static_assert(sizeof(BattlePassPageUnlockedToast_C_SetImage) == 0x000040, "Wrong size on BattlePassPageUnlockedToast_C_SetImage");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetImage, CallFunc_GetImageOverride_ReturnValue) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_SetImage::CallFunc_GetImageOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetImage, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000028, "Member 'BattlePassPageUnlockedToast_C_SetImage::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetImage, K2Node_DynamicCast_AsTwitch_Notification) == 0x000030, "Member 'BattlePassPageUnlockedToast_C_SetImage::K2Node_DynamicCast_AsTwitch_Notification' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetImage, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BattlePassPageUnlockedToast_C_SetImage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.SetToast
// 0x0010 (0x0010 - 0x0000)
struct BattlePassPageUnlockedToast_C_SetToast final
{
public:
	class UFortUINotification*                    Toast;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetOpenButtonVisibility_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_SetToast) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_SetToast");
static_assert(sizeof(BattlePassPageUnlockedToast_C_SetToast) == 0x000010, "Wrong size on BattlePassPageUnlockedToast_C_SetToast");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetToast, Toast) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_SetToast::Toast' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetToast, CallFunc_GetOpenButtonVisibility_ReturnValue) == 0x000008, "Member 'BattlePassPageUnlockedToast_C_SetToast::CallFunc_GetOpenButtonVisibility_ReturnValue' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.SetupAnimBindings
// 0x0034 (0x0034 - 0x0000)
struct BattlePassPageUnlockedToast_C_SetupAnimBindings final
{
public:
	bool                                          Unbind;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_SetupAnimBindings) == 0x000004, "Wrong alignment on BattlePassPageUnlockedToast_C_SetupAnimBindings");
static_assert(sizeof(BattlePassPageUnlockedToast_C_SetupAnimBindings) == 0x000034, "Wrong size on BattlePassPageUnlockedToast_C_SetupAnimBindings");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetupAnimBindings, Unbind) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_SetupAnimBindings::Unbind' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BattlePassPageUnlockedToast_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BattlePassPageUnlockedToast_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_2) == 0x00001C, "Member 'BattlePassPageUnlockedToast_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_3) == 0x000028, "Member 'BattlePassPageUnlockedToast_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.ShowText
// 0x0048 (0x0048 - 0x0000)
struct BattlePassPageUnlockedToast_C_ShowText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCommonTextBlock*                       TextBlock;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       LocalTextBlock;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LocalText;                                         // 0x0028(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_ShowText) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_ShowText");
static_assert(sizeof(BattlePassPageUnlockedToast_C_ShowText) == 0x000048, "Wrong size on BattlePassPageUnlockedToast_C_ShowText");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ShowText, Text) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_ShowText::Text' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ShowText, TextBlock) == 0x000018, "Member 'BattlePassPageUnlockedToast_C_ShowText::TextBlock' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ShowText, LocalTextBlock) == 0x000020, "Member 'BattlePassPageUnlockedToast_C_ShowText::LocalTextBlock' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ShowText, LocalText) == 0x000028, "Member 'BattlePassPageUnlockedToast_C_ShowText::LocalText' has a wrong offset!");
static_assert(offsetof(BattlePassPageUnlockedToast_C_ShowText, CallFunc_TextIsEmpty_ReturnValue) == 0x000040, "Member 'BattlePassPageUnlockedToast_C_ShowText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function BattlePassPageUnlockedToast.BattlePassPageUnlockedToast_C.StartIntro
// 0x0008 (0x0008 - 0x0000)
struct BattlePassPageUnlockedToast_C_StartIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPageUnlockedToast_C_StartIntro) == 0x000008, "Wrong alignment on BattlePassPageUnlockedToast_C_StartIntro");
static_assert(sizeof(BattlePassPageUnlockedToast_C_StartIntro) == 0x000008, "Wrong size on BattlePassPageUnlockedToast_C_StartIntro");
static_assert(offsetof(BattlePassPageUnlockedToast_C_StartIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BattlePassPageUnlockedToast_C_StartIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

