#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SCMachine_Pickup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_SCMachine_Pickup.BGA_Athena_SCMachine_Pickup_C
// 0x0120 (0x0B50 - 0x0A30)
class ABGA_Athena_SCMachine_Pickup_C final : public ABuildingGameplayActorSpawnChip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      OverlapCollision;                                  // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ParentMesh;                                        // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortLinkToActorComponent*              FortLinkToActor;                                   // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortPhysicsObjectComponent*            FortPhysicsObject;                                 // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SC_Machine_Memory_Card_Loop_Cue;                   // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnInEffect;                                     // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BackgroundGlow;                                    // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Card;                                              // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         UnHide;                                            // 0x0A78(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeUnhide;                                 // 0x0A7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         OwnerTeam;                                         // 0x0A80(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_A81[0x7];                                      // 0x0A81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_DestroyPickup;                               // 0x0A88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_PickupLife;                                    // 0x0A90(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   InteractText;                                      // 0x0AB8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        SpawnOutParticle;                                  // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PickupSound;                                       // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnSoundPlayed;                                  // 0x0AE0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE1[0x7];                                      // 0x0AE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SpawnInSound;                                      // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPendingKill;                                     // 0x0AF0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideAndKill;                                       // 0x0AF1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF2[0x6];                                      // 0x0AF2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_PickUpInteractTime;                            // 0x0AF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsDelayingDeath;                                   // 0x0B20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OwnerDiedInVortex;                                 // 0x0B21(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B22[0x6];                                      // 0x0B22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Auto_Collect_Active_Row;                           // 0x0B28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AutoCollectCards();
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void BndEvt__BGA_Athena_SCMachine_Pickup_FortLinkToActor_K2Node_ComponentBoundEvent_4_OnLinkedActorDestroyed__DelegateSignature(class AActor* DamageCauser);
	void BndEvt__Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CollectPickup();
	void DelayDestroyPickup();
	void DestroyPickup();
	void ExecuteUbergraph_BGA_Athena_SCMachine_Pickup(int32 EntryPoint);
	void HideAndKillPickup();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDestroyPickup();
	void OnRep_HideAndKill();
	void OnRep_UnHide();
	void ReceiveBeginPlay();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void SpawnSound();
	void UserConstructionScript();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_SCMachine_Pickup_C">();
	}
	static class ABGA_Athena_SCMachine_Pickup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_SCMachine_Pickup_C>();
	}
};
static_assert(alignof(ABGA_Athena_SCMachine_Pickup_C) == 0x000008, "Wrong alignment on ABGA_Athena_SCMachine_Pickup_C");
static_assert(sizeof(ABGA_Athena_SCMachine_Pickup_C) == 0x000B50, "Wrong size on ABGA_Athena_SCMachine_Pickup_C");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, UberGraphFrame) == 0x000A30, "Member 'ABGA_Athena_SCMachine_Pickup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, OverlapCollision) == 0x000A38, "Member 'ABGA_Athena_SCMachine_Pickup_C::OverlapCollision' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, ParentMesh) == 0x000A40, "Member 'ABGA_Athena_SCMachine_Pickup_C::ParentMesh' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, FortLinkToActor) == 0x000A48, "Member 'ABGA_Athena_SCMachine_Pickup_C::FortLinkToActor' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, FortPhysicsObject) == 0x000A50, "Member 'ABGA_Athena_SCMachine_Pickup_C::FortPhysicsObject' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, SC_Machine_Memory_Card_Loop_Cue) == 0x000A58, "Member 'ABGA_Athena_SCMachine_Pickup_C::SC_Machine_Memory_Card_Loop_Cue' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, SpawnInEffect) == 0x000A60, "Member 'ABGA_Athena_SCMachine_Pickup_C::SpawnInEffect' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, BackgroundGlow) == 0x000A68, "Member 'ABGA_Athena_SCMachine_Pickup_C::BackgroundGlow' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, Card) == 0x000A70, "Member 'ABGA_Athena_SCMachine_Pickup_C::Card' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, UnHide) == 0x000A78, "Member 'ABGA_Athena_SCMachine_Pickup_C::UnHide' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, DelayBeforeUnhide) == 0x000A7C, "Member 'ABGA_Athena_SCMachine_Pickup_C::DelayBeforeUnhide' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, OwnerTeam) == 0x000A80, "Member 'ABGA_Athena_SCMachine_Pickup_C::OwnerTeam' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, Timer_DestroyPickup) == 0x000A88, "Member 'ABGA_Athena_SCMachine_Pickup_C::Timer_DestroyPickup' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, Row_PickupLife) == 0x000A90, "Member 'ABGA_Athena_SCMachine_Pickup_C::Row_PickupLife' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, InteractText) == 0x000AB8, "Member 'ABGA_Athena_SCMachine_Pickup_C::InteractText' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, SpawnOutParticle) == 0x000AD0, "Member 'ABGA_Athena_SCMachine_Pickup_C::SpawnOutParticle' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, PickupSound) == 0x000AD8, "Member 'ABGA_Athena_SCMachine_Pickup_C::PickupSound' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, SpawnSoundPlayed) == 0x000AE0, "Member 'ABGA_Athena_SCMachine_Pickup_C::SpawnSoundPlayed' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, SpawnInSound) == 0x000AE8, "Member 'ABGA_Athena_SCMachine_Pickup_C::SpawnInSound' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, IsPendingKill) == 0x000AF0, "Member 'ABGA_Athena_SCMachine_Pickup_C::IsPendingKill' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, HideAndKill) == 0x000AF1, "Member 'ABGA_Athena_SCMachine_Pickup_C::HideAndKill' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, Row_PickUpInteractTime) == 0x000AF8, "Member 'ABGA_Athena_SCMachine_Pickup_C::Row_PickUpInteractTime' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, IsDelayingDeath) == 0x000B20, "Member 'ABGA_Athena_SCMachine_Pickup_C::IsDelayingDeath' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, OwnerDiedInVortex) == 0x000B21, "Member 'ABGA_Athena_SCMachine_Pickup_C::OwnerDiedInVortex' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Pickup_C, Auto_Collect_Active_Row) == 0x000B28, "Member 'ABGA_Athena_SCMachine_Pickup_C::Auto_Collect_Active_Row' has a wrong offset!");

}

