#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_ShieldGenerator_NonPhysics

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_ShieldGenerator_NonPhysics.BGA_Athena_ShieldGenerator_NonPhysics_C.BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent) == 0x000008, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function BGA_Athena_ShieldGenerator_NonPhysics.BGA_Athena_ShieldGenerator_NonPhysics_C.BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLastBody;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature");
static_assert(sizeof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature) == 0x000018, "Wrong size on BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature, WaterBody) == 0x000000, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature, WaterInteractionComponent) == 0x000008, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature::WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature, bIsLastBody) == 0x000010, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature::bIsLastBody' has a wrong offset!");

// Function BGA_Athena_ShieldGenerator_NonPhysics.BGA_Athena_ShieldGenerator_NonPhysics_C.ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics
// 0x0BC0 (0x0BC0 - 0x0000)
struct BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0040(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0130(0x0018)()
	EFortBuildingInitializationReason             K2Node_Event_InitializationReason;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBuildingPersistentState                  K2Node_Event_BuildingPersistentState;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0158(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue; // 0x0238(0x00D0)(ContainsInstancedReference)
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody_1;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent_1; // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_EffectContextGetInstigatorActor_ReturnValue; // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0330(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x03D8(0x00D0)(ContainsInstancedReference)
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x04B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_EffectContextGetInstigatorActor_ReturnValue_1; // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0560(0x00D0)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_642[0x6];                                      // 0x0642(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMarkerComponent*                 CallFunc_GetMarkerComponent_ReturnValue;           // 0x0660(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarkerID                              CallFunc_MarkActorOnClient_ReturnValue;            // 0x0668(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0670(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor;                                // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_HitComp;                              // 0x0680(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ServerLocation;                 // 0x0690(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x06B0(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_791[0xF];                                      // 0x0791(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x07A0(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_801[0x7];                                      // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0808(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0820(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0838(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0850(0x0060)(IsPlainOldData, NoDestructor)
	class AFortWaterBodyActor*                    K2Node_CustomEvent_Water_Body;                     // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsInWater;                      // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWaterBodyComponent*                    CallFunc_GetWaterBodyComponent_ReturnValue;        // 0x08C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Decal_ShieldGenerator_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D9[0x7];                                      // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x08E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWaterSurfaceInfo                      CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo; // 0x08F8(0x0068)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0960(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96C[0x4];                                      // 0x096C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0970(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x097C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0990(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLastBody;            // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_999[0x3];                                      // 0x0999(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x099C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x09A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActive_ReturnValue;                // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x09A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AA[0x6];                                      // 0x09AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x09B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x09C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9CC[0x4];                                      // 0x09CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x09D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x09E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x09EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x09F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActive_ReturnValue_1;              // 0x09F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F5[0x3];                                      // 0x09F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x09F8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x0A04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A09[0x3];                                      // 0x0A09(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_7;            // 0x0A0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A11[0x7];                                      // 0x0A11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0A18(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0A20(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0A2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0A2D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0A2E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2F[0x1];                                      // 0x0A2F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_8;            // 0x0A30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A34[0x4];                                      // 0x0A34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0A38(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_9;            // 0x0A40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_StopDecalUpdates;               // 0x0A44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0A45(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A46[0x2];                                      // 0x0A46(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0A48(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0A58(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A69[0x7];                                      // 0x0A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0A78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7C[0x4];                                      // 0x0A7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0A80(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0B61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B62[0x6];                                      // 0x0B62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0B68(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0B80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9C[0x4];                                      // 0x0B9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0BA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics) == 0x000010, "Wrong alignment on BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics");
static_assert(sizeof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics) == 0x000BC0, "Wrong size on BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, EntryPoint) == 0x000000, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_Damage) == 0x000004, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_DamageTags) == 0x000008, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_Momentum) == 0x000028, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_HitInfo) == 0x000040, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_InstigatedBy) == 0x000120, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_DamageCauser) == 0x000128, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_EffectContext) == 0x000130, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_InitializationReason) == 0x000148, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_InitializationReason' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_BuildingPersistentState) == 0x000149, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_BuildingPersistentState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetValueAtLevel_ReturnValue) == 0x00014C, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000150, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_HitResult) == 0x000158, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue) == 0x000238, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_ComponentBoundEvent_WaterBody_1) == 0x000308, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_ComponentBoundEvent_WaterBody_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_ComponentBoundEvent_WaterInteractionComponent_1) == 0x000310, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_ComponentBoundEvent_WaterInteractionComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x000318, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_EffectContextGetInstigatorActor_ReturnValue) == 0x000320, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_EffectContextGetInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetTransform_ReturnValue) == 0x000330, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BreakTransform_Location) == 0x000390, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BreakTransform_Rotation) == 0x0003A8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BreakTransform_Scale) == 0x0003C0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0003D8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetTransform_ReturnValue_1) == 0x0004B0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BreakTransform_Location_1) == 0x000510, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BreakTransform_Rotation_1) == 0x000528, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BreakTransform_Scale_1) == 0x000540, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_EffectContextGetInstigatorActor_ReturnValue_1) == 0x000558, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_EffectContextGetInstigatorActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000560, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetOwner_ReturnValue) == 0x000630, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000638, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_DynamicCast_bSuccess) == 0x000640, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, Temp_bool_IsClosed_Variable) == 0x000641, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetController_ReturnValue) == 0x000648, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000650, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_DynamicCast_bSuccess_1) == 0x000658, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetMarkerComponent_ReturnValue) == 0x000660, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetMarkerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_MarkActorOnClient_ReturnValue) == 0x000668, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_MarkActorOnClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x000670, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_Actor) == 0x000678, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_Event_HitComp) == 0x000680, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_Event_HitComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, Temp_int_Loop_Counter_Variable) == 0x000688, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_Add_IntInt_ReturnValue) == 0x00068C, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_CustomEvent_ServerLocation) == 0x000690, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_CustomEvent_ServerLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, Temp_bool_Has_Been_Initd_Variable) == 0x0006A8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0006B0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000790, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetTransform_ReturnValue_2) == 0x0007A0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_IsValid_ReturnValue) == 0x000800, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BreakTransform_Location_2) == 0x000808, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BreakTransform_Rotation_2) == 0x000820, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BreakTransform_Scale_2) == 0x000838, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_MakeTransform_ReturnValue) == 0x000850, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_CustomEvent_Water_Body) == 0x0008B0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_CustomEvent_Water_Body' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_CustomEvent_IsInWater) == 0x0008B8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_CustomEvent_IsInWater' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0008C0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetWaterBodyComponent_ReturnValue) == 0x0008C8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetWaterBodyComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_FinishSpawningActor_ReturnValue) == 0x0008D0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_HasAuthority_ReturnValue) == 0x0008D8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0008E0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo) == 0x0008F8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_CreateDelegate_OutputDelegate) == 0x000960, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000970, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000978, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_CreateDelegate_OutputDelegate_1) == 0x00097C, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_ComponentBoundEvent_WaterBody) == 0x000988, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x000990, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_ComponentBoundEvent_bIsLastBody) == 0x000998, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_ComponentBoundEvent_bIsLastBody' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00099C, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0009A0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_IsCurieActive_ReturnValue) == 0x0009A8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_IsCurieActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_HasAuthority_ReturnValue_1) == 0x0009A9, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0009B0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x0009C8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0009D0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x0009E8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, Temp_int_Array_Index_Variable) == 0x0009EC, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x0009F0, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_IsCurieActive_ReturnValue_1) == 0x0009F4, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_IsCurieActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_CreateDelegate_OutputDelegate_2) == 0x0009F8, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetValueAtLevel_ReturnValue_6) == 0x000A04, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetValueAtLevel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000A08, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_GetValueAtLevel_ReturnValue_7) == 0x000A0C, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_GetValueAtLevel_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_BooleanAND_ReturnValue) == 0x000A10, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000A18, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics, K2Node_CreateDelegate_OutputDelegate_3) == 0x000A20, "Member 'BGA_Athena_ShieldGenerator_NonPhysics_C_ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
