#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_RiftPortal_Athena_Spawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_RiftPortal_Athena_Spawner.BGA_RiftPortal_Athena_Spawner_C
// 0x0060 (0x0A40 - 0x09E0)
class ABGA_RiftPortal_Athena_Spawner_C final : public ABuildingGameplayActorConsumable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ActorOriginalLocation;                             // 0x09F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxSpawnHeightMultiplier;                          // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A0C[0x4];                                      // 0x0A0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxSpawnHeight;                                    // 0x0A10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 Rift;                                              // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_RiftPortal_Athena_Spawner_C">();
	}
	static class ABGA_RiftPortal_Athena_Spawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_RiftPortal_Athena_Spawner_C>();
	}
};
static_assert(alignof(ABGA_RiftPortal_Athena_Spawner_C) == 0x000008, "Wrong alignment on ABGA_RiftPortal_Athena_Spawner_C");
static_assert(sizeof(ABGA_RiftPortal_Athena_Spawner_C) == 0x000A40, "Wrong size on ABGA_RiftPortal_Athena_Spawner_C");
static_assert(offsetof(ABGA_RiftPortal_Athena_Spawner_C, UberGraphFrame) == 0x0009E0, "Member 'ABGA_RiftPortal_Athena_Spawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_RiftPortal_Athena_Spawner_C, DefaultSceneRoot) == 0x0009E8, "Member 'ABGA_RiftPortal_Athena_Spawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABGA_RiftPortal_Athena_Spawner_C, ActorOriginalLocation) == 0x0009F0, "Member 'ABGA_RiftPortal_Athena_Spawner_C::ActorOriginalLocation' has a wrong offset!");
static_assert(offsetof(ABGA_RiftPortal_Athena_Spawner_C, MaxSpawnHeightMultiplier) == 0x000A08, "Member 'ABGA_RiftPortal_Athena_Spawner_C::MaxSpawnHeightMultiplier' has a wrong offset!");
static_assert(offsetof(ABGA_RiftPortal_Athena_Spawner_C, MaxSpawnHeight) == 0x000A10, "Member 'ABGA_RiftPortal_Athena_Spawner_C::MaxSpawnHeight' has a wrong offset!");
static_assert(offsetof(ABGA_RiftPortal_Athena_Spawner_C, Rift) == 0x000A38, "Member 'ABGA_RiftPortal_Athena_Spawner_C::Rift' has a wrong offset!");

}

