#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_GenericCurieFuel_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Curie_structs.hpp"


namespace SDK::Params
{

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.AttachedComponentDied
// 0x0060 (0x0060 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_AttachedComponentDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_AttachedComponentDied");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied) == 0x000060, "Wrong size on BGA_GenericCurieFuel_Parent_C_AttachedComponentDied");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied, DamagedActor) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_AttachedComponentDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied, Damage) == 0x000008, "Member 'BGA_GenericCurieFuel_Parent_C_AttachedComponentDied::Damage' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied, InstigatedBy) == 0x000010, "Member 'BGA_GenericCurieFuel_Parent_C_AttachedComponentDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied, DamageCauser) == 0x000018, "Member 'BGA_GenericCurieFuel_Parent_C_AttachedComponentDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied, HitLocation) == 0x000020, "Member 'BGA_GenericCurieFuel_Parent_C_AttachedComponentDied::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied, FHitComponent) == 0x000038, "Member 'BGA_GenericCurieFuel_Parent_C_AttachedComponentDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied, BoneName) == 0x000040, "Member 'BGA_GenericCurieFuel_Parent_C_AttachedComponentDied::BoneName' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_AttachedComponentDied, Momentum) == 0x000048, "Member 'BGA_GenericCurieFuel_Parent_C_AttachedComponentDied::Momentum' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.BaseDied
// 0x0008 (0x0008 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_BaseDied final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_BaseDied) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_BaseDied");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_BaseDied) == 0x000008, "Wrong size on BGA_GenericCurieFuel_Parent_C_BaseDied");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_BaseDied, DestroyedActor) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_BaseDied::DestroyedActor' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature
// 0x00F8 (0x00F8 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x00E0(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x0000F8, "Wrong size on BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactResult' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactVelocity) == 0x0000E0, "Member 'BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactVelocity' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature
// 0x00E0 (0x00E0 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature) == 0x0000E0, "Wrong size on BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.ExecuteUbergraph_BGA_GenericCurieFuel_Parent
// 0x0408 (0x0408 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult_1;         // 0x0090(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_ComponentBoundEvent_ImpactVelocity;         // 0x0170(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_GenericCurieFuel_Parent_C*         K2Node_DynamicCast_AsBGA_Generic_Curie_Fuel_Parent; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_OnCurieActivated*      CallFunc_OnCurieActivated_ReturnValue;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieContainerHandle                  K2Node_Event_CurieContainerHandle;                 // 0x01C4(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_ElementTag;                           // 0x01C8(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0238(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0318(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03F8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent) == 0x000408, "Wrong size on BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, EntryPoint) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CustomEvent_DestroyedActor) == 0x000008, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CustomEvent_DamagedActor) == 0x000010, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CustomEvent_Damage) == 0x000018, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CustomEvent_InstigatedBy) == 0x000020, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CustomEvent_DamageCauser) == 0x000028, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CustomEvent_HitLocation) == 0x000030, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CustomEvent_FHitComponent) == 0x000048, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CustomEvent_BoneName) == 0x000050, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CustomEvent_Momentum) == 0x000058, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, CallFunc_IsServer_ReturnValue) == 0x000088, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_ComponentBoundEvent_ImpactResult_1) == 0x000090, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_ComponentBoundEvent_ImpactResult_1' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_ComponentBoundEvent_ImpactVelocity) == 0x000170, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_ComponentBoundEvent_ImpactVelocity' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_DynamicCast_AsBuilding_Actor) == 0x000188, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, CallFunc_IsValid_ReturnValue) == 0x000191, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_DynamicCast_AsBGA_Generic_Curie_Fuel_Parent) == 0x000198, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_DynamicCast_AsBGA_Generic_Curie_Fuel_Parent' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_DynamicCast_AsPawn) == 0x0001A8, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_DynamicCast_bSuccess_2) == 0x0001B0, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, CallFunc_OnCurieActivated_ReturnValue) == 0x0001B8, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::CallFunc_OnCurieActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, CallFunc_IsValid_ReturnValue_1) == 0x0001C0, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_CurieContainerHandle) == 0x0001C4, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_CurieContainerHandle' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_ElementTag) == 0x0001C8, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_ElementTag' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0001CC, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_MyComp) == 0x0001D0, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_Other) == 0x0001D8, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_OtherComp) == 0x0001E0, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_bSelfMoved) == 0x0001E8, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_HitLocation) == 0x0001F0, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_HitNormal) == 0x000208, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_NormalImpulse) == 0x000220, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_Event_Hit) == 0x000238, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_ComponentBoundEvent_ImpactResult) == 0x000318, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003F8, "Member 'BGA_GenericCurieFuel_Parent_C_ExecuteUbergraph_BGA_GenericCurieFuel_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.HandleHits
// 0x0018 (0x0018 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_HandleHits final
{
public:
	class UObject*                                ObjectRef;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    PrimitiveObjectRef;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HitVehicle_Success;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HitBuildingWall_Success;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HitBuildingActor_Success;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_HandleHits) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_HandleHits");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_HandleHits) == 0x000018, "Wrong size on BGA_GenericCurieFuel_Parent_C_HandleHits");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HandleHits, ObjectRef) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_HandleHits::ObjectRef' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HandleHits, PrimitiveObjectRef) == 0x000008, "Member 'BGA_GenericCurieFuel_Parent_C_HandleHits::PrimitiveObjectRef' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HandleHits, CallFunc_HitVehicle_Success) == 0x000010, "Member 'BGA_GenericCurieFuel_Parent_C_HandleHits::CallFunc_HitVehicle_Success' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HandleHits, CallFunc_HitBuildingWall_Success) == 0x000011, "Member 'BGA_GenericCurieFuel_Parent_C_HandleHits::CallFunc_HitBuildingWall_Success' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HandleHits, CallFunc_HitBuildingActor_Success) == 0x000012, "Member 'BGA_GenericCurieFuel_Parent_C_HandleHits::CallFunc_HitBuildingActor_Success' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.HitBuildingActor
// 0x0038 (0x0038 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_HitBuildingActor final
{
public:
	class UObject*                                ObjectRef;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    PrimitiveObjectRef;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_GenericCurieFuel_Parent_C*         K2Node_DynamicCast_AsBGA_Generic_Curie_Fuel_Parent; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_HitBuildingActor) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_HitBuildingActor");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_HitBuildingActor) == 0x000038, "Wrong size on BGA_GenericCurieFuel_Parent_C_HitBuildingActor");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingActor, ObjectRef) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingActor::ObjectRef' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingActor, PrimitiveObjectRef) == 0x000008, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingActor::PrimitiveObjectRef' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingActor, Success) == 0x000010, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingActor::Success' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingActor, K2Node_DynamicCast_AsBuilding_Actor) == 0x000018, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingActor::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingActor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingActor, K2Node_DynamicCast_AsBGA_Generic_Curie_Fuel_Parent) == 0x000028, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingActor::K2Node_DynamicCast_AsBGA_Generic_Curie_Fuel_Parent' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingActor, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.HitBuildingWall
// 0x0038 (0x0038 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_HitBuildingWall final
{
public:
	class UObject*                                ObjectRef;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    PrimitiveObjectRef;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingWall*                          K2Node_DynamicCast_AsBuilding_Wall;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDoorComponent_ReturnValue;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_HitBuildingWall");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall) == 0x000038, "Wrong size on BGA_GenericCurieFuel_Parent_C_HitBuildingWall");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall, ObjectRef) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingWall::ObjectRef' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall, PrimitiveObjectRef) == 0x000008, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingWall::PrimitiveObjectRef' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall, Success) == 0x000010, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingWall::Success' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000018, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingWall::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingWall::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall, K2Node_DynamicCast_AsBuilding_Wall) == 0x000028, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingWall::K2Node_DynamicCast_AsBuilding_Wall' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingWall::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitBuildingWall, CallFunc_IsDoorComponent_ReturnValue) == 0x000031, "Member 'BGA_GenericCurieFuel_Parent_C_HitBuildingWall::CallFunc_IsDoorComponent_ReturnValue' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.HitVehicle
// 0x0030 (0x0030 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_HitVehicle final
{
public:
	class UObject*                                ObjectRef;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    PrimitiveObjectRef;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_HitVehicle) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_HitVehicle");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_HitVehicle) == 0x000030, "Wrong size on BGA_GenericCurieFuel_Parent_C_HitVehicle");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitVehicle, ObjectRef) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_HitVehicle::ObjectRef' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitVehicle, PrimitiveObjectRef) == 0x000008, "Member 'BGA_GenericCurieFuel_Parent_C_HitVehicle::PrimitiveObjectRef' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitVehicle, Success) == 0x000010, "Member 'BGA_GenericCurieFuel_Parent_C_HitVehicle::Success' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitVehicle, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000018, "Member 'BGA_GenericCurieFuel_Parent_C_HitVehicle::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_HitVehicle, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BGA_GenericCurieFuel_Parent_C_HitVehicle::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.IgniteNearbyMaterials
// 0x0158 (0x0158 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials final
{
public:
	struct FVector                                SpherePos;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0078(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials) == 0x000158, "Wrong size on BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, SpherePos) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::SpherePos' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000028, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, K2Node_MakeArray_Array) == 0x000038, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_SphereOverlapActors_OutActors) == 0x000050, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_SphereOverlapActors_ReturnValue) == 0x000060, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_Array_Get_Item) == 0x000068, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials, CallFunc_MakeHitResult_ReturnValue) == 0x000078, "Member 'BGA_GenericCurieFuel_Parent_C_IgniteNearbyMaterials::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.OnCurieElementDetached_BP
// 0x0008 (0x0008 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_OnCurieElementDetached_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ElementTag;                                        // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_OnCurieElementDetached_BP) == 0x000004, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_OnCurieElementDetached_BP");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_OnCurieElementDetached_BP) == 0x000008, "Wrong size on BGA_GenericCurieFuel_Parent_C_OnCurieElementDetached_BP");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_OnCurieElementDetached_BP, CurieContainerHandle) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_OnCurieElementDetached_BP::CurieContainerHandle' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_OnCurieElementDetached_BP, ElementTag) == 0x000004, "Member 'BGA_GenericCurieFuel_Parent_C_OnCurieElementDetached_BP::ElementTag' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.ReceiveHit
// 0x0148 (0x0148 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0068(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_ReceiveHit) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_ReceiveHit");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_ReceiveHit) == 0x000148, "Wrong size on BGA_GenericCurieFuel_Parent_C_ReceiveHit");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ReceiveHit, MyComp) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ReceiveHit, Other) == 0x000008, "Member 'BGA_GenericCurieFuel_Parent_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ReceiveHit, OtherComp) == 0x000010, "Member 'BGA_GenericCurieFuel_Parent_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'BGA_GenericCurieFuel_Parent_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ReceiveHit, HitLocation) == 0x000020, "Member 'BGA_GenericCurieFuel_Parent_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ReceiveHit, HitNormal) == 0x000038, "Member 'BGA_GenericCurieFuel_Parent_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ReceiveHit, NormalImpulse) == 0x000050, "Member 'BGA_GenericCurieFuel_Parent_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ReceiveHit, Hit) == 0x000068, "Member 'BGA_GenericCurieFuel_Parent_C_ReceiveHit::Hit' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.SelfIgnite
// 0x00F8 (0x00F8 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_SelfIgnite final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0018(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_SelfIgnite) == 0x000008, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_SelfIgnite");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_SelfIgnite) == 0x0000F8, "Wrong size on BGA_GenericCurieFuel_Parent_C_SelfIgnite");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_SelfIgnite, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_SelfIgnite::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_SelfIgnite, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BGA_GenericCurieFuel_Parent_C_SelfIgnite::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_SelfIgnite, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000010, "Member 'BGA_GenericCurieFuel_Parent_C_SelfIgnite::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_SelfIgnite, Temp_struct_Variable) == 0x000018, "Member 'BGA_GenericCurieFuel_Parent_C_SelfIgnite::Temp_struct_Variable' has a wrong offset!");

// Function BGA_GenericCurieFuel_Parent.BGA_GenericCurieFuel_Parent_C.ShouldPlayNativeCurieFX
// 0x0014 (0x0014 - 0x0000)
struct BGA_GenericCurieFuel_Parent_C_ShouldPlayNativeCurieFX final
{
public:
	EFortCurieNativeFXType                        FXType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortNativeCurieFXResponse             OutResponse;                                       // 0x0004(0x0008)(Parm, OutParm, NoDestructor)
	struct FFortNativeCurieFXResponse             K2Node_MakeStruct_FortNativeCurieFXResponse;       // 0x000C(0x0008)(NoDestructor)
};
static_assert(alignof(BGA_GenericCurieFuel_Parent_C_ShouldPlayNativeCurieFX) == 0x000004, "Wrong alignment on BGA_GenericCurieFuel_Parent_C_ShouldPlayNativeCurieFX");
static_assert(sizeof(BGA_GenericCurieFuel_Parent_C_ShouldPlayNativeCurieFX) == 0x000014, "Wrong size on BGA_GenericCurieFuel_Parent_C_ShouldPlayNativeCurieFX");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ShouldPlayNativeCurieFX, FXType) == 0x000000, "Member 'BGA_GenericCurieFuel_Parent_C_ShouldPlayNativeCurieFX::FXType' has a wrong offset!");
static_assert(offsetof(BGA_GenericCurieFuel_Parent_C_ShouldPlayNativeCurieFX, OutResponse) == 0x000004, "Member 'BGA_GenericCurieFuel_Parent_C_ShouldPlayNativeCurieFX::OutResponse' has a wrong offset!");
