#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_FlopperSpawn_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_UserConstructionScript) == 0x000001, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_UserConstructionScript");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_UserConstructionScript) == 0x000001, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_UserConstructionScript");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_UserConstructionScript, CallFunc_IsServer_ReturnValue) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_UserConstructionScript::CallFunc_IsServer_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.UpdateCollectionsComponent
// 0x0028 (0x0028 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent final
{
public:
	bool                                          bCaughtFish;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    ItemDefinition;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            PickUp;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Length;                                            // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent) == 0x000028, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent, bCaughtFish) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent::bCaughtFish' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent, Player) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent::Player' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent, ItemDefinition) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent::ItemDefinition' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent, PickUp) == 0x000018, "Member 'BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent::PickUp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent, Length) == 0x000020, "Member 'BGA_Athena_FlopperSpawn_Parent_C_UpdateCollectionsComponent::Length' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.SpawnItem
// 0x0070 (0x0070 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_SpawnItem final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hooked;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        HookComponent;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnLoc;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemSpawnDelay;                                    // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CaughtWithFishingRod;                              // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CaughtWithHappyGhost;                              // 0x003D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ItemUsedToFish;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APrj_Athena_FloppingRabbit_C*           Projectile_0;                                      // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Required_Tags;                                     // 0x0050(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_SpawnItem");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem) == 0x000070, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_SpawnItem");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, Target) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::Target' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, Hooked) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::Hooked' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, HookComponent) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::HookComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, SpawnLoc) == 0x000018, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::SpawnLoc' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, Player) == 0x000030, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::Player' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, ItemSpawnDelay) == 0x000038, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::ItemSpawnDelay' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, CaughtWithFishingRod) == 0x00003C, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::CaughtWithFishingRod' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, CaughtWithHappyGhost) == 0x00003D, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::CaughtWithHappyGhost' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, ItemUsedToFish) == 0x000040, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::ItemUsedToFish' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, Projectile_0) == 0x000048, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::Projectile_0' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SpawnItem, Required_Tags) == 0x000050, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SpawnItem::Required_Tags' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.SomethingCaught
// 0x0038 (0x0038 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught final
{
public:
	class AFortPickup*                            ItemSpawned;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  RequiredTags;                                      // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class USceneComponent*                        HookComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught) == 0x000038, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught, ItemSpawned) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught::ItemSpawned' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught, Player) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught::Player' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught, RequiredTags) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught::RequiredTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught, HookComponent) == 0x000030, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SomethingCaught::HookComponent' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.ShouldKill
// 0x0014 (0x0014 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_ShouldKill final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_ShouldKill) == 0x000004, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_ShouldKill");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_ShouldKill) == 0x000014, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_ShouldKill");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_ShouldKill, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_ShouldKill::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_ShouldKill, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BGA_Athena_FlopperSpawn_Parent_C_ShouldKill::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_ShouldKill, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_ShouldKill::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_ShouldKill, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00000C, "Member 'BGA_Athena_FlopperSpawn_Parent_C_ShouldKill::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_ShouldKill, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Parent_C_ShouldKill::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.SetRespawnDelay
// 0x000C (0x000C - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay) == 0x000004, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay) == 0x00000C, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000004, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SetRespawnDelay::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.SetBalanceValues
// 0x0014 (0x0014 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues) == 0x000004, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues) == 0x000014, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000004, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues, CallFunc_FTrunc_ReturnValue) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues, CallFunc_FTrunc_ReturnValue_1) == 0x00000C, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SetBalanceValues::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.SendQuestFishingEvent
// 0x00F8 (0x00F8 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput;      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0028(0x0020)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0048(0x00B0)()
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent) == 0x0000F8, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent, Actor) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent::Actor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent, CallFunc_GetOwnedGameplayTags_self_CastInput) == 0x000018, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent::CallFunc_GetOwnedGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000028, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent, K2Node_MakeStruct_GameplayEventData) == 0x000048, "Member 'BGA_Athena_FlopperSpawn_Parent_C_SendQuestFishingEvent::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.PlaySpawnItemHightier
// 0x0018 (0x0018 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_PlaySpawnItemHightier final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_PlaySpawnItemHightier) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_PlaySpawnItemHightier");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_PlaySpawnItemHightier) == 0x000018, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_PlaySpawnItemHightier");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_PlaySpawnItemHightier, Location) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_PlaySpawnItemHightier::Location' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.OnReady_5804F209455A50B3EE64E3AED087DE64
// 0x0030 (0x0030 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64) == 0x000030, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64, GameState) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64::GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64, Playlist) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64::Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64, PlaylistContextTags) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Parent_C_OnReady_5804F209455A50B3EE64E3AED087DE64::PlaylistContextTags' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.HideAndDelayForRespawn
// 0x0004 (0x0004 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_HideAndDelayForRespawn final
{
public:
	float                                         TimeToDelay;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_HideAndDelayForRespawn) == 0x000004, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_HideAndDelayForRespawn");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_HideAndDelayForRespawn) == 0x000004, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_HideAndDelayForRespawn");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_HideAndDelayForRespawn, TimeToDelay) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_HideAndDelayForRespawn::TimeToDelay' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.HandleUseTracking
// 0x0010 (0x0010 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking final
{
public:
	bool                                          CallFunc_Can_Respawn_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking) == 0x000004, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking) == 0x000010, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking, CallFunc_Can_Respawn_ReturnValue) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking::CallFunc_Can_Respawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking, Temp_int_Variable) == 0x000004, "Member 'BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BGA_Athena_FlopperSpawn_Parent_C_HandleUseTracking::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.GetLootTier
// 0x0058 (0x0058 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_GetLootTier final
{
public:
	bool                                          IsExplosion;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsProFishingRod;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Output_Get;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0044(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Map_Find_Value_1;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_GetLootTier");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier) == 0x000058, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_GetLootTier");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, IsExplosion) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::IsExplosion' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, IsProFishingRod) == 0x000001, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::IsProFishingRod' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, Output_Get) == 0x000004, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::Output_Get' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Map_Find_Value) == 0x00000C, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Map_Keys_Keys) == 0x000030, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Array_Get_Item) == 0x000044, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_HasTag_ReturnValue) == 0x000049, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Map_Find_Value_1) == 0x00004C, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_Map_Find_ReturnValue_1) == 0x000050, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_GetLootTier, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'BGA_Athena_FlopperSpawn_Parent_C_GetLootTier::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.FindFishSize
// 0x00F0 (0x00F0 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_FindFishSize final
{
public:
	TMap<struct FGameplayTag, struct FScalableFloat> FishSizeMap_0;                                     // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UFortItemDefinition*                    ItemDef;                                           // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         FishSize;                                          // 0x0058(0x0028)(Parm, OutParm)
	bool                                          Found;                                             // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           LocalFishSize;                                     // 0x0084(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0090(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x00A8(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CallFunc_Map_Find_Value;                           // 0x00C0(0x0028)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Parent_C_FindFishSize");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize) == 0x0000F0, "Wrong size on BGA_Athena_FlopperSpawn_Parent_C_FindFishSize");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, FishSizeMap_0) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::FishSizeMap_0' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, ItemDef) == 0x000050, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::ItemDef' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, FishSize) == 0x000058, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::FishSize' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, Found) == 0x000080, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::Found' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, LocalFishSize) == 0x000084, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::LocalFishSize' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, Temp_bool_True_if_break_was_hit_Variable) == 0x000088, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_Not_PreBool_ReturnValue) == 0x000089, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_Map_Keys_Keys) == 0x000090, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, Temp_int_Array_Index_Variable) == 0x0000A0, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_HasTag_ReturnValue) == 0x0000AC, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, Temp_int_Loop_Counter_Variable) == 0x0000B0, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_BooleanAND_ReturnValue) == 0x0000BC, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_Map_Find_Value) == 0x0000C0, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Parent_C_FindFishSize, CallFunc_Map_Find_ReturnValue) == 0x0000E8, "Member 'BGA_Athena_FlopperSpawn_Parent_C_FindFishSize::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Parent.BGA_Athena_FlopperSpawn_Parent_C.ExecuteUbergraph_BGA_Athena_FlopperSpawn_Parent
// 0x0F00 (0x0F00 - 0x0000)
struct BGA_Athena_FlopperSpawn_Parent_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0068(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APrj_Athena_FloppingRabbit_C*           K2Node_DynamicCast_AsPrj_Athena_Flopping_Rabbit;   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetPoiGridTagsForLocation_ReturnValue;    // 0x01A0(0x0020)()
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BoxTraceSingle_OutHit;                    // 0x01D8(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceSingle_ReturnValue;               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Select_Default;                             // 0x0418(0x0020)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0470(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hooked;                         // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_CustomEvent_HookComponent_1;                // 0x0570(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_SpawnLoc;                       // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Player_2;                       // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ItemSpawnDelay;                 // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CaughtWithFishingRod;           // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CaughtWithHappyGhost;           // 0x059D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E[0x2];                                      // 0x059E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_ItemUsedToFish;                 // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APrj_Athena_FloppingRabbit_C*           K2Node_CustomEvent_Projectile;                     // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_Required_Tags;                  // 0x05B0(0x0020)()
