#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_RealityFlower_SeedPod

#include "Basic.hpp"

#include "RealitySeedGameplayRuntime_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_RealityFlower_SeedPod.BGA_Athena_RealityFlower_SeedPod_C
// 0x0178 (0x0F90 - 0x0E18)
class ABGA_Athena_RealityFlower_SeedPod_C final : public ABuildingRealitySeedPod
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_RealityPod_Pulse;                               // 0x0E20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_RealityPod_Idle;                                // 0x0E28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0E30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortLinkToActorComponent*              FortLinkToActor;                                   // 0x0E38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Grow_SizePercent_86B45E174DE2455726BADBA7321F9397; // 0x0E40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Grow__Direction_86B45E174DE2455726BADBA7321F9397;  // 0x0E44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E45[0x3];                                      // 0x0E45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Grow;                                              // 0x0E48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_bCanBeDamaged;                                 // 0x0E50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_bExplodeOnDeath;                               // 0x0E78(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SeedsToSpawnOnDeath_Min;                       // 0x0EA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SeedsToSpawnOnDeath_Max;                       // 0x0EC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Seeds_RadialSpacingVarianceMult;               // 0x0EF0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SeedCollisionRadius;                           // 0x0F18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  Tags_IncomingDamageToIgnite;                       // 0x0F40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Mesh_Scale;                                        // 0x0F60(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         Mesh_MaxScale;                                     // 0x0F64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class ABuildingGameplayActor>     BGA_RealitySeed;                                   // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Die;                                            // 0x0F70(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SeedsToSpawnOnDeath;                               // 0x0F74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipDeathEffects;                                  // 0x0F78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollisionEnabled;                                  // 0x0F79(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F7A[0x2];                                      // 0x0F7A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GC_Damaged;                                        // 0x0F7C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySet*                        GAS_AbilitySet;                                    // 0x0F80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impact_TimeStamp;                                  // 0x0F88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BGA_RealityFlower_SeedPod_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedActorDestroyed__DelegateSignature(class AActor* DamageCauser);
	void ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod(int32 EntryPoint);
	void Grow__FinishedFunc();
	void Grow__UpdateFunc();
	void GrowOnSpawn();
	void OnBuildingActorInitialized(EFortBuildingInitializationReason InitializationReason, EFortBuildingPersistentState BuildingPersistentState);
	void OnCurieElementInteract_BP(const struct FCurieContainerHandle& CurieContainerHandle, const struct FGameplayTag& ElementTag, const struct FCurieInteractParamsHandle& InteractParamsHandle);
	void OnCurieElementInteractBegun_BP(const struct FCurieContainerHandle& CurieContainerHandle, const struct FGameplayTag& ElementTag, const struct FCurieInteractParamsHandle& InteractParamsHandle);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnRep_CollisionEnabled();
	void OnRep_Mesh_Scale();
	void ReceiveBeginPlay();
	void SpawnSeedsOnDeath();
	void Trigger_FX_Pulse();

	class FName GetMarkerDetailsId() const;
	void GetSpawnedSeedTransform(int32 SeedIndex, struct FTransform* SpawnTransform) const;
	void GetSpawnedSeedYaw(int32 SpawnedSeedIndex, float* Yaw) const;
	struct FGameplayTagContainer GetTargetTagsForQuestEvent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_RealityFlower_SeedPod_C">();
	}
	static class ABGA_Athena_RealityFlower_SeedPod_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_RealityFlower_SeedPod_C>();
	}
};
static_assert(alignof(ABGA_Athena_RealityFlower_SeedPod_C) == 0x000008, "Wrong alignment on ABGA_Athena_RealityFlower_SeedPod_C");
static_assert(sizeof(ABGA_Athena_RealityFlower_SeedPod_C) == 0x000F90, "Wrong size on ABGA_Athena_RealityFlower_SeedPod_C");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, UberGraphFrame) == 0x000E18, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, NS_RealityPod_Pulse) == 0x000E20, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::NS_RealityPod_Pulse' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, NS_RealityPod_Idle) == 0x000E28, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::NS_RealityPod_Idle' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Audio) == 0x000E30, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Audio' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, FortLinkToActor) == 0x000E38, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::FortLinkToActor' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Grow_SizePercent_86B45E174DE2455726BADBA7321F9397) == 0x000E40, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Grow_SizePercent_86B45E174DE2455726BADBA7321F9397' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Grow__Direction_86B45E174DE2455726BADBA7321F9397) == 0x000E44, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Grow__Direction_86B45E174DE2455726BADBA7321F9397' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Grow) == 0x000E48, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Grow' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Row_bCanBeDamaged) == 0x000E50, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Row_bCanBeDamaged' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Row_bExplodeOnDeath) == 0x000E78, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Row_bExplodeOnDeath' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Row_SeedsToSpawnOnDeath_Min) == 0x000EA0, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Row_SeedsToSpawnOnDeath_Min' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Row_SeedsToSpawnOnDeath_Max) == 0x000EC8, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Row_SeedsToSpawnOnDeath_Max' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Row_Seeds_RadialSpacingVarianceMult) == 0x000EF0, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Row_Seeds_RadialSpacingVarianceMult' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Row_SeedCollisionRadius) == 0x000F18, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Row_SeedCollisionRadius' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Tags_IncomingDamageToIgnite) == 0x000F40, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Tags_IncomingDamageToIgnite' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Mesh_Scale) == 0x000F60, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Mesh_Scale' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Mesh_MaxScale) == 0x000F64, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Mesh_MaxScale' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, BGA_RealitySeed) == 0x000F68, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::BGA_RealitySeed' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, GC_Die) == 0x000F70, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::GC_Die' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, SeedsToSpawnOnDeath) == 0x000F74, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::SeedsToSpawnOnDeath' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, SkipDeathEffects) == 0x000F78, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::SkipDeathEffects' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, CollisionEnabled) == 0x000F79, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::CollisionEnabled' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, GC_Damaged) == 0x000F7C, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::GC_Damaged' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, GAS_AbilitySet) == 0x000F80, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::GAS_AbilitySet' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_C, Impact_TimeStamp) == 0x000F88, "Member 'ABGA_Athena_RealityFlower_SeedPod_C::Impact_TimeStamp' has a wrong offset!");

}

