#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_FlopperSpawn_Junk

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_FlopperSpawn_Junk.BGA_Athena_FlopperSpawn_Junk_C.SpawnItem
// 0x0070 (0x0070 - 0x0000)
struct BGA_Athena_FlopperSpawn_Junk_C_SpawnItem final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hooked;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        HookComponent;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnLoc;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemSpawnDelay;                                    // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CaughtWithFishingRod;                              // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CaughtWithHappyGhost;                              // 0x003D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ItemUsedToFish;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APrj_Athena_FloppingRabbit_C*           Projectile_0;                                      // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Required_Tags;                                     // 0x0050(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Junk_C_SpawnItem");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem) == 0x000070, "Wrong size on BGA_Athena_FlopperSpawn_Junk_C_SpawnItem");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, Target) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::Target' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, Hooked) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::Hooked' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, HookComponent) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::HookComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, SpawnLoc) == 0x000018, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::SpawnLoc' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, Player) == 0x000030, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::Player' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, ItemSpawnDelay) == 0x000038, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::ItemSpawnDelay' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, CaughtWithFishingRod) == 0x00003C, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::CaughtWithFishingRod' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, CaughtWithHappyGhost) == 0x00003D, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::CaughtWithHappyGhost' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, ItemUsedToFish) == 0x000040, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::ItemUsedToFish' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, Projectile_0) == 0x000048, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::Projectile_0' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_SpawnItem, Required_Tags) == 0x000050, "Member 'BGA_Athena_FlopperSpawn_Junk_C_SpawnItem::Required_Tags' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Junk.BGA_Athena_FlopperSpawn_Junk_C.GetLootTier
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_FlopperSpawn_Junk_C_GetLootTier final
{
public:
	bool                                          IsExplosion;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsProFishingRod;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Output_Get;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Junk_C_GetLootTier) == 0x000004, "Wrong alignment on BGA_Athena_FlopperSpawn_Junk_C_GetLootTier");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Junk_C_GetLootTier) == 0x000008, "Wrong size on BGA_Athena_FlopperSpawn_Junk_C_GetLootTier");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_GetLootTier, IsExplosion) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Junk_C_GetLootTier::IsExplosion' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_GetLootTier, IsProFishingRod) == 0x000001, "Member 'BGA_Athena_FlopperSpawn_Junk_C_GetLootTier::IsProFishingRod' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_GetLootTier, Output_Get) == 0x000004, "Member 'BGA_Athena_FlopperSpawn_Junk_C_GetLootTier::Output_Get' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Junk.BGA_Athena_FlopperSpawn_Junk_C.ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk
// 0x0180 (0x0180 - 0x0000)
struct BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Hooked;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_Event_HookComponent;                        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_SpawnLoc;                             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Player;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ItemSpawnDelay;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_CaughtWithFishingRod;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_CaughtWithHappyGhost;                 // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_ItemUsedToFish;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APrj_Athena_FloppingRabbit_C*           K2Node_Event_Projectile;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_Required_Tags;                        // 0x0090(0x0020)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATiered_Chest_Athena_Flopper_Proto_C*   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk) == 0x000010, "Wrong alignment on BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk) == 0x000180, "Wrong size on BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, EntryPoint) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_IsServer_ReturnValue) == 0x000009, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_CustomEvent_Location) == 0x000010, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_Target) == 0x000040, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_Hooked) == 0x000048, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_Hooked' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_HookComponent) == 0x000050, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_HookComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_SpawnLoc) == 0x000058, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_SpawnLoc' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_Player) == 0x000070, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_ItemSpawnDelay) == 0x000078, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_ItemSpawnDelay' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_CaughtWithFishingRod) == 0x00007C, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_CaughtWithFishingRod' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_CaughtWithHappyGhost) == 0x00007D, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_CaughtWithHappyGhost' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_ItemUsedToFish) == 0x000080, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_ItemUsedToFish' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_Projectile) == 0x000088, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_Projectile' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Event_Required_Tags) == 0x000090, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Event_Required_Tags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_BooleanOR_ReturnValue) == 0x0000B0, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B8, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000D0, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_GetInstigator_ReturnValue) == 0x0000E0, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, Temp_bool_Variable) == 0x0000E8, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, K2Node_Select_Default) == 0x0000F0, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000170, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk, CallFunc_FinishSpawningActor_ReturnValue) == 0x000178, "Member 'BGA_Athena_FlopperSpawn_Junk_C_ExecuteUbergraph_BGA_Athena_FlopperSpawn_Junk::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FlopperSpawn_Junk.BGA_Athena_FlopperSpawn_Junk_C.CustomEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BGA_Athena_FlopperSpawn_Junk_C_CustomEvent_1 final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FlopperSpawn_Junk_C_CustomEvent_1) == 0x000008, "Wrong alignment on BGA_Athena_FlopperSpawn_Junk_C_CustomEvent_1");
static_assert(sizeof(BGA_Athena_FlopperSpawn_Junk_C_CustomEvent_1) == 0x000018, "Wrong size on BGA_Athena_FlopperSpawn_Junk_C_CustomEvent_1");
static_assert(offsetof(BGA_Athena_FlopperSpawn_Junk_C_CustomEvent_1, Location) == 0x000000, "Member 'BGA_Athena_FlopperSpawn_Junk_C_CustomEvent_1::Location' has a wrong offset!");

}

