#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_Sentry_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_Sentry_Parent.BGA_Athena_Sentry_Parent_C.AttemptToRegisterWithDataTrackerManager
// 0x0038 (0x0038 - 0x0000)
struct BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetStateTagFromEnumValue_StateTag;        // 0x001C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStateTagFromEnumValue_bFoundValidData; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponentManager* CallFunc_GetCurrent_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0034(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager) == 0x000008, "Wrong alignment on BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager");
static_assert(sizeof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager) == 0x000038, "Wrong size on BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000018, "Member 'BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager, CallFunc_GetStateTagFromEnumValue_StateTag) == 0x00001C, "Member 'BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager::CallFunc_GetStateTagFromEnumValue_StateTag' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager, CallFunc_GetStateTagFromEnumValue_bFoundValidData) == 0x000020, "Member 'BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager::CallFunc_GetStateTagFromEnumValue_bFoundValidData' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager, Temp_bool_Variable) == 0x000021, "Member 'BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager, CallFunc_GetCurrent_ReturnValue) == 0x000028, "Member 'BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager::CallFunc_GetCurrent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager, K2Node_Select_Default) == 0x000034, "Member 'BGA_Athena_Sentry_Parent_C_AttemptToRegisterWithDataTrackerManager::K2Node_Select_Default' has a wrong offset!");

// Function BGA_Athena_Sentry_Parent.BGA_Athena_Sentry_Parent_C.BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BGA_Athena_Sentry_Parent.BGA_Athena_Sentry_Parent_C.BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__ActivationVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BGA_Athena_Sentry_Parent.BGA_Athena_Sentry_Parent_C.BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_2_OnLinkedActorDestroyed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_Sentry_Parent_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_2_OnLinkedActorDestroyed__DelegateSignature final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Sentry_Parent_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_2_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_Sentry_Parent_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_2_OnLinkedActorDestroyed__DelegateSignature");
static_assert(sizeof(BGA_Athena_Sentry_Parent_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_2_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong size on BGA_Athena_Sentry_Parent_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_2_OnLinkedActorDestroyed__DelegateSignature");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_2_OnLinkedActorDestroyed__DelegateSignature, DamageCauser) == 0x000000, "Member 'BGA_Athena_Sentry_Parent_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_2_OnLinkedActorDestroyed__DelegateSignature::DamageCauser' has a wrong offset!");

// Function BGA_Athena_Sentry_Parent.BGA_Athena_Sentry_Parent_C.CanDoTargeting
// 0x0004 (0x0004 - 0x0000)
struct BGA_Athena_Sentry_Parent_C_CanDoTargeting final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Sentry_Parent_C_CanDoTargeting) == 0x000001, "Wrong alignment on BGA_Athena_Sentry_Parent_C_CanDoTargeting");
static_assert(sizeof(BGA_Athena_Sentry_Parent_C_CanDoTargeting) == 0x000004, "Wrong size on BGA_Athena_Sentry_Parent_C_CanDoTargeting");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_CanDoTargeting, Return) == 0x000000, "Member 'BGA_Athena_Sentry_Parent_C_CanDoTargeting::Return' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_CanDoTargeting, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BGA_Athena_Sentry_Parent_C_CanDoTargeting::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_CanDoTargeting, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000002, "Member 'BGA_Athena_Sentry_Parent_C_CanDoTargeting::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_CanDoTargeting, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BGA_Athena_Sentry_Parent_C_CanDoTargeting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BGA_Athena_Sentry_Parent.BGA_Athena_Sentry_Parent_C.CanTargetPawn
// 0x0010 (0x0010 - 0x0000)
struct BGA_Athena_Sentry_Parent_C_CanTargetPawn final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Sentry_Parent_C_CanTargetPawn) == 0x000008, "Wrong alignment on BGA_Athena_Sentry_Parent_C_CanTargetPawn");
static_assert(sizeof(BGA_Athena_Sentry_Parent_C_CanTargetPawn) == 0x000010, "Wrong size on BGA_Athena_Sentry_Parent_C_CanTargetPawn");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_CanTargetPawn, Pawn) == 0x000000, "Member 'BGA_Athena_Sentry_Parent_C_CanTargetPawn::Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_CanTargetPawn, ReturnValue) == 0x000008, "Member 'BGA_Athena_Sentry_Parent_C_CanTargetPawn::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_CanTargetPawn, CallFunc_IsDead_ReturnValue) == 0x000009, "Member 'BGA_Athena_Sentry_Parent_C_CanTargetPawn::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_CanTargetPawn, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'BGA_Athena_Sentry_Parent_C_CanTargetPawn::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_CanTargetPawn, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'BGA_Athena_Sentry_Parent_C_CanTargetPawn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BGA_Athena_Sentry_Parent.BGA_Athena_Sentry_Parent_C.ExecuteUbergraph_BGA_Athena_Sentry_Parent
// 0x07D8 (0x07D8 - 0x0000)
struct BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0040(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0180(0x00B0)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_1;                             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0258(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x0290(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0380(0x0018)()
	float                                         K2Node_Event_Damage;                               // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x03A0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x03D8(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x04C8(0x0018)()
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2[0x2];                                      // 0x04E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0538(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0560(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0580(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0598(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x05B0(0x00D0)(ContainsInstancedReference)
	bool                                          CallFunc_CanDoTargeting_Return;                    // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBuildingGameplayActorSentry_State            Temp_byte_Variable;                                // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x06A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBuildingGameplayActorSentry_State            Temp_byte_Variable_1;                              // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x06B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x06BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BB[0x1];                                      // 0x06BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x06C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_LookLocationToWorldRotation_ReturnValue;  // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_LookLocationToWorldRotation_ReturnValue_1; // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBuildingGameplayActorSentry_State            Temp_byte_Variable_2;                              // 0x06F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x06FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x06FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x06FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x06FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x06FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0701(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0702(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_703[0x5];                                      // 0x0703(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0708(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x072C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x072D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x072E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBuildingGameplayActorSentry_State            K2Node_Select_Default;                             // 0x072F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBuildingGameplayActorSentry_State            K2Node_Select_Default_1;                           // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0738(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0750(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0769(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x076A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76B[0x5];                                      // 0x076B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0770(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0789(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x078A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x078B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_3;                   // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0790(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponentManager* CallFunc_GetCurrent_ReturnValue;                   // 0x07B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x07B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BA[0x6];                                      // 0x07BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponentManager* CallFunc_GetCurrent_ReturnValue_1;                 // 0x07C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CA[0x2];                                      // 0x07CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetStateTagFromEnumValue_StateTag;        // 0x07CC(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStateTagFromEnumValue_bFoundValidData; // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable_3;                              // 0x07D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_2;                           // 0x07D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent) == 0x000008, "Wrong alignment on BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent");
static_assert(sizeof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent) == 0x0007D8, "Wrong size on BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, EntryPoint) == 0x000000, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000011, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000020, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000028, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000030, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000038, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_bFromSweep) == 0x00003C, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_SweepResult) == 0x000040, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000120, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000128, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000138, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_OtherActor) == 0x000140, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_OtherComp) == 0x000148, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000150, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000158, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000168, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000178, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_IsServer_ReturnValue) == 0x000179, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_MakeStruct_GameplayEventData) == 0x000180, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000230, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000240, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, Temp_bool_IsClosed_Variable) == 0x000241, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_ComponentBoundEvent_DamageCauser) == 0x000248, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_Damage_1) == 0x000250, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_DamageTags_1) == 0x000258, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_Momentum_1) == 0x000278, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_HitInfo_1) == 0x000290, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_InstigatedBy_1) == 0x000370, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_DamageCauser_1) == 0x000378, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_EffectContext_1) == 0x000380, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_Damage) == 0x000398, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_DamageTags) == 0x0003A0, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_Momentum) == 0x0003C0, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_HitInfo) == 0x0003D8, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_InstigatedBy) == 0x0004B8, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_DamageCauser) == 0x0004C0, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, K2Node_Event_EffectContext) == 0x0004C8, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_bBlockingHit) == 0x0004E0, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_bInitialOverlap) == 0x0004E1, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_Time) == 0x0004E4, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_Distance) == 0x0004E8, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_Location) == 0x0004F0, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_ImpactPoint) == 0x000508, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_Normal) == 0x000520, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_ImpactNormal) == 0x000538, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_PhysMat) == 0x000550, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent, CallFunc_BreakHitResult_HitActor) == 0x000558, "Member 'BGA_Athena_Sentry_Parent_C_ExecuteUbergraph_BGA_Athena_Sentry_Parent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
