#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_ShieldGenerator_NonPhysics

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BGA_Athena_WithGravity_Parent_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_ShieldGenerator_NonPhysics.BGA_Athena_ShieldGenerator_NonPhysics_C
// 0x01D8 (0x0DE8 - 0x0C10)
class ABGA_Athena_ShieldGenerator_NonPhysics_C final : public ABGA_Athena_WithGravity_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Athena_ShieldGenerator_NonPhysics_C; // 0x0C10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortPhysicsObjectComponent*            FortPhysicsObject;                                 // 0x0C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortPhysicsObjectNavigationComponent*  FortPhysicsObjectNavigation;                       // 0x0C20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        EruptStartSound;                                   // 0x0C28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      WaterInteractionCollision;                         // 0x0C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX;                                                // 0x0C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        EruptLoopSound;                                    // 0x0C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       AoECollision;                                      // 0x0C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_ShieldGeneratorDied;                         // 0x0C50(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C54[0x4];                                      // 0x0C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_AoeRadius;                                     // 0x0C58(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_Lifespan;                                      // 0x0C80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_GC_HitWorld;                                   // 0x0CA8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_GC_HitWater;                                   // 0x0CAC(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_GC_Destroyed;                                  // 0x0CB0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB4[0x4];                                      // 0x0CB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GE_Channel;                                        // 0x0CB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AB_Decal_ShieldGenerator_C*             SpawnedDecal;                                      // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterSplashFXCooldown;                             // 0x0CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCC[0x4];                                      // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_WaterSplashFXCooldown;                         // 0x0CD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DiedFromTimeOut;                                   // 0x0CF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF9[0x3];                                      // 0x0CF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag_GC_TimedOut;                                   // 0x0CFC(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      WaterTraceObjectTypes;                             // 0x0D00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_WaterSplashMagnitude;                          // 0x0D10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_WaterSplashInterval;                           // 0x0D38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SetFXMode;                                         // 0x0D60(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D64[0x4];                                      // 0x0D64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Handle_UpdateDecalTimer;                           // 0x0D68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasSetPreviousDecalLocation;                       // 0x0D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D71[0x7];                                      // 0x0D71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PreviousDecalLocation;                             // 0x0D78(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_DecalUpdateInterval;                           // 0x0D90(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_DecalMinDistanceToRespawn;                     // 0x0DB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DistanceFromLastDecalLocation;                     // 0x0DE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyWaterInArea();
	void BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody);
	void BndEvt__BGA_Athena_ShieldGenerator_NonPhysics_FortWaterInteraction_K2Node_ComponentBoundEvent_1_WaterInteractionOnExitWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsLastBody);
	void EndFX();
	void ExecuteUbergraph_BGA_Athena_ShieldGenerator_NonPhysics(int32 EntryPoint);
	void HandleBinding(class AActor* Actor, class UPrimitiveComponent* HitComp);
	void KillSelf();
	void Mark();
	void OnBuildingActorInitialized(EFortBuildingInitializationReason InitializationReason, EFortBuildingPersistentState BuildingPersistentState);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnRep_SetFXMode();
	void PlayFX();
	void PlayHitFX(const struct FHitResult& HitResult);
	void ReceiveBeginPlay();
	void RemoveDecal(bool StopDecalUpdates);
	void ResetEnterWaterEvent();
	void SetLocationFromServer(const struct FVector& ServerLocation);
	void SpawnNewDecal();
	void Update_FX_for_Water(class AFortWaterBodyActor* Water_Body, bool IsInWater);
	void UpdateDecal();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_ShieldGenerator_NonPhysics_C">();
	}
	static class ABGA_Athena_ShieldGenerator_NonPhysics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_ShieldGenerator_NonPhysics_C>();
	}
};
static_assert(alignof(ABGA_Athena_ShieldGenerator_NonPhysics_C) == 0x000008, "Wrong alignment on ABGA_Athena_ShieldGenerator_NonPhysics_C");
static_assert(sizeof(ABGA_Athena_ShieldGenerator_NonPhysics_C) == 0x000DE8, "Wrong size on ABGA_Athena_ShieldGenerator_NonPhysics_C");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, UberGraphFrame_BGA_Athena_ShieldGenerator_NonPhysics_C) == 0x000C10, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::UberGraphFrame_BGA_Athena_ShieldGenerator_NonPhysics_C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, FortPhysicsObject) == 0x000C18, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::FortPhysicsObject' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, FortPhysicsObjectNavigation) == 0x000C20, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::FortPhysicsObjectNavigation' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, EruptStartSound) == 0x000C28, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::EruptStartSound' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, WaterInteractionCollision) == 0x000C30, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::WaterInteractionCollision' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, FX) == 0x000C38, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::FX' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, EruptLoopSound) == 0x000C40, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::EruptLoopSound' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, AoECollision) == 0x000C48, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::AoECollision' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Event_ShieldGeneratorDied) == 0x000C50, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Event_ShieldGeneratorDied' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Row_AoeRadius) == 0x000C58, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Row_AoeRadius' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Row_Lifespan) == 0x000C80, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Row_Lifespan' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Tag_GC_HitWorld) == 0x000CA8, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Tag_GC_HitWorld' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Tag_GC_HitWater) == 0x000CAC, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Tag_GC_HitWater' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Tag_GC_Destroyed) == 0x000CB0, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Tag_GC_Destroyed' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, GE_Channel) == 0x000CB8, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::GE_Channel' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, SpawnedDecal) == 0x000CC0, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::SpawnedDecal' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, WaterSplashFXCooldown) == 0x000CC8, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::WaterSplashFXCooldown' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Row_WaterSplashFXCooldown) == 0x000CD0, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Row_WaterSplashFXCooldown' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, DiedFromTimeOut) == 0x000CF8, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::DiedFromTimeOut' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Tag_GC_TimedOut) == 0x000CFC, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Tag_GC_TimedOut' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, WaterTraceObjectTypes) == 0x000D00, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::WaterTraceObjectTypes' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Row_WaterSplashMagnitude) == 0x000D10, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Row_WaterSplashMagnitude' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Row_WaterSplashInterval) == 0x000D38, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Row_WaterSplashInterval' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, SetFXMode) == 0x000D60, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::SetFXMode' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Handle_UpdateDecalTimer) == 0x000D68, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Handle_UpdateDecalTimer' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, HasSetPreviousDecalLocation) == 0x000D70, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::HasSetPreviousDecalLocation' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, PreviousDecalLocation) == 0x000D78, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::PreviousDecalLocation' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Row_DecalUpdateInterval) == 0x000D90, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Row_DecalUpdateInterval' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, Row_DecalMinDistanceToRespawn) == 0x000DB8, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::Row_DecalMinDistanceToRespawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_ShieldGenerator_NonPhysics_C, DistanceFromLastDecalLocation) == 0x000DE0, "Member 'ABGA_Athena_ShieldGenerator_NonPhysics_C::DistanceFromLastDecalLocation' has a wrong offset!");

}

