#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Vortex_Area_Effect_VentShaft

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "BGA_DudeBro_Mini_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Vortex_Area_Effect_VentShaft.BGA_Vortex_Area_Effect_VentShaft_C
// 0x0068 (0x0C30 - 0x0BC8)
class ABGA_Vortex_Area_Effect_VentShaft_C final : public ABGA_DudeBro_Mini_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Vortex_Area_Effect_VentShaft_C; // 0x0BC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Cave_VentShaft_Round;                           // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Updraft_VentShaft;                              // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan_Updraft_04;                                    // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan_Updraft_01;                                    // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan_Updraft_02;                                    // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan_Updraft_03;                                    // 0x0BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Apollo_PowerPlant_Updraft;                       // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        UpdraftAudio;                                      // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  LTMTag;                                            // 0x0C10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft(int32 EntryPoint);
	void OnReady_56638133436A4AFB6D3679BEE81348CB(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Vortex_Area_Effect_VentShaft_C">();
	}
	static class ABGA_Vortex_Area_Effect_VentShaft_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Vortex_Area_Effect_VentShaft_C>();
	}
};
static_assert(alignof(ABGA_Vortex_Area_Effect_VentShaft_C) == 0x000008, "Wrong alignment on ABGA_Vortex_Area_Effect_VentShaft_C");
static_assert(sizeof(ABGA_Vortex_Area_Effect_VentShaft_C) == 0x000C30, "Wrong size on ABGA_Vortex_Area_Effect_VentShaft_C");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, UberGraphFrame_BGA_Vortex_Area_Effect_VentShaft_C) == 0x000BC8, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::UberGraphFrame_BGA_Vortex_Area_Effect_VentShaft_C' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, SM_Cave_VentShaft_Round) == 0x000BD0, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::SM_Cave_VentShaft_Round' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, NS_Updraft_VentShaft) == 0x000BD8, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::NS_Updraft_VentShaft' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, Fan_Updraft_04) == 0x000BE0, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::Fan_Updraft_04' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, Fan_Updraft_01) == 0x000BE8, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::Fan_Updraft_01' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, Fan_Updraft_02) == 0x000BF0, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::Fan_Updraft_02' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, Fan_Updraft_03) == 0x000BF8, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::Fan_Updraft_03' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, P_Apollo_PowerPlant_Updraft) == 0x000C00, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::P_Apollo_PowerPlant_Updraft' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, UpdraftAudio) == 0x000C08, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::UpdraftAudio' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_VentShaft_C, LTMTag) == 0x000C10, "Member 'ABGA_Vortex_Area_Effect_VentShaft_C::LTMTag' has a wrong offset!");

}

