#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Held_Petrol_Pump

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BGA_Held_Petrol_Pump.BGA_Held_Petrol_Pump_C.ExecuteUbergraph_BGA_Held_Petrol_Pump
// 0x0060 (0x0060 - 0x0000)
struct BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DistanceBetweenTwoVectors_Distance;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump) == 0x000008, "Wrong alignment on BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump");
static_assert(sizeof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump) == 0x000060, "Wrong size on BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, EntryPoint) == 0x000000, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_HasAuthority_ReturnValue) == 0x00001A, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_IsValid_ReturnValue_2) == 0x00001B, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_IsValid_ReturnValue_3) == 0x00001C, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_DistanceBetweenTwoVectors_Distance) == 0x000038, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_DistanceBetweenTwoVectors_Distance' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_GetInstigator_ReturnValue) == 0x000040, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, K2Node_DynamicCast_AsFort_Pawn) == 0x000048, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_GetValueAtLevel_ReturnValue) == 0x000054, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00005C, "Member 'BGA_Held_Petrol_Pump_C_ExecuteUbergraph_BGA_Held_Petrol_Pump::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BGA_Held_Petrol_Pump.BGA_Held_Petrol_Pump_C.BlueprintCanInteract
// 0x0020 (0x0020 - 0x0000)
struct BGA_Held_Petrol_Pump_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteract_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Held_Petrol_Pump_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on BGA_Held_Petrol_Pump_C_BlueprintCanInteract");
static_assert(sizeof(BGA_Held_Petrol_Pump_C_BlueprintCanInteract) == 0x000020, "Wrong size on BGA_Held_Petrol_Pump_C_BlueprintCanInteract");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'BGA_Held_Petrol_Pump_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'BGA_Held_Petrol_Pump_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'BGA_Held_Petrol_Pump_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'BGA_Held_Petrol_Pump_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintCanInteract, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'BGA_Held_Petrol_Pump_C_BlueprintCanInteract::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintCanInteract, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BGA_Held_Petrol_Pump_C_BlueprintCanInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintCanInteract, CallFunc_CanInteract_ReturnValue) == 0x000019, "Member 'BGA_Held_Petrol_Pump_C_BlueprintCanInteract::CallFunc_CanInteract_ReturnValue' has a wrong offset!");

// Function BGA_Held_Petrol_Pump.BGA_Held_Petrol_Pump_C.BlueprintGetInteractionTime
// 0x0018 (0x0018 - 0x0000)
struct BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutInteractionTime;                                // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x000C(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime) == 0x000008, "Wrong alignment on BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime");
static_assert(sizeof(BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime) == 0x000018, "Wrong size on BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime, InteractingPawn) == 0x000000, "Member 'BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime, OutInteractionTime) == 0x000008, "Member 'BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime::OutInteractionTime' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime, InteractionBeingAttempted) == 0x00000C, "Member 'BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime, ReturnValue) == 0x00000D, "Member 'BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime, CallFunc_GetValueAtLevel_ReturnValue) == 0x000010, "Member 'BGA_Held_Petrol_Pump_C_BlueprintGetInteractionTime::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");

}

