#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_RealityFlower_SeedPod

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Curie_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_RealityFlower_SeedPod.BGA_Athena_RealityFlower_SeedPod_C.BndEvt__BGA_RealityFlower_SeedPod_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedActorDestroyed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_C_BndEvt__BGA_RealityFlower_SeedPod_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedActorDestroyed__DelegateSignature final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_C_BndEvt__BGA_RealityFlower_SeedPod_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_C_BndEvt__BGA_RealityFlower_SeedPod_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedActorDestroyed__DelegateSignature");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_C_BndEvt__BGA_RealityFlower_SeedPod_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong size on BGA_Athena_RealityFlower_SeedPod_C_BndEvt__BGA_RealityFlower_SeedPod_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedActorDestroyed__DelegateSignature");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_BndEvt__BGA_RealityFlower_SeedPod_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedActorDestroyed__DelegateSignature, DamageCauser) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_C_BndEvt__BGA_RealityFlower_SeedPod_FortLinkToActor_K2Node_ComponentBoundEvent_1_OnLinkedActorDestroyed__DelegateSignature::DamageCauser' has a wrong offset!");

// Function BGA_Athena_RealityFlower_SeedPod.BGA_Athena_RealityFlower_SeedPod_C.ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod
// 0x0940 (0x0940 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_2;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_2;                         // 0x0010(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_2;                           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_2;                            // 0x0048(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_2;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_2;                       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_2;                      // 0x0138(0x0018)()
	EFortBuildingInitializationReason             K2Node_Event_InitializationReason;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBuildingPersistentState                  K2Node_Event_BuildingPersistentState;              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieContainerHandle                  K2Node_Event_CurieContainerHandle_1;               // 0x0154(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_ElementTag_1;                         // 0x0158(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractParamsHandle             K2Node_Event_InteractParamsHandle_1;               // 0x0160(0x0010)(ConstParm)
	struct FCurieContainerHandle                  K2Node_Event_CurieContainerHandle;                 // 0x0170(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_ElementTag;                           // 0x0174(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FCurieInteractParamsHandle             K2Node_Event_InteractParamsHandle;                 // 0x0178(0x0010)(ConstParm)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_1;                             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0190(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x01C8(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x02B8(0x0018)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeSimpleFortEffectContext_ReturnValue;  // 0x02D8(0x0018)()
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x03C0(0x00D0)(ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_492[0x2];                                      // 0x0492(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSpawnedSeedTransform_SpawnTransform;   // 0x04C0(0x0060)(IsPlainOldData, NoDestructor)
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActorFromWorldContext_ReturnValue; // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_RealityFlower_Seed_C*       K2Node_DynamicCast_AsBGA_Athena_Reality_Flower_Seed; // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552[0x6];                                      // 0x0552(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0558(0x00B0)()
	float                                         K2Node_Event_Damage;                               // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0610(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0648(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0738(0x0018)()
	TScriptInterface<class IAbilitySystemInterface> CallFunc_EquipFortAbilitySet_AbilitySystemInterfaceActor_CastInput; // 0x0750(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FFortAbilitySetHandle                  CallFunc_EquipFortAbilitySet_ReturnValue;          // 0x0760(0x0038)(ContainsInstancedReference)
	uint8                                         Pad_798[0x8];                                      // 0x0798(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x07A0(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0800(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0818(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0830(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0848(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0860(0x00D0)(ContainsInstancedReference)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x093C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod) == 0x000010, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod) == 0x000940, "Wrong size on BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, EntryPoint) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_Damage_2) == 0x000008, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_Damage_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_DamageTags_2) == 0x000010, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_DamageTags_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_Momentum_2) == 0x000030, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_Momentum_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_HitInfo_2) == 0x000048, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_HitInfo_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_InstigatedBy_2) == 0x000128, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_InstigatedBy_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_DamageCauser_2) == 0x000130, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_DamageCauser_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_EffectContext_2) == 0x000138, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_EffectContext_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_InitializationReason) == 0x000150, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_InitializationReason' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_BuildingPersistentState) == 0x000151, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_BuildingPersistentState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_CurieContainerHandle_1) == 0x000154, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_CurieContainerHandle_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_ElementTag_1) == 0x000158, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_ElementTag_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_InteractParamsHandle_1) == 0x000160, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_InteractParamsHandle_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_CurieContainerHandle) == 0x000170, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_CurieContainerHandle' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_ElementTag) == 0x000174, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_ElementTag' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_InteractParamsHandle) == 0x000178, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_InteractParamsHandle' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000188, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000189, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_Damage_1) == 0x00018C, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_DamageTags_1) == 0x000190, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_Momentum_1) == 0x0001B0, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_HitInfo_1) == 0x0001C8, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_InstigatedBy_1) == 0x0002A8, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_DamageCauser_1) == 0x0002B0, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_EffectContext_1) == 0x0002B8, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_HasAnyTags_ReturnValue) == 0x0002D0, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_MakeSimpleFortEffectContext_ReturnValue) == 0x0002D8, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_MakeSimpleFortEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_bBlockingHit) == 0x0002F0, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002F1, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_Time) == 0x0002F4, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_Distance) == 0x0002F8, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_Location) == 0x000300, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_ImpactPoint) == 0x000318, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_Normal) == 0x000330, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_ImpactNormal) == 0x000348, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_PhysMat) == 0x000360, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_HitActor) == 0x000368, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_HitComponent) == 0x000370, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_HitBoneName) == 0x000378, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_BoneName) == 0x00037C, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_HitItem) == 0x000380, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_ElementIndex) == 0x000384, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_FaceIndex) == 0x000388, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_TraceStart) == 0x000390, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakHitResult_TraceEnd) == 0x0003A8, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0003C0, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, Temp_bool_Has_Been_Initd_Variable_1) == 0x000490, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_GetValueAsBool_ReturnValue) == 0x000491, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_Subtract_IntInt_ReturnValue) == 0x000494, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_GetValueAtLevel_ReturnValue) == 0x000498, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00049C, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_FTrunc_ReturnValue) == 0x0004A0, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_FTrunc_ReturnValue_1) == 0x0004A4, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_Max_ReturnValue) == 0x0004A8, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_Greater_IntInt_ReturnValue) == 0x0004AC, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_Min_ReturnValue) == 0x0004B0, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0004B4, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, Temp_int_Variable) == 0x0004B8, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_GetSpawnedSeedTransform_SpawnTransform) == 0x0004C0, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_GetSpawnedSeedTransform_SpawnTransform' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_SpawnBuildingGameplayActorFromWorldContext_ReturnValue) == 0x000520, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_SpawnBuildingGameplayActorFromWorldContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000528, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_DynamicCast_AsBGA_Athena_Reality_Flower_Seed) == 0x000530, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_DynamicCast_AsBGA_Athena_Reality_Flower_Seed' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_DynamicCast_bSuccess) == 0x000538, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_Add_IntInt_ReturnValue) == 0x00053C, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_IsServer_ReturnValue) == 0x000540, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_ComponentBoundEvent_DamageCauser) == 0x000548, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_Not_PreBool_ReturnValue) == 0x000550, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, Temp_bool_IsClosed_Variable_1) == 0x000551, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_MakeStruct_GameplayEventData) == 0x000558, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_Damage) == 0x000608, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_DamageTags) == 0x000610, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_Momentum) == 0x000630, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_HitInfo) == 0x000648, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_InstigatedBy) == 0x000728, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_DamageCauser) == 0x000730, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, K2Node_Event_EffectContext) == 0x000738, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_EquipFortAbilitySet_AbilitySystemInterfaceActor_CastInput) == 0x000750, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_EquipFortAbilitySet_AbilitySystemInterfaceActor_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_EquipFortAbilitySet_ReturnValue) == 0x000760, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_EquipFortAbilitySet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_GetSocketTransform_ReturnValue) == 0x0007A0, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakTransform_Location) == 0x000800, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakTransform_Rotation) == 0x000818, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_BreakTransform_Scale) == 0x000830, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000848, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000860, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000930, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000934, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000938, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00093C, "Member 'BGA_Athena_RealityFlower_SeedPod_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BGA_Athena_RealityFlower_SeedPod.BGA_Athena_RealityFlower_SeedPod_C.OnBuildingActorInitialized
// 0x0002 (0x0002 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_C_OnBuildingActorInitialized final
{
public:
	EFortBuildingInitializationReason             InitializationReason;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBuildingPersistentState                  BuildingPersistentState;                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_C_OnBuildingActorInitialized) == 0x000001, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_C_OnBuildingActorInitialized");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_C_OnBuildingActorInitialized) == 0x000002, "Wrong size on BGA_Athena_RealityFlower_SeedPod_C_OnBuildingActorInitialized");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnBuildingActorInitialized, InitializationReason) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnBuildingActorInitialized::InitializationReason' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnBuildingActorInitialized, BuildingPersistentState) == 0x000001, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnBuildingActorInitialized::BuildingPersistentState' has a wrong offset!");

// Function BGA_Athena_RealityFlower_SeedPod.BGA_Athena_RealityFlower_SeedPod_C.OnCurieElementInteract_BP
// 0x0018 (0x0018 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ElementTag;                                        // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FCurieInteractParamsHandle             InteractParamsHandle;                              // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP) == 0x000008, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP) == 0x000018, "Wrong size on BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP, CurieContainerHandle) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP::CurieContainerHandle' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP, ElementTag) == 0x000004, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP::ElementTag' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP, InteractParamsHandle) == 0x000008, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteract_BP::InteractParamsHandle' has a wrong offset!");

// Function BGA_Athena_RealityFlower_SeedPod.BGA_Athena_RealityFlower_SeedPod_C.OnCurieElementInteractBegun_BP
// 0x0018 (0x0018 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ElementTag;                                        // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FCurieInteractParamsHandle             InteractParamsHandle;                              // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP) == 0x000008, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP) == 0x000018, "Wrong size on BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP, CurieContainerHandle) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP::CurieContainerHandle' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP, ElementTag) == 0x000004, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP::ElementTag' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP, InteractParamsHandle) == 0x000008, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnCurieElementInteractBegun_BP::InteractParamsHandle' has a wrong offset!");

// Function BGA_Athena_RealityFlower_SeedPod.BGA_Athena_RealityFlower_SeedPod_C.OnDamageServer
// 0x0148 (0x0148 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer) == 0x000008, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer) == 0x000148, "Wrong size on BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer, Damage) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer, DamageTags) == 0x000008, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer, Momentum) == 0x000028, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer, HitInfo) == 0x000040, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer, InstigatedBy) == 0x000120, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer, DamageCauser) == 0x000128, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer, EffectContext) == 0x000130, "Member 'BGA_Athena_RealityFlower_SeedPod_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function BGA_Athena_RealityFlower_SeedPod.BGA_Athena_RealityFlower_SeedPod_C.OnDeathPlayEffects
// 0x0148 (0x0148 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
