#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_RealityFlower_SeedPod_SpawnManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_RealityFlower_SeedPod_SpawnManager.BGA_Athena_RealityFlower_SeedPod_SpawnManager_C
// 0x0098 (0x0A08 - 0x0970)
class ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0970(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x0978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABGA_Athena_RealityFlower_SeedPod_C*> SeedPods;                                          // 0x0988(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FScalableFloat                         Row_SeedPodsToSpawn_Min;                           // 0x0998(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SeedPodsToSpawn_Max;                           // 0x09C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SeedPodsToSpawn;                                   // 0x09E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         SeedPodsToDestroy;                                 // 0x09EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<struct FVector>                        LinkedSeedPodLocations;                            // 0x09F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DebugTest_SpawnAllPods;                            // 0x0A00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CreateLinkedSeedPodLocationArray();
	void DebugSeedPodManager();
	void ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager(int32 EntryPoint);
	void OnReady_E053B1C94CDC75701FECB9A51B4A252F(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void ReceiveBeginPlay();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_RealityFlower_SeedPod_SpawnManager_C">();
	}
	static class ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C>();
	}
};
static_assert(alignof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C) == 0x000008, "Wrong alignment on ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C");
static_assert(sizeof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C) == 0x000A08, "Wrong size on ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, UberGraphFrame) == 0x000970, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, TextRender) == 0x000978, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, DefaultSceneRoot) == 0x000980, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, SeedPods) == 0x000988, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::SeedPods' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, Row_SeedPodsToSpawn_Min) == 0x000998, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::Row_SeedPodsToSpawn_Min' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, Row_SeedPodsToSpawn_Max) == 0x0009C0, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::Row_SeedPodsToSpawn_Max' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, SeedPodsToSpawn) == 0x0009E8, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::SeedPodsToSpawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, SeedPodsToDestroy) == 0x0009EC, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::SeedPodsToDestroy' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, LinkedSeedPodLocations) == 0x0009F0, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::LinkedSeedPodLocations' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C, DebugTest_SpawnAllPods) == 0x000A00, "Member 'ABGA_Athena_RealityFlower_SeedPod_SpawnManager_C::DebugTest_SpawnAllPods' has a wrong offset!");

}

