#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_RealityFlower_SeedPod_SpawnManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_RealityFlower_SeedPod_SpawnManager.BGA_Athena_RealityFlower_SeedPod_SpawnManager_C.CreateLinkedSeedPodLocationArray
// 0x0040 (0x0040 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_RealityFlower_SeedPod_C*    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray) == 0x000008, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray) == 0x000040, "Wrong size on BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray, CallFunc_Array_Get_Item) == 0x000010, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_CreateLinkedSeedPodLocationArray::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BGA_Athena_RealityFlower_SeedPod_SpawnManager.BGA_Athena_RealityFlower_SeedPod_SpawnManager_C.ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager
// 0x0200 (0x0200 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue_1;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_RealityFlower_SeedPod_C*    CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager) == 0x000008, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager) == 0x000200, "Wrong size on BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, EntryPoint) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, K2Node_CustomEvent_GameState) == 0x000008, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, K2Node_CustomEvent_Playlist) == 0x000010, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, K2Node_CustomEvent_PlaylistContextTags) == 0x000018, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_SelectString_ReturnValue) == 0x000038, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, Temp_struct_Variable) == 0x000048, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, Temp_object_Variable) == 0x000068, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, Temp_object_Variable_1) == 0x000070, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000078, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, Temp_int_Array_Index_Variable) == 0x000090, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, Temp_int_Array_Index_Variable_1) == 0x00009C, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, Temp_bool_True_if_break_was_hit_Variable) == 0x0000A0, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Not_PreBool_ReturnValue) == 0x0000A1, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000A8, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Conv_IntToString_ReturnValue) == 0x0000B0, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_FTrunc_ReturnValue) == 0x0000C0, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C8, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D8, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0000E8, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_FTrunc_ReturnValue_1) == 0x0000EC, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Min_ReturnValue) == 0x0000F4, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0000F8, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000FC, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Array_Length_ReturnValue_2) == 0x000100, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000104, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Array_Length_ReturnValue_3) == 0x000108, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00010C, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_SelectInt_ReturnValue) == 0x000110, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Max_ReturnValue) == 0x000114, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Min_ReturnValue_1) == 0x000118, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Min_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00011C, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Array_Length_ReturnValue_4) == 0x000120, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Less_IntInt_ReturnValue) == 0x000124, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Array_Get_Item) == 0x000128, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Array_Length_ReturnValue_5) == 0x000130, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Array_Length_ReturnValue_6) == 0x000134, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Subtract_IntInt_ReturnValue) == 0x000138, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x00013C, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_InEditorOrPIE_ReturnValue) == 0x00013D, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_InEditorOrPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000140, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_FTrunc_ReturnValue_2) == 0x000144, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x000148, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000150, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_FTrunc_ReturnValue_3) == 0x000160, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000168, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000178, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000188, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000198, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0001A8, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_IsServer_ReturnValue) == 0x0001B8, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0001C0, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D0, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Array_Length_ReturnValue_7) == 0x0001E8, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001EC, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, Temp_int_Loop_Counter_Variable_1) == 0x0001F0, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001F4, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001F8, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_BooleanAND_ReturnValue) == 0x0001FC, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001FD, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager, CallFunc_BooleanAND_ReturnValue_1) == 0x0001FE, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ExecuteUbergraph_BGA_Athena_RealityFlower_SeedPod_SpawnManager::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BGA_Athena_RealityFlower_SeedPod_SpawnManager.BGA_Athena_RealityFlower_SeedPod_SpawnManager_C.OnReady_E053B1C94CDC75701FECB9A51B4A252F
// 0x0030 (0x0030 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F) == 0x000008, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F) == 0x000030, "Wrong size on BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F, GameState) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F::GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F, Playlist) == 0x000008, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F::Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F, PlaylistContextTags) == 0x000010, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_OnReady_E053B1C94CDC75701FECB9A51B4A252F::PlaylistContextTags' has a wrong offset!");

// Function BGA_Athena_RealityFlower_SeedPod_SpawnManager.BGA_Athena_RealityFlower_SeedPod_SpawnManager_C.ShouldDie
// 0x0020 (0x0020 - 0x0000)
struct BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ShouldDie) == 0x000008, "Wrong alignment on BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ShouldDie");
static_assert(sizeof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ShouldDie) == 0x000020, "Wrong size on BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ShouldDie");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ShouldDie, Damage) == 0x000000, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ShouldDie::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ShouldDie, EventInstigator) == 0x000008, "Member 'BGA_Athena_RealityFlower_SeedPod_SpawnManager_C_ShouldDie::EventInstigator' has a wrong offset!");
