#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SCMachine

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_SCMachine.BGA_Athena_SCMachine_C.BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BGA_Athena_SCMachine.BGA_Athena_SCMachine_C.BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_Athena_SCMachine_C_BndEvt__BlockingVolume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BGA_Athena_SCMachine.BGA_Athena_SCMachine_C.CheckQuestCredit
// 0x0058 (0x0058 - 0x0000)
struct BGA_Athena_SCMachine_C_CheckQuestCredit final
{
public:
	class AFortPlayerControllerAthena*            FortPlayerController_Local;                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckCreativeMode_CanCompleteQuest; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SCMachine_C_CheckQuestCredit) == 0x000008, "Wrong alignment on BGA_Athena_SCMachine_C_CheckQuestCredit");
static_assert(sizeof(BGA_Athena_SCMachine_C_CheckQuestCredit) == 0x000058, "Wrong size on BGA_Athena_SCMachine_C_CheckQuestCredit");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, FortPlayerController_Local) == 0x000000, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::FortPlayerController_Local' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_GetQuestManager_ReturnValue) == 0x000010, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_IsValid_ReturnValue_1) == 0x000024, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000030, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Athena_CheckCreativeMode_CanCompleteQuest) == 0x000040, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Athena_CheckCreativeMode_CanCompleteQuest' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Array_Get_Item) == 0x000048, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_CheckQuestCredit, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BGA_Athena_SCMachine_C_CheckQuestCredit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BGA_Athena_SCMachine.BGA_Athena_SCMachine_C.ExecuteUbergraph_BGA_Athena_SCMachine
// 0x0920 (0x0920 - 0x0000)
struct BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_Event_PlayerPawn;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VictoryDrone_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InteractingActorCount, float MultiInteractMultiplier, float InteractingDuration)> K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0118(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue;     // 0x0228(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0240(0x00D0)(ContainsInstancedReference)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_PhaseInPawn;                    // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0348(0x0020)()
	class AFortPlayerControllerAthena*            K2Node_Event_AthenaPC_1;                           // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_Event_AthenaPC;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize10                  CallFunc_MakeVector_NetQuantize10_ReturnValue_1;   // 0x03A0(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x03B8(0x00D0)(ContainsInstancedReference)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0490(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0498(0x0020)(ConstParm)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue;         // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_1;       // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_2;       // 0x04BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x04BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x04BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x04C0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_TurnOn;                         // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x04CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_3;       // 0x04CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCooldownLength_ReturnValue;            // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_4;       // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x04D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D6[0x2];                                      // 0x04D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_5;       // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x04E8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpawnMachineState                            CallFunc_GetSpawnMachineState_ReturnValue_6;       // 0x051D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x051E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x051F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_CustomEvent_Player;                         // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_FloatToLinearColor_ReturnValue;      // 0x0534(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0544(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x05A0(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0684(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_692[0x2];                                      // 0x0692(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x06A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x06B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x06D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0710(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0730(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0748(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0760(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0769(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76A[0x6];                                      // 0x076A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x0770(0x00D0)(ContainsInstancedReference)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0840(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_InteractingPawn;                // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0874(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0875(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_876[0x2];                                      // 0x0876(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_2;                            // 0x0878(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_891[0x7];                                      // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_InFortPawn;                     // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x08A0(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BC[0x4];                                      // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x08C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x08DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultipleInteractionEnabled_ReturnValue; // 0x08DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultipleInteractionEnabled_ReturnValue_1; // 0x08DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DF[0x1];                                      // 0x08DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x08E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F9[0x3];                                      // 0x08F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InteractingActorCount;          // 0x08FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MultiInteractMultiplier;        // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InteractingDuration;            // 0x0904(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_909[0x3];                                      // 0x0909(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InteractingActorCount, float MultiInteractMultiplier, float InteractingDuration)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x090C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_919[0x3];                                      // 0x0919(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue_1; // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine) == 0x000010, "Wrong alignment on BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine");
static_assert(sizeof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine) == 0x000920, "Wrong size on BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, EntryPoint) == 0x000000, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetConsoleVariableFloatValue_ReturnValue) == 0x000004, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetConsoleVariableFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_Event_PlayerPawn) == 0x000038, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_Event_PlayerPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0000B0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0000D0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsValid_ReturnValue_2) == 0x0000D8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000E0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000F8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000100, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000108, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000110, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_bFromSweep) == 0x000114, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_SweepResult) == 0x000118, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_X) == 0x0001F8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_Y) == 0x0001FC, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_Z) == 0x000200, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000208, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherActor) == 0x000210, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherComp) == 0x000218, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000220, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeVector_NetQuantize10_ReturnValue) == 0x000228, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeVector_NetQuantize10_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000240, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, Temp_object_Variable) == 0x000310, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsServer_ReturnValue) == 0x000318, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CustomEvent_PhaseInPawn) == 0x000320, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CustomEvent_PhaseInPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsServer_ReturnValue_1) == 0x000328, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000330, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_DynamicCast_bSuccess) == 0x000338, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, Temp_object_Variable_1) == 0x000340, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, Temp_struct_Variable) == 0x000348, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_Event_AthenaPC_1) == 0x000368, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_Event_AthenaPC_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_Event_AthenaPC) == 0x000370, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_Event_AthenaPC' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000378, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_IsActive_ReturnValue) == 0x000390, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_X_1) == 0x000394, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_Y_1) == 0x000398, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_BreakVector_Z_1) == 0x00039C, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeVector_NetQuantize10_ReturnValue_1) == 0x0003A0, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeVector_NetQuantize10_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x0003B8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CustomEvent_GameState) == 0x000488, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CustomEvent_Playlist) == 0x000490, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, K2Node_CustomEvent_PlaylistContextTags) == 0x000498, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetSpawnMachineState_ReturnValue) == 0x0004B8, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetSpawnMachineState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0004B9, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetSpawnMachineState_ReturnValue_1) == 0x0004BA, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetSpawnMachineState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_GetSpawnMachineState_ReturnValue_2) == 0x0004BB, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_GetSpawnMachineState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0004BC, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0004BD, "Member 'BGA_Athena_SCMachine_C_ExecuteUbergraph_BGA_Athena_SCMachine::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
