#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_ValetMod_CowCatcher

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"


namespace SDK::Params
{

// Function BGA_ValetMod_CowCatcher.BGA_ValetMod_CowCatcher_C.CalculateLaunchDirection
// 0x0060 (0x0060 - 0x0000)
struct BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection final
{
public:
	struct FVector                                LaunchDirection;                                   // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection) == 0x000008, "Wrong alignment on BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection");
static_assert(sizeof(BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection) == 0x000060, "Wrong size on BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection, LaunchDirection) == 0x000000, "Member 'BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection::LaunchDirection' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000018, "Member 'BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection, CallFunc_GetForwardVector_ReturnValue) == 0x000030, "Member 'BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection, CallFunc_NegateVector_ReturnValue) == 0x000048, "Member 'BGA_ValetMod_CowCatcher_C_CalculateLaunchDirection::CallFunc_NegateVector_ReturnValue' has a wrong offset!");

// Function BGA_ValetMod_CowCatcher.BGA_ValetMod_CowCatcher_C.CanDestroyBuilding
// 0x0010 (0x0010 - 0x0000)
struct BGA_ValetMod_CowCatcher_C_CanDestroyBuilding final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPermissionToAlterBuildings_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_CowCatcher_C_CanDestroyBuilding) == 0x000008, "Wrong alignment on BGA_ValetMod_CowCatcher_C_CanDestroyBuilding");
static_assert(sizeof(BGA_ValetMod_CowCatcher_C_CanDestroyBuilding) == 0x000010, "Wrong size on BGA_ValetMod_CowCatcher_C_CanDestroyBuilding");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CanDestroyBuilding, Actor) == 0x000000, "Member 'BGA_ValetMod_CowCatcher_C_CanDestroyBuilding::Actor' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CanDestroyBuilding, ReturnValue) == 0x000008, "Member 'BGA_ValetMod_CowCatcher_C_CanDestroyBuilding::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CanDestroyBuilding, CallFunc_HasPermissionToAlterBuildings_ReturnValue) == 0x000009, "Member 'BGA_ValetMod_CowCatcher_C_CanDestroyBuilding::CallFunc_HasPermissionToAlterBuildings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CanDestroyBuilding, CallFunc_ActorHasTag_ReturnValue) == 0x00000A, "Member 'BGA_ValetMod_CowCatcher_C_CanDestroyBuilding::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CanDestroyBuilding, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'BGA_ValetMod_CowCatcher_C_CanDestroyBuilding::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CanDestroyBuilding, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'BGA_ValetMod_CowCatcher_C_CanDestroyBuilding::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_CanDestroyBuilding, CallFunc_BooleanAND_ReturnValue_1) == 0x00000D, "Member 'BGA_ValetMod_CowCatcher_C_CanDestroyBuilding::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BGA_ValetMod_CowCatcher.BGA_ValetMod_CowCatcher_C.ExecuteUbergraph_BGA_ValetMod_CowCatcher
// 0x06A8 (0x06A8 - 0x0000)
struct BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_1;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0070(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x00A8(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_1;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0198(0x0018)()
	float                                         K2Node_Event_Damage;                               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x01B8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x01F0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x02E0(0x0018)()
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0348(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue_1;          // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_HitComponent;                   // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0398(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_492[0x2];                                      // 0x0492(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0510(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_CustomEvent_AttachedVehicle;                // 0x0590(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x05A8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_CustomEvent_DeadVehicle;                    // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_InTags;                         // 0x05C0(0x0020)(ConstParm)
	class AController*                            K2Node_CustomEvent_EventInstigator;                // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FA[0x6];                                      // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AController*                      K2Node_CustomEvent_LastDamageInstigator;           // 0x0610(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     K2Node_CustomEvent_Vehicle;                        // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_1;     // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortAthenaVehicle* DeadVehicle, struct FGameplayTagContainer& InTags, class AController* EventInstigator, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0628(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_635[0x3];                                      // 0x0635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle_1;        // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641[0x3];                                      // 0x0641(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AController* LastDamageInstigator, class AFortAthenaVehicle* Vehicle)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0644(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortAthenaVehicle* DeadVehicle, struct FGameplayTagContainer& InTags, class AController* EventInstigator, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0650(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AController* LastDamageInstigator, class AFortAthenaVehicle* Vehicle)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x065C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0668(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0675(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_676[0x2];                                      // 0x0676(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x3];                                      // 0x0691(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0698(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher) == 0x000008, "Wrong alignment on BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher");
static_assert(sizeof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher) == 0x0006A8, "Wrong size on BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, EntryPoint) == 0x000000, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000038, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_Damage_1) == 0x000068, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_DamageTags_1) == 0x000070, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_Momentum_1) == 0x000090, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_HitInfo_1) == 0x0000A8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_InstigatedBy_1) == 0x000188, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_DamageCauser_1) == 0x000190, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_EffectContext_1) == 0x000198, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_Damage) == 0x0001B0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_DamageTags) == 0x0001B8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_Momentum) == 0x0001D8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_HitInfo) == 0x0001F0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_InstigatedBy) == 0x0002D0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_DamageCauser) == 0x0002D8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_Event_EffectContext) == 0x0002E0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0002F8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000300, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakVector_X) == 0x000308, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakVector_Y) == 0x00030C, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakVector_Z) == 0x000310, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000318, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakVector_X_1) == 0x000320, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakVector_Y_1) == 0x000324, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakVector_Z_1) == 0x000328, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000330, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CreateDelegate_OutputDelegate_1) == 0x000348, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_SpawnFXAtLocation_ReturnValue_1) == 0x000358, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_SpawnFXAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x000360, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_HitComponent) == 0x000368, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_OtherActor) == 0x000370, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_OtherComp) == 0x000378, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_NormalImpulse) == 0x000380, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_Hit) == 0x000398, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000478, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_bBlockingHit) == 0x000490, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_bInitialOverlap) == 0x000491, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_Time) == 0x000494, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_Distance) == 0x000498, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_Location) == 0x0004A0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_ImpactPoint) == 0x0004B8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_Normal) == 0x0004D0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_ImpactNormal) == 0x0004E8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_PhysMat) == 0x000500, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_HitActor) == 0x000508, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_HitComponent) == 0x000510, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_HitBoneName) == 0x000518, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_BoneName) == 0x00051C, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_HitItem) == 0x000520, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_ElementIndex) == 0x000524, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_FaceIndex) == 0x000528, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_TraceStart) == 0x000530, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BreakHitResult_TraceEnd) == 0x000548, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_GetActorForwardVector_ReturnValue) == 0x000560, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000578, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_AttachedVehicle) == 0x000590, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_AttachedVehicle' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_Dot_VectorVector_ReturnValue) == 0x0005A0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0005A4, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CreateDelegate_OutputDelegate_2) == 0x0005A8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_DeadVehicle) == 0x0005B8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_DeadVehicle' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_InTags) == 0x0005C0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_InTags' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_EventInstigator) == 0x0005E0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_EventInstigator' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_DamageCauser) == 0x0005E8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x0005F0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_IsDedicatedServer_ReturnValue) == 0x0005F8, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_IsValid_ReturnValue) == 0x0005F9, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_DynamicCast_AsFort_Athena_Vehicle) == 0x000600, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_DynamicCast_AsFort_Athena_Vehicle' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_DynamicCast_bSuccess_1) == 0x000608, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_LastDamageInstigator) == 0x000610, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_LastDamageInstigator' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CustomEvent_Vehicle) == 0x000618, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_Conv_InterfaceToObject_ReturnValue_1) == 0x000620, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_Conv_InterfaceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CreateDelegate_OutputDelegate_3) == 0x000628, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_IsValid_ReturnValue_1) == 0x000634, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_DynamicCast_AsFort_Athena_Vehicle_1) == 0x000638, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_DynamicCast_AsFort_Athena_Vehicle_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_DynamicCast_bSuccess_2) == 0x000640, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CreateDelegate_OutputDelegate_4) == 0x000644, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CreateDelegate_OutputDelegate_5) == 0x000650, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CreateDelegate_OutputDelegate_6) == 0x00065C, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, K2Node_CreateDelegate_OutputDelegate_7) == 0x000668, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_HasAuthority_ReturnValue) == 0x000674, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000675, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_GetOwner_ReturnValue_1) == 0x000678, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_DoesImplementInterface_ReturnValue) == 0x000680, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_GetOwner_ReturnValue_2) == 0x000688, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_IsValid_ReturnValue_2) == 0x000690, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_RandomFloatInRange_ReturnValue) == 0x000694, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000698, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_HasAuthority_ReturnValue_1) == 0x0006A0, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher, CallFunc_BooleanAND_ReturnValue) == 0x0006A1, "Member 'BGA_ValetMod_CowCatcher_C_ExecuteUbergraph_BGA_ValetMod_CowCatcher::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BGA_ValetMod_CowCatcher.BGA_ValetMod_CowCatcher_C.OnDeathPlayEffects
// 0x0148 (0x0148 - 0x0000)
struct BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects");
static_assert(sizeof(BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects) == 0x000148, "Wrong size on BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects, HitInfo) == 0x000040, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects, InstigatedBy) == 0x000120, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects, DamageCauser) == 0x000128, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects, EffectContext) == 0x000130, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function BGA_ValetMod_CowCatcher.BGA_ValetMod_CowCatcher_C.OnDeathServer
// 0x0148 (0x0148 - 0x0000)
struct BGA_ValetMod_CowCatcher_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BGA_ValetMod_CowCatcher_C_OnDeathServer) == 0x000008, "Wrong alignment on BGA_ValetMod_CowCatcher_C_OnDeathServer");
static_assert(sizeof(BGA_ValetMod_CowCatcher_C_OnDeathServer) == 0x000148, "Wrong size on BGA_ValetMod_CowCatcher_C_OnDeathServer");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathServer, Damage) == 0x000000, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathServer, DamageTags) == 0x000008, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathServer, Momentum) == 0x000028, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathServer, HitInfo) == 0x000040, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathServer, InstigatedBy) == 0x000120, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathServer, DamageCauser) == 0x000128, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_ValetMod_CowCatcher_C_OnDeathServer, EffectContext) == 0x000130, "Member 'BGA_ValetMod_CowCatcher_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function BGA_ValetMod_CowCatcher.BGA_ValetMod_CowCatcher_C.OnOwnerVehicleExploded
// 0x0010 (0x0010 - 0x0000)
struct BGA_ValetMod_CowCatcher_C_OnOwnerVehicleExploded final
{
public:
