#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SCMachine_Redux

#include "Basic.hpp"

#include "BGA_Athena_SCMachine_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_SCMachine_Redux.BGA_Athena_SCMachine_Redux_C
// 0x0020 (0x0E30 - 0x0E10)
class ABGA_Athena_SCMachine_Redux_C final : public ABGA_Athena_SCMachine_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Athena_SCMachine_Redux_C;       // 0x0E10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Redux_Portal_Closing;                           // 0x0E18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_SpawnRift;                                       // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rift_Play_Rate;                                    // 0x0E28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_Athena_SCMachine_Redux(int32 EntryPoint);
	void HandleActorCountChanged(int32 InteractingActorCount, float MultiInteractMultiplier, float InteractingDuration);
	void OnSpawnMachineStateChanged();
	void ReceiveBeginPlay();
	void Reset_Rift();
	void SpawnRift(class AFortPawn* InFortPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_SCMachine_Redux_C">();
	}
	static class ABGA_Athena_SCMachine_Redux_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_SCMachine_Redux_C>();
	}
};
static_assert(alignof(ABGA_Athena_SCMachine_Redux_C) == 0x000008, "Wrong alignment on ABGA_Athena_SCMachine_Redux_C");
static_assert(sizeof(ABGA_Athena_SCMachine_Redux_C) == 0x000E30, "Wrong size on ABGA_Athena_SCMachine_Redux_C");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, UberGraphFrame_BGA_Athena_SCMachine_Redux_C) == 0x000E10, "Member 'ABGA_Athena_SCMachine_Redux_C::UberGraphFrame_BGA_Athena_SCMachine_Redux_C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, NS_Redux_Portal_Closing) == 0x000E18, "Member 'ABGA_Athena_SCMachine_Redux_C::NS_Redux_Portal_Closing' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, P_SpawnRift) == 0x000E20, "Member 'ABGA_Athena_SCMachine_Redux_C::P_SpawnRift' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SCMachine_Redux_C, Rift_Play_Rate) == 0x000E28, "Member 'ABGA_Athena_SCMachine_Redux_C::Rift_Play_Rate' has a wrong offset!");

}

