#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_RiftPortal_Athena_Spawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_RiftPortal_Athena_Spawner.BGA_RiftPortal_Athena_Spawner_C.ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner
// 0x0520 (0x0520 - 0x0000)
struct BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x00B0(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0118(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_RiftPortal_Athena_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0220(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0238(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue_1;     // 0x0350(0x0060)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue_2;     // 0x03B0(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0418(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_RiftPortal_Athena_C*               CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner) == 0x000010, "Wrong alignment on BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner");
static_assert(sizeof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner) == 0x000520, "Wrong size on BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, EntryPoint) == 0x000000, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_BreakVector_X) == 0x000024, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_BreakVector_Y) == 0x000028, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_BreakVector_Z) == 0x00002C, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000034, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Round_ReturnValue) == 0x000038, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Round_ReturnValue_1) == 0x00003C, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000040, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000044, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000048, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Round_ReturnValue_2) == 0x00004C, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_GetValueAtLevel_ReturnValue) == 0x000050, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000054, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_FTrunc_ReturnValue) == 0x000058, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_RandomInteger_ReturnValue) == 0x000078, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_BreakVector_X_1) == 0x00007C, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_BreakVector_Y_1) == 0x000080, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_BreakVector_Z_1) == 0x000084, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, K2Node_MakeArray_Array) == 0x000088, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000098, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0000B0, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000110, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000118, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001F8, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000200, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000208, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, Temp_object_Variable) == 0x000220, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Multiply_IntFloat_ReturnValue_3) == 0x000230, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Multiply_IntFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000238, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000318, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x00031C, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000320, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Greater_IntInt_ReturnValue) == 0x000324, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Add_FloatFloat_ReturnValue) == 0x000328, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_MakeVector_ReturnValue_1) == 0x000330, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Conv_VectorToTransform_ReturnValue_1) == 0x000350, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Conv_VectorToTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_Conv_VectorToTransform_ReturnValue_2) == 0x0003B0, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_Conv_VectorToTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000410, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000418, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x0004F8, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000500, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000508, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000510, "Member 'BGA_RiftPortal_Athena_Spawner_C_ExecuteUbergraph_BGA_RiftPortal_Athena_Spawner::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");

}

