#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Campsite

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_Campsite_Improvements_structs.hpp"
#include "Struct_Campsite_Improvement_structs.hpp"
#include "AIModule_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_Campsite.BGA_Campsite_C.UpdateCampsiteLocation
// 0x00E0 (0x00E0 - 0x0000)
struct BGA_Campsite_C_UpdateCampsiteLocation final
{
public:
	struct FVector                                newCampsiteLoc;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                averageTentLocation;                               // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualExactly_VectorVector_ReturnValue;    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCampsite_Improvement_Component_C*      CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Campsite_C_UpdateCampsiteLocation) == 0x000008, "Wrong alignment on BGA_Campsite_C_UpdateCampsiteLocation");
static_assert(sizeof(BGA_Campsite_C_UpdateCampsiteLocation) == 0x0000E0, "Wrong size on BGA_Campsite_C_UpdateCampsiteLocation");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, newCampsiteLoc) == 0x000000, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::newCampsiteLoc' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, Count) == 0x000018, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::Count' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, averageTentLocation) == 0x000020, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::averageTentLocation' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000044, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000048, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, Temp_int_Variable) == 0x000068, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_EqualExactly_VectorVector_ReturnValue) == 0x00006C, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_EqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_Array_Get_Item) == 0x000078, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000081, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_GetOwner_ReturnValue) == 0x000088, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_UpdateCampsiteLocation, CallFunc_SelectVector_ReturnValue) == 0x0000C8, "Member 'BGA_Campsite_C_UpdateCampsiteLocation::CallFunc_SelectVector_ReturnValue' has a wrong offset!");

// Function BGA_Campsite.BGA_Campsite_C.TentColors
// 0x0050 (0x0050 - 0x0000)
struct BGA_Campsite_C_TentColors final
{
public:
	class UObject*                                Player_State;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         squad_ID;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           squad_member_color;                                // 0x000C(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         random_squadmember_index;                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetSquadId_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSquadMemberIndex_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetPinColorBySquadMemberIndex_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Campsite_C_TentColors) == 0x000008, "Wrong alignment on BGA_Campsite_C_TentColors");
static_assert(sizeof(BGA_Campsite_C_TentColors) == 0x000050, "Wrong size on BGA_Campsite_C_TentColors");
static_assert(offsetof(BGA_Campsite_C_TentColors, Player_State) == 0x000000, "Member 'BGA_Campsite_C_TentColors::Player_State' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, squad_ID) == 0x000008, "Member 'BGA_Campsite_C_TentColors::squad_ID' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, squad_member_color) == 0x00000C, "Member 'BGA_Campsite_C_TentColors::squad_member_color' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, random_squadmember_index) == 0x00001C, "Member 'BGA_Campsite_C_TentColors::random_squadmember_index' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000020, "Member 'BGA_Campsite_C_TentColors::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BGA_Campsite_C_TentColors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'BGA_Campsite_C_TentColors::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, CallFunc_GetSquadId_ReturnValue) == 0x000030, "Member 'BGA_Campsite_C_TentColors::CallFunc_GetSquadId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, CallFunc_GetSquadMemberIndex_ReturnValue) == 0x000034, "Member 'BGA_Campsite_C_TentColors::CallFunc_GetSquadMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, CallFunc_GetPinColorBySquadMemberIndex_ReturnValue) == 0x000038, "Member 'BGA_Campsite_C_TentColors::CallFunc_GetPinColorBySquadMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BGA_Campsite_C_TentColors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_TentColors, CallFunc_Percent_IntInt_ReturnValue) == 0x00004C, "Member 'BGA_Campsite_C_TentColors::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function BGA_Campsite.BGA_Campsite_C.Spawn Secondary Blueprint
// 0x0058 (0x0058 - 0x0000)
struct BGA_Campsite_C_Spawn_Secondary_Blueprint final
{
public:
	struct FVector                                Spawn_Transform_Location;                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Spawn_Transform_Rotation;                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerState*                           ImprovementOwner;                                  // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_Campsite_Improvement           Struct_Campsite_Improvement;                       // 0x0038(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Campsite_C_Spawn_Secondary_Blueprint) == 0x000008, "Wrong alignment on BGA_Campsite_C_Spawn_Secondary_Blueprint");
static_assert(sizeof(BGA_Campsite_C_Spawn_Secondary_Blueprint) == 0x000058, "Wrong size on BGA_Campsite_C_Spawn_Secondary_Blueprint");
static_assert(offsetof(BGA_Campsite_C_Spawn_Secondary_Blueprint, Spawn_Transform_Location) == 0x000000, "Member 'BGA_Campsite_C_Spawn_Secondary_Blueprint::Spawn_Transform_Location' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Spawn_Secondary_Blueprint, Spawn_Transform_Rotation) == 0x000018, "Member 'BGA_Campsite_C_Spawn_Secondary_Blueprint::Spawn_Transform_Rotation' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Spawn_Secondary_Blueprint, ImprovementOwner) == 0x000030, "Member 'BGA_Campsite_C_Spawn_Secondary_Blueprint::ImprovementOwner' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Spawn_Secondary_Blueprint, Struct_Campsite_Improvement) == 0x000038, "Member 'BGA_Campsite_C_Spawn_Secondary_Blueprint::Struct_Campsite_Improvement' has a wrong offset!");

// Function BGA_Campsite.BGA_Campsite_C.RegisterCampsite
// 0x0030 (0x0030 - 0x0000)
struct BGA_Campsite_C_RegisterCampsite final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameStateComponent_Campsite*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Campsite_C_RegisterCampsite) == 0x000008, "Wrong alignment on BGA_Campsite_C_RegisterCampsite");
static_assert(sizeof(BGA_Campsite_C_RegisterCampsite) == 0x000030, "Wrong size on BGA_Campsite_C_RegisterCampsite");
static_assert(offsetof(BGA_Campsite_C_RegisterCampsite, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BGA_Campsite_C_RegisterCampsite::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_RegisterCampsite, CallFunc_GetGameStateAthena_ReturnValue) == 0x000018, "Member 'BGA_Campsite_C_RegisterCampsite::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_RegisterCampsite, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BGA_Campsite_C_RegisterCampsite::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_RegisterCampsite, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BGA_Campsite_C_RegisterCampsite::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_RegisterCampsite, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BGA_Campsite_C_RegisterCampsite::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BGA_Campsite.BGA_Campsite_C.OnDeathServer
// 0x0148 (0x0148 - 0x0000)
struct BGA_Campsite_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BGA_Campsite_C_OnDeathServer) == 0x000008, "Wrong alignment on BGA_Campsite_C_OnDeathServer");
static_assert(sizeof(BGA_Campsite_C_OnDeathServer) == 0x000148, "Wrong size on BGA_Campsite_C_OnDeathServer");
static_assert(offsetof(BGA_Campsite_C_OnDeathServer, Damage) == 0x000000, "Member 'BGA_Campsite_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_OnDeathServer, DamageTags) == 0x000008, "Member 'BGA_Campsite_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_OnDeathServer, Momentum) == 0x000028, "Member 'BGA_Campsite_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_OnDeathServer, HitInfo) == 0x000040, "Member 'BGA_Campsite_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_OnDeathServer, InstigatedBy) == 0x000120, "Member 'BGA_Campsite_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_OnDeathServer, DamageCauser) == 0x000128, "Member 'BGA_Campsite_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_OnDeathServer, EffectContext) == 0x000130, "Member 'BGA_Campsite_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function BGA_Campsite.BGA_Campsite_C.MoveCampsiteLocation
// 0x0018 (0x0018 - 0x0000)
struct BGA_Campsite_C_MoveCampsiteLocation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Campsite_C_MoveCampsiteLocation) == 0x000008, "Wrong alignment on BGA_Campsite_C_MoveCampsiteLocation");
static_assert(sizeof(BGA_Campsite_C_MoveCampsiteLocation) == 0x000018, "Wrong size on BGA_Campsite_C_MoveCampsiteLocation");
static_assert(offsetof(BGA_Campsite_C_MoveCampsiteLocation, NewLocation) == 0x000000, "Member 'BGA_Campsite_C_MoveCampsiteLocation::NewLocation' has a wrong offset!");

// Function BGA_Campsite.BGA_Campsite_C.ImprovementDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BGA_Campsite_C_ImprovementDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Campsite_C_ImprovementDestroyed) == 0x000008, "Wrong alignment on BGA_Campsite_C_ImprovementDestroyed");
static_assert(sizeof(BGA_Campsite_C_ImprovementDestroyed) == 0x000008, "Wrong size on BGA_Campsite_C_ImprovementDestroyed");
static_assert(offsetof(BGA_Campsite_C_ImprovementDestroyed, DestroyedActor) == 0x000000, "Member 'BGA_Campsite_C_ImprovementDestroyed::DestroyedActor' has a wrong offset!");

// Function BGA_Campsite.BGA_Campsite_C.GetIsDying?
// 0x0001 (0x0001 - 0x0000)
struct BGA_Campsite_C_GetIsDying_ final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Campsite_C_GetIsDying_) == 0x000001, "Wrong alignment on BGA_Campsite_C_GetIsDying_");
static_assert(sizeof(BGA_Campsite_C_GetIsDying_) == 0x000001, "Wrong size on BGA_Campsite_C_GetIsDying_");
static_assert(offsetof(BGA_Campsite_C_GetIsDying_, NewParam) == 0x000000, "Member 'BGA_Campsite_C_GetIsDying_::NewParam' has a wrong offset!");

// Function BGA_Campsite.BGA_Campsite_C.Get Improvement by Type
// 0x0090 (0x0090 - 0x0000)
struct BGA_Campsite_C_Get_Improvement_by_Type final
{
public:
	Enum_Campsite_Improvements                    ImprovementDef;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_Campsite_Improvement           Improvement;                                       // 0x0008(0x0020)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_Campsite_Improvement           mathcingImprvmnt;                                  // 0x0028(0x0020)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_Campsite_Improvement           CallFunc_Array_Get_Item;                           // 0x0068(0x0020)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Campsite_C_Get_Improvement_by_Type) == 0x000008, "Wrong alignment on BGA_Campsite_C_Get_Improvement_by_Type");
static_assert(sizeof(BGA_Campsite_C_Get_Improvement_by_Type) == 0x000090, "Wrong size on BGA_Campsite_C_Get_Improvement_by_Type");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, ImprovementDef) == 0x000000, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::ImprovementDef' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, Improvement) == 0x000008, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::Improvement' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, mathcingImprvmnt) == 0x000028, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::mathcingImprvmnt' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, Count) == 0x000048, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::Count' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, Temp_bool_True_if_break_was_hit_Variable) == 0x00004C, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, CallFunc_Not_PreBool_ReturnValue) == 0x000054, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, CallFunc_Array_Get_Item) == 0x000068, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, CallFunc_BooleanAND_ReturnValue) == 0x000089, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Campsite_C_Get_Improvement_by_Type, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00008A, "Member 'BGA_Campsite_C_Get_Improvement_by_Type::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BGA_Campsite.BGA_Campsite_C.ExecuteUbergraph_BGA_Campsite
// 0x0D20 (0x0D20 - 0x0000)
struct BGA_Campsite_C_ExecuteUbergraph_BGA_Campsite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Spawn_Transform_Location;       // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Spawn_Transform_Rotation;       // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerState*                           K2Node_CustomEvent_ImprovementOwner;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_Campsite_Improvement           K2Node_CustomEvent_Struct_Campsite_Improvement;    // 0x0060(0x0020)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetQueryResultsAsLocations_ResultLocations; // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetQueryResultsAsLocations_ReturnValue;   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0xE];                                       // 0x00A2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Impact_Normal;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Impact_Point;                   // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Hit_Actor;                      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_Hit_Component;                  // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hit_Water_;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingWall*                          K2Node_DynamicCast_AsBuilding_Wall;                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor_1;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_NewLocation;                    // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01E8(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02CC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x02E0(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class UCampsite_Improvement_Component_C*      K2Node_CustomEvent_Improvement;                    // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0348(0x0008)(NoDestructor, HasGetValueTypeHash)
	Enum_Campsite_Improvements                    K2Node_CustomEvent_Improvement_Type_2;             // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_Improvement_Owner_1;            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Spawn_Location;                 // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Spawn_Transform_Rotation_1;     // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SupportingActor;                // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemEntry                         K2Node_CustomEvent_InstigatingWeapon;              // 0x0398(0x01A0)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_Static_Mesh;         // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCampsite_Improvement_Component_C*      CallFunc_Array_Get_Item;                           // 0x0550(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0560(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2[0x6];                                      // 0x05C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_Campsite_Improvement           CallFunc_Get_Improvement_by_Type_Improvement;      // 0x05C8(0x0020)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor_1;               // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCampsite_Improvement_Component_C*      CallFunc_GetComponentByClass_ReturnValue;          // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Tent_C*                              K2Node_DynamicCast_AsB_Tent;                       // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire;   // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor_2;             // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_Static_Mesh_1;       // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCampsite_Improvement_Component_C*      CallFunc_AddComponent_ReturnValue;                 // 0x0650(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0675(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_676[0x2];                                      // 0x0676(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_New_Campsite_Instigator;        // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SupportingActor_1;              // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemEntry                         K2Node_CustomEvent_Instigating_Item;               // 0x0688(0x01A0)()
	Enum_Campsite_Improvements                    K2Node_CustomEvent_Improvement_Type_1;             // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_DeplayGameplayCueTag;           // 0x0838(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_859[0x7];                                      // 0x0859(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0860(0x00D0)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x093C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93D[0x3];                                      // 0x093D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0948(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0968(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0980(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0A70(0x0018)()
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Campsite_Improvements                    K2Node_CustomEvent_Improvement_Type;               // 0x0A89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8A[0x6];                                      // 0x0A8A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_Improvement_Owner;              // 0x0A90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0AA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA4[0x4];                                      // 0x0AA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0AB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0AB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0AD0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ADC[0x4];                                      // 0x0ADC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0AE0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0AF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0B00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B04[0x4];                                      // 0x0B04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0B08(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0B18(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_Raycast_Improvement_Positioning_Hit;      // 0x0B30(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0C10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0C11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C12[0x2];                                      // 0x0C12(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0C14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0C18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1C[0x4];                                      // 0x0C1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0C20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0C38(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0C50(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0C68(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0C80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0C88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0C90(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0C98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0C9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
