#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Vortex_Effect_SevenStatue

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_Vortex_Effect_SevenStatue.BGA_Vortex_Effect_SevenStatue_C.ExecuteUbergraph_BGA_Vortex_Effect_SevenStatue
// 0x0004 (0x0004 - 0x0000)
struct BGA_Vortex_Effect_SevenStatue_C_ExecuteUbergraph_BGA_Vortex_Effect_SevenStatue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Vortex_Effect_SevenStatue_C_ExecuteUbergraph_BGA_Vortex_Effect_SevenStatue) == 0x000004, "Wrong alignment on BGA_Vortex_Effect_SevenStatue_C_ExecuteUbergraph_BGA_Vortex_Effect_SevenStatue");
static_assert(sizeof(BGA_Vortex_Effect_SevenStatue_C_ExecuteUbergraph_BGA_Vortex_Effect_SevenStatue) == 0x000004, "Wrong size on BGA_Vortex_Effect_SevenStatue_C_ExecuteUbergraph_BGA_Vortex_Effect_SevenStatue");
static_assert(offsetof(BGA_Vortex_Effect_SevenStatue_C_ExecuteUbergraph_BGA_Vortex_Effect_SevenStatue, EntryPoint) == 0x000000, "Member 'BGA_Vortex_Effect_SevenStatue_C_ExecuteUbergraph_BGA_Vortex_Effect_SevenStatue::EntryPoint' has a wrong offset!");

// Function BGA_Vortex_Effect_SevenStatue.BGA_Vortex_Effect_SevenStatue_C.UserConstructionScript
// 0x00F8 (0x00F8 - 0x0000)
struct BGA_Vortex_Effect_SevenStatue_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0018(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Vortex_Effect_SevenStatue_C_UserConstructionScript) == 0x000008, "Wrong alignment on BGA_Vortex_Effect_SevenStatue_C_UserConstructionScript");
static_assert(sizeof(BGA_Vortex_Effect_SevenStatue_C_UserConstructionScript) == 0x0000F8, "Wrong size on BGA_Vortex_Effect_SevenStatue_C_UserConstructionScript");
static_assert(offsetof(BGA_Vortex_Effect_SevenStatue_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'BGA_Vortex_Effect_SevenStatue_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Effect_SevenStatue_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000018, "Member 'BGA_Vortex_Effect_SevenStatue_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

