#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_BouncePad_Rope_Parallel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BGA_BouncePad_Rope_Parallel.BGA_BouncePad_Rope_Parallel_C.BndEvt__BGA_BouncePad_Rope_Parallel_FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BGA_BouncePad_Rope_Parallel_C_BndEvt__BGA_BouncePad_Rope_Parallel_FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_BouncePad_Rope_Parallel_C_BndEvt__BGA_BouncePad_Rope_Parallel_FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong alignment on BGA_BouncePad_Rope_Parallel_C_BndEvt__BGA_BouncePad_Rope_Parallel_FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature");
static_assert(sizeof(BGA_BouncePad_Rope_Parallel_C_BndEvt__BGA_BouncePad_Rope_Parallel_FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong size on BGA_BouncePad_Rope_Parallel_C_BndEvt__BGA_BouncePad_Rope_Parallel_FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_BndEvt__BGA_BouncePad_Rope_Parallel_FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature, DamageCauser) == 0x000000, "Member 'BGA_BouncePad_Rope_Parallel_C_BndEvt__BGA_BouncePad_Rope_Parallel_FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature::DamageCauser' has a wrong offset!");

// Function BGA_BouncePad_Rope_Parallel.BGA_BouncePad_Rope_Parallel_C.CalculateClosestSockets
// 0x0430 (0x0430 - 0x0000)
struct BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets final
{
public:
	TArray<class FName>                           Socketlist_names1;                                 // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FName>                           Socketlist_names;                                  // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           Socketlist_names_0;                                // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 Socketlist_distance;                               // 0x0030(0x0010)(Edit, BlueprintVisible)
	TMap<class FName, float>                      Socketlist;                                        // 0x0040(0x0050)(Edit, BlueprintVisible)
	class FName                                   CurrentSocket;                                     // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0xC];                                      // 0x0114(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0120(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x01A0(0x0060)(IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0xC];                                      // 0x0204(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue;        // 0x0210(0x0060)(IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0270(0x0018)()
	class UTextRenderComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_3;            // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D3[0x1];                                      // 0x02D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x02E0(0x0010)(ReferenceParm)
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x02F0(0x0010)(ReferenceParm)
	float                                         CallFunc_Array_Get_Item_2;                         // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_2;         // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_3;         // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x0398(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue_1;          // 0x03A8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_3;          // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x042D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets) == 0x000010, "Wrong alignment on BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets");
static_assert(sizeof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets) == 0x000430, "Wrong size on BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Socketlist_names1) == 0x000000, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Socketlist_names1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Socketlist_names) == 0x000010, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Socketlist_names' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Socketlist_names_0) == 0x000020, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Socketlist_names_0' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Socketlist_distance) == 0x000030, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Socketlist_distance' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Socketlist) == 0x000040, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Socketlist' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CurrentSocket) == 0x000090, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CurrentSocket' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Array_Index_Variable) == 0x000094, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_bool_True_if_break_was_hit_Variable) == 0x000098, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Array_Index_Variable_1) == 0x0000A4, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Loop_Counter_Variable_1) == 0x0000A8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Loop_Counter_Variable_2) == 0x0000B0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Array_Index_Variable_2) == 0x0000B4, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Loop_Counter_Variable_3) == 0x0000BC, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000C0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Array_Index_Variable_3) == 0x0000C4, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_GetDisplayName_ReturnValue) == 0x0000D0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_LastIndex_ReturnValue) == 0x0000F0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_LastIndex_ReturnValue_1) == 0x0000F4, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_LastIndex_ReturnValue_2) == 0x0000FC, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_LastIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000100, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Add_ReturnValue) == 0x000104, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Add_ReturnValue_1) == 0x000108, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Add_ReturnValue_2) == 0x00010C, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Loop_Counter_Variable_4) == 0x000110, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_GetTransform_ReturnValue) == 0x000120, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Add_IntInt_ReturnValue_4) == 0x000180, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_GetSocketLocation_ReturnValue) == 0x000188, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0001A0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Get_Item) == 0x000200, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_MakeRelativeTransform_ReturnValue) == 0x000210, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_MakeRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_NameToText_ReturnValue) == 0x000270, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_AddComponent_ReturnValue) == 0x000288, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_NameToString_ReturnValue) == 0x000290, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Length_ReturnValue) == 0x0002A0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Less_IntInt_ReturnValue) == 0x0002A4, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0002A8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, Temp_int_Array_Index_Variable_4) == 0x0002C0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Get_Item_1) == 0x0002C4, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Length_ReturnValue_1) == 0x0002C8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_LastIndex_ReturnValue_3) == 0x0002CC, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_LastIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002D0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002D1, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_BooleanAND_ReturnValue) == 0x0002D2, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Length_ReturnValue_2) == 0x0002D4, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0002D8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Map_Keys_Keys) == 0x0002E0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Map_Values_Values) == 0x0002F0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Get_Item_2) == 0x000300, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Add_ReturnValue_3) == 0x000304, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000308, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_FloatToString_ReturnValue) == 0x000310, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000320, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000330, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000340, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Add_ReturnValue_4) == 0x000350, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_FloatToString_ReturnValue_2) == 0x000358, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_FloatToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_FloatToString_ReturnValue_3) == 0x000368, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_FloatToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000378, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Add_ReturnValue_5) == 0x000388, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Add_ReturnValue_6) == 0x00038C, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Length_ReturnValue_3) == 0x000390, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Less_IntInt_ReturnValue_2) == 0x000394, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_GetAllSocketNames_ReturnValue) == 0x000398, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_GetAllSocketNames_ReturnValue_1) == 0x0003A8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_GetAllSocketNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Get_Item_3) == 0x0003B8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Get_Item_4) == 0x0003BC, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0003C0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_GetSocketLocation_ReturnValue_2) == 0x0003D0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Contains_ReturnValue) == 0x0003E8, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Vector_Distance_ReturnValue) == 0x0003EC, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_NameToString_ReturnValue_2) == 0x0003F0, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_NameToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Conv_NameToString_ReturnValue_3) == 0x000400, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Conv_NameToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000410, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Contains_ReturnValue_1) == 0x000420, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Length_ReturnValue_4) == 0x000424, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Array_Length_ReturnValue_5) == 0x000428, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Less_IntInt_ReturnValue_3) == 0x00042C, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets, CallFunc_Less_IntInt_ReturnValue_4) == 0x00042D, "Member 'BGA_BouncePad_Rope_Parallel_C_CalculateClosestSockets::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");

// Function BGA_BouncePad_Rope_Parallel.BGA_BouncePad_Rope_Parallel_C.ConnectToSpiderweb
// 0x09B0 (0x09B0 - 0x0000)
struct BGA_BouncePad_Rope_Parallel_C_ConnectToSpiderweb final
{
public:
	class FName                                   CurrentSocket;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Socketlist_distance;                               // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           Socketlist_names;                                  // 0x0018(0x0010)(Edit, BlueprintVisible)
	TMap<class FName, float>                      Socketlist;                                        // 0x0028(0x0050)(Edit, BlueprintVisible)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_CalculateClosestSockets_Socketlist_names1; // 0x0090(0x0010)(ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_2;         // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_FTrunc64_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_3;         // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_4;         // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue_1;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue_2;                   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue_1; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue_2; // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_1;        // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_2;                      // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue_1;     // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue_3;                   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue_4;                   // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue_3; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue_4; // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_5;          // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue_2;     // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_2;        // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_3;                      // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_5;         // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue_5;                   // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue_5; // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_3;        // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_4;      // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_4;                      // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_NegateVector_ReturnValue_1;               // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_6;         // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_4;        // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_5;      // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue_3;     // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_5;                      // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue_1;              // 0x0580(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         CallFunc_FTrunc64_ReturnValue_6;                   // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue_7;                   // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue_6; // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue_7; // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FTrunc64_ReturnValue_8;                   // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_Int64Int64UsingFloatingPoint_ReturnValue_8; // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0xC];                                      // 0x05D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x05E0(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0640(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65C[0x4];                                      // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0660(0x0060)(IsPlainOldData, NoDestructor)
