#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Vortex_Area_Effect_VentShaft

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_Vortex_Area_Effect_VentShaft.BGA_Vortex_Area_Effect_VentShaft_C.ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft
// 0x0090 (0x0090 - 0x0000)
struct BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft) == 0x000008, "Wrong alignment on BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft");
static_assert(sizeof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft) == 0x000090, "Wrong size on BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, EntryPoint) == 0x000000, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, K2Node_CustomEvent_GameState) == 0x000008, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, K2Node_CustomEvent_Playlist) == 0x000010, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, K2Node_CustomEvent_PlaylistContextTags) == 0x000018, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, Temp_struct_Variable) == 0x000048, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, Temp_object_Variable) == 0x000068, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, CallFunc_HasAnyTags_ReturnValue) == 0x000070, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, Temp_object_Variable_1) == 0x000078, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000080, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, CallFunc_HasAuthority_ReturnValue) == 0x000088, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_ExecuteUbergraph_BGA_Vortex_Area_Effect_VentShaft::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BGA_Vortex_Area_Effect_VentShaft.BGA_Vortex_Area_Effect_VentShaft_C.OnReady_56638133436A4AFB6D3679BEE81348CB
// 0x0030 (0x0030 - 0x0000)
struct BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB) == 0x000008, "Wrong alignment on BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB");
static_assert(sizeof(BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB) == 0x000030, "Wrong size on BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB, GameState) == 0x000000, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB::GameState' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB, Playlist) == 0x000008, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB::Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB, PlaylistContextTags) == 0x000010, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_OnReady_56638133436A4AFB6D3679BEE81348CB::PlaylistContextTags' has a wrong offset!");

// Function BGA_Vortex_Area_Effect_VentShaft.BGA_Vortex_Area_Effect_VentShaft_C.UserConstructionScript
// 0x00F8 (0x00F8 - 0x0000)
struct BGA_Vortex_Area_Effect_VentShaft_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0018(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Vortex_Area_Effect_VentShaft_C_UserConstructionScript) == 0x000008, "Wrong alignment on BGA_Vortex_Area_Effect_VentShaft_C_UserConstructionScript");
static_assert(sizeof(BGA_Vortex_Area_Effect_VentShaft_C_UserConstructionScript) == 0x0000F8, "Wrong size on BGA_Vortex_Area_Effect_VentShaft_C_UserConstructionScript");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Vortex_Area_Effect_VentShaft_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000018, "Member 'BGA_Vortex_Area_Effect_VentShaft_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

