#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoarRidingPlayerLayerAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0407 (0x0408 - 0x0001)
struct BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1411;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_1412;                               // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1413;                           // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1414;                           // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1415;                           // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1416;                           // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1417;                           // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1418;                           // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1419;                           // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1420;                           // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1421;                                 // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1422;                           // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1423;                           // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1424;                           // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1425;                           // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1426;                           // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1427;                           // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1428;                           // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1429;                           // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1430;                           // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1431;                           // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1432;                           // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1433;                               // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1434;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1435;                                 // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1436;                           // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1437;                           // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1438;                                 // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1439;                           // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1440;                                 // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1441;                               // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1442;                                 // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1443;                               // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1444;                               // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1445;                                 // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1446;                           // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1447;                           // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1448;                               // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1449;                                // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1450;                           // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1451;                           // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1452;                              // 0x0130(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1453;                               // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1454;                                // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1455;                           // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1456;                               // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1457;                                // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1458;                           // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1459;                           // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1460;                               // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1461;                                // 0x016C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1462;                           // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1463;                               // 0x0178(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1464;                           // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1465;                               // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1466;                           // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1467;                               // 0x0198(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1468;                           // 0x01A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1469;                               // 0x01A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1470;                               // 0x01AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1471;                           // 0x01B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1472;                               // 0x01B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1473;                           // 0x01C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1474;                               // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1475;                           // 0x01D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1476;                               // 0x01D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1477;                               // 0x01DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1478;                                // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1479;                           // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1480;                               // 0x01F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1481;                           // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1482;                               // 0x0200(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1483;                              // 0x0208(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_1484;                           // 0x0218(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1485;                           // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1486;                              // 0x0228(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1487;                               // 0x0238(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1488;                                // 0x023C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1489;                           // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1490;                               // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1491;                                // 0x024C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1492;                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1493;                              // 0x0258(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_1494;                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1495;                                 // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1496;                               // 0x0278(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1497;                               // 0x027C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1498;                               // 0x0280(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1499;                           // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1500;                               // 0x0290(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1501;                                // 0x0294(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1502;                               // 0x0298(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1503;                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1504;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_1505;                               // 0x02B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1506;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1507;                                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_1508;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1509;                                 // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1510;                               // 0x02D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1511;                               // 0x02D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1512;                              // 0x02E0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1513;                               // 0x02F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1514;                                // 0x02F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1515;                               // 0x02F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1516;                              // 0x02FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1517;                             // 0x0300(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1518;                              // 0x032C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1519;                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1520;                               // 0x0338(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1521;                               // 0x0339(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1522;                               // 0x033A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B[0x1];                                      // 0x033B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1523;                               // 0x033C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1524;                               // 0x0340(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1525;                               // 0x0344(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1526;                               // 0x0348(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1527;                             // 0x0350(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1528;                               // 0x0368(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1529;                               // 0x036C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0370(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x03F0(0x0018)()
};
static_assert(alignof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000408, "Wrong size on BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1411) == 0x000004, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1411' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1412) == 0x000008, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1412' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1413) == 0x000010, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1413' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1414) == 0x000018, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1414' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1415) == 0x000020, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1415' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1416) == 0x000028, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1416' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1417) == 0x000030, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1417' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1418) == 0x000038, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1418' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1419) == 0x000040, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1419' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1420) == 0x000048, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1420' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1421) == 0x000050, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1421' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1422) == 0x000058, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1422' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1423) == 0x000060, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1423' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1424) == 0x000068, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1424' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1425) == 0x000070, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1425' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1426) == 0x000078, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1426' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1427) == 0x000080, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1427' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1428) == 0x000088, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1428' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1429) == 0x000090, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1429' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1430) == 0x000098, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1430' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1431) == 0x0000A0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1431' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1432) == 0x0000A8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1432' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1433) == 0x0000B0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1433' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1434) == 0x0000B4, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1434' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1435) == 0x0000B8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1435' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1436) == 0x0000C0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1436' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1437) == 0x0000C8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1437' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1438) == 0x0000D0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1438' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1439) == 0x0000D8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1439' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1440) == 0x0000E0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1440' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1441) == 0x0000E8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1441' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1442) == 0x0000F0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1442' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1443) == 0x0000F8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1443' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1444) == 0x0000FC, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1444' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1445) == 0x000100, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1445' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1446) == 0x000108, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1446' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1447) == 0x000110, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1447' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1448) == 0x000118, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1448' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1449) == 0x00011C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1449' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1450) == 0x000120, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1450' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1451) == 0x000128, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1451' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1452) == 0x000130, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1452' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1453) == 0x000140, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1453' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1454) == 0x000144, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1454' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1455) == 0x000148, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1455' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1456) == 0x000150, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1456' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1457) == 0x000154, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1457' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1458) == 0x000158, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1458' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1459) == 0x000160, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1459' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1460) == 0x000168, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1460' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1461) == 0x00016C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1461' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1462) == 0x000170, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1462' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1463) == 0x000178, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1463' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1464) == 0x000180, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1464' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1465) == 0x000188, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1465' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1466) == 0x000190, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1466' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1467) == 0x000198, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1467' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1468) == 0x0001A0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1468' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1469) == 0x0001A8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1469' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1470) == 0x0001AC, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1470' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1471) == 0x0001B0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1471' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1472) == 0x0001B8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1472' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1473) == 0x0001C0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1473' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1474) == 0x0001C8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1474' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1475) == 0x0001D0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1475' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1476) == 0x0001D8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1476' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1477) == 0x0001DC, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1477' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1478) == 0x0001E0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1478' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1479) == 0x0001E8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1479' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1480) == 0x0001F0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1480' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1481) == 0x0001F8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1481' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1482) == 0x000200, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1482' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1483) == 0x000208, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1483' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1484) == 0x000218, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1484' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1485) == 0x000220, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1485' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1486) == 0x000228, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1486' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1487) == 0x000238, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1487' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1488) == 0x00023C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1488' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1489) == 0x000240, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1489' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1490) == 0x000248, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1490' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1491) == 0x00024C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1491' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1492) == 0x000250, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1492' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1493) == 0x000258, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1493' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1494) == 0x000268, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1494' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1495) == 0x000270, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1495' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1496) == 0x000278, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1496' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1497) == 0x00027C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1497' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1498) == 0x000280, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1498' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1499) == 0x000288, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1499' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1500) == 0x000290, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1500' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1501) == 0x000294, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1501' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1502) == 0x000298, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1502' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1503) == 0x0002A0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1503' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1504) == 0x0002A8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1504' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1505) == 0x0002B0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1505' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1506) == 0x0002B8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1506' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1507) == 0x0002C0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1507' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1508) == 0x0002C8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1508' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1509) == 0x0002D0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1509' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1510) == 0x0002D8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1510' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1511) == 0x0002D9, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1511' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1512) == 0x0002E0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1512' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1513) == 0x0002F0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1513' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1514) == 0x0002F4, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1514' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1515) == 0x0002F8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1515' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1516) == 0x0002FC, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1516' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1517) == 0x000300, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1517' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1518) == 0x00032C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1518' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1519) == 0x000330, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1519' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1520) == 0x000338, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1520' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1521) == 0x000339, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1521' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1522) == 0x00033A, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1522' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1523) == 0x00033C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1523' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1524) == 0x000340, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1524' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1525) == 0x000344, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1525' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1526) == 0x000348, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1526' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1527) == 0x000350, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1527' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1528) == 0x000368, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1528' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1529) == 0x00036C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1529' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000370, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0003F0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0087 (0x0088 - 0x0001)
struct BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty;                                   // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_0;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x001B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
