#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_SplineMesh_Terrace_Child

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Athena_SplineMesh_Terrace_Child.BP_Athena_SplineMesh_Terrace_Child_C.ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child
// 0x0030 (0x0030 - 0x0000)
struct BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_count;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child) == 0x000008, "Wrong alignment on BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child");
static_assert(sizeof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child) == 0x000030, "Wrong size on BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child, EntryPoint) == 0x000000, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000004, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child, CallFunc_RandomFloatInRange_ReturnValue) == 0x00000C, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child, K2Node_CustomEvent_count) == 0x000010, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child::K2Node_CustomEvent_count' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child, CallFunc_IsMobileGame_ReturnValue) == 0x000014, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child, CallFunc_Greater_IntInt_ReturnValue) == 0x000015, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child, CallFunc_GetPlatformName_ReturnValue) == 0x000018, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child, CallFunc_Contains_ReturnValue) == 0x000028, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_ExecuteUbergraph_BP_Athena_SplineMesh_Terrace_Child::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function BP_Athena_SplineMesh_Terrace_Child.BP_Athena_SplineMesh_Terrace_Child_C.initInstances
// 0x0040 (0x0040 - 0x0000)
struct BP_Athena_SplineMesh_Terrace_Child_C_initInstances final
{
public:
	class UInstancedStaticMeshComponent*          Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 l_instanceIndices;                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetInstanceCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveInstances_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances) == 0x000008, "Wrong alignment on BP_Athena_SplineMesh_Terrace_Child_C_initInstances");
static_assert(sizeof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances) == 0x000040, "Wrong size on BP_Athena_SplineMesh_Terrace_Child_C_initInstances");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, Target) == 0x000000, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::Target' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, Count) == 0x000008, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::Count' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, l_instanceIndices) == 0x000010, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::l_instanceIndices' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, CallFunc_GetInstanceCount_ReturnValue) == 0x000020, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::CallFunc_GetInstanceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, Temp_int_Variable) == 0x000028, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, CallFunc_RemoveInstances_ReturnValue) == 0x00002C, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::CallFunc_RemoveInstances_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, CallFunc_Percent_IntInt_ReturnValue) == 0x000034, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000039, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_initInstances, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_initInstances::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Athena_SplineMesh_Terrace_Child.BP_Athena_SplineMesh_Terrace_Child_C.test_rice_reduction
// 0x0004 (0x0004 - 0x0000)
struct BP_Athena_SplineMesh_Terrace_Child_C_test_rice_reduction final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SplineMesh_Terrace_Child_C_test_rice_reduction) == 0x000004, "Wrong alignment on BP_Athena_SplineMesh_Terrace_Child_C_test_rice_reduction");
static_assert(sizeof(BP_Athena_SplineMesh_Terrace_Child_C_test_rice_reduction) == 0x000004, "Wrong size on BP_Athena_SplineMesh_Terrace_Child_C_test_rice_reduction");
static_assert(offsetof(BP_Athena_SplineMesh_Terrace_Child_C_test_rice_reduction, Count) == 0x000000, "Member 'BP_Athena_SplineMesh_Terrace_Child_C_test_rice_reduction::Count' has a wrong offset!");

}

