#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_SkyTube_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Athena_SkyTube_Base.BP_Athena_SkyTube_Base_C.Actor Exit Skytube
// 0x00F0 (0x00F0 - 0x0000)
struct BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSkyTubePhysicsComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetVehicleAbilitySystemComponent_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_BP_GetAllPassengers_ReturnValue;          // 0x0070(0x0010)(ReferenceParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x008C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_DynamicCast_AsFort_Projectile_Base;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExitSkyTube_bOutIsLastTube;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExitSkyTube_bIsLastTube;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExitSkyTube_bOutIsLastTube_1;             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube) == 0x000008, "Wrong alignment on BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube");
static_assert(sizeof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube) == 0x0000F0, "Wrong size on BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, OtherActor) == 0x000000, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000008, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_GetVehicleAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_GetVehicleAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_AsFort_Pawn) == 0x000038, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_AsFort_Vehicle_Interface_1) == 0x000048, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_AsFort_Vehicle_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000060, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_BP_GetAllPassengers_ReturnValue) == 0x000070, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_BP_GetAllPassengers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000080, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00008C, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000098, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_bSuccess_4) == 0x0000A0, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_AsFort_Projectile_Base) == 0x0000A8, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_AsFort_Projectile_Base' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, K2Node_DynamicCast_bSuccess_5) == 0x0000B0, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0000B8, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_ExitSkyTube_bOutIsLastTube) == 0x0000C0, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_ExitSkyTube_bOutIsLastTube' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_ExitSkyTube_bIsLastTube) == 0x0000C1, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_ExitSkyTube_bIsLastTube' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, Temp_int_Array_Index_Variable) == 0x0000D0, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_ExitSkyTube_bOutIsLastTube_1) == 0x0000D4, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_ExitSkyTube_bOutIsLastTube_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x0000E0, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x0000E8, "Member 'BP_Athena_SkyTube_Base_C_Actor_Exit_Skytube::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");

// Function BP_Athena_SkyTube_Base.BP_Athena_SkyTube_Base_C.AddSplineMesh
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Athena_SkyTube_Base_C_AddSplineMesh final
{
public:
	class USplineMeshComponent*                   NewSplineMesh;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsExemptFromShutdown_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SkyTube_Base_C_AddSplineMesh) == 0x000010, "Wrong alignment on BP_Athena_SkyTube_Base_C_AddSplineMesh");
static_assert(sizeof(BP_Athena_SkyTube_Base_C_AddSplineMesh) == 0x0000A0, "Wrong size on BP_Athena_SkyTube_Base_C_AddSplineMesh");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_AddSplineMesh, NewSplineMesh) == 0x000000, "Member 'BP_Athena_SkyTube_Base_C_AddSplineMesh::NewSplineMesh' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_AddSplineMesh, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_Athena_SkyTube_Base_C_AddSplineMesh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_AddSplineMesh, CallFunc_IsExemptFromShutdown_ReturnValue) == 0x000018, "Member 'BP_Athena_SkyTube_Base_C_AddSplineMesh::CallFunc_IsExemptFromShutdown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_AddSplineMesh, Temp_struct_Variable) == 0x000020, "Member 'BP_Athena_SkyTube_Base_C_AddSplineMesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_AddSplineMesh, CallFunc_AddComponent_ReturnValue) == 0x000080, "Member 'BP_Athena_SkyTube_Base_C_AddSplineMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_AddSplineMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000088, "Member 'BP_Athena_SkyTube_Base_C_AddSplineMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_AddSplineMesh, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000090, "Member 'BP_Athena_SkyTube_Base_C_AddSplineMesh::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_Athena_SkyTube_Base.BP_Athena_SkyTube_Base_C.CalculateLaunchForce
// 0x01F0 (0x01F0 - 0x0000)
struct BP_Athena_SkyTube_Base_C_CalculateLaunchForce final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Out_Launch;                                        // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkyTubeEnabled_ReturnValue;             // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindDirectionClosestToWorldLocation_ReturnValue; // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce) == 0x000008, "Wrong alignment on BP_Athena_SkyTube_Base_C_CalculateLaunchForce");
static_assert(sizeof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce) == 0x0001F0, "Wrong size on BP_Athena_SkyTube_Base_C_CalculateLaunchForce");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, Pawn) == 0x000000, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::Pawn' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, Velocity) == 0x000008, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::Velocity' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, Out_Launch) == 0x000020, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::Out_Launch' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_GetValueAtLevel_ReturnValue) == 0x000038, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_GetControlRotation_ReturnValue) == 0x000070, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000088, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x0000A0, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Normal_ReturnValue) == 0x0000B8, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Normal_ReturnValue_1) == 0x0000D0, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000E8, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000100, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000104, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000108, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x00010C, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x000110, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_MakeVector_ReturnValue_1) == 0x000118, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000130, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Add_VectorVector_ReturnValue) == 0x000148, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_BreakVector_X) == 0x000160, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_BreakVector_Y) == 0x000164, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_BreakVector_Z) == 0x000168, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_IsSkyTubeEnabled_ReturnValue) == 0x00016C, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_IsSkyTubeEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000170, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_MakeVector_ReturnValue_2) == 0x000178, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_FindDirectionClosestToWorldLocation_ReturnValue) == 0x000190, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_FindDirectionClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001A8, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Dot_VectorVector_ReturnValue) == 0x0001C0, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_SelectVector_ReturnValue) == 0x0001C8, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_Abs_ReturnValue) == 0x0001E0, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_DegAcos_ReturnValue) == 0x0001E4, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_MapRangeClamped_ReturnValue) == 0x0001E8, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CalculateLaunchForce, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0001EC, "Member 'BP_Athena_SkyTube_Base_C_CalculateLaunchForce::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");

// Function BP_Athena_SkyTube_Base.BP_Athena_SkyTube_Base_C.CheckZDirection
// 0x0078 (0x0078 - 0x0000)
struct BP_Athena_SkyTube_Base_C_CheckZDirection final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SkyTube_Base_C_CheckZDirection) == 0x000008, "Wrong alignment on BP_Athena_SkyTube_Base_C_CheckZDirection");
static_assert(sizeof(BP_Athena_SkyTube_Base_C_CheckZDirection) == 0x000078, "Wrong size on BP_Athena_SkyTube_Base_C_CheckZDirection");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CheckZDirection, Pawn) == 0x000000, "Member 'BP_Athena_SkyTube_Base_C_CheckZDirection::Pawn' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CheckZDirection, Velocity) == 0x000008, "Member 'BP_Athena_SkyTube_Base_C_CheckZDirection::Velocity' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CheckZDirection, CallFunc_Normal_ReturnValue) == 0x000020, "Member 'BP_Athena_SkyTube_Base_C_CheckZDirection::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CheckZDirection, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_Athena_SkyTube_Base_C_CheckZDirection::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CheckZDirection, CallFunc_GetActorUpVector_ReturnValue) == 0x000040, "Member 'BP_Athena_SkyTube_Base_C_CheckZDirection::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CheckZDirection, CallFunc_Normal_ReturnValue_1) == 0x000058, "Member 'BP_Athena_SkyTube_Base_C_CheckZDirection::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CheckZDirection, CallFunc_Dot_VectorVector_ReturnValue) == 0x000070, "Member 'BP_Athena_SkyTube_Base_C_CheckZDirection::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_CheckZDirection, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000074, "Member 'BP_Athena_SkyTube_Base_C_CheckZDirection::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Athena_SkyTube_Base.BP_Athena_SkyTube_Base_C.ExecuteUbergraph_BP_Athena_SkyTube_Base
// 0x0230 (0x0230 - 0x0000)
struct BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle;     // 0x0008(0x0018)()
	bool                                          CallFunc_IsSkyTubeEnabled_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkyTubeEnabled_ReturnValue_1;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkyTubeEnabled_ReturnValue_2;           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDelayUntilDisabled_ReturnValue;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetAudioComponent_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSkyTubePhysicsComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActorPtrConst_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNullItem_Is_Null_Item;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle_1;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle_2;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_GetParentComponent_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_GetParentComponent_ReturnValue_1;         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    K2Node_DynamicCast_AsFort_Projectile_Base;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_2;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EnterSkyTube_bIsFirstTube;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Skydive_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EnterSkyTube_bOutIsFirstTube;             // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0180(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x019C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle_1;   // 0x01B0(0x0018)()
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EnterSkyTube_bOutIsFirstTube_1;           // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_3;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_ExitingPawn;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0200(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base) == 0x000008, "Wrong alignment on BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base");
static_assert(sizeof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base) == 0x000230, "Wrong size on BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, EntryPoint) == 0x000000, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, K2Node_MakeStruct_GameplayEffectContextHandle) == 0x000008, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::K2Node_MakeStruct_GameplayEffectContextHandle' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_IsSkyTubeEnabled_ReturnValue) == 0x000020, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_IsSkyTubeEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_IsSkyTubeEnabled_ReturnValue_1) == 0x000021, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_IsSkyTubeEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_IsSkyTubeEnabled_ReturnValue_2) == 0x000022, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_IsSkyTubeEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_GetDelayUntilDisabled_ReturnValue) == 0x000024, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_GetDelayUntilDisabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_GetAudioComponent_ReturnValue) == 0x000028, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_GetAudioComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_IsValid_ReturnValue_2) == 0x000051, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, K2Node_Event_OtherActor) == 0x000058, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_IsValid_ReturnValue_3) == 0x000060, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base, CallFunc_IsValid_ReturnValue_4) == 0x000061, "Member 'BP_Athena_SkyTube_Base_C_ExecuteUbergraph_BP_Athena_SkyTube_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
