#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaMapScreenContainer

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.BP_OnShowTabsSet
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet final
{
public:
	bool                                          bShowTabs;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet) == 0x000001, "Wrong alignment on BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet) == 0x000001, "Wrong size on BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet, bShowTabs) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_BP_OnShowTabsSet::bShowTabs' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.ExecuteUbergraph_BP_AthenaMapScreenContainer
// 0x0048 (0x0048 - 0x0000)
struct BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UScoreboard_UI_C*                       K2Node_DynamicCast_AsScoreboard_UI;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UScoreboard_MapWidget_C*                K2Node_DynamicCast_AsScoreboard_Map_Widget;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowTabs;                            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowCreativeScoreboard;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer) == 0x000008, "Wrong alignment on BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer) == 0x000048, "Wrong size on BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, EntryPoint) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable) == 0x000004, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable_1) == 0x000005, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_AsScoreboard_UI) == 0x000018, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_AsScoreboard_UI' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_AsScoreboard_Map_Widget) == 0x000028, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_AsScoreboard_Map_Widget' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_IsValid_ReturnValue_2) == 0x000031, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Event_bShowTabs) == 0x000032, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Event_bShowTabs' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Event_IsDesignTime) == 0x000040, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Event_bShowCreativeScoreboard) == 0x000041, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Event_bShowCreativeScoreboard' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_bool_Variable) == 0x000042, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Select_Default) == 0x000043, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Select_Default' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.OnShowOrHideCreativeScoreboard
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard final
{
public:
	bool                                          bShowCreativeScoreboard;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard) == 0x000001, "Wrong alignment on BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard) == 0x000001, "Wrong size on BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard, bShowCreativeScoreboard) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_OnShowOrHideCreativeScoreboard::bShowCreativeScoreboard' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaMapScreenContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_PreConstruct) == 0x000001, "Wrong alignment on BP_AthenaMapScreenContainer_C_PreConstruct");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_PreConstruct) == 0x000001, "Wrong size on BP_AthenaMapScreenContainer_C_PreConstruct");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.ShowOrHideScoreboardUI
// 0x0028 (0x0028 - 0x0000)
struct BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI final
{
public:
	class UObject*                                ScoreboardWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShow;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortHideShowInterface> K2Node_DynamicCast_AsFort_Hide_Show_Interface;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI) == 0x000008, "Wrong alignment on BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI) == 0x000028, "Wrong size on BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI, ScoreboardWidget) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI::ScoreboardWidget' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI, bShow) == 0x000008, "Member 'BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI::bShow' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI, K2Node_DynamicCast_AsFort_Hide_Show_Interface) == 0x000010, "Member 'BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI::K2Node_DynamicCast_AsFort_Hide_Show_Interface' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AthenaMapScreenContainer_C_ShowOrHideScoreboardUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

