#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_SkyTube_Ring_Prop_Coaster_b

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Athena_SkyTube_Ring_Prop_Coaster_b.BP_Athena_SkyTube_Ring_Prop_Coaster_b_C.AreTubesEnabled
// 0x0002 (0x0002 - 0x0000)
struct BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_AreTubesEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_AreTubesEnabled) == 0x000001, "Wrong alignment on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_AreTubesEnabled");
static_assert(sizeof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_AreTubesEnabled) == 0x000002, "Wrong size on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_AreTubesEnabled");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_AreTubesEnabled, Enabled) == 0x000000, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_AreTubesEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_AreTubesEnabled, CallFunc_IsEnabled_ReturnValue) == 0x000001, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_AreTubesEnabled::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");

// Function BP_Athena_SkyTube_Ring_Prop_Coaster_b.BP_Athena_SkyTube_Ring_Prop_Coaster_b_C.ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b
// 0x0278 (0x0278 - 0x0000)
struct BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0068(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0160(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0174(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0180(0x00D0)(ContainsInstancedReference)
	bool                                          CallFunc_AreTubesEnabled_Enabled;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreTubesEnabled_Enabled_1;                // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_1;                  // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_2;                  // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b) == 0x000008, "Wrong alignment on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b");
static_assert(sizeof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b) == 0x000278, "Wrong size on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, EntryPoint) == 0x000000, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CustomEvent_PlaylistName) == 0x000010, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CustomEvent_PlaylistContextTags) == 0x000018, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000038, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CustomEvent_OverlappedComponent) == 0x000048, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CustomEvent_OtherActor) == 0x000050, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CustomEvent_OtherComp) == 0x000058, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CustomEvent_OtherBodyIndex) == 0x000060, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CustomEvent_bFromSweep) == 0x000064, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CustomEvent_SweepResult) == 0x000068, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_DynamicCast_AsFort_Pawn) == 0x000148, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000158, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CreateDelegate_OutputDelegate) == 0x000160, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_VSize_ReturnValue) == 0x00016C, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_MapRangeClamped_ReturnValue) == 0x000170, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, K2Node_CreateDelegate_OutputDelegate_1) == 0x000174, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000180, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_AreTubesEnabled_Enabled) == 0x000250, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_AreTubesEnabled_Enabled' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_IsEnabled_ReturnValue) == 0x000251, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000258, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_BooleanAND_ReturnValue) == 0x000270, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_AreTubesEnabled_Enabled_1) == 0x000271, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_AreTubesEnabled_Enabled_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_IsEnabled_ReturnValue_1) == 0x000272, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_IsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_IsEnabled_ReturnValue_2) == 0x000273, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_IsEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b, CallFunc_BooleanAND_ReturnValue_1) == 0x000274, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_ExecuteUbergraph_BP_Athena_SkyTube_Ring_Prop_Coaster_b::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_Athena_SkyTube_Ring_Prop_Coaster_b.BP_Athena_SkyTube_Ring_Prop_Coaster_b_C.PawnPassedThroughConduit
// 0x0100 (0x0100 - 0x0000)
struct BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit) == 0x000008, "Wrong alignment on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit");
static_assert(sizeof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit) == 0x000100, "Wrong size on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit, OverlappedComponent) == 0x000000, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit, OtherActor) == 0x000008, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit, OtherComp) == 0x000010, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit, OtherBodyIndex) == 0x000018, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit, bFromSweep) == 0x00001C, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit, SweepResult) == 0x000020, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PawnPassedThroughConduit::SweepResult' has a wrong offset!");

// Function BP_Athena_SkyTube_Ring_Prop_Coaster_b.BP_Athena_SkyTube_Ring_Prop_Coaster_b_C.PlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PlaylistLoaded) == 0x000008, "Wrong alignment on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PlaylistLoaded");
static_assert(sizeof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PlaylistLoaded) == 0x000028, "Wrong size on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PlaylistLoaded");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PlaylistLoaded, PlaylistName) == 0x000000, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_PlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function BP_Athena_SkyTube_Ring_Prop_Coaster_b.BP_Athena_SkyTube_Ring_Prop_Coaster_b_C.UserConstructionScript
// 0x0220 (0x0220 - 0x0000)
struct BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0040(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0140(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript");
static_assert(sizeof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript) == 0x000220, "Wrong size on BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, K2Node_Select_Default) == 0x000018, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000020, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000040, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, CallFunc_Lerp_ReturnValue) == 0x000120, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000128, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000140, "Member 'BP_Athena_SkyTube_Ring_Prop_Coaster_b_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

