#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaMapScreenContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C
// 0x0050 (0x05C0 - 0x0570)
class UBP_AthenaMapScreenContainer_C final : public UAthenaMapScreenContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DamageTaken;                                       // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Tabs;                                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OnlineStatusIndicator;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US18_PlayerBattlePassXpAndReward_C*     S18_PlayerBattlePassXpAndReward_310;               // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TabButtons;                               // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_SwitcherContainer;                         // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreboard_UI_C*                       ScoreboardWidgetRef;                               // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnShowTabsSet(bool bShowTabs);
	void ExecuteUbergraph_BP_AthenaMapScreenContainer(int32 EntryPoint);
	void OnCreativeCareerScoreboardWidgetSet();
	void OnDamageReceived();
	void OnInitialized();
	void OnMinigameEndUI();
	void OnShowOrHideCreativeScoreboard(bool bShowCreativeScoreboard);
	void PreConstruct(bool IsDesignTime);
	void ShowOrHideScoreboardUI(class UObject* ScoreboardWidget, bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AthenaMapScreenContainer_C">();
	}
	static class UBP_AthenaMapScreenContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AthenaMapScreenContainer_C>();
	}
};
static_assert(alignof(UBP_AthenaMapScreenContainer_C) == 0x000008, "Wrong alignment on UBP_AthenaMapScreenContainer_C");
static_assert(sizeof(UBP_AthenaMapScreenContainer_C) == 0x0005C0, "Wrong size on UBP_AthenaMapScreenContainer_C");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, UberGraphFrame) == 0x000570, "Member 'UBP_AthenaMapScreenContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, DamageTaken) == 0x000578, "Member 'UBP_AthenaMapScreenContainer_C::DamageTaken' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, HBox_Tabs) == 0x000580, "Member 'UBP_AthenaMapScreenContainer_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, NextTabAction) == 0x000588, "Member 'UBP_AthenaMapScreenContainer_C::NextTabAction' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, OnlineStatusIndicator) == 0x000590, "Member 'UBP_AthenaMapScreenContainer_C::OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, PreviousTabAction) == 0x000598, "Member 'UBP_AthenaMapScreenContainer_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, S18_PlayerBattlePassXpAndReward_310) == 0x0005A0, "Member 'UBP_AthenaMapScreenContainer_C::S18_PlayerBattlePassXpAndReward_310' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SafeZone_TabButtons) == 0x0005A8, "Member 'UBP_AthenaMapScreenContainer_C::SafeZone_TabButtons' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SizeBox_SwitcherContainer) == 0x0005B0, "Member 'UBP_AthenaMapScreenContainer_C::SizeBox_SwitcherContainer' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, ScoreboardWidgetRef) == 0x0005B8, "Member 'UBP_AthenaMapScreenContainer_C::ScoreboardWidgetRef' has a wrong offset!");

}

