#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ApolloSnowSetup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.ExecuteUbergraph_BP_ApolloSnowSetup
// 0x0140 (0x0140 - 0x0000)
struct BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Snow_PostProcessing_Volume_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x001C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x0024(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_2;     // 0x0028(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_3;     // 0x0030(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_4;     // 0x0038(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_3;    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_5;     // 0x0040(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_4;    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_6;     // 0x0060(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         K2Node_CustomEvent_GameState;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_7;     // 0x0070(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_5;    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Intensity_1;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_GameStateReady*        CallFunc_GameStateReadyAsync_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Intensity;                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_6;    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_8;     // 0x0094(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_9;     // 0x0098(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_7;    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_10;    // 0x00A0(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_11;    // 0x00A4(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_12;    // 0x00A8(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Snow_PostProcessing_Volume_C*       CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGameStateBase* GameState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00BC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         Temp_object_Variable;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_1; // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_1; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_1; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_1; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_2; // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_2; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_2; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_2; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup) == 0x000008, "Wrong alignment on BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup");
static_assert(sizeof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup) == 0x000140, "Wrong size on BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, EntryPoint) == 0x000000, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x00001C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x000024, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_2) == 0x000028, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_3) == 0x000030, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x000034, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_4) == 0x000038, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_3) == 0x00003C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_5) == 0x000040, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_4) == 0x000044, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MatchReadyAsync_ReturnValue) == 0x000048, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_6) == 0x000060, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_GameState) == 0x000068, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_7) == 0x000070, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_5) == 0x000074, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_Intensity_1) == 0x000078, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_Intensity_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GameStateReadyAsync_ReturnValue) == 0x000080, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GameStateReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_HasAuthority_ReturnValue) == 0x000089, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_Intensity) == 0x00008C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_Intensity' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_6) == 0x000090, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_8) == 0x000094, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_9) == 0x000098, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_7) == 0x00009C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_10) == 0x0000A0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_11) == 0x0000A4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_12) == 0x0000A8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, Temp_int_Array_Index_Variable) == 0x0000AC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_HasAuthority_ReturnValue_1) == 0x0000B8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000BC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, Temp_int_Loop_Counter_Variable) == 0x0000C8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Less_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_HasAuthority_ReturnValue_2) == 0x0000D4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_HasAuthority_ReturnValue_3) == 0x0000D5, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x0000D6, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x0000D8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x0000E0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x0000E8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_FMax_ReturnValue) == 0x0000EC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, Temp_object_Variable) == 0x0000F0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_bIsEventActive_1) == 0x0000F8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_bIsEventActive_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSinceBegin_1) == 0x000100, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeUntilEnd_1) == 0x000108, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSpanRatio_1) == 0x000110, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000118, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_bIsEventActive_2) == 0x000121, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_bIsEventActive_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSinceBegin_2) == 0x000128, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeUntilEnd_2) == 0x000130, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSpanRatio_2) == 0x000138, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00013C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.MakeLocationVisibleInSnow
// 0x0014 (0x0014 - 0x0000)
struct BP_ApolloSnowSetup_C_MakeLocationVisibleInSnow final
{
public:
	struct FGameplayTag                           LocationTag;                                       // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_MakeLocationVisibleInSnow) == 0x000004, "Wrong alignment on BP_ApolloSnowSetup_C_MakeLocationVisibleInSnow");
static_assert(sizeof(BP_ApolloSnowSetup_C_MakeLocationVisibleInSnow) == 0x000014, "Wrong size on BP_ApolloSnowSetup_C_MakeLocationVisibleInSnow");
static_assert(offsetof(BP_ApolloSnowSetup_C_MakeLocationVisibleInSnow, LocationTag) == 0x000000, "Member 'BP_ApolloSnowSetup_C_MakeLocationVisibleInSnow::LocationTag' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_MakeLocationVisibleInSnow, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'BP_ApolloSnowSetup_C_MakeLocationVisibleInSnow::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.OnReady_E426AA7F4F2319EA06FBA2B9905F0B24
// 0x0008 (0x0008 - 0x0000)
struct BP_ApolloSnowSetup_C_OnReady_E426AA7F4F2319EA06FBA2B9905F0B24 final
{
public:
	class AGameStateBase*                         GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_OnReady_E426AA7F4F2319EA06FBA2B9905F0B24) == 0x000008, "Wrong alignment on BP_ApolloSnowSetup_C_OnReady_E426AA7F4F2319EA06FBA2B9905F0B24");
static_assert(sizeof(BP_ApolloSnowSetup_C_OnReady_E426AA7F4F2319EA06FBA2B9905F0B24) == 0x000008, "Wrong size on BP_ApolloSnowSetup_C_OnReady_E426AA7F4F2319EA06FBA2B9905F0B24");
static_assert(offsetof(BP_ApolloSnowSetup_C_OnReady_E426AA7F4F2319EA06FBA2B9905F0B24, GameState) == 0x000000, "Member 'BP_ApolloSnowSetup_C_OnReady_E426AA7F4F2319EA06FBA2B9905F0B24::GameState' has a wrong offset!");

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.OnRep_Snow_Amount
// 0x0001 (0x0001 - 0x0000)
struct BP_ApolloSnowSetup_C_OnRep_Snow_Amount final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_OnRep_Snow_Amount) == 0x000001, "Wrong alignment on BP_ApolloSnowSetup_C_OnRep_Snow_Amount");
static_assert(sizeof(BP_ApolloSnowSetup_C_OnRep_Snow_Amount) == 0x000001, "Wrong size on BP_ApolloSnowSetup_C_OnRep_Snow_Amount");
static_assert(offsetof(BP_ApolloSnowSetup_C_OnRep_Snow_Amount, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_ApolloSnowSetup_C_OnRep_Snow_Amount::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.OnRep_SnowFalling
// 0x0001 (0x0001 - 0x0000)
struct BP_ApolloSnowSetup_C_OnRep_SnowFalling final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_OnRep_SnowFalling) == 0x000001, "Wrong alignment on BP_ApolloSnowSetup_C_OnRep_SnowFalling");
static_assert(sizeof(BP_ApolloSnowSetup_C_OnRep_SnowFalling) == 0x000001, "Wrong size on BP_ApolloSnowSetup_C_OnRep_SnowFalling");
static_assert(offsetof(BP_ApolloSnowSetup_C_OnRep_SnowFalling, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_ApolloSnowSetup_C_OnRep_SnowFalling::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.ProxyCalendarEventRatio
// 0x0100 (0x0100 - 0x0000)
struct BP_ApolloSnowSetup_C_ProxyCalendarEventRatio final
{
public:
	struct FDateTime                              Start_Time;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              End_Time;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              EventTime;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EventHourLength;                                   // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 EventInfo;                                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          EventActive;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DateTimeDateTime_ReturnValue;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DateTimeDateTime_ReturnValue; // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue_1;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalHours_ReturnValue;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TimespanRatio_ReturnValue;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio) == 0x000008, "Wrong alignment on BP_ApolloSnowSetup_C_ProxyCalendarEventRatio");
static_assert(sizeof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio) == 0x000100, "Wrong size on BP_ApolloSnowSetup_C_ProxyCalendarEventRatio");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, Start_Time) == 0x000000, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::Start_Time' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, End_Time) == 0x000008, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::End_Time' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, EventTime) == 0x000010, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::EventTime' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, Ratio) == 0x000018, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::Ratio' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, EventHourLength) == 0x00001C, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::EventHourLength' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, EventInfo) == 0x000020, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::EventInfo' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, EventActive) == 0x000030, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::EventActive' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, Temp_bool_Variable) == 0x000031, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Less_DateTimeDateTime_ReturnValue) == 0x000032, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Less_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_GreaterEqual_DateTimeDateTime_ReturnValue) == 0x000033, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_GreaterEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000038, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Subtract_DateTimeDateTime_ReturnValue_1) == 0x000048, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Subtract_DateTimeDateTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_GetTotalHours_ReturnValue) == 0x000050, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_GetTotalHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_TimespanRatio_ReturnValue) == 0x000054, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_TimespanRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_FTrunc_ReturnValue) == 0x000058, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_FClamp_ReturnValue) == 0x00005C, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Conv_FloatToString_ReturnValue) == 0x000070, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, Temp_string_Variable) == 0x000080, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A0, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, Temp_string_Variable_1) == 0x0000B0, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C0, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D0, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, K2Node_Select_Default) == 0x0000E0, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ProxyCalendarEventRatio, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000F0, "Member 'BP_ApolloSnowSetup_C_ProxyCalendarEventRatio::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.SetFallingSnow
// 0x0004 (0x0004 - 0x0000)
struct BP_ApolloSnowSetup_C_SetFallingSnow final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_SetFallingSnow) == 0x000004, "Wrong alignment on BP_ApolloSnowSetup_C_SetFallingSnow");
static_assert(sizeof(BP_ApolloSnowSetup_C_SetFallingSnow) == 0x000004, "Wrong size on BP_ApolloSnowSetup_C_SetFallingSnow");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetFallingSnow, Intensity) == 0x000000, "Member 'BP_ApolloSnowSetup_C_SetFallingSnow::Intensity' has a wrong offset!");

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.SetSnow
// 0x0004 (0x0004 - 0x0000)
struct BP_ApolloSnowSetup_C_SetSnow final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_SetSnow) == 0x000004, "Wrong alignment on BP_ApolloSnowSetup_C_SetSnow");
static_assert(sizeof(BP_ApolloSnowSetup_C_SetSnow) == 0x000004, "Wrong size on BP_ApolloSnowSetup_C_SetSnow");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnow, Intensity) == 0x000000, "Member 'BP_ApolloSnowSetup_C_SetSnow::Intensity' has a wrong offset!");

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.SetSnowAltitude
// 0x0130 (0x0130 - 0x0000)
struct BP_ApolloSnowSetup_C_SetSnowAltitude final
{
public:
	float                                         SnowAmount_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0048(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_SetSnowAltitude) == 0x000008, "Wrong alignment on BP_ApolloSnowSetup_C_SetSnowAltitude");
static_assert(sizeof(BP_ApolloSnowSetup_C_SetSnowAltitude) == 0x000130, "Wrong size on BP_ApolloSnowSetup_C_SetSnowAltitude");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowAltitude, SnowAmount_0) == 0x000000, "Member 'BP_ApolloSnowSetup_C_SetSnowAltitude::SnowAmount_0' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowAltitude, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_ApolloSnowSetup_C_SetSnowAltitude::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowAltitude, CallFunc_BreakVector_X) == 0x000020, "Member 'BP_ApolloSnowSetup_C_SetSnowAltitude::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowAltitude, CallFunc_BreakVector_Y) == 0x000024, "Member 'BP_ApolloSnowSetup_C_SetSnowAltitude::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowAltitude, CallFunc_BreakVector_Z) == 0x000028, "Member 'BP_ApolloSnowSetup_C_SetSnowAltitude::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowAltitude, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'BP_ApolloSnowSetup_C_SetSnowAltitude::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowAltitude, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000048, "Member 'BP_ApolloSnowSetup_C_SetSnowAltitude::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowAltitude, CallFunc_MapRangeClamped_ReturnValue) == 0x000128, "Member 'BP_ApolloSnowSetup_C_SetSnowAltitude::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowAltitude, CallFunc_Add_FloatFloat_ReturnValue) == 0x00012C, "Member 'BP_ApolloSnowSetup_C_SetSnowAltitude::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.SetSnowFall
// 0x0008 (0x0008 - 0x0000)
struct BP_ApolloSnowSetup_C_SetSnowFall final
{
public:
	float                                         FallingSnow_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ApolloSnowSetup_C_SetSnowFall) == 0x000004, "Wrong alignment on BP_ApolloSnowSetup_C_SetSnowFall");
static_assert(sizeof(BP_ApolloSnowSetup_C_SetSnowFall) == 0x000008, "Wrong size on BP_ApolloSnowSetup_C_SetSnowFall");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowFall, FallingSnow_0) == 0x000000, "Member 'BP_ApolloSnowSetup_C_SetSnowFall::FallingSnow_0' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_SetSnowFall, CallFunc_GetFloatValue_ReturnValue) == 0x000004, "Member 'BP_ApolloSnowSetup_C_SetSnowFall::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");

}

