#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_Environmental_ZipLine_Spline

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.AddSplineMeshSegment
// 0x0080 (0x0080 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment final
{
public:
	class USplineMeshComponent*                   SplineMeshSegment;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment) == 0x000010, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment) == 0x000080, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment, SplineMeshSegment) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment::SplineMeshSegment' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment, Temp_struct_Variable) == 0x000010, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment, CallFunc_SetStaticMesh_ReturnValue) == 0x000078, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.AutoSmoothTanget
// 0x00E8 (0x00E8 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget final
{
public:
	struct FVector                                Tangent;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PointA;                                            // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PointB;                                            // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SmoothedTangent;                                   // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget) == 0x000008, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget) == 0x0000E8, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, Tangent) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::Tangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, PointA) == 0x000018, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::PointA' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, PointB) == 0x000030, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::PointB' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, SmoothedTangent) == 0x000048, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::SmoothedTangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, Temp_bool_Variable) == 0x000060, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_Normal_ReturnValue) == 0x000080, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_VSize_ReturnValue) == 0x000098, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000B8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, K2Node_Select_Default) == 0x0000D0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::K2Node_Select_Default' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.Calc Auto Location At Alpha
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha final
{
public:
	float                                         InAlpha;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebug;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PointLocation;                                     // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplinePointID;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAutoHorizAndVertVectors_VertVec;       // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAutoHorizAndVertVectors_HorizVec;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_3;                      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_4;                      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha) == 0x000008, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha) == 0x0001C0, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, InAlpha) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::InAlpha' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, DrawDebug) == 0x000004, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::DrawDebug' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, PointLocation) == 0x000008, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::PointLocation' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, SplinePointID) == 0x000020, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::SplinePointID' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_VLerp_ReturnValue) == 0x000028, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_GetAutoHorizAndVertVectors_VertVec) == 0x000048, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_GetAutoHorizAndVertVectors_VertVec' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_GetAutoHorizAndVertVectors_HorizVec) == 0x000060, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_GetAutoHorizAndVertVectors_HorizVec' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000078, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000090, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_VLerp_ReturnValue_1) == 0x0000A8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_BooleanOR_ReturnValue) == 0x0000C1, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000E0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x000110, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_VLerp_ReturnValue_2) == 0x000128, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000140, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_VLerp_ReturnValue_3) == 0x000158, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_VLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000170, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000188, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_Lerp_ReturnValue) == 0x0001A0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_FClamp_ReturnValue) == 0x0001A4, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha, CallFunc_VLerp_ReturnValue_4) == 0x0001A8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha::CallFunc_VLerp_ReturnValue_4' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.CalculatePositionOfPoles
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles final
{
public:
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles) == 0x000008, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles) == 0x0000B0, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000008, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x000020, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000038, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x000050, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000068, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000070, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetSocketLocation_ReturnValue) == 0x000078, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000090, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline
// 0x0080 (0x0080 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn_1;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline) == 0x000008, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline) == 0x000080, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, EntryPoint) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, K2Node_CustomEvent_PlayerPawn) == 0x000008, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::K2Node_CustomEvent_PlayerPawn' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, K2Node_CustomEvent_PlayerPawn_1) == 0x000018, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::K2Node_CustomEvent_PlayerPawn_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000020, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000038, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00003C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000048, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.GetAutoHorizAndVertVectors
// 0x00D8 (0x00D8 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors final
{
public:
	struct FVector                                highVector;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LowVector;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VertVec;                                           // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HorizVec;                                          // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors) == 0x000008, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors) == 0x0000D8, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, highVector) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::highVector' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, LowVector) == 0x000018, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::LowVector' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, VertVec) == 0x000030, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::VertVec' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, HorizVec) == 0x000048, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::HorizVec' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, CallFunc_BreakVector_X) == 0x000078, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, CallFunc_BreakVector_Y) == 0x00007C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, CallFunc_BreakVector_Z) == 0x000080, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors, CallFunc_MakeVector_ReturnValue_1) == 0x0000C0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_GetAutoHorizAndVertVectors::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.PlayerAttachedToZipline
// 0x0008 (0x0008 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_PlayerAttachedToZipline final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_PlayerAttachedToZipline) == 0x000008, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_PlayerAttachedToZipline");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_PlayerAttachedToZipline) == 0x000008, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_PlayerAttachedToZipline");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_PlayerAttachedToZipline, PlayerPawn) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_PlayerAttachedToZipline::PlayerPawn' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.PlayerDetachedFromZipline
// 0x0008 (0x0008 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_PlayerDetachedFromZipline final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_PlayerDetachedFromZipline) == 0x000008, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_PlayerDetachedFromZipline");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_PlayerDetachedFromZipline) == 0x000008, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_PlayerDetachedFromZipline");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_PlayerDetachedFromZipline, PlayerPawn) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_PlayerDetachedFromZipline::PlayerPawn' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.SetCableTilingBySplineLength
// 0x0018 (0x0018 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength final
{
public:
	class UMeshComponent*                         Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength) == 0x000008, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength) == 0x000018, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength, Target) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength::Target' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength, CallFunc_GetSplineLength_ReturnValue) == 0x000008, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetCableTilingBySplineLength::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.SetSplinePositionAndTangent
// 0x0160 (0x0160 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent final
{
public:
	bool                                          SetPosition;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetTangent;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ID;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OneDivNumPoints;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SplinePointIDToSet;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AlphaForLocation;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstPoint;                                      // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SplinePointID;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevAlpha;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Calc_Auto_Location_At_Alpha_PointLocation; // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAutoHorizAndVertVectors_VertVec;       // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAutoHorizAndVertVectors_HorizVec;      // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent) == 0x000008, "Wrong alignment on BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent) == 0x000160, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, SetPosition) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::SetPosition' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, SetTangent) == 0x000001, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::SetTangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, ID) == 0x000004, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::ID' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, OneDivNumPoints) == 0x000008, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::OneDivNumPoints' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, SplinePointIDToSet) == 0x00000C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::SplinePointIDToSet' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, AlphaForLocation) == 0x000010, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::AlphaForLocation' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, IsFirstPoint) == 0x000014, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::IsFirstPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, SplinePointID) == 0x000018, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::SplinePointID' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, PrevAlpha) == 0x00001C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::PrevAlpha' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, Alpha) == 0x000020, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::Alpha' has a wrong offset!");
