#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_HiThere

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Athena_HiThere.BP_Athena_HiThere_C
// 0x0028 (0x0298 - 0x0270)
class ABP_Athena_HiThere_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ContentPatchVersion;                               // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortAnalyticsEventAttribute>   AttributeArray;                                    // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Athena_HiThere(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Athena_HiThere_C">();
	}
	static class ABP_Athena_HiThere_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Athena_HiThere_C>();
	}
};
static_assert(alignof(ABP_Athena_HiThere_C) == 0x000008, "Wrong alignment on ABP_Athena_HiThere_C");
static_assert(sizeof(ABP_Athena_HiThere_C) == 0x000298, "Wrong size on ABP_Athena_HiThere_C");
static_assert(offsetof(ABP_Athena_HiThere_C, UberGraphFrame) == 0x000270, "Member 'ABP_Athena_HiThere_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Athena_HiThere_C, DefaultSceneRoot) == 0x000278, "Member 'ABP_Athena_HiThere_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Athena_HiThere_C, ContentPatchVersion) == 0x000280, "Member 'ABP_Athena_HiThere_C::ContentPatchVersion' has a wrong offset!");
static_assert(offsetof(ABP_Athena_HiThere_C, AttributeArray) == 0x000288, "Member 'ABP_Athena_HiThere_C::AttributeArray' has a wrong offset!");

}

