#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AssaultRifle_FrontClip_SideAction

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AssaultRifle_FrontClip_SideAction.BP_AssaultRifle_FrontClip_SideAction_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_AssaultRifle_FrontClip_SideAction_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_AssaultRifle_FrontClip_SideAction_C_AnimGraph) == 0x000008, "Wrong alignment on BP_AssaultRifle_FrontClip_SideAction_C_AnimGraph");
static_assert(sizeof(BP_AssaultRifle_FrontClip_SideAction_C_AnimGraph) == 0x000010, "Wrong size on BP_AssaultRifle_FrontClip_SideAction_C_AnimGraph");
static_assert(offsetof(BP_AssaultRifle_FrontClip_SideAction_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_AssaultRifle_FrontClip_SideAction_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_AssaultRifle_FrontClip_SideAction.BP_AssaultRifle_FrontClip_SideAction_C.ExecuteUbergraph_BP_AssaultRifle_FrontClip_SideAction
// 0x0004 (0x0004 - 0x0000)
struct BP_AssaultRifle_FrontClip_SideAction_C_ExecuteUbergraph_BP_AssaultRifle_FrontClip_SideAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AssaultRifle_FrontClip_SideAction_C_ExecuteUbergraph_BP_AssaultRifle_FrontClip_SideAction) == 0x000004, "Wrong alignment on BP_AssaultRifle_FrontClip_SideAction_C_ExecuteUbergraph_BP_AssaultRifle_FrontClip_SideAction");
static_assert(sizeof(BP_AssaultRifle_FrontClip_SideAction_C_ExecuteUbergraph_BP_AssaultRifle_FrontClip_SideAction) == 0x000004, "Wrong size on BP_AssaultRifle_FrontClip_SideAction_C_ExecuteUbergraph_BP_AssaultRifle_FrontClip_SideAction");
static_assert(offsetof(BP_AssaultRifle_FrontClip_SideAction_C_ExecuteUbergraph_BP_AssaultRifle_FrontClip_SideAction, EntryPoint) == 0x000000, "Member 'BP_AssaultRifle_FrontClip_SideAction_C_ExecuteUbergraph_BP_AssaultRifle_FrontClip_SideAction::EntryPoint' has a wrong offset!");

}

