#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ControllerRequirement_CheckLivingWorldManagerBudget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_ControllerRequirement_CheckLivingWorldManagerBudget.BP_ControllerRequirement_CheckLivingWorldManagerBudget_C.IsRequirementMetInternal
// 0x0050 (0x0050 - 0x0000)
struct BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal final
{
public:
	struct FControllerRequirementTestContext      RequestContext;                                    // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthenaFromContext_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaLivingWorldManager*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_QueryEventBudget_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal) == 0x000008, "Wrong alignment on BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal");
static_assert(sizeof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal) == 0x000050, "Wrong size on BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal");
static_assert(offsetof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal, RequestContext) == 0x000000, "Member 'BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal::RequestContext' has a wrong offset!");
static_assert(offsetof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal, ReturnValue) == 0x000020, "Member 'BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal, CallFunc_GetGameStateAthenaFromContext_ReturnValue) == 0x000028, "Member 'BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal::CallFunc_GetGameStateAthenaFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal, CallFunc_QueryEventBudget_ReturnValue) == 0x000044, "Member 'BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal::CallFunc_QueryEventBudget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'BP_ControllerRequirement_CheckLivingWorldManagerBudget_C_IsRequirementMetInternal::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

