#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cattus_MPC_Animation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Cattus_MPC_Animation.BP_Cattus_MPC_Animation_C.DebugOvergrowth
// 0x0004 (0x0004 - 0x0000)
struct BP_Cattus_MPC_Animation_C_DebugOvergrowth final
{
public:
	float                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cattus_MPC_Animation_C_DebugOvergrowth) == 0x000004, "Wrong alignment on BP_Cattus_MPC_Animation_C_DebugOvergrowth");
static_assert(sizeof(BP_Cattus_MPC_Animation_C_DebugOvergrowth) == 0x000004, "Wrong size on BP_Cattus_MPC_Animation_C_DebugOvergrowth");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_DebugOvergrowth, NewParam) == 0x000000, "Member 'BP_Cattus_MPC_Animation_C_DebugOvergrowth::NewParam' has a wrong offset!");

// Function BP_Cattus_MPC_Animation.BP_Cattus_MPC_Animation_C.ExecuteUbergraph_BP_Cattus_MPC_Animation
// 0x0160 (0x0160 - 0x0000)
struct BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              Temp_struct_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_2;           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_3;           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewParam;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_4;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_5;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_6;           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_7;           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_8;           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_1;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_7;                       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0148(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation) == 0x000008, "Wrong alignment on BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation");
static_assert(sizeof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation) == 0x000160, "Wrong size on BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, EntryPoint) == 0x000000, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_EventName_2) == 0x000008, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000018, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000020, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000028, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_EventName_1) == 0x000038, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000048, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000050, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000058, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_EventName) == 0x000068, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_TimeUntilEnd) == 0x000078, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_TimeSinceBegin) == 0x000080, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_TimeSpanRatio) == 0x000088, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, Temp_float_Variable) == 0x000098, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, Temp_struct_Variable) == 0x0000A0, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_GetTotalSeconds_ReturnValue) == 0x0000A8, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000AC, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, Temp_struct_Variable_1) == 0x0000B0, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, Temp_string_Variable) == 0x0000B8, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_WatchCalendarEvent_ReturnValue) == 0x0000C8, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_WatchCalendarEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x0000D0, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0000D4, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x0000D8, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_MakeLiteralFloat_ReturnValue_2) == 0x0000DC, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_MakeLiteralFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_MakeLiteralFloat_ReturnValue_3) == 0x0000E0, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_MakeLiteralFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CustomEvent_NewParam) == 0x0000E4, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Lerp_ReturnValue) == 0x0000E8, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Lerp_ReturnValue_1) == 0x0000EC, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Lerp_ReturnValue_2) == 0x0000F0, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Lerp_ReturnValue_3) == 0x0000F4, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_MakeLiteralFloat_ReturnValue_4) == 0x0000F8, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_MakeLiteralFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_FClamp_ReturnValue) == 0x0000FC, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_MakeLiteralFloat_ReturnValue_5) == 0x000100, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_MakeLiteralFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_MakeLiteralFloat_ReturnValue_6) == 0x000104, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_MakeLiteralFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_MakeLiteralFloat_ReturnValue_7) == 0x000108, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_MakeLiteralFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_MakeLiteralFloat_ReturnValue_8) == 0x00010C, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_MakeLiteralFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x000110, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000118, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000120, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000128, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_GetTotalSeconds_ReturnValue_1) == 0x00012C, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_GetTotalSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000130, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_FClamp_ReturnValue_1) == 0x000134, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Lerp_ReturnValue_4) == 0x000138, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Lerp_ReturnValue_5) == 0x00013C, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Lerp_ReturnValue_6) == 0x000140, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_Lerp_ReturnValue_7) == 0x000144, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, K2Node_CreateDelegate_OutputDelegate_3) == 0x000148, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000158, "Member 'BP_Cattus_MPC_Animation_C_ExecuteUbergraph_BP_Cattus_MPC_Animation::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_Cattus_MPC_Animation.BP_Cattus_MPC_Animation_C.OnEventActive_66CB2D794265FF6324883898423DFB73
// 0x0028 (0x0028 - 0x0000)
struct BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73) == 0x000008, "Wrong alignment on BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73");
static_assert(sizeof(BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73) == 0x000028, "Wrong size on BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73, EventName) == 0x000000, "Member 'BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73::EventName' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73, TimeUntilEnd) == 0x000010, "Member 'BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73, TimeSinceBegin) == 0x000018, "Member 'BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73, TimespanRatio) == 0x000020, "Member 'BP_Cattus_MPC_Animation_C_OnEventActive_66CB2D794265FF6324883898423DFB73::TimespanRatio' has a wrong offset!");

// Function BP_Cattus_MPC_Animation.BP_Cattus_MPC_Animation_C.OnEventEnded_66CB2D794265FF6324883898423DFB73
// 0x0028 (0x0028 - 0x0000)
struct BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73) == 0x000008, "Wrong alignment on BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73");
static_assert(sizeof(BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73) == 0x000028, "Wrong size on BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73, EventName) == 0x000000, "Member 'BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73::EventName' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73, TimeUntilEnd) == 0x000010, "Member 'BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73, TimeSinceBegin) == 0x000018, "Member 'BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73, TimespanRatio) == 0x000020, "Member 'BP_Cattus_MPC_Animation_C_OnEventEnded_66CB2D794265FF6324883898423DFB73::TimespanRatio' has a wrong offset!");

// Function BP_Cattus_MPC_Animation.BP_Cattus_MPC_Animation_C.OnEventUpdated_66CB2D794265FF6324883898423DFB73
// 0x0028 (0x0028 - 0x0000)
struct BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73) == 0x000008, "Wrong alignment on BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73");
static_assert(sizeof(BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73) == 0x000028, "Wrong size on BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73, EventName) == 0x000000, "Member 'BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73::EventName' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73, TimeUntilEnd) == 0x000010, "Member 'BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73, TimeSinceBegin) == 0x000018, "Member 'BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73, TimespanRatio) == 0x000020, "Member 'BP_Cattus_MPC_Animation_C_OnEventUpdated_66CB2D794265FF6324883898423DFB73::TimespanRatio' has a wrong offset!");

// Function BP_Cattus_MPC_Animation.BP_Cattus_MPC_Animation_C.OnRep_NormalizedValue
// 0x0001 (0x0001 - 0x0000)
struct BP_Cattus_MPC_Animation_C_OnRep_NormalizedValue final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cattus_MPC_Animation_C_OnRep_NormalizedValue) == 0x000001, "Wrong alignment on BP_Cattus_MPC_Animation_C_OnRep_NormalizedValue");
static_assert(sizeof(BP_Cattus_MPC_Animation_C_OnRep_NormalizedValue) == 0x000001, "Wrong size on BP_Cattus_MPC_Animation_C_OnRep_NormalizedValue");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_OnRep_NormalizedValue, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_Cattus_MPC_Animation_C_OnRep_NormalizedValue::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_Cattus_MPC_Animation.BP_Cattus_MPC_Animation_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_Cattus_MPC_Animation_C_UserConstructionScript final
{
public:
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_2;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_3;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cattus_MPC_Animation_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Cattus_MPC_Animation_C_UserConstructionScript");
static_assert(sizeof(BP_Cattus_MPC_Animation_C_UserConstructionScript) == 0x000020, "Wrong size on BP_Cattus_MPC_Animation_C_UserConstructionScript");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_UserConstructionScript, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000000, "Member 'BP_Cattus_MPC_Animation_C_UserConstructionScript::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cattus_MPC_Animation_C_UserConstructionScript, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x000004, "Member 'BP_Cattus_MPC_Animation_C_UserConstructionScript::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
