#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CalendarProps_V2

#include "Basic.hpp"

#include "CalendarPropData_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CalendarProps_V2.BP_CalendarProps_V2_C.event
// 0x0010 (0x0010 - 0x0000)
struct BP_CalendarProps_V2_C_event final
{
public:
	class FString                                 EventName_0;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarProps_V2_C_event) == 0x000008, "Wrong alignment on BP_CalendarProps_V2_C_event");
static_assert(sizeof(BP_CalendarProps_V2_C_event) == 0x000010, "Wrong size on BP_CalendarProps_V2_C_event");
static_assert(offsetof(BP_CalendarProps_V2_C_event, EventName_0) == 0x000000, "Member 'BP_CalendarProps_V2_C_event::EventName_0' has a wrong offset!");

// Function BP_CalendarProps_V2.BP_CalendarProps_V2_C.ExecuteUbergraph_BP_CalendarProps_V2
// 0x0960 (0x0960 - 0x0000)
struct BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCalendarPropData                      CallFunc_Array_Get_Item;                           // 0x0020(0x00B0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0xC];                                      // 0x0124(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0130(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0190(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetArrayElementAttachedTo_AttachToSpawned; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetArrayElementAttachedTo_ElementToAttachTo; // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x0220(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue;        // 0x0290(0x0060)(IsPlainOldData, NoDestructor)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x02F0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class AFortAthenaLowGravZone*                 K2Node_DynamicCast_AsFort_Athena_Low_Grav_Zone;    // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortEQSPrevisActor*                    K2Node_DynamicCast_AsFort_EQSPrevis_Actor;         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_Static_Mesh;         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343[0x1];                                      // 0x0343(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCalendarPropData                      CallFunc_Array_Get_Item_2;                         // 0x0350(0x00B0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0xC];                                      // 0x0404(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0410(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_1;                 // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_3;               // 0x04C0(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FCalendarPropData                      CallFunc_Array_Get_Item_3;                         // 0x0520(0x00B0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x05D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D5[0xB];                                      // 0x05D5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_1;          // 0x05E0(0x0060)(IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_1;    // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0648(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_2;                 // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_2;                // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x3];                                      // 0x0689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingSMActor*                       CallFunc_Array_Get_Item_4;                         // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCalendarPropData                      K2Node_MakeStruct_CalendarPropData;                // 0x06A0(0x00B0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761[0x3];                                      // 0x0761(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76C[0x4];                                      // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_5;                         // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingProp*                          K2Node_DynamicCast_AsBuilding_Prop;                // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0782(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_783[0x1];                                      // 0x0783(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCalendarPropData                      CallFunc_Array_Get_Item_6;                         // 0x0790(0x00B0)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_7;                         // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0848(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_854[0x4];                                      // 0x0854(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingProp*                          K2Node_DynamicCast_AsBuilding_Prop_1;              // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0861(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_862[0x2];                                      // 0x0862(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0864(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_8;                         // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingProp*                          K2Node_DynamicCast_AsBuilding_Prop_2;              // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0889(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x088A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88B[0x5];                                      // 0x088B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCalendarPropData                      CallFunc_Array_Get_Item_9;                         // 0x0890(0x00B0)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_10;                        // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_949[0x7];                                      // 0x0949(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingProp*                          K2Node_DynamicCast_AsBuilding_Prop_3;              // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2) == 0x000010, "Wrong alignment on BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2");
static_assert(sizeof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2) == 0x000960, "Wrong size on BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, EntryPoint) == 0x000000, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Array_Index_Variable_2) == 0x000014, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Length_ReturnValue_1) == 0x0000D0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Length_ReturnValue_2) == 0x0000D4, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Loop_Counter_Variable_1) == 0x0000D8, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Array_Index_Variable_3) == 0x0000E4, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Loop_Counter_Variable_2) == 0x0000E8, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000EC, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_class_Variable) == 0x0000F0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_ClassDynamicCast_AsActor) == 0x0000F8, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_ClassDynamicCast_bSuccess) == 0x000100, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_CustomEvent_Loaded) == 0x000108, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Add_ReturnValue) == 0x000110, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Loop_Counter_Variable_3) == 0x000114, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Add_IntInt_ReturnValue_3) == 0x000118, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Array_Index_Variable_4) == 0x00011C, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Array_Index_Variable_5) == 0x000120, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetTransform_ReturnValue) == 0x000130, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetTransform_ReturnValue_1) == 0x000190, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x0001F0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x0001F8, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000200, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000208, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_1) == 0x000210, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetArrayElementAttachedTo_AttachToSpawned) == 0x000218, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetArrayElementAttachedTo_AttachToSpawned' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetArrayElementAttachedTo_ElementToAttachTo) == 0x00021C, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetArrayElementAttachedTo_ElementToAttachTo' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetTransform_ReturnValue_2) == 0x000220, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetObjectClass_ReturnValue) == 0x000280, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_MakeRelativeTransform_ReturnValue) == 0x000290, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_MakeRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x0002F0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_AsFort_Athena_Low_Grav_Zone) == 0x000318, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_AsFort_Athena_Low_Grav_Zone' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_bSuccess) == 0x000320, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_AsFort_EQSPrevis_Actor) == 0x000328, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_AsFort_EQSPrevis_Actor' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_bSuccess_1) == 0x000330, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_AsBuilding_Static_Mesh) == 0x000338, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_AsBuilding_Static_Mesh' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_bSuccess_2) == 0x000340, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_IsValid_ReturnValue) == 0x000341, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_IsValid_ReturnValue_1) == 0x000342, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Length_ReturnValue_3) == 0x000344, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_2) == 0x000350, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Length_ReturnValue_4) == 0x000400, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_ComposeTransforms_ReturnValue) == 0x000410, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Less_IntInt_ReturnValue) == 0x000470, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000478, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_ClassDynamicCast_AsActor_1) == 0x000480, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_ClassDynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_ClassDynamicCast_bSuccess_1) == 0x000488, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000490, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Loop_Counter_Variable_4) == 0x000498, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_FinishSpawningActor_ReturnValue) == 0x0004A0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Add_ReturnValue_1) == 0x0004A8, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Add_ReturnValue_2) == 0x0004AC, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Less_IntInt_ReturnValue_1) == 0x0004B0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Add_IntInt_ReturnValue_4) == 0x0004B4, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_GetTransform_ReturnValue_3) == 0x0004C0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_GetTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_3) == 0x000520, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Length_ReturnValue_5) == 0x0005D0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Less_IntInt_ReturnValue_2) == 0x0005D4, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_ComposeTransforms_ReturnValue_1) == 0x0005E0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_ComposeTransforms_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_LoadClassAsset_Blocking_ReturnValue_1) == 0x000640, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_LoadClassAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_CustomEvent_EventName) == 0x000648, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_ClassDynamicCast_AsActor_2) == 0x000658, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_ClassDynamicCast_AsActor_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_ClassDynamicCast_bSuccess_2) == 0x000660, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_ClassDynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000668, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000670, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000678, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_AsBuilding_Actor) == 0x000680, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_bSuccess_3) == 0x000688, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Add_ReturnValue_3) == 0x00068C, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_4) == 0x000690, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_MakeStruct_CalendarPropData) == 0x0006A0, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_MakeStruct_CalendarPropData' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Add_ReturnValue_4) == 0x000750, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_MatchReadyAsync_ReturnValue) == 0x000758, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_IsValid_ReturnValue_2) == 0x000760, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Add_ReturnValue_5) == 0x000764, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, Temp_int_Loop_Counter_Variable_5) == 0x000768, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_5) == 0x000770, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_AsBuilding_Prop) == 0x000778, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_AsBuilding_Prop' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_bSuccess_4) == 0x000780, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Less_IntInt_ReturnValue_3) == 0x000781, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_IsValid_ReturnValue_3) == 0x000782, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Add_IntInt_ReturnValue_5) == 0x000784, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Length_ReturnValue_6) == 0x000788, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Less_IntInt_ReturnValue_4) == 0x00078C, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_6) == 0x000790, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_7) == 0x000840, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_CreateDelegate_OutputDelegate) == 0x000848, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_AsBuilding_Prop_1) == 0x000858, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_AsBuilding_Prop_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_bSuccess_5) == 0x000860, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Greater_IntInt_ReturnValue) == 0x000861, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000864, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_8) == 0x000870, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Length_ReturnValue_7) == 0x000878, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_AsBuilding_Prop_2) == 0x000880, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_AsBuilding_Prop_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_bSuccess_6) == 0x000888, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Less_IntInt_ReturnValue_5) == 0x000889, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_IsValid_ReturnValue_4) == 0x00088A, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_9) == 0x000890, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Array_Get_Item_10) == 0x000940, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Array_Get_Item_10' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000948, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_AsBuilding_Prop_3) == 0x000950, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_AsBuilding_Prop_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2, K2Node_DynamicCast_bSuccess_7) == 0x000958, "Member 'BP_CalendarProps_V2_C_ExecuteUbergraph_BP_CalendarProps_V2::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");

// Function BP_CalendarProps_V2.BP_CalendarProps_V2_C.GetArrayElementAttachedTo
// 0x0080 (0x0080 - 0x0000)
struct BP_CalendarProps_V2_C_GetArrayElementAttachedTo final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AttachToSpawned;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ElementToAttachTo;                                 // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_Static_Mesh;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarProps_V2_C_GetArrayElementAttachedTo) == 0x000008, "Wrong alignment on BP_CalendarProps_V2_C_GetArrayElementAttachedTo");
static_assert(sizeof(BP_CalendarProps_V2_C_GetArrayElementAttachedTo) == 0x000080, "Wrong size on BP_CalendarProps_V2_C_GetArrayElementAttachedTo");
static_assert(offsetof(BP_CalendarProps_V2_C_GetArrayElementAttachedTo, SpawnedActor) == 0x000000, "Member 'BP_CalendarProps_V2_C_GetArrayElementAttachedTo::SpawnedActor' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_GetArrayElementAttachedTo, AttachToSpawned) == 0x000008, "Member 'BP_CalendarProps_V2_C_GetArrayElementAttachedTo::AttachToSpawned' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_GetArrayElementAttachedTo, ElementToAttachTo) == 0x00000C, "Member 'BP_CalendarProps_V2_C_GetArrayElementAttachedTo::ElementToAttachTo' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_GetArrayElementAttachedTo, K2Node_DynamicCast_AsBuilding_Static_Mesh) == 0x000010, "Member 'BP_CalendarProps_V2_C_GetArrayElementAttachedTo::K2Node_DynamicCast_AsBuilding_Static_Mesh' has a wrong offset!");
static_assert(offsetof(BP_CalendarProps_V2_C_GetArrayElementAttachedTo, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CalendarProps_V2_C_GetArrayElementAttachedTo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
