#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decal_HollowBase_Graffiti

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Decal_Blast_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Decal_HollowBase_Graffiti.BP_Decal_HollowBase_Graffiti_C
// 0x0038 (0x02B8 - 0x0280)
class ABP_Decal_HollowBase_Graffiti_C final : public ABP_Decal_Blast_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Decal_HollowBase_Graffiti_C;     // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TextureStreamingRef;                               // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AParent_BuildingWall_C*>         ParentBuildingWalls;                               // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ABuildingActor*>                 ParentBuildingProps;                               // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Override_Per_Quality_Level_;                       // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Override___Fade_Screen_Size_Below_Epic;            // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Decal_HollowBase_Graffiti(int32 EntryPoint);
	void Override_Fade_Screen_Size_Per_Quality(bool OverridePerQualityLevel_, float Low, float Medium, float High, float Epic, bool* FadeScreenSizeUpdated);
	void ParentPropDestroyed(class AActor* DestroyedActor);
	void ParentWallDestroyed_(class AActor* DestroyedActor);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Decal_HollowBase_Graffiti_C">();
	}
	static class ABP_Decal_HollowBase_Graffiti_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Decal_HollowBase_Graffiti_C>();
	}
};
static_assert(alignof(ABP_Decal_HollowBase_Graffiti_C) == 0x000008, "Wrong alignment on ABP_Decal_HollowBase_Graffiti_C");
static_assert(sizeof(ABP_Decal_HollowBase_Graffiti_C) == 0x0002B8, "Wrong size on ABP_Decal_HollowBase_Graffiti_C");
static_assert(offsetof(ABP_Decal_HollowBase_Graffiti_C, UberGraphFrame_BP_Decal_HollowBase_Graffiti_C) == 0x000280, "Member 'ABP_Decal_HollowBase_Graffiti_C::UberGraphFrame_BP_Decal_HollowBase_Graffiti_C' has a wrong offset!");
static_assert(offsetof(ABP_Decal_HollowBase_Graffiti_C, TextureStreamingRef) == 0x000288, "Member 'ABP_Decal_HollowBase_Graffiti_C::TextureStreamingRef' has a wrong offset!");
static_assert(offsetof(ABP_Decal_HollowBase_Graffiti_C, ParentBuildingWalls) == 0x000290, "Member 'ABP_Decal_HollowBase_Graffiti_C::ParentBuildingWalls' has a wrong offset!");
static_assert(offsetof(ABP_Decal_HollowBase_Graffiti_C, ParentBuildingProps) == 0x0002A0, "Member 'ABP_Decal_HollowBase_Graffiti_C::ParentBuildingProps' has a wrong offset!");
static_assert(offsetof(ABP_Decal_HollowBase_Graffiti_C, Override_Per_Quality_Level_) == 0x0002B0, "Member 'ABP_Decal_HollowBase_Graffiti_C::Override_Per_Quality_Level_' has a wrong offset!");
static_assert(offsetof(ABP_Decal_HollowBase_Graffiti_C, Override___Fade_Screen_Size_Below_Epic) == 0x0002B4, "Member 'ABP_Decal_HollowBase_Graffiti_C::Override___Fade_Screen_Size_Below_Epic' has a wrong offset!");

}

