#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decal_HollowBase_Graffiti

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Decal_HollowBase_Graffiti.BP_Decal_HollowBase_Graffiti_C.ExecuteUbergraph_BP_Decal_HollowBase_Graffiti
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor_1;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AParent_BuildingWall_C*                 K2Node_DynamicCast_AsParent_Building_Wall;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AParent_BuildingWall_C*                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_2;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_3;           // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Override_Fade_Screen_Size_Per_Quality_FadeScreenSizeUpdated; // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti) == 0x000008, "Wrong alignment on BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti");
static_assert(sizeof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti) == 0x0000B0, "Wrong size on BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, EntryPoint) == 0x000000, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, K2Node_CustomEvent_DestroyedActor_1) == 0x000018, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::K2Node_CustomEvent_DestroyedActor_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, K2Node_DynamicCast_AsParent_Building_Wall) == 0x000020, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::K2Node_DynamicCast_AsParent_Building_Wall' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Max_ReturnValue) == 0x000044, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_RemoveItem_ReturnValue) == 0x000054, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_IsEmpty_ReturnValue) == 0x000055, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x000056, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_IsValid_ReturnValue_1) == 0x00006C, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000074, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_RemoveItem_ReturnValue_2) == 0x000078, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_RemoveItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Max_ReturnValue_1) == 0x00007C, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, K2Node_CustomEvent_DestroyedActor) == 0x000080, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, K2Node_DynamicCast_AsBuilding_Actor) == 0x000088, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x000091, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Array_RemoveItem_ReturnValue_3) == 0x000092, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Array_RemoveItem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, Temp_int_Loop_Counter_Variable_1) == 0x000094, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000098, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_GetDecalMaterial_ReturnValue) == 0x0000A0, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_GetDecalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti, CallFunc_Override_Fade_Screen_Size_Per_Quality_FadeScreenSizeUpdated) == 0x0000A9, "Member 'BP_Decal_HollowBase_Graffiti_C_ExecuteUbergraph_BP_Decal_HollowBase_Graffiti::CallFunc_Override_Fade_Screen_Size_Per_Quality_FadeScreenSizeUpdated' has a wrong offset!");

// Function BP_Decal_HollowBase_Graffiti.BP_Decal_HollowBase_Graffiti_C.Override Fade Screen Size Per Quality
// 0x0020 (0x0020 - 0x0000)
struct BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality final
{
public:
	bool                                          OverridePerQualityLevel_;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Low;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Medium;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         High;                                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Epic;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FadeScreenSizeUpdated;                             // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality) == 0x000004, "Wrong alignment on BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality");
static_assert(sizeof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality) == 0x000020, "Wrong size on BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality, OverridePerQualityLevel_) == 0x000000, "Member 'BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality::OverridePerQualityLevel_' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality, Low) == 0x000004, "Member 'BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality::Low' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality, Medium) == 0x000008, "Member 'BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality::Medium' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality, High) == 0x00000C, "Member 'BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality::High' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality, Epic) == 0x000010, "Member 'BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality::Epic' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality, FadeScreenSizeUpdated) == 0x000014, "Member 'BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality::FadeScreenSizeUpdated' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000018, "Member 'BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'BP_Decal_HollowBase_Graffiti_C_Override_Fade_Screen_Size_Per_Quality::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_Decal_HollowBase_Graffiti.BP_Decal_HollowBase_Graffiti_C.ParentPropDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_Decal_HollowBase_Graffiti_C_ParentPropDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_HollowBase_Graffiti_C_ParentPropDestroyed) == 0x000008, "Wrong alignment on BP_Decal_HollowBase_Graffiti_C_ParentPropDestroyed");
static_assert(sizeof(BP_Decal_HollowBase_Graffiti_C_ParentPropDestroyed) == 0x000008, "Wrong size on BP_Decal_HollowBase_Graffiti_C_ParentPropDestroyed");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ParentPropDestroyed, DestroyedActor) == 0x000000, "Member 'BP_Decal_HollowBase_Graffiti_C_ParentPropDestroyed::DestroyedActor' has a wrong offset!");

// Function BP_Decal_HollowBase_Graffiti.BP_Decal_HollowBase_Graffiti_C.ParentWallDestroyed 
// 0x0008 (0x0008 - 0x0000)
struct BP_Decal_HollowBase_Graffiti_C_ParentWallDestroyed_ final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_HollowBase_Graffiti_C_ParentWallDestroyed_) == 0x000008, "Wrong alignment on BP_Decal_HollowBase_Graffiti_C_ParentWallDestroyed_");
static_assert(sizeof(BP_Decal_HollowBase_Graffiti_C_ParentWallDestroyed_) == 0x000008, "Wrong size on BP_Decal_HollowBase_Graffiti_C_ParentWallDestroyed_");
static_assert(offsetof(BP_Decal_HollowBase_Graffiti_C_ParentWallDestroyed_, DestroyedActor) == 0x000000, "Member 'BP_Decal_HollowBase_Graffiti_C_ParentWallDestroyed_::DestroyedActor' has a wrong offset!");

}

