#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Default_Ambient

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_Default_Ambient.BP_Default_Ambient_C.WeatherComponentReady
// 0x0008 (0x0008 - 0x0000)
struct BP_Default_Ambient_C_WeatherComponentReady final
{
public:
	class UFortTimeOfDayWeatherComponent*         WeatherComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Default_Ambient_C_WeatherComponentReady) == 0x000008, "Wrong alignment on BP_Default_Ambient_C_WeatherComponentReady");
static_assert(sizeof(BP_Default_Ambient_C_WeatherComponentReady) == 0x000008, "Wrong size on BP_Default_Ambient_C_WeatherComponentReady");
static_assert(offsetof(BP_Default_Ambient_C_WeatherComponentReady, WeatherComponent) == 0x000000, "Member 'BP_Default_Ambient_C_WeatherComponentReady::WeatherComponent' has a wrong offset!");

// Function BP_Default_Ambient.BP_Default_Ambient_C.WeatherChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_Default_Ambient_C_WeatherChanged final
{
public:
	EGlobalWeatherState                           WeatherState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortReplicatedWeatherEventData        WeatherData;                                       // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_Default_Ambient_C_WeatherChanged) == 0x000004, "Wrong alignment on BP_Default_Ambient_C_WeatherChanged");
static_assert(sizeof(BP_Default_Ambient_C_WeatherChanged) == 0x000018, "Wrong size on BP_Default_Ambient_C_WeatherChanged");
static_assert(offsetof(BP_Default_Ambient_C_WeatherChanged, WeatherState) == 0x000000, "Member 'BP_Default_Ambient_C_WeatherChanged::WeatherState' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_WeatherChanged, WeatherData) == 0x000004, "Member 'BP_Default_Ambient_C_WeatherChanged::WeatherData' has a wrong offset!");

// Function BP_Default_Ambient.BP_Default_Ambient_C.SetWeatherTags
// 0x0010 (0x0010 - 0x0000)
struct BP_Default_Ambient_C_SetWeatherTags final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Default_Ambient_C_SetWeatherTags) == 0x000008, "Wrong alignment on BP_Default_Ambient_C_SetWeatherTags");
static_assert(sizeof(BP_Default_Ambient_C_SetWeatherTags) == 0x000010, "Wrong size on BP_Default_Ambient_C_SetWeatherTags");
static_assert(offsetof(BP_Default_Ambient_C_SetWeatherTags, Selection) == 0x000000, "Member 'BP_Default_Ambient_C_SetWeatherTags::Selection' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_SetWeatherTags, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'BP_Default_Ambient_C_SetWeatherTags::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_SetWeatherTags, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_Default_Ambient_C_SetWeatherTags::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");

// Function BP_Default_Ambient.BP_Default_Ambient_C.OnReady_C65C4919436D0ED92141E6913B3C3C6D
// 0x0008 (0x0008 - 0x0000)
struct BP_Default_Ambient_C_OnReady_C65C4919436D0ED92141E6913B3C3C6D final
{
public:
	class AFortTimeOfDayManager*                  TimeOfDayManager;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Default_Ambient_C_OnReady_C65C4919436D0ED92141E6913B3C3C6D) == 0x000008, "Wrong alignment on BP_Default_Ambient_C_OnReady_C65C4919436D0ED92141E6913B3C3C6D");
static_assert(sizeof(BP_Default_Ambient_C_OnReady_C65C4919436D0ED92141E6913B3C3C6D) == 0x000008, "Wrong size on BP_Default_Ambient_C_OnReady_C65C4919436D0ED92141E6913B3C3C6D");
static_assert(offsetof(BP_Default_Ambient_C_OnReady_C65C4919436D0ED92141E6913B3C3C6D, TimeOfDayManager) == 0x000000, "Member 'BP_Default_Ambient_C_OnReady_C65C4919436D0ED92141E6913B3C3C6D::TimeOfDayManager' has a wrong offset!");

// Function BP_Default_Ambient.BP_Default_Ambient_C.ExecuteUbergraph_BP_Default_Ambient
// 0x0090 (0x0090 - 0x0000)
struct BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_TimeOfDayManagerReady* CallFunc_GetTimeOfDayManagerReady_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortTimeOfDayWeatherComponent* WeatherComponent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNullItem_Is_Null_Item;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTimeOfDayWeatherComponent*         K2Node_CustomEvent_WeatherComponent;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGlobalWeatherState WeatherState, const struct FFortReplicatedWeatherEventData& WeatherData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGlobalWeatherState                           K2Node_CustomEvent_WeatherState;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortReplicatedWeatherEventData        K2Node_CustomEvent_WeatherData;                    // 0x0050(0x0014)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EGlobalWeatherState WeatherState, const struct FFortReplicatedWeatherEventData& WeatherData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  K2Node_CustomEvent_TimeOfDayManager;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortTimeOfDayManager* TimeOfDayManager)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient) == 0x000008, "Wrong alignment on BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient");
static_assert(sizeof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient) == 0x000090, "Wrong size on BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, EntryPoint) == 0x000000, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, CallFunc_GetTimeOfDayManagerReady_ReturnValue) == 0x000010, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::CallFunc_GetTimeOfDayManagerReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, Temp_object_Variable) == 0x000020, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, CallFunc_IsNullItem_Is_Null_Item) == 0x000034, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::CallFunc_IsNullItem_Is_Null_Item' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, K2Node_CustomEvent_WeatherComponent) == 0x000038, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::K2Node_CustomEvent_WeatherComponent' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, K2Node_CustomEvent_WeatherState) == 0x00004C, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::K2Node_CustomEvent_WeatherState' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, K2Node_CustomEvent_WeatherData) == 0x000050, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::K2Node_CustomEvent_WeatherData' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, K2Node_SwitchEnum_CmpSuccess) == 0x000064, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, CallFunc_HasAuthority_ReturnValue) == 0x000074, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, K2Node_CustomEvent_TimeOfDayManager) == 0x000078, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::K2Node_CustomEvent_TimeOfDayManager' has a wrong offset!");
static_assert(offsetof(BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'BP_Default_Ambient_C_ExecuteUbergraph_BP_Default_Ambient::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function BP_Default_Ambient.BP_Default_Ambient_C.ClearFogTags
// 0x0008 (0x0008 - 0x0000)
struct BP_Default_Ambient_C_ClearFogTags final
{
public:
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Default_Ambient_C_ClearFogTags) == 0x000008, "Wrong alignment on BP_Default_Ambient_C_ClearFogTags");
static_assert(sizeof(BP_Default_Ambient_C_ClearFogTags) == 0x000008, "Wrong size on BP_Default_Ambient_C_ClearFogTags");
static_assert(offsetof(BP_Default_Ambient_C_ClearFogTags, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BP_Default_Ambient_C_ClearFogTags::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");

}

