#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Demeter_Lighthouse_Prototype_Spinny_Light

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Demeter_Lighthouse_Prototype_Spinny_Light.BP_Demeter_Lighthouse_Prototype_Spinny_Light_C
// 0x0028 (0x0E98 - 0x0E70)
class ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpinningLightAudio;                                // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FresnelLens;                                       // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Is_Died;                                           // 0x0E90(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_Light(int32 EntryPoint);
	void killLighthouse();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnReady_00BF6F404FBB9F2A492A49BAB520D79A();
	void OnRep_Is_Died();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Demeter_Lighthouse_Prototype_Spinny_Light_C">();
	}
	static class ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C>();
	}
};
static_assert(alignof(ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C) == 0x000008, "Wrong alignment on ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C");
static_assert(sizeof(ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C) == 0x000E98, "Wrong size on ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C, UberGraphFrame) == 0x000E70, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C, PointLight) == 0x000E78, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C, SpinningLightAudio) == 0x000E80, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C::SpinningLightAudio' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C, FresnelLens) == 0x000E88, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C::FresnelLens' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C, Is_Died) == 0x000E90, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_Light_C::Is_Died' has a wrong offset!");

}

