#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decal_Reality_Glitch

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Decal_Reality_Glitch.BP_Decal_Reality_Glitch_C.ExecuteUbergraph_BP_Decal_Reality_Glitch
// 0x0008 (0x0008 - 0x0000)
struct BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch) == 0x000004, "Wrong alignment on BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch");
static_assert(sizeof(BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch) == 0x000008, "Wrong size on BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch");
static_assert(offsetof(BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch, EntryPoint) == 0x000000, "Member 'BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_Decal_Reality_Glitch_C_ExecuteUbergraph_BP_Decal_Reality_Glitch::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Decal_Reality_Glitch.BP_Decal_Reality_Glitch_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Decal_Reality_Glitch_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_Reality_Glitch_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Decal_Reality_Glitch_C_ReceiveEndPlay");
static_assert(sizeof(BP_Decal_Reality_Glitch_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Decal_Reality_Glitch_C_ReceiveEndPlay");
static_assert(offsetof(BP_Decal_Reality_Glitch_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Decal_Reality_Glitch_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

