#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Daisy_Launcher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Daisy_Launcher.BP_Daisy_Launcher_C.BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Daisy_Launcher.BP_Daisy_Launcher_C.BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Daisy_Launcher_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Daisy_Launcher.BP_Daisy_Launcher_C.DestroyBuildingProps
// 0x02A8 (0x02A8 - 0x0000)
struct BP_Daisy_Launcher_C_DestroyBuildingProps final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComp;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchVelocity;                                    // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0068(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_CapsuleTraceMultiForObjects_OutHits;      // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceMultiForObjects_ReturnValue;  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x00D0(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x1];                                      // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags; // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x02A0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Daisy_Launcher_C_DestroyBuildingProps) == 0x000008, "Wrong alignment on BP_Daisy_Launcher_C_DestroyBuildingProps");
static_assert(sizeof(BP_Daisy_Launcher_C_DestroyBuildingProps) == 0x0002A8, "Wrong size on BP_Daisy_Launcher_C_DestroyBuildingProps");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, Actor) == 0x000000, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::Actor' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, AbilitySystemComp) == 0x000008, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::AbilitySystemComp' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, LaunchVelocity) == 0x000010, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::LaunchVelocity' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_Normal_ReturnValue) == 0x000028, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, Temp_object_Variable) == 0x000068, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_GetValueAtLevel_ReturnValue) == 0x000078, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000080, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000088, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_CapsuleTraceMultiForObjects_OutHits) == 0x0000B8, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_CapsuleTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_CapsuleTraceMultiForObjects_ReturnValue) == 0x0000C8, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_CapsuleTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_Less_IntInt_ReturnValue) == 0x0001B0, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B1, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001B2, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_Time) == 0x0001B4, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_Distance) == 0x0001B8, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_Location) == 0x0001C0, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D8, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_Normal) == 0x0001F0, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_ImpactNormal) == 0x000208, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_PhysMat) == 0x000220, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_HitActor) == 0x000228, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_HitComponent) == 0x000230, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_HitBoneName) == 0x000238, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_BoneName) == 0x00023C, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_ElementIndex) == 0x000244, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_FaceIndex) == 0x000248, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_TraceStart) == 0x000250, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BreakHitResult_TraceEnd) == 0x000268, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags) == 0x000280, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, K2Node_DynamicCast_AsBuilding_Trap) == 0x000288, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, K2Node_DynamicCast_bSuccess) == 0x000290, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000298, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_DestroyBuildingProps, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0002A0, "Member 'BP_Daisy_Launcher_C_DestroyBuildingProps::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function BP_Daisy_Launcher.BP_Daisy_Launcher_C.ExecuteUbergraph_BP_Daisy_Launcher
// 0x06C0 (0x06C0 - 0x0000)
struct BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0008(0x00D0)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0140(0x00B0)()
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0210(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPhysicsObjectComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APhysicsBall_Master_C*                  K2Node_DynamicCast_AsPhysics_Ball_Master;          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_C4_C*                     K2Node_DynamicCast_AsB_BGA_Athena_C4;              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_DynamicCast_AsFort_Projectile_Base;         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtrConst_ReturnValue;      // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPhysicsObjectComponent*            CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APhysicsBall_Master_C*                  K2Node_DynamicCast_AsPhysics_Ball_Master_1;        // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_C4_C*                     K2Node_DynamicCast_AsB_BGA_Athena_C4_1;            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_DynamicCast_AsFort_Projectile_Base_1;       // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtrConst_ReturnValue_1;    // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMovementBaseActor_ReturnValue;         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPhysicsObjectComponent*            CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0480(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_2;           // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x0548(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x057C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0588(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x05A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x05C0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x05D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x05F0(0x00D0)(ContainsInstancedReference)
};
static_assert(alignof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher) == 0x000008, "Wrong alignment on BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher");
static_assert(sizeof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher) == 0x0006C0, "Wrong size on BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, EntryPoint) == 0x000000, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000008, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000E4, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000E8, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0000EC, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0000F0, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0000F4, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_GetActorUpVector_ReturnValue) == 0x0000F8, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_Add_VectorVector_ReturnValue) == 0x000110, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_GetActorUpVector_ReturnValue_1) == 0x000128, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_MakeStruct_GameplayEventData) == 0x000140, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001F0, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_OtherActor) == 0x0001F8, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_OtherComp) == 0x000200, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000208, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_bFromSweep) == 0x00020C, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_SweepResult) == 0x000210, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0002F0, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0002F8, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000300, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000308, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_GetComponentByClass_ReturnValue) == 0x000310, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_AsPhysics_Ball_Master) == 0x000318, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_AsPhysics_Ball_Master' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_bSuccess) == 0x000320, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_IsValid_ReturnValue) == 0x000321, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_AsB_BGA_Athena_C4) == 0x000328, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_AsB_BGA_Athena_C4' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_bSuccess_1) == 0x000330, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_AsFort_Projectile_Base) == 0x000338, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_AsFort_Projectile_Base' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_bSuccess_2) == 0x000340, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000344, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000348, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_bSuccess_3) == 0x000358, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_GetVehicleActorPtrConst_ReturnValue) == 0x000360, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_GetVehicleActorPtrConst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_AsFort_Pawn) == 0x000368, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, K2Node_DynamicCast_bSuccess_4) == 0x000370, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000378, "Member 'BP_Daisy_Launcher_C_ExecuteUbergraph_BP_Daisy_Launcher::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
