#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DisplayShadowProxy_01

#include "Basic.hpp"

#include "FakeShadowData_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DisplayShadowProxy_01.BP_DisplayShadowProxy_01_C
// 0x0020 (0x02B0 - 0x0290)
class ABP_DisplayShadowProxy_01_C final : public AFortSkydivingShadowProxy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FFakeShadowData                        InstanceData;                                      // 0x02A0(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UpdateInstances();
	void ShowShadowProxy();
	void HideShadowProxy();
	void ExecuteUbergraph_BP_DisplayShadowProxy_01(int32 EntryPoint);
	void enablefakeshadows();
	void disablefakeshadows();
	void Clear_();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DisplayShadowProxy_01_C">();
	}
	static class ABP_DisplayShadowProxy_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DisplayShadowProxy_01_C>();
	}
};
static_assert(alignof(ABP_DisplayShadowProxy_01_C) == 0x000008, "Wrong alignment on ABP_DisplayShadowProxy_01_C");
static_assert(sizeof(ABP_DisplayShadowProxy_01_C) == 0x0002B0, "Wrong size on ABP_DisplayShadowProxy_01_C");
static_assert(offsetof(ABP_DisplayShadowProxy_01_C, UberGraphFrame) == 0x000290, "Member 'ABP_DisplayShadowProxy_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DisplayShadowProxy_01_C, InstancedStaticMesh) == 0x000298, "Member 'ABP_DisplayShadowProxy_01_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_DisplayShadowProxy_01_C, InstanceData) == 0x0002A0, "Member 'ABP_DisplayShadowProxy_01_C::InstanceData' has a wrong offset!");

}

