#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams.BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C
// 0x0038 (0x0EA8 - 0x0E70)
class ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FresnelBeam_A2;                                    // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FresnelBeam_A1;                                    // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Cone_Length;                                       // 0x0E88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Start_Radius;                                      // 0x0E8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cone_Angle;                                        // 0x0E90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Light_Color_rgb__and_Brightness_a_;                // 0x0E94(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_Shift;                                       // 0x0EA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void initializeMaterialParams();
	void initBeam();
	void getValidatedConeLength(float* Cone_Length_0);
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C">();
	}
	static class ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C>();
	}
};
static_assert(alignof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C) == 0x000008, "Wrong alignment on ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C");
static_assert(sizeof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C) == 0x000EA8, "Wrong size on ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, UberGraphFrame) == 0x000E70, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, FresnelBeam_A2) == 0x000E78, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::FresnelBeam_A2' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, FresnelBeam_A1) == 0x000E80, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::FresnelBeam_A1' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Cone_Length) == 0x000E88, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Cone_Length' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Start_Radius) == 0x000E8C, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Start_Radius' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Cone_Angle) == 0x000E90, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Cone_Angle' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Light_Color_rgb__and_Brightness_a_) == 0x000E94, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Light_Color_rgb__and_Brightness_a_' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Light_Shift) == 0x000EA4, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Light_Shift' has a wrong offset!");

}

