#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluidSim_FN

#include "Basic.hpp"

#include "FluidForceDynamicPerInstanceData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FluidForceDynamic_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_FluidSim_FN.BP_FluidSim_FN_C.GetFortnitePawnForces
// 0x06B8 (0x06B8 - 0x0000)
struct BP_FluidSim_FN_C_GetFortnitePawnForces final
{
public:
	TMap<class UActorComponent*, struct FFluidForceDynamicPerInstanceData> PreviousDynamicForces;                             // 0x0000(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class AFortPawn*>                      RelevantPawns;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         LastCheckedIndex;                                  // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPawn*>                      NearbyPawns;                                       // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetShallowWaterMaxDynamicForces_ReturnValue; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x00A4(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FFluidForceDynamic                     CallFunc_Map_Find_Value;                           // 0x00A8(0x0070)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_Array_Get_Item_1;                         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetVehicleTags_ReturnValue;               // 0x0168(0x0020)(ConstParm)
	bool                                          CallFunc_IsInWater_ReturnValue;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B[0x5];                                      // 0x018B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFluidForceDynamicPerInstanceData      CallFunc_Map_Find_Value_1;                         // 0x0198(0x0148)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFluidForceDynamicPerInstanceData      CallFunc_Map_Find_Value_2;                         // 0x02E8(0x0148)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortCharacterVehicle*                  K2Node_DynamicCast_AsFort_Character_Vehicle;       // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    CallFunc_GetCurrentWaterBody_ReturnValue;          // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWaterSurfaceInfo                      CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo; // 0x0480(0x0068)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFluidForceDynamicPerInstanceData      K2Node_SetFieldsInStruct_StructOut;                // 0x04F8(0x0148)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_Array_Get_Item_2;                         // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_2;           // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_662[0x2];                                      // 0x0662(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDrivingVehicle_ReturnValue;             // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPawnLOD_ReturnValue;                   // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetLocalPawn_Pawn;                        // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x067A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B[0x5];                                      // 0x067B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_3;           // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x3];                                      // 0x0689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x069C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69D[0x3];                                      // 0x069D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPawn*>                      CallFunc_GetFortPawnsInRange_OutFortPawns;         // 0x06A8(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_FluidSim_FN_C_GetFortnitePawnForces) == 0x000008, "Wrong alignment on BP_FluidSim_FN_C_GetFortnitePawnForces");
static_assert(sizeof(BP_FluidSim_FN_C_GetFortnitePawnForces) == 0x0006B8, "Wrong size on BP_FluidSim_FN_C_GetFortnitePawnForces");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, PreviousDynamicForces) == 0x000000, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::PreviousDynamicForces' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, RelevantPawns) == 0x000050, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::RelevantPawns' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, LastCheckedIndex) == 0x000060, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::LastCheckedIndex' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, NearbyPawns) == 0x000068, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::NearbyPawns' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, Temp_bool_True_if_break_was_hit_Variable) == 0x000078, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Map_Keys_Keys) == 0x000080, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Not_PreBool_ReturnValue) == 0x000094, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_GetShallowWaterMaxDynamicForces_ReturnValue) == 0x000098, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_GetShallowWaterMaxDynamicForces_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, Temp_int_Array_Index_Variable) == 0x00009C, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, Temp_int_Array_Index_Variable_1) == 0x0000A0, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Array_Get_Item) == 0x0000A4, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Map_Find_Value) == 0x0000A8, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Map_Find_ReturnValue) == 0x000118, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, Temp_int_Loop_Counter_Variable) == 0x00011C, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, Temp_int_Array_Index_Variable_2) == 0x000120, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Less_IntInt_ReturnValue) == 0x000124, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Add_IntInt_ReturnValue) == 0x000128, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_BooleanAND_ReturnValue) == 0x00012C, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, Temp_int_Loop_Counter_Variable_1) == 0x000130, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Array_Get_Item_1) == 0x000138, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Array_Length_ReturnValue_1) == 0x000140, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000148, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Less_IntInt_ReturnValue_1) == 0x000151, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_GetVehicleUInterface_ReturnValue) == 0x000158, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_GetVehicleTags_ReturnValue) == 0x000168, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_GetVehicleTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_IsInWater_ReturnValue) == 0x000188, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_IsInWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_HasTag_ReturnValue) == 0x000189, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_BooleanAND_ReturnValue_1) == 0x00018A, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x000190, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Map_Find_Value_1) == 0x000198, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Map_Find_ReturnValue_1) == 0x0002E0, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_IsInVehicle_ReturnValue) == 0x0002E1, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_IsValid_ReturnValue) == 0x0002E2, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Map_Find_Value_2) == 0x0002E8, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Map_Find_ReturnValue_2) == 0x000430, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000438, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_bSuccess_1) == 0x000440, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_IsValid_ReturnValue_1) == 0x000441, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_AsFort_Character_Vehicle) == 0x000448, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_AsFort_Character_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_bSuccess_2) == 0x000450, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_GetCurrentWaterBody_ReturnValue) == 0x000458, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_GetCurrentWaterBody_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000460, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_IsValid_ReturnValue_2) == 0x000478, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo) == 0x000480, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004E8, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_BreakVector_X) == 0x0004EC, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_BreakVector_Y) == 0x0004F0, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_BreakVector_Z) == 0x0004F4, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_SetFieldsInStruct_StructOut) == 0x0004F8, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, Temp_int_Loop_Counter_Variable_2) == 0x000640, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Add_IntInt_ReturnValue_2) == 0x000644, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Array_Get_Item_2) == 0x000648, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Array_Length_ReturnValue_2) == 0x000650, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_AsFort_Player_Pawn_2) == 0x000658, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_AsFort_Player_Pawn_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_bSuccess_3) == 0x000660, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Less_IntInt_ReturnValue_2) == 0x000661, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Array_Add_ReturnValue) == 0x000664, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_IsDrivingVehicle_ReturnValue) == 0x000668, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_IsDrivingVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_GetPawnLOD_ReturnValue) == 0x00066C, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_GetPawnLOD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_GetLocalPawn_Pawn) == 0x000670, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_GetLocalPawn_Pawn' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000678, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_IsValid_ReturnValue_3) == 0x000679, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_BooleanOR_ReturnValue) == 0x00067A, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_AsFort_Player_Pawn_3) == 0x000680, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_AsFort_Player_Pawn_3' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, K2Node_DynamicCast_bSuccess_4) == 0x000688, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Array_AddUnique_ReturnValue) == 0x00068C, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Array_Length_ReturnValue_3) == 0x000690, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Less_IntInt_ReturnValue_3) == 0x000694, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Percent_IntInt_ReturnValue) == 0x000698, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00069C, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0006A0, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetFortnitePawnForces, CallFunc_GetFortPawnsInRange_OutFortPawns) == 0x0006A8, "Member 'BP_FluidSim_FN_C_GetFortnitePawnForces::CallFunc_GetFortPawnsInRange_OutFortPawns' has a wrong offset!");

// Function BP_FluidSim_FN.BP_FluidSim_FN_C.ExecuteUbergraph_BP_FluidSim_FN
// 0x0004 (0x0004 - 0x0000)
struct BP_FluidSim_FN_C_ExecuteUbergraph_BP_FluidSim_FN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluidSim_FN_C_ExecuteUbergraph_BP_FluidSim_FN) == 0x000004, "Wrong alignment on BP_FluidSim_FN_C_ExecuteUbergraph_BP_FluidSim_FN");
static_assert(sizeof(BP_FluidSim_FN_C_ExecuteUbergraph_BP_FluidSim_FN) == 0x000004, "Wrong size on BP_FluidSim_FN_C_ExecuteUbergraph_BP_FluidSim_FN");
static_assert(offsetof(BP_FluidSim_FN_C_ExecuteUbergraph_BP_FluidSim_FN, EntryPoint) == 0x000000, "Member 'BP_FluidSim_FN_C_ExecuteUbergraph_BP_FluidSim_FN::EntryPoint' has a wrong offset!");

// Function BP_FluidSim_FN.BP_FluidSim_FN_C.GetLocalPawn
// 0x0020 (0x0020 - 0x0000)
struct BP_FluidSim_FN_C_GetLocalPawn final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluidSim_FN_C_GetLocalPawn) == 0x000008, "Wrong alignment on BP_FluidSim_FN_C_GetLocalPawn");
static_assert(sizeof(BP_FluidSim_FN_C_GetLocalPawn) == 0x000020, "Wrong size on BP_FluidSim_FN_C_GetLocalPawn");
static_assert(offsetof(BP_FluidSim_FN_C_GetLocalPawn, Pawn) == 0x000000, "Member 'BP_FluidSim_FN_C_GetLocalPawn::Pawn' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetLocalPawn, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000008, "Member 'BP_FluidSim_FN_C_GetLocalPawn::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluidSim_FN_C_GetLocalPawn, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_FluidSim_FN_C_GetLocalPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
