#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluidSim_FN

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FluidForceDynamic_structs.hpp"
#include "BP_FluidSim_01_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FluidSim_FN.BP_FluidSim_FN_C
// 0x01C0 (0x06F0 - 0x0530)
class ABP_FluidSim_FN_C final : public ABP_FluidSim_01_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FluidSim_FN_C;                   // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFluidForceDynamic                     BoatForceSettings;                                 // 0x0538(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFluidForceDynamic                     PlayerForceSettings;                               // 0x05A8(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFluidForceDynamic                     MechForceSettings;                                 // 0x0618(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class AFortPawn*>                      RelevantFortPawns;                                 // 0x0688(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Use_FN_Pawn_Forces;                                // 0x0698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FFluidForceDynamic> VehicleTypeMap;                                    // 0x06A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void GetPlayerPawnForces();
	void GetFortnitePawnForces();
	void ExecuteUbergraph_BP_FluidSim_FN(int32 EntryPoint);
	void GetLocalPawn(class APawn** Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FluidSim_FN_C">();
	}
	static class ABP_FluidSim_FN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FluidSim_FN_C>();
	}
};
static_assert(alignof(ABP_FluidSim_FN_C) == 0x000008, "Wrong alignment on ABP_FluidSim_FN_C");
static_assert(sizeof(ABP_FluidSim_FN_C) == 0x0006F0, "Wrong size on ABP_FluidSim_FN_C");
static_assert(offsetof(ABP_FluidSim_FN_C, UberGraphFrame_BP_FluidSim_FN_C) == 0x000530, "Member 'ABP_FluidSim_FN_C::UberGraphFrame_BP_FluidSim_FN_C' has a wrong offset!");
static_assert(offsetof(ABP_FluidSim_FN_C, BoatForceSettings) == 0x000538, "Member 'ABP_FluidSim_FN_C::BoatForceSettings' has a wrong offset!");
static_assert(offsetof(ABP_FluidSim_FN_C, PlayerForceSettings) == 0x0005A8, "Member 'ABP_FluidSim_FN_C::PlayerForceSettings' has a wrong offset!");
static_assert(offsetof(ABP_FluidSim_FN_C, MechForceSettings) == 0x000618, "Member 'ABP_FluidSim_FN_C::MechForceSettings' has a wrong offset!");
static_assert(offsetof(ABP_FluidSim_FN_C, RelevantFortPawns) == 0x000688, "Member 'ABP_FluidSim_FN_C::RelevantFortPawns' has a wrong offset!");
static_assert(offsetof(ABP_FluidSim_FN_C, Use_FN_Pawn_Forces) == 0x000698, "Member 'ABP_FluidSim_FN_C::Use_FN_Pawn_Forces' has a wrong offset!");
static_assert(offsetof(ABP_FluidSim_FN_C, VehicleTypeMap) == 0x0006A0, "Member 'ABP_FluidSim_FN_C::VehicleTypeMap' has a wrong offset!");

}

