#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_TimerManager_Lobby

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Generic_TimerManager_Lobby.BP_Generic_TimerManager_Lobby_C.ExecuteUbergraph_BP_Generic_TimerManager_Lobby
// 0x02A0 (0x02A0 - 0x0000)
struct BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              Temp_struct_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalSeconds_ReturnValue_1;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x010C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_2;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalSeconds_ReturnValue_3;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSeconds_ReturnValue;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinutes_ReturnValue;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Reverse_ReturnValue;                      // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_1;                    // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue_1;               // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_1;         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue_2;               // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_2;         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue_3;               // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_3;         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHours_ReturnValue;                     // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDays_ReturnValue;                      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Reverse_ReturnValue_2;                    // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_4;               // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_3;                    // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_4;         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue_5;               // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_5;         // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue_6;               // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_6;         // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue_7;               // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_7;         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinutes_ReturnValue_1;                 // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHours_ReturnValue_1;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeconds_ReturnValue_1;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDays_ReturnValue_1;                    // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby");
static_assert(sizeof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby) == 0x0002A0, "Wrong size on BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, EntryPoint) == 0x000000, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_EventName_2) == 0x000008, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000018, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000020, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000028, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_EventName_1) == 0x000038, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000048, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000050, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000058, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_EventName) == 0x000068, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_TimeUntilEnd) == 0x000078, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_TimeSinceBegin) == 0x000080, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CustomEvent_TimeSpanRatio) == 0x000088, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, Temp_float_Variable) == 0x000098, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, Temp_struct_Variable) == 0x0000A0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, Temp_struct_Variable_1) == 0x0000A8, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, Temp_string_Variable) == 0x0000B0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x0000C0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x0000C8, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x0000D0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x0000D8, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetTotalSeconds_ReturnValue) == 0x0000DC, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_WatchCalendarEvent_ReturnValue) == 0x0000E0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_WatchCalendarEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetTotalSeconds_ReturnValue_1) == 0x0000EC, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetTotalSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, Temp_bool_Has_Been_Initd_Variable) == 0x0000F0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, Temp_bool_IsClosed_Variable) == 0x0000F1, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F4, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000100, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000108, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, K2Node_CreateDelegate_OutputDelegate_4) == 0x00010C, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetTotalSeconds_ReturnValue_2) == 0x000118, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetTotalSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000120, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000128, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetTotalSeconds_ReturnValue_3) == 0x00012C, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetTotalSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000130, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSeconds_ReturnValue) == 0x000134, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_IntToString_ReturnValue) == 0x000138, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetMinutes_ReturnValue) == 0x000148, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetMinutes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Reverse_ReturnValue) == 0x000150, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Reverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000160, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSubstring_ReturnValue) == 0x000170, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Reverse_ReturnValue_1) == 0x000180, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Reverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000190, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSubstring_ReturnValue_1) == 0x000198, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_StringToFloat_ReturnValue_1) == 0x0001A8, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_StringToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSubstring_ReturnValue_2) == 0x0001B0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSubstring_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_StringToFloat_ReturnValue_2) == 0x0001C0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_StringToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSubstring_ReturnValue_3) == 0x0001C8, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSubstring_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_StringToFloat_ReturnValue_3) == 0x0001D8, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_StringToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetHours_ReturnValue) == 0x0001DC, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0001E0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetDays_ReturnValue) == 0x0001F0, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetDays_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Reverse_ReturnValue_2) == 0x0001F8, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Reverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000208, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSubstring_ReturnValue_4) == 0x000218, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSubstring_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Reverse_ReturnValue_3) == 0x000228, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Reverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_StringToFloat_ReturnValue_4) == 0x000238, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_StringToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSubstring_ReturnValue_5) == 0x000240, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSubstring_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_StringToFloat_ReturnValue_5) == 0x000250, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_StringToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSubstring_ReturnValue_6) == 0x000258, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSubstring_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_StringToFloat_ReturnValue_6) == 0x000268, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_StringToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSubstring_ReturnValue_7) == 0x000270, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSubstring_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Conv_StringToFloat_ReturnValue_7) == 0x000280, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Conv_StringToFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetMinutes_ReturnValue_1) == 0x000284, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetMinutes_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetHours_ReturnValue_1) == 0x000288, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetHours_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetSeconds_ReturnValue_1) == 0x00028C, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_GetDays_ReturnValue_1) == 0x000290, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_GetDays_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_Subtract_IntInt_ReturnValue) == 0x000294, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby, CallFunc_MakeTimespan_ReturnValue) == 0x000298, "Member 'BP_Generic_TimerManager_Lobby_C_ExecuteUbergraph_BP_Generic_TimerManager_Lobby::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");

// Function BP_Generic_TimerManager_Lobby.BP_Generic_TimerManager_Lobby_C.OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio_0;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E");
static_assert(sizeof(BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E) == 0x000028, "Wrong size on BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E, EventName) == 0x000000, "Member 'BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E::EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E, TimeUntilEnd) == 0x000010, "Member 'BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E, TimeSinceBegin) == 0x000018, "Member 'BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E, TimespanRatio_0) == 0x000020, "Member 'BP_Generic_TimerManager_Lobby_C_OnEventActive_2CA6194447CC90E72CA40FB1A2CD843E::TimespanRatio_0' has a wrong offset!");

// Function BP_Generic_TimerManager_Lobby.BP_Generic_TimerManager_Lobby_C.OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio_0;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E");
static_assert(sizeof(BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E) == 0x000028, "Wrong size on BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E, EventName) == 0x000000, "Member 'BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E::EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E, TimeUntilEnd) == 0x000010, "Member 'BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E, TimeSinceBegin) == 0x000018, "Member 'BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E, TimespanRatio_0) == 0x000020, "Member 'BP_Generic_TimerManager_Lobby_C_OnEventEnded_2CA6194447CC90E72CA40FB1A2CD843E::TimespanRatio_0' has a wrong offset!");

// Function BP_Generic_TimerManager_Lobby.BP_Generic_TimerManager_Lobby_C.OnEventUpdated_2CA6194447CC90E72CA40FB1A2CD843E
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_TimerManager_Lobby_C_OnEventUpdated_2CA6194447CC90E72CA40FB1A2CD843E final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio_0;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_Lobby_C_OnEventUpdated_2CA6194447CC90E72CA40FB1A2CD843E) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_Lobby_C_OnEventUpdated_2CA6194447CC90E72CA40FB1A2CD843E");
static_assert(sizeof(BP_Generic_TimerManager_Lobby_C_OnEventUpdated_2CA6194447CC90E72CA40FB1A2CD843E) == 0x000028, "Wrong size on BP_Generic_TimerManager_Lobby_C_OnEventUpdated_2CA6194447CC90E72CA40FB1A2CD843E");
static_assert(offsetof(BP_Generic_TimerManager_Lobby_C_OnEventUpdated_2CA6194447CC90E72CA40FB1A2CD843E, EventName) == 0x000000, "Member 'BP_Generic_TimerManager_Lobby_C_OnEventUpdated_2CA6194447CC90E72CA40FB1A2CD843E::EventName' has a wrong offset!");
