#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Meatball_AudioController

#include "Basic.hpp"

#include "Water_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.Audio Tick Update
// 0x0008 (0x0008 - 0x0000)
struct BP_Meatball_AudioController_C_Audio_Tick_Update final
{
public:
	class AMeatballVehicle_L_C*                   Vehicle_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_Audio_Tick_Update) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_Audio_Tick_Update");
static_assert(sizeof(BP_Meatball_AudioController_C_Audio_Tick_Update) == 0x000008, "Wrong size on BP_Meatball_AudioController_C_Audio_Tick_Update");
static_assert(offsetof(BP_Meatball_AudioController_C_Audio_Tick_Update, Vehicle_0) == 0x000000, "Member 'BP_Meatball_AudioController_C_Audio_Tick_Update::Vehicle_0' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature");
static_assert(sizeof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature) == 0x000010, "Wrong size on BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature");
static_assert(offsetof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature, AudioComponent) == 0x000000, "Member 'BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature::AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature, Index_0) == 0x000008, "Member 'BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature::Index_0' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature");
static_assert(sizeof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature) == 0x000010, "Wrong size on BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature");
static_assert(offsetof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature, AudioComponent) == 0x000000, "Member 'BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature::AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature, Index_0) == 0x000008, "Member 'BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature::Index_0' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.CacheAudio
// 0x0030 (0x0030 - 0x0000)
struct BP_Meatball_AudioController_C_CacheAudio final
{
public:
	class AFortMeatballVehicle*                   Meatball;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleAudioVoice*                 Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMeatballVehicle_L_C*                   K2Node_DynamicCast_AsMeatball_Vehicle_L;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortVehicleAudioVoice*                 K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_CacheAudio) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_CacheAudio");
static_assert(sizeof(BP_Meatball_AudioController_C_CacheAudio) == 0x000030, "Wrong size on BP_Meatball_AudioController_C_CacheAudio");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, Meatball) == 0x000000, "Member 'BP_Meatball_AudioController_C_CacheAudio::Meatball' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, Temp_object_Variable) == 0x000008, "Member 'BP_Meatball_AudioController_C_CacheAudio::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, CallFunc_GetAttachParentActor_ReturnValue) == 0x000010, "Member 'BP_Meatball_AudioController_C_CacheAudio::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, K2Node_DynamicCast_AsMeatball_Vehicle_L) == 0x000018, "Member 'BP_Meatball_AudioController_C_CacheAudio::K2Node_DynamicCast_AsMeatball_Vehicle_L' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Meatball_AudioController_C_CacheAudio::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, Temp_bool_Variable) == 0x000021, "Member 'BP_Meatball_AudioController_C_CacheAudio::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, CallFunc_IsMobilePlatform_ReturnValue) == 0x000022, "Member 'BP_Meatball_AudioController_C_CacheAudio::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, CallFunc_IsDedicatedServer_ReturnValue) == 0x000023, "Member 'BP_Meatball_AudioController_C_CacheAudio::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, K2Node_Select_Default) == 0x000028, "Member 'BP_Meatball_AudioController_C_CacheAudio::K2Node_Select_Default' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.ExecuteUbergraph_BP_Meatball_AudioController
// 0x0310 (0x0310 - 0x0000)
struct BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AMeatballVehicle_L_C*                   K2Node_CustomEvent_Vehicle_2;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_PlayerIsTryingToMoveForward_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerIsTryingToMoveForward_ReturnValue;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsBoosting_self_CastInput;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBoosting_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsBoosting_self_CastInput_1;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBoosting_ReturnValue_1;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSteeringAngle_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_PlayerIsTryingToMoveForward_self_CastInput_1; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerIsTryingToMoveForward_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetForwardSpeedKmh_self_CastInput;        // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSteeringAngle_ReturnValue_1;           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_HasDriver_self_CastInput;                 // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDriver_ReturnValue;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_3;           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsBoosting_self_CastInput_2;              // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBoosting_ReturnValue_2;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_4;           // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_VehicleIsInAir_self_CastInput;            // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VehicleIsInAir_ReturnValue;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_5;           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput_1;               // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue_1;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_6;           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput_2;               // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue_2;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_VehicleIsInAir_self_CastInput_1;          // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VehicleIsInAir_ReturnValue_1;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetForwardSpeedKmh_self_CastInput_1;      // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue_1;         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput_3;               // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue_3;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_3;            // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_7;           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetForwardSpeedKmh_self_CastInput_2;      // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue_2;         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_3;                        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_4;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetForwardSpeedKmh_self_CastInput_3;      // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue_3;         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_4;                        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_5;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        K2Node_ComponentBoundEvent_AudioComponent_1;       // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_ComponentBoundEvent_AudioComponent;         // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSpeedKmh_ReturnValue;             // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput_4;               // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue_4;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_1;             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_2;             // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetIntParameter_self_CastInput;           // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetIntParameter_self_CastInput_1;         // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetIntParameter_self_CastInput_2;         // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetIntParameter_self_CastInput_3;         // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Awake;                          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_CustomEvent_Vehicle_1;                      // 0x0298(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_PlayerPawn_1;                   // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SeatIndex_1;                    // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetIntParameter_self_CastInput_4;         // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_CustomEvent_Vehicle;                        // 0x02C8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_PlayerPawn;                     // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SeatIndex;                      // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02E4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetIntParameter_self_CastInput_5;         // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController");
static_assert(sizeof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController) == 0x000310, "Wrong size on BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, EntryPoint) == 0x000000, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_CustomEvent_Vehicle_2) == 0x000030, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_CustomEvent_Vehicle_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_PlayerIsTryingToMoveForward_self_CastInput) == 0x000038, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_PlayerIsTryingToMoveForward_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_PlayerIsTryingToMoveForward_ReturnValue) == 0x000048, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_PlayerIsTryingToMoveForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_self_CastInput) == 0x000050, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_ReturnValue) == 0x000060, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_self_CastInput_1) == 0x000068, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_ReturnValue_1) == 0x000078, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetSteeringAngle_ReturnValue) == 0x00007C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetSteeringAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_BooleanAND_ReturnValue) == 0x000080, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue) == 0x000084, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000088, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue) == 0x00008C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_PlayerIsTryingToMoveForward_self_CastInput_1) == 0x000090, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_PlayerIsTryingToMoveForward_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_PlayerIsTryingToMoveForward_ReturnValue_1) == 0x0000A0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_PlayerIsTryingToMoveForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_self_CastInput) == 0x0000A8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_ReturnValue) == 0x0000B8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_BooleanOR_ReturnValue) == 0x0000BC, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0000C0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C4, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x0000C8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetSteeringAngle_ReturnValue_1) == 0x0000CC, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetSteeringAngle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue_1) == 0x0000D0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0000D4, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000D8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput) == 0x0000E0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue) == 0x0000F0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x0000F4, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_HasDriver_self_CastInput) == 0x0000F8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_HasDriver_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_HasDriver_ReturnValue) == 0x000108, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_HasDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_3) == 0x00010C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_self_CastInput_2) == 0x000110, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_ReturnValue_2) == 0x000120, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_4) == 0x000124, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_VehicleIsInAir_self_CastInput) == 0x000128, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_VehicleIsInAir_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_VehicleIsInAir_ReturnValue) == 0x000138, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_VehicleIsInAir_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_5) == 0x00013C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput_1) == 0x000140, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue_1) == 0x000150, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_6) == 0x000154, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput_2) == 0x000158, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue_2) == 0x000168, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00016C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_VehicleIsInAir_self_CastInput_1) == 0x000170, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_VehicleIsInAir_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_VehicleIsInAir_ReturnValue_1) == 0x000180, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_VehicleIsInAir_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Not_PreBool_ReturnValue_2) == 0x000181, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_self_CastInput_1) == 0x000188, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_ReturnValue_1) == 0x000198, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput_3) == 0x0001A0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue_3) == 0x0001B0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue_2) == 0x0001B4, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001B8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_3) == 0x0001BC, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_BooleanAND_ReturnValue_1) == 0x0001C0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_7) == 0x0001C4, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_self_CastInput_2) == 0x0001C8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_ReturnValue_2) == 0x0001D8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue_3) == 0x0001DC, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_4) == 0x0001E0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_self_CastInput_3) == 0x0001E8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_ReturnValue_3) == 0x0001F8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue_4) == 0x0001FC, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_5) == 0x000200, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_ComponentBoundEvent_AudioComponent_1) == 0x000208, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_ComponentBoundEvent_AudioComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_ComponentBoundEvent_Index_1) == 0x000210, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000214, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_ComponentBoundEvent_AudioComponent) == 0x000218, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_ComponentBoundEvent_AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_ComponentBoundEvent_Index) == 0x000220, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetTotalSpeedKmh_ReturnValue) == 0x000224, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetTotalSpeedKmh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000228, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput_4) == 0x000230, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue_4) == 0x000240, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToInt_ReturnValue_1) == 0x000244, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToInt_ReturnValue_2) == 0x000248, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_SetIntParameter_self_CastInput) == 0x000250, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_SetIntParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_SetIntParameter_self_CastInput_1) == 0x000260, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_SetIntParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_SetIntParameter_self_CastInput_2) == 0x000270, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_SetIntParameter_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_SetIntParameter_self_CastInput_3) == 0x000280, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_SetIntParameter_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_CustomEvent_Awake) == 0x000290, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_CustomEvent_Awake' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000291, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_CustomEvent_Vehicle_1) == 0x000298, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_CustomEvent_Vehicle_1' has a wrong offset!");
