#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_DayNight_Outfit_Controller

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_DayNight_Outfit_Controller.BP_NPC_DayNight_Outfit_Controller_C
// 0x00C8 (0x0338 - 0x0270)
class ABP_NPC_DayNight_Outfit_Controller_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortAthenaLivingWorldManager*          LivingWorldManager;                                // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckTImeInterval;                                 // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              NightAI;                                           // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaPatrolPathPointProvider*     NightProvider;                                     // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              FortPawnRef;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaPatrolPathPointProvider*     PathProvider;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TrySpawnTimerHandle;                               // 0x02B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  SwapId;                                            // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortSwapItemAndVariantData>    SwapDataDay;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraSystem*                         NS_SwapFX;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SwapSound;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortSwapItemAndVariantData>    SwapDataNight;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FFortSwapItemAndVariantData>    SwapData;                                          // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGuid                                  SwapIdDay;                                         // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  SwapIdNight;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNightOverrideActive;                              // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        FortPlayerPawnRef;                                 // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActorSpawned(class AActor* SpawnedActor, bool bResult);
	void CheckTimeOfDay();
	void ExecuteUbergraph_BP_NPC_DayNight_Outfit_Controller(int32 EntryPoint);
	void OnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnReady_01C3EE354F8B18DD786A8F9E360B6187(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_DayNight_Outfit_Controller_C">();
	}
	static class ABP_NPC_DayNight_Outfit_Controller_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_DayNight_Outfit_Controller_C>();
	}
};
static_assert(alignof(ABP_NPC_DayNight_Outfit_Controller_C) == 0x000008, "Wrong alignment on ABP_NPC_DayNight_Outfit_Controller_C");
static_assert(sizeof(ABP_NPC_DayNight_Outfit_Controller_C) == 0x000338, "Wrong size on ABP_NPC_DayNight_Outfit_Controller_C");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, UberGraphFrame) == 0x000270, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, DefaultSceneRoot) == 0x000278, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, LivingWorldManager) == 0x000280, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::LivingWorldManager' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, CheckTImeInterval) == 0x000288, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::CheckTImeInterval' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, NightAI) == 0x000290, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::NightAI' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, NightProvider) == 0x000298, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::NightProvider' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, FortPawnRef) == 0x0002A0, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::FortPawnRef' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, PathProvider) == 0x0002A8, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::PathProvider' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, TrySpawnTimerHandle) == 0x0002B0, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::TrySpawnTimerHandle' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, SwapId) == 0x0002B8, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::SwapId' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, SwapDataDay) == 0x0002C8, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::SwapDataDay' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, NS_SwapFX) == 0x0002D8, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::NS_SwapFX' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, SwapSound) == 0x0002E0, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::SwapSound' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, SwapDataNight) == 0x0002E8, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::SwapDataNight' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, SwapData) == 0x0002F8, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::SwapData' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, SwapIdDay) == 0x000308, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::SwapIdDay' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, SwapIdNight) == 0x000318, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::SwapIdNight' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, bNightOverrideActive) == 0x000328, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::bNightOverrideActive' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DayNight_Outfit_Controller_C, FortPlayerPawnRef) == 0x000330, "Member 'ABP_NPC_DayNight_Outfit_Controller_C::FortPlayerPawnRef' has a wrong offset!");

}

