#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileTrajectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ProjectileTrajectory.BP_ProjectileTrajectory_C.ExecuteUbergraph_BP_ProjectileTrajectory
// 0x01C0 (0x01C0 - 0x0000)
struct BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        K2Node_Event_SplinePoints;                         // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector>                        K2Node_Event_SplineTangents;                       // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0060(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTransform                             Temp_struct_Variable;                              // 0x0140(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory) == 0x000010, "Wrong alignment on BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory");
static_assert(sizeof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory) == 0x0001C0, "Wrong size on BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, EntryPoint) == 0x000000, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, K2Node_Event_SplinePoints) == 0x000010, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::K2Node_Event_SplinePoints' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, K2Node_Event_SplineTangents) == 0x000020, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::K2Node_Event_SplineTangents' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_Array_LastIndex_ReturnValue) == 0x000030, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000034, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000044, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000060, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, Temp_struct_Variable) == 0x000140, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_AddComponent_ReturnValue) == 0x0001A0, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, Temp_int_Variable) == 0x0001A8, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001AC, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001AD, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_Add_IntInt_ReturnValue) == 0x0001B0, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001B8, "Member 'BP_ProjectileTrajectory_C_ExecuteUbergraph_BP_ProjectileTrajectory::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_ProjectileTrajectory.BP_ProjectileTrajectory_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ProjectileTrajectory_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ProjectileTrajectory_C_ReceiveTick");
static_assert(sizeof(BP_ProjectileTrajectory_C_ReceiveTick) == 0x000004, "Wrong size on BP_ProjectileTrajectory_C_ReceiveTick");
static_assert(offsetof(BP_ProjectileTrajectory_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ProjectileTrajectory_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ProjectileTrajectory.BP_ProjectileTrajectory_C.SetShouldUpdateFromOwner
// 0x0010 (0x0010 - 0x0000)
struct BP_ProjectileTrajectory_C_SetShouldUpdateFromOwner final
{
public:
	bool                                          ShouldUpdate_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Owner_0;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_C_SetShouldUpdateFromOwner) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_C_SetShouldUpdateFromOwner");
static_assert(sizeof(BP_ProjectileTrajectory_C_SetShouldUpdateFromOwner) == 0x000010, "Wrong size on BP_ProjectileTrajectory_C_SetShouldUpdateFromOwner");
static_assert(offsetof(BP_ProjectileTrajectory_C_SetShouldUpdateFromOwner, ShouldUpdate_0) == 0x000000, "Member 'BP_ProjectileTrajectory_C_SetShouldUpdateFromOwner::ShouldUpdate_0' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_SetShouldUpdateFromOwner, Owner_0) == 0x000008, "Member 'BP_ProjectileTrajectory_C_SetShouldUpdateFromOwner::Owner_0' has a wrong offset!");

// Function BP_ProjectileTrajectory.BP_ProjectileTrajectory_C.SetTrajectorySpline
// 0x0020 (0x0020 - 0x0000)
struct BP_ProjectileTrajectory_C_SetTrajectorySpline final
{
public:
	TArray<struct FVector>                        SplinePoints;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FVector>                        SplineTangents;                                    // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ProjectileTrajectory_C_SetTrajectorySpline) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_C_SetTrajectorySpline");
static_assert(sizeof(BP_ProjectileTrajectory_C_SetTrajectorySpline) == 0x000020, "Wrong size on BP_ProjectileTrajectory_C_SetTrajectorySpline");
static_assert(offsetof(BP_ProjectileTrajectory_C_SetTrajectorySpline, SplinePoints) == 0x000000, "Member 'BP_ProjectileTrajectory_C_SetTrajectorySpline::SplinePoints' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_SetTrajectorySpline, SplineTangents) == 0x000010, "Member 'BP_ProjectileTrajectory_C_SetTrajectorySpline::SplineTangents' has a wrong offset!");

// Function BP_ProjectileTrajectory.BP_ProjectileTrajectory_C.UpdateFromTrajectoryOwner
// 0x0018 (0x0018 - 0x0000)
struct BP_ProjectileTrajectory_C_UpdateFromTrajectoryOwner final
{
public:
	TScriptInterface<class IFortTrajectoryAbilityInterface> K2Node_DynamicCast_AsFort_Trajectory_Ability_Interface; // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_C_UpdateFromTrajectoryOwner) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_C_UpdateFromTrajectoryOwner");
static_assert(sizeof(BP_ProjectileTrajectory_C_UpdateFromTrajectoryOwner) == 0x000018, "Wrong size on BP_ProjectileTrajectory_C_UpdateFromTrajectoryOwner");
static_assert(offsetof(BP_ProjectileTrajectory_C_UpdateFromTrajectoryOwner, K2Node_DynamicCast_AsFort_Trajectory_Ability_Interface) == 0x000000, "Member 'BP_ProjectileTrajectory_C_UpdateFromTrajectoryOwner::K2Node_DynamicCast_AsFort_Trajectory_Ability_Interface' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_C_UpdateFromTrajectoryOwner, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_ProjectileTrajectory_C_UpdateFromTrajectoryOwner::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

