#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Party_Sparkles

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Party_Sparkles.BP_Party_Sparkles_C
// 0x0048 (0x02B8 - 0x0270)
class ABP_Party_Sparkles_C final : public AActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Motes_Few;                                      // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OverallDirection;                                  // 0x0288(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LoopDuration;                                      // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HueShiftMin;                                       // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HueShiftMax;                                       // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Curl;                                              // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveIntensity;                                 // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Party_Sparkles_C">();
	}
	static class ABP_Party_Sparkles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Party_Sparkles_C>();
	}
};
static_assert(alignof(ABP_Party_Sparkles_C) == 0x000008, "Wrong alignment on ABP_Party_Sparkles_C");
static_assert(sizeof(ABP_Party_Sparkles_C) == 0x0002B8, "Wrong size on ABP_Party_Sparkles_C");
static_assert(offsetof(ABP_Party_Sparkles_C, Billboard) == 0x000270, "Member 'ABP_Party_Sparkles_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Party_Sparkles_C, SM_Motes_Few) == 0x000278, "Member 'ABP_Party_Sparkles_C::SM_Motes_Few' has a wrong offset!");
static_assert(offsetof(ABP_Party_Sparkles_C, Size) == 0x000280, "Member 'ABP_Party_Sparkles_C::Size' has a wrong offset!");
static_assert(offsetof(ABP_Party_Sparkles_C, OverallDirection) == 0x000288, "Member 'ABP_Party_Sparkles_C::OverallDirection' has a wrong offset!");
static_assert(offsetof(ABP_Party_Sparkles_C, LoopDuration) == 0x0002A0, "Member 'ABP_Party_Sparkles_C::LoopDuration' has a wrong offset!");
static_assert(offsetof(ABP_Party_Sparkles_C, HueShiftMin) == 0x0002A4, "Member 'ABP_Party_Sparkles_C::HueShiftMin' has a wrong offset!");
static_assert(offsetof(ABP_Party_Sparkles_C, HueShiftMax) == 0x0002A8, "Member 'ABP_Party_Sparkles_C::HueShiftMax' has a wrong offset!");
static_assert(offsetof(ABP_Party_Sparkles_C, Curl) == 0x0002AC, "Member 'ABP_Party_Sparkles_C::Curl' has a wrong offset!");
static_assert(offsetof(ABP_Party_Sparkles_C, EmissiveIntensity) == 0x0002B0, "Member 'ABP_Party_Sparkles_C::EmissiveIntensity' has a wrong offset!");

}

