#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pistol_Grip_Clip_TopAction

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Pistol_Grip_Clip_TopAction.BP_Pistol_Grip_Clip_TopAction_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_Pistol_Grip_Clip_TopAction_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_Pistol_Grip_Clip_TopAction_C_AnimGraph) == 0x000008, "Wrong alignment on BP_Pistol_Grip_Clip_TopAction_C_AnimGraph");
static_assert(sizeof(BP_Pistol_Grip_Clip_TopAction_C_AnimGraph) == 0x000010, "Wrong size on BP_Pistol_Grip_Clip_TopAction_C_AnimGraph");
static_assert(offsetof(BP_Pistol_Grip_Clip_TopAction_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_Pistol_Grip_Clip_TopAction_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function BP_Pistol_Grip_Clip_TopAction.BP_Pistol_Grip_Clip_TopAction_C.ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction
// 0x0004 (0x0004 - 0x0000)
struct BP_Pistol_Grip_Clip_TopAction_C_ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Pistol_Grip_Clip_TopAction_C_ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction) == 0x000004, "Wrong alignment on BP_Pistol_Grip_Clip_TopAction_C_ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction");
static_assert(sizeof(BP_Pistol_Grip_Clip_TopAction_C_ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction) == 0x000004, "Wrong size on BP_Pistol_Grip_Clip_TopAction_C_ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction");
static_assert(offsetof(BP_Pistol_Grip_Clip_TopAction_C_ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction, EntryPoint) == 0x000000, "Member 'BP_Pistol_Grip_Clip_TopAction_C_ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction::EntryPoint' has a wrong offset!");

}

