#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RealityPG_CuddleMountain

#include "Basic.hpp"

#include "BP_Artemis_StaticMesh_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RealityPG_CuddleMountain.BP_RealityPG_CuddleMountain_C
// 0x00D0 (0x0388 - 0x02B8)
class ABP_RealityPG_CuddleMountain_C final : public ABP_Artemis_StaticMesh_C
{
public:
	class UChildActorComponent*                   Jump_Link_03;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Jump_Link_02;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Jump_Link_01;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Clamber_Link_05;                                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Clamber_Link_04;                                   // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Clamber_Link_03;                                   // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Clamber_Link_02;                                   // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Clamber_Link_01;                                   // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          NavMeshBlocker;                                    // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Ear_A1;                // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Ear_A;                 // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Eye_A1;                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Eye_A;                 // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RealityPG_CuddleMountain_Girders_B;                // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_MetalSheets_A;         // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_FloorRail_B;           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_FloorRail_A;           // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Floor_D;               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Floor_C;               // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Floor_B;               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Floor_A;               // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RealityPG_CuddleMountain_Girders_Door_A;           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RealityPG_CuddleMountain_Girders_Door_B;           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Girders_A;             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_MetalSheets_B;         // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RealityPG_CuddleMountain_Mouth_A;               // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RealityPG_CuddleMountain_C">();
	}
	static class ABP_RealityPG_CuddleMountain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RealityPG_CuddleMountain_C>();
	}
};
static_assert(alignof(ABP_RealityPG_CuddleMountain_C) == 0x000008, "Wrong alignment on ABP_RealityPG_CuddleMountain_C");
static_assert(sizeof(ABP_RealityPG_CuddleMountain_C) == 0x000388, "Wrong size on ABP_RealityPG_CuddleMountain_C");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, Jump_Link_03) == 0x0002B8, "Member 'ABP_RealityPG_CuddleMountain_C::Jump_Link_03' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, Jump_Link_02) == 0x0002C0, "Member 'ABP_RealityPG_CuddleMountain_C::Jump_Link_02' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, Jump_Link_01) == 0x0002C8, "Member 'ABP_RealityPG_CuddleMountain_C::Jump_Link_01' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, Clamber_Link_05) == 0x0002D0, "Member 'ABP_RealityPG_CuddleMountain_C::Clamber_Link_05' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, Clamber_Link_04) == 0x0002D8, "Member 'ABP_RealityPG_CuddleMountain_C::Clamber_Link_04' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, Clamber_Link_03) == 0x0002E0, "Member 'ABP_RealityPG_CuddleMountain_C::Clamber_Link_03' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, Clamber_Link_02) == 0x0002E8, "Member 'ABP_RealityPG_CuddleMountain_C::Clamber_Link_02' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, Clamber_Link_01) == 0x0002F0, "Member 'ABP_RealityPG_CuddleMountain_C::Clamber_Link_01' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, NavMeshBlocker) == 0x0002F8, "Member 'ABP_RealityPG_CuddleMountain_C::NavMeshBlocker' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Ear_A1) == 0x000300, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Ear_A1' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Ear_A) == 0x000308, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Ear_A' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Eye_A1) == 0x000310, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Eye_A1' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Eye_A) == 0x000318, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Eye_A' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, RealityPG_CuddleMountain_Girders_B) == 0x000320, "Member 'ABP_RealityPG_CuddleMountain_C::RealityPG_CuddleMountain_Girders_B' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_MetalSheets_A) == 0x000328, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_MetalSheets_A' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_FloorRail_B) == 0x000330, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_FloorRail_B' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_FloorRail_A) == 0x000338, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_FloorRail_A' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Floor_D) == 0x000340, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Floor_D' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Floor_C) == 0x000348, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Floor_C' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Floor_B) == 0x000350, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Floor_B' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Floor_A) == 0x000358, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Floor_A' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, RealityPG_CuddleMountain_Girders_Door_A) == 0x000360, "Member 'ABP_RealityPG_CuddleMountain_C::RealityPG_CuddleMountain_Girders_Door_A' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, RealityPG_CuddleMountain_Girders_Door_B) == 0x000368, "Member 'ABP_RealityPG_CuddleMountain_C::RealityPG_CuddleMountain_Girders_Door_B' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Girders_A) == 0x000370, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Girders_A' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_MetalSheets_B) == 0x000378, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_MetalSheets_B' has a wrong offset!");
static_assert(offsetof(ABP_RealityPG_CuddleMountain_C, SM_RealityPG_CuddleMountain_Mouth_A) == 0x000380, "Member 'ABP_RealityPG_CuddleMountain_C::SM_RealityPG_CuddleMountain_Mouth_A' has a wrong offset!");

}

