#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplayPC_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplayPC_Athena.BP_ReplayPC_Athena_C
// 0x00C0 (0x4350 - 0x4290)
class ABP_ReplayPC_Athena_C final : public AFortReplaySpectatorAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x4290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x4298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUnderwaterAudioComponent_C*            UnderwaterAudioComponent;                          // 0x42A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<float, class USoundMix*>                 PlaybackRateMap;                                   // 0x42A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CurrentPlayRate;                                   // 0x42F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFast;                                           // 0x42FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42FD[0x3];                                     // 0x42FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SpeedupLoop;                                       // 0x4300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SlowdownLoop;                                      // 0x4308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHudVisible;                                     // 0x4310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4311[0x7];                                     // 0x4311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        ZoomOutLoop;                                       // 0x4318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ZoomInLoop;                                        // 0x4320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSkydivingAudioEnabled;                          // 0x4328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTargetParachuting;                              // 0x4329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTargetSkydiving;                                // 0x432A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432B[0x5];                                     // 0x432B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SkydivingAudioLoop;                                // 0x4330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPaused;                                         // 0x4338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4339[0x7];                                     // 0x4339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CurrentSkydivingSound;                             // 0x4340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              PauseMIx;                                          // 0x4348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplayPC_Athena(int32 EntryPoint);
	class USoundBase* GetSkydivingSound();
	void Handle_Parachute_Audio_State();
	void _Speedup_Loops(float Playback_Multiplier);
	void IsGameplayCamera(bool* IsGameplayCamera_0);
	void Looping_Audio_Update();
	void On_Pause_State_Changed(bool bPaused);
	void OnNotifyNewPlaybackMultiplier(float NewMultiplier);
	void OnReplayHudVisibilityChanged(const EHudVisibilityState IsVisible);
	void OnZoomInBegin();
	void OnZoomInEnd();
	void OnZoomOutBegin();
	void OnZoomOutEnd();
	void ReceiveBeginPlay();
	void SetSkydivingAudioEnabled(bool Enabled);
	void Update_Sound_Mix();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplayPC_Athena_C">();
	}
	static class ABP_ReplayPC_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplayPC_Athena_C>();
	}
};
static_assert(alignof(ABP_ReplayPC_Athena_C) == 0x000010, "Wrong alignment on ABP_ReplayPC_Athena_C");
static_assert(sizeof(ABP_ReplayPC_Athena_C) == 0x004350, "Wrong size on ABP_ReplayPC_Athena_C");
static_assert(offsetof(ABP_ReplayPC_Athena_C, UberGraphFrame) == 0x004290, "Member 'ABP_ReplayPC_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, PostProcess) == 0x004298, "Member 'ABP_ReplayPC_Athena_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, UnderwaterAudioComponent) == 0x0042A0, "Member 'ABP_ReplayPC_Athena_C::UnderwaterAudioComponent' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, PlaybackRateMap) == 0x0042A8, "Member 'ABP_ReplayPC_Athena_C::PlaybackRateMap' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, CurrentPlayRate) == 0x0042F8, "Member 'ABP_ReplayPC_Athena_C::CurrentPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsFast) == 0x0042FC, "Member 'ABP_ReplayPC_Athena_C::bIsFast' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SpeedupLoop) == 0x004300, "Member 'ABP_ReplayPC_Athena_C::SpeedupLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SlowdownLoop) == 0x004308, "Member 'ABP_ReplayPC_Athena_C::SlowdownLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsHudVisible) == 0x004310, "Member 'ABP_ReplayPC_Athena_C::bIsHudVisible' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, ZoomOutLoop) == 0x004318, "Member 'ABP_ReplayPC_Athena_C::ZoomOutLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, ZoomInLoop) == 0x004320, "Member 'ABP_ReplayPC_Athena_C::ZoomInLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsSkydivingAudioEnabled) == 0x004328, "Member 'ABP_ReplayPC_Athena_C::bIsSkydivingAudioEnabled' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsTargetParachuting) == 0x004329, "Member 'ABP_ReplayPC_Athena_C::bIsTargetParachuting' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsTargetSkydiving) == 0x00432A, "Member 'ABP_ReplayPC_Athena_C::bIsTargetSkydiving' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SkydivingAudioLoop) == 0x004330, "Member 'ABP_ReplayPC_Athena_C::SkydivingAudioLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsPaused) == 0x004338, "Member 'ABP_ReplayPC_Athena_C::bIsPaused' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, CurrentSkydivingSound) == 0x004340, "Member 'ABP_ReplayPC_Athena_C::CurrentSkydivingSound' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, PauseMIx) == 0x004348, "Member 'ABP_ReplayPC_Athena_C::PauseMIx' has a wrong offset!");

}

