#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RVT_Graffiti_Decal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RVT_Graffiti_Decal.BP_RVT_Graffiti_Decal_C
// 0x0028 (0x02E0 - 0x02B8)
class ABP_RVT_Graffiti_Decal_C final : public AFortStaticMeshActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Decal_Tint;                                        // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Opacity;                                           // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Diffuse;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RVT_Graffiti_Decal_C">();
	}
	static class ABP_RVT_Graffiti_Decal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RVT_Graffiti_Decal_C>();
	}
};
static_assert(alignof(ABP_RVT_Graffiti_Decal_C) == 0x000008, "Wrong alignment on ABP_RVT_Graffiti_Decal_C");
static_assert(sizeof(ABP_RVT_Graffiti_Decal_C) == 0x0002E0, "Wrong size on ABP_RVT_Graffiti_Decal_C");
static_assert(offsetof(ABP_RVT_Graffiti_Decal_C, Billboard) == 0x0002B8, "Member 'ABP_RVT_Graffiti_Decal_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_RVT_Graffiti_Decal_C, Decal_Tint) == 0x0002C0, "Member 'ABP_RVT_Graffiti_Decal_C::Decal_Tint' has a wrong offset!");
static_assert(offsetof(ABP_RVT_Graffiti_Decal_C, Opacity) == 0x0002D0, "Member 'ABP_RVT_Graffiti_Decal_C::Opacity' has a wrong offset!");
static_assert(offsetof(ABP_RVT_Graffiti_Decal_C, Diffuse) == 0x0002D8, "Member 'ABP_RVT_Graffiti_Decal_C::Diffuse' has a wrong offset!");

}

