#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RiskyReels_AudioMix_Controller

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RiskyReels_AudioMix_Controller.BP_RiskyReels_AudioMix_Controller_C
// 0x0018 (0x0288 - 0x0270)
class ABP_RiskyReels_AudioMix_Controller_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        MixApplicationAudio;                               // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AAthena_Prop_Video_Stream_Trigger1_C*   StreamTriggerBP;                                   // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RiskyReels_AudioMix_Controller(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Video_Started(bool FirstStart);
	void Video_Stopped();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RiskyReels_AudioMix_Controller_C">();
	}
	static class ABP_RiskyReels_AudioMix_Controller_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RiskyReels_AudioMix_Controller_C>();
	}
};
static_assert(alignof(ABP_RiskyReels_AudioMix_Controller_C) == 0x000008, "Wrong alignment on ABP_RiskyReels_AudioMix_Controller_C");
static_assert(sizeof(ABP_RiskyReels_AudioMix_Controller_C) == 0x000288, "Wrong size on ABP_RiskyReels_AudioMix_Controller_C");
static_assert(offsetof(ABP_RiskyReels_AudioMix_Controller_C, UberGraphFrame) == 0x000270, "Member 'ABP_RiskyReels_AudioMix_Controller_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RiskyReels_AudioMix_Controller_C, MixApplicationAudio) == 0x000278, "Member 'ABP_RiskyReels_AudioMix_Controller_C::MixApplicationAudio' has a wrong offset!");
static_assert(offsetof(ABP_RiskyReels_AudioMix_Controller_C, StreamTriggerBP) == 0x000280, "Member 'ABP_RiskyReels_AudioMix_Controller_C::StreamTriggerBP' has a wrong offset!");

}

