#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StationProp_VendingMachine_Malfunctioning

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_StationProp_VendingMachine_Malfunctioning.BP_StationProp_VendingMachine_Malfunctioning_C.PlayServiceUsedEffects
// 0x0080 (0x0080 - 0x0000)
struct BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects) == 0x000008, "Wrong alignment on BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects");
static_assert(sizeof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects) == 0x000080, "Wrong size on BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, PlayerController) == 0x000000, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, CallFunc_GetForwardVector_ReturnValue) == 0x000008, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000038, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, CallFunc_BreakRotator_Roll) == 0x000050, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, CallFunc_BreakRotator_Pitch) == 0x000054, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, CallFunc_BreakRotator_Yaw) == 0x000058, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, CallFunc_MakeRotator_ReturnValue) == 0x000060, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000078, "Member 'BP_StationProp_VendingMachine_Malfunctioning_C_PlayServiceUsedEffects::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");

}

