#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StationProp_VendingMachine_Emote_Base

#include "Basic.hpp"

#include "VendingDamageResponse_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonConversationRuntime_structs.hpp"
#include "VendingMachineMaterialStyle_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_StationProp_VendingMachine_Emote_Base.BP_StationProp_VendingMachine_Emote_Base_C.BlueprintOnLocalInteract
// 0x0010 (0x0010 - 0x0000)
struct BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract final
{
public:
	class AFortPlayerPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract) == 0x000008, "Wrong alignment on BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract");
static_assert(sizeof(BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract) == 0x000010, "Wrong size on BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract, InteractingPawn) == 0x000000, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract, InteractionBeingAttempted) == 0x000008, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract, ReturnValue) == 0x000009, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract, CallFunc_IsLocallyControlled_ReturnValue) == 0x00000A, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_BlueprintOnLocalInteract::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function BP_StationProp_VendingMachine_Emote_Base.BP_StationProp_VendingMachine_Emote_Base_C.ChangeEmote
// 0x0050 (0x0050 - 0x0000)
struct BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmote final
{
public:
	struct FVendingMachineMaterialStyle           DesiredStyle;                                      // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmote) == 0x000008, "Wrong alignment on BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmote");
static_assert(sizeof(BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmote) == 0x000050, "Wrong size on BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmote");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmote, DesiredStyle) == 0x000000, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmote::DesiredStyle' has a wrong offset!");

// Function BP_StationProp_VendingMachine_Emote_Base.BP_StationProp_VendingMachine_Emote_Base_C.ChangeEmoteScreenRevealed
// 0x0001 (0x0001 - 0x0000)
struct BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmoteScreenRevealed final
{
public:
	bool                                          Revealed;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmoteScreenRevealed) == 0x000001, "Wrong alignment on BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmoteScreenRevealed");
static_assert(sizeof(BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmoteScreenRevealed) == 0x000001, "Wrong size on BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmoteScreenRevealed");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmoteScreenRevealed, Revealed) == 0x000000, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ChangeEmoteScreenRevealed::Revealed' has a wrong offset!");

// Function BP_StationProp_VendingMachine_Emote_Base.BP_StationProp_VendingMachine_Emote_Base_C.Event On Dialog Marker Interaction State Changed
// 0x0010 (0x0010 - 0x0000)
struct BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Dialog_Marker_Interaction_State_Changed final
{
public:
	EDialogMarkerInteractionState                 CurrentInteractionState;                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPlayerController*            InteractingController;                             // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Dialog_Marker_Interaction_State_Changed) == 0x000008, "Wrong alignment on BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Dialog_Marker_Interaction_State_Changed");
static_assert(sizeof(BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Dialog_Marker_Interaction_State_Changed) == 0x000010, "Wrong size on BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Dialog_Marker_Interaction_State_Changed");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Dialog_Marker_Interaction_State_Changed, CurrentInteractionState) == 0x000000, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Dialog_Marker_Interaction_State_Changed::CurrentInteractionState' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Dialog_Marker_Interaction_State_Changed, InteractingController) == 0x000008, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Dialog_Marker_Interaction_State_Changed::InteractingController' has a wrong offset!");

// Function BP_StationProp_VendingMachine_Emote_Base.BP_StationProp_VendingMachine_Emote_Base_C.Event On Receive Conversation Message
// 0x0080 (0x0080 - 0x0000)
struct BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Receive_Conversation_Message final
{
public:
	const class AFortPlayerController*            LocalPlayerController;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClientConversationMessagePayload      Message;                                           // 0x0008(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Receive_Conversation_Message) == 0x000008, "Wrong alignment on BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Receive_Conversation_Message");
static_assert(sizeof(BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Receive_Conversation_Message) == 0x000080, "Wrong size on BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Receive_Conversation_Message");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Receive_Conversation_Message, LocalPlayerController) == 0x000000, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Receive_Conversation_Message::LocalPlayerController' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Receive_Conversation_Message, Message) == 0x000008, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_Event_On_Receive_Conversation_Message::Message' has a wrong offset!");

// Function BP_StationProp_VendingMachine_Emote_Base.BP_StationProp_VendingMachine_Emote_Base_C.ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base
// 0x0440 (0x0440 - 0x0000)
struct BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVendingMachineMaterialStyle           K2Node_CustomEvent_DesiredStyle;                   // 0x0030(0x0050)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPhysicsObjectComponent*            CallFunc_GetPhysicsObjectComponent_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAwake_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPlayerController*            K2Node_CustomEvent_LocalPlayerController;          // 0x0090(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClientConversationMessagePayload      K2Node_CustomEvent_Message;                        // 0x0098(0x0078)(ConstParm)
	float                                         K2Node_Event_Damage;                               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0118(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0150(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0240(0x0018)()
	EDialogMarkerInteractionState                 K2Node_CustomEvent_CurrentInteractionState;        // 0x0258(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPlayerController*            K2Node_CustomEvent_InteractingController;          // 0x0260(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterialInstance_ReturnValue;   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Revealed;                       // 0x028E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x028F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0294(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue_1;             // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue_2;             // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B7[0x1];                                      // 0x02B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02B8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EDialogMarkerInteractionState CurrentInteractionState, class AFortPlayerController* InteractingController)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02C4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasHealthLeft_ReturnValue;                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasHealthLeft_ReturnValue_1;              // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x2];                                      // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortPlayerController* LocalPlayerController, struct FClientConversationMessagePayload& Message)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x02D4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FadeOutDuration;                // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0330(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base) == 0x000008, "Wrong alignment on BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base");
static_assert(sizeof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base) == 0x000440, "Wrong size on BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, EntryPoint) == 0x000000, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_3) == 0x000007, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_4) == 0x000008, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_5) == 0x000009, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_6) == 0x00000A, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_7) == 0x000028, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_HasAuthority_ReturnValue) == 0x000029, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_8) == 0x00002A, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CustomEvent_DesiredStyle) == 0x000030, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CustomEvent_DesiredStyle' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_GetPhysicsObjectComponent_ReturnValue) == 0x000080, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_GetPhysicsObjectComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsAwake_ReturnValue) == 0x000088, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsAwake_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_9) == 0x000089, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_SwitchName_CmpSuccess) == 0x00008A, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CustomEvent_LocalPlayerController) == 0x000090, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CustomEvent_LocalPlayerController' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CustomEvent_Message) == 0x000098, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_Event_Damage) == 0x000110, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_Event_DamageTags) == 0x000118, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_Event_Momentum) == 0x000138, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_Event_HitInfo) == 0x000150, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_Event_InstigatedBy) == 0x000230, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_Event_DamageCauser) == 0x000238, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_Event_EffectContext) == 0x000240, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CustomEvent_CurrentInteractionState) == 0x000258, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CustomEvent_CurrentInteractionState' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CustomEvent_InteractingController) == 0x000260, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CustomEvent_InteractingController' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_GetDynamicMaterialInstance_ReturnValue) == 0x000268, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_GetDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000270, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_GetPlayerPawn_ReturnValue) == 0x000278, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000280, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000288, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_10) == 0x000289, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_11) == 0x00028A, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00028B, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00028C, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_BooleanOR_ReturnValue) == 0x00028D, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CustomEvent_Revealed) == 0x00028E, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CustomEvent_Revealed' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_GetValueAsBool_ReturnValue) == 0x00028F, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000290, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000294, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0002A0, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002A8, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_BooleanOR_ReturnValue_1) == 0x0002B0, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0002B1, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_GetValueAsBool_ReturnValue_1) == 0x0002B2, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_GetValueAsBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_12) == 0x0002B3, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_IsValid_ReturnValue_13) == 0x0002B4, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_GetValueAsBool_ReturnValue_2) == 0x0002B5, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_GetValueAsBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0002B6, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002B8, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002C4, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_HasHealthLeft_ReturnValue) == 0x0002D0, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_HasHealthLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_HasHealthLeft_ReturnValue_1) == 0x0002D1, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_HasHealthLeft_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002D4, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, K2Node_CustomEvent_FadeOutDuration) == 0x0002E0, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::K2Node_CustomEvent_FadeOutDuration' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_RLerp_ReturnValue) == 0x0002E8, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_ComposeRotators_ReturnValue) == 0x000300, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000318, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000330, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000410, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000418, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000430, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000438, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_ExecuteUbergraph_BP_StationProp_VendingMachine_Emote_Base::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function BP_StationProp_VendingMachine_Emote_Base.BP_StationProp_VendingMachine_Emote_Base_C.HandleLocalPlayerInteract
// 0x0001 (0x0001 - 0x0000)
struct BP_StationProp_VendingMachine_Emote_Base_C_HandleLocalPlayerInteract final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_VendingMachine_Emote_Base_C_HandleLocalPlayerInteract) == 0x000001, "Wrong alignment on BP_StationProp_VendingMachine_Emote_Base_C_HandleLocalPlayerInteract");
static_assert(sizeof(BP_StationProp_VendingMachine_Emote_Base_C_HandleLocalPlayerInteract) == 0x000001, "Wrong size on BP_StationProp_VendingMachine_Emote_Base_C_HandleLocalPlayerInteract");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleLocalPlayerInteract, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleLocalPlayerInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_StationProp_VendingMachine_Emote_Base.BP_StationProp_VendingMachine_Emote_Base_C.HandleReceiveConversationMessage
// 0x00F0 (0x00F0 - 0x0000)
struct BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage final
{
public:
	struct FClientConversationMessagePayload      ClientConversationMessagePayload;                  // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConversationNodeParameterPair         CallFunc_Array_Get_Item;                           // 0x0090(0x0020)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRequestStyleParams                    K2Node_MakeStruct_RequestStyleParams;              // 0x00C0(0x0030)(NoDestructor)
};
static_assert(alignof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage) == 0x000008, "Wrong alignment on BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage");
static_assert(sizeof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage) == 0x0000F0, "Wrong size on BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, ClientConversationMessagePayload) == 0x000000, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::ClientConversationMessagePayload' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, Temp_int_Array_Index_Variable) == 0x000088, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, Temp_bool_True_if_break_was_hit_Variable) == 0x00008C, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B4, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, CallFunc_BooleanAND_ReturnValue) == 0x0000B8, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000B9, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage, K2Node_MakeStruct_RequestStyleParams) == 0x0000C0, "Member 'BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveConversationMessage::K2Node_MakeStruct_RequestStyleParams' has a wrong offset!");

// Function BP_StationProp_VendingMachine_Emote_Base.BP_StationProp_VendingMachine_Emote_Base_C.HandleReceiveDamage
// 0x0128 (0x0128 - 0x0000)
struct BP_StationProp_VendingMachine_Emote_Base_C_HandleReceiveDamage final
{
public:
	class AFortPawn*                              InstigatingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChosenDamageResponseThreshold;                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVendingDamageResponse                 ChosenDamageResponse;                              // 0x0010(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVendingDamageResponse                 CallFunc_Array_Random_OutItem;                     // 0x0038(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVendingDamageResponse                 CallFunc_Array_Random_OutItem_1;                   // 0x0060(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVendingDamageResponse                 K2Node_MakeStruct_VendingDamageResponse;           // 0x0088(0x0020)(HasGetValueTypeHash)
	struct FVendingDamageResponse                 CallFunc_Array_Random_OutItem_2;                   // 0x00A8(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_2;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue_1;             // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue_2;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue_3;             // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
