#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_S21WaterFallPrefab_A

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_S21WaterFallPrefab_A.BP_S21WaterFallPrefab_A_C
// 0x0058 (0x02C8 - 0x0270)
class ABP_S21WaterFallPrefab_A_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Top_UnderwaterFlow;                                // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Smoke_Merged;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      WaterFallEffect;                                   // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DetailSpalsh;                                      // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Drop_Back;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Drop_Left;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DetailFoam_Left;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BottomMeshSplash;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Waterfall;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_S21WaterFallPrefab_A(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_S21WaterFallPrefab_A_C">();
	}
	static class ABP_S21WaterFallPrefab_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_S21WaterFallPrefab_A_C>();
	}
};
static_assert(alignof(ABP_S21WaterFallPrefab_A_C) == 0x000008, "Wrong alignment on ABP_S21WaterFallPrefab_A_C");
static_assert(sizeof(ABP_S21WaterFallPrefab_A_C) == 0x0002C8, "Wrong size on ABP_S21WaterFallPrefab_A_C");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, UberGraphFrame) == 0x000270, "Member 'ABP_S21WaterFallPrefab_A_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, Top_UnderwaterFlow) == 0x000278, "Member 'ABP_S21WaterFallPrefab_A_C::Top_UnderwaterFlow' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, Smoke_Merged) == 0x000280, "Member 'ABP_S21WaterFallPrefab_A_C::Smoke_Merged' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, WaterFallEffect) == 0x000288, "Member 'ABP_S21WaterFallPrefab_A_C::WaterFallEffect' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, DetailSpalsh) == 0x000290, "Member 'ABP_S21WaterFallPrefab_A_C::DetailSpalsh' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, Drop_Back) == 0x000298, "Member 'ABP_S21WaterFallPrefab_A_C::Drop_Back' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, Drop_Left) == 0x0002A0, "Member 'ABP_S21WaterFallPrefab_A_C::Drop_Left' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, DetailFoam_Left) == 0x0002A8, "Member 'ABP_S21WaterFallPrefab_A_C::DetailFoam_Left' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, BottomMeshSplash) == 0x0002B0, "Member 'ABP_S21WaterFallPrefab_A_C::BottomMeshSplash' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, Waterfall) == 0x0002B8, "Member 'ABP_S21WaterFallPrefab_A_C::Waterfall' has a wrong offset!");
static_assert(offsetof(ABP_S21WaterFallPrefab_A_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_S21WaterFallPrefab_A_C::DefaultSceneRoot' has a wrong offset!");

}

