#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SidebarCollectionScreenContainerEditTags

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SidebarCollectionScreenContainerEditTags.BP_SidebarCollectionScreenContainerEditTags_C
// 0x0088 (0x0590 - 0x0508)
class UBP_SidebarCollectionScreenContainerEditTags_C final : public UFortSidebarCollectionScreenContainerEditTags
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HBox_Tabs;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_Bottom;                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_Tabs;                             // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_Top;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Header;                                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_ButtonsList;                              // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_MobileCloseButton;                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Profile;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Tabs;                                     // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Title;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarCollectionInputTextButton_C*    TagsInfoButton;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleCommonButton_C*                  TagsInfoInputBlocker;                              // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__BP_SidebarCollectionScreenContainerEditTags_TagsInfoButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__BP_SidebarCollectionScreenContainerEditTags_WhatAreTagsInputBlocker_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_OnCollectionTabTitleChange(const ESocialTagCategory& TagCategory);
	void BP_OnShowTabsSet(bool bShowTabs);
	void BP_OnWhatAreTagsActivated();
	void BP_OnWhatAreTagsDeactivated();
	void Construct();
	void ExecuteUbergraph_BP_SidebarCollectionScreenContainerEditTags(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ToggleTagsInfoTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SidebarCollectionScreenContainerEditTags_C">();
	}
	static class UBP_SidebarCollectionScreenContainerEditTags_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SidebarCollectionScreenContainerEditTags_C>();
	}
};
static_assert(alignof(UBP_SidebarCollectionScreenContainerEditTags_C) == 0x000008, "Wrong alignment on UBP_SidebarCollectionScreenContainerEditTags_C");
static_assert(sizeof(UBP_SidebarCollectionScreenContainerEditTags_C) == 0x000590, "Wrong size on UBP_SidebarCollectionScreenContainerEditTags_C");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, UberGraphFrame) == 0x000508, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, HBox_Tabs) == 0x000510, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, Image_Background) == 0x000518, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, Image_Background_Bottom) == 0x000520, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::Image_Background_Bottom' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, Image_Background_Tabs) == 0x000528, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::Image_Background_Tabs' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, Image_Background_Top) == 0x000530, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::Image_Background_Top' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, NextTabAction) == 0x000538, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::NextTabAction' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, PreviousTabAction) == 0x000540, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, RichText_Description) == 0x000548, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::RichText_Description' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, RichText_Header) == 0x000550, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::RichText_Header' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, SafeZone_ButtonsList) == 0x000558, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::SafeZone_ButtonsList' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, SafeZone_MobileCloseButton) == 0x000560, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::SafeZone_MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, SafeZone_Profile) == 0x000568, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::SafeZone_Profile' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, SafeZone_Tabs) == 0x000570, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::SafeZone_Tabs' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, SafeZone_Title) == 0x000578, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::SafeZone_Title' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, TagsInfoButton) == 0x000580, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::TagsInfoButton' has a wrong offset!");
static_assert(offsetof(UBP_SidebarCollectionScreenContainerEditTags_C, TagsInfoInputBlocker) == 0x000588, "Member 'UBP_SidebarCollectionScreenContainerEditTags_C::TagsInfoInputBlocker' has a wrong offset!");

}

