#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StormMeshRotator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct BP_StormMeshRotator_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SafeZoneStorm_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormMeshRotator_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_StormMeshRotator_C_UserConstructionScript");
static_assert(sizeof(BP_StormMeshRotator_C_UserConstructionScript) == 0x000050, "Wrong size on BP_StormMeshRotator_C_UserConstructionScript");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_IsConsolePlatform_ReturnValue) == 0x000000, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_IsMobilePlatform_ReturnValue) == 0x000010, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000014, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue_1) == 0x00001B, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000028, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_GetActorOfClass_ReturnValue) == 0x000030, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000040, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000048, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.SetStormProgression
// 0x0004 (0x0004 - 0x0000)
struct BP_StormMeshRotator_C_SetStormProgression final
{
public:
	float                                         Progression;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormMeshRotator_C_SetStormProgression) == 0x000004, "Wrong alignment on BP_StormMeshRotator_C_SetStormProgression");
static_assert(sizeof(BP_StormMeshRotator_C_SetStormProgression) == 0x000004, "Wrong size on BP_StormMeshRotator_C_SetStormProgression");
static_assert(offsetof(BP_StormMeshRotator_C_SetStormProgression, Progression) == 0x000000, "Member 'BP_StormMeshRotator_C_SetStormProgression::Progression' has a wrong offset!");

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.setStormMeshVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_StormMeshRotator_C_setStormMeshVisibility final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormMeshRotator_C_setStormMeshVisibility) == 0x000001, "Wrong alignment on BP_StormMeshRotator_C_setStormMeshVisibility");
static_assert(sizeof(BP_StormMeshRotator_C_setStormMeshVisibility) == 0x000001, "Wrong size on BP_StormMeshRotator_C_setStormMeshVisibility");
static_assert(offsetof(BP_StormMeshRotator_C_setStormMeshVisibility, bEnabled) == 0x000000, "Member 'BP_StormMeshRotator_C_setStormMeshVisibility::bEnabled' has a wrong offset!");

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.OnStormEffectsEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_StormMeshRotator_C_OnStormEffectsEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormMeshRotator_C_OnStormEffectsEnabled) == 0x000001, "Wrong alignment on BP_StormMeshRotator_C_OnStormEffectsEnabled");
static_assert(sizeof(BP_StormMeshRotator_C_OnStormEffectsEnabled) == 0x000001, "Wrong size on BP_StormMeshRotator_C_OnStormEffectsEnabled");
static_assert(offsetof(BP_StormMeshRotator_C_OnStormEffectsEnabled, bEnabled) == 0x000000, "Member 'BP_StormMeshRotator_C_OnStormEffectsEnabled::bEnabled' has a wrong offset!");

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.initializeMobileStormSphere
// 0x0018 (0x0018 - 0x0000)
struct BP_StormMeshRotator_C_initializeMobileStormSphere final
{
public:
	TDelegate<void(const class FString& CVarName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataDrivenCVarEngineSubsystem*         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormMeshRotator_C_initializeMobileStormSphere) == 0x000008, "Wrong alignment on BP_StormMeshRotator_C_initializeMobileStormSphere");
static_assert(sizeof(BP_StormMeshRotator_C_initializeMobileStormSphere) == 0x000018, "Wrong size on BP_StormMeshRotator_C_initializeMobileStormSphere");
static_assert(offsetof(BP_StormMeshRotator_C_initializeMobileStormSphere, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_StormMeshRotator_C_initializeMobileStormSphere::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_initializeMobileStormSphere, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000010, "Member 'BP_StormMeshRotator_C_initializeMobileStormSphere::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.handleCvarChanged
// 0x0040 (0x0040 - 0x0000)
struct BP_StormMeshRotator_C_handleCvarChanged final
{
public:
	class FString                                 CVarName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_getSphereEnabled_enabled;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormMeshRotator_C_handleCvarChanged) == 0x000008, "Wrong alignment on BP_StormMeshRotator_C_handleCvarChanged");
static_assert(sizeof(BP_StormMeshRotator_C_handleCvarChanged) == 0x000040, "Wrong size on BP_StormMeshRotator_C_handleCvarChanged");
static_assert(offsetof(BP_StormMeshRotator_C_handleCvarChanged, CVarName) == 0x000000, "Member 'BP_StormMeshRotator_C_handleCvarChanged::CVarName' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_handleCvarChanged, Temp_object_Variable) == 0x000010, "Member 'BP_StormMeshRotator_C_handleCvarChanged::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_handleCvarChanged, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'BP_StormMeshRotator_C_handleCvarChanged::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_handleCvarChanged, Temp_object_Variable_1) == 0x000020, "Member 'BP_StormMeshRotator_C_handleCvarChanged::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_handleCvarChanged, CallFunc_getSphereEnabled_enabled) == 0x000028, "Member 'BP_StormMeshRotator_C_handleCvarChanged::CallFunc_getSphereEnabled_enabled' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_handleCvarChanged, Temp_bool_Variable) == 0x000029, "Member 'BP_StormMeshRotator_C_handleCvarChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_handleCvarChanged, K2Node_Select_Default) == 0x000030, "Member 'BP_StormMeshRotator_C_handleCvarChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_handleCvarChanged, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000038, "Member 'BP_StormMeshRotator_C_handleCvarChanged::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_handleCvarChanged, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000039, "Member 'BP_StormMeshRotator_C_handleCvarChanged::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.getSphereEnabled
// 0x0005 (0x0005 - 0x0000)
struct BP_StormMeshRotator_C_getSphereEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormMeshRotator_C_getSphereEnabled) == 0x000001, "Wrong alignment on BP_StormMeshRotator_C_getSphereEnabled");
static_assert(sizeof(BP_StormMeshRotator_C_getSphereEnabled) == 0x000005, "Wrong size on BP_StormMeshRotator_C_getSphereEnabled");
static_assert(offsetof(BP_StormMeshRotator_C_getSphereEnabled, Enabled) == 0x000000, "Member 'BP_StormMeshRotator_C_getSphereEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_getSphereEnabled, CallFunc_IsErebus_ReturnValue) == 0x000001, "Member 'BP_StormMeshRotator_C_getSphereEnabled::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_getSphereEnabled, CallFunc_IsMobileGame_ReturnValue) == 0x000002, "Member 'BP_StormMeshRotator_C_getSphereEnabled::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_getSphereEnabled, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'BP_StormMeshRotator_C_getSphereEnabled::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_getSphereEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'BP_StormMeshRotator_C_getSphereEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.ExecuteUbergraph_BP_StormMeshRotator
// 0x0028 (0x0028 - 0x0000)
struct BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled_1;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SafeZoneStorm_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Progression;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_getSphereEnabled_enabled;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator) == 0x000008, "Wrong alignment on BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator");
static_assert(sizeof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator) == 0x000028, "Wrong size on BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, EntryPoint) == 0x000000, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, K2Node_Event_bEnabled) == 0x000004, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::K2Node_Event_bEnabled' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, K2Node_Event_bEnabled_1) == 0x000005, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::K2Node_Event_bEnabled_1' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, K2Node_CustomEvent_Progression) == 0x000014, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::K2Node_CustomEvent_Progression' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, CallFunc_getSphereEnabled_enabled) == 0x000021, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::CallFunc_getSphereEnabled_enabled' has a wrong offset!");

}

