#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Snow_PostProcessing_Volume

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Snow_PostProcessing_Volume.BP_Snow_PostProcessing_Volume_C.ExecuteUbergraph_BP_Snow_PostProcessing_Volume
// 0x003C (0x003C - 0x0000)
struct BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume) == 0x000004, "Wrong alignment on BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume");
static_assert(sizeof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume) == 0x00003C, "Wrong size on BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, EntryPoint) == 0x000000, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000008, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_GetScalarParameterValue_ReturnValue) == 0x00000C, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000014, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_FClamp_ReturnValue_1) == 0x000028, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_FCeil_ReturnValue) == 0x00002C, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Lerp_ReturnValue) == 0x000030, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000034, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000038, "Member 'BP_Snow_PostProcessing_Volume_C_ExecuteUbergraph_BP_Snow_PostProcessing_Volume::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");

// Function BP_Snow_PostProcessing_Volume.BP_Snow_PostProcessing_Volume_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_Snow_PostProcessing_Volume_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Snow_PostProcessing_Volume_C_UserConstructionScript");
static_assert(sizeof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript) == 0x000038, "Wrong size on BP_Snow_PostProcessing_Volume_C_UserConstructionScript");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000004, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_GetScalarParameterValue_ReturnValue) == 0x00000C, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000014, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_FClamp_ReturnValue_1) == 0x000024, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_FCeil_ReturnValue) == 0x000028, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Lerp_ReturnValue) == 0x00002C, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000030, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Snow_PostProcessing_Volume_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000034, "Member 'BP_Snow_PostProcessing_Volume_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");

}

