#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StationProp_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_StationProp_Parent.BP_StationProp_Parent_C.ExecuteUbergraph_BP_StationProp_Parent
// 0x0150 (0x0150 - 0x0000)
struct BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0010(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0048(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0138(0x0018)()
};
static_assert(alignof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent) == 0x000008, "Wrong alignment on BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent");
static_assert(sizeof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent) == 0x000150, "Wrong size on BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, EntryPoint) == 0x000000, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, K2Node_Event_Damage) == 0x000008, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, K2Node_Event_DamageTags) == 0x000010, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, K2Node_Event_Momentum) == 0x000030, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, K2Node_Event_HitInfo) == 0x000048, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, K2Node_Event_InstigatedBy) == 0x000128, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, K2Node_Event_DamageCauser) == 0x000130, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent, K2Node_Event_EffectContext) == 0x000138, "Member 'BP_StationProp_Parent_C_ExecuteUbergraph_BP_StationProp_Parent::K2Node_Event_EffectContext' has a wrong offset!");

// Function BP_StationProp_Parent.BP_StationProp_Parent_C.OnDeathPlayEffects
// 0x0148 (0x0148 - 0x0000)
struct BP_StationProp_Parent_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_StationProp_Parent_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on BP_StationProp_Parent_C_OnDeathPlayEffects");
static_assert(sizeof(BP_StationProp_Parent_C_OnDeathPlayEffects) == 0x000148, "Wrong size on BP_StationProp_Parent_C_OnDeathPlayEffects");
static_assert(offsetof(BP_StationProp_Parent_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'BP_StationProp_Parent_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'BP_StationProp_Parent_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'BP_StationProp_Parent_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_OnDeathPlayEffects, HitInfo) == 0x000040, "Member 'BP_StationProp_Parent_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_OnDeathPlayEffects, InstigatedBy) == 0x000120, "Member 'BP_StationProp_Parent_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_OnDeathPlayEffects, DamageCauser) == 0x000128, "Member 'BP_StationProp_Parent_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_OnDeathPlayEffects, EffectContext) == 0x000130, "Member 'BP_StationProp_Parent_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function BP_StationProp_Parent.BP_StationProp_Parent_C.PlayServiceUsedEffects
// 0x0008 (0x0008 - 0x0000)
struct BP_StationProp_Parent_C_PlayServiceUsedEffects final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_Parent_C_PlayServiceUsedEffects) == 0x000008, "Wrong alignment on BP_StationProp_Parent_C_PlayServiceUsedEffects");
static_assert(sizeof(BP_StationProp_Parent_C_PlayServiceUsedEffects) == 0x000008, "Wrong size on BP_StationProp_Parent_C_PlayServiceUsedEffects");
static_assert(offsetof(BP_StationProp_Parent_C_PlayServiceUsedEffects, PlayerController) == 0x000000, "Member 'BP_StationProp_Parent_C_PlayServiceUsedEffects::PlayerController' has a wrong offset!");

// Function BP_StationProp_Parent.BP_StationProp_Parent_C.BlueprintCanInteract
// 0x0030 (0x0030 - 0x0000)
struct BP_StationProp_Parent_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConversationParticipantComponent*      CallFunc_FindConversationComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInActiveConversation_ReturnValue;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_Parent_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on BP_StationProp_Parent_C_BlueprintCanInteract");
static_assert(sizeof(BP_StationProp_Parent_C_BlueprintCanInteract) == 0x000030, "Wrong size on BP_StationProp_Parent_C_BlueprintCanInteract");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, CallFunc_FindConversationComponent_ReturnValue) == 0x000020, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::CallFunc_FindConversationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, CallFunc_IsInActiveConversation_ReturnValue) == 0x000029, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::CallFunc_IsInActiveConversation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002A, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'BP_StationProp_Parent_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_StationProp_Parent.BP_StationProp_Parent_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct BP_StationProp_Parent_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_StationProp_Parent_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on BP_StationProp_Parent_C_BlueprintGetInteractionString");
static_assert(sizeof(BP_StationProp_Parent_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on BP_StationProp_Parent_C_BlueprintGetInteractionString");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'BP_StationProp_Parent_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'BP_StationProp_Parent_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'BP_StationProp_Parent_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");

// Function BP_StationProp_Parent.BP_StationProp_Parent_C.BlueprintGetInteractionTime
// 0x0010 (0x0010 - 0x0000)
struct BP_StationProp_Parent_C_BlueprintGetInteractionTime final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutInteractionTime;                                // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x000C(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StationProp_Parent_C_BlueprintGetInteractionTime) == 0x000008, "Wrong alignment on BP_StationProp_Parent_C_BlueprintGetInteractionTime");
static_assert(sizeof(BP_StationProp_Parent_C_BlueprintGetInteractionTime) == 0x000010, "Wrong size on BP_StationProp_Parent_C_BlueprintGetInteractionTime");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintGetInteractionTime, InteractingPawn) == 0x000000, "Member 'BP_StationProp_Parent_C_BlueprintGetInteractionTime::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintGetInteractionTime, OutInteractionTime) == 0x000008, "Member 'BP_StationProp_Parent_C_BlueprintGetInteractionTime::OutInteractionTime' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintGetInteractionTime, InteractionBeingAttempted) == 0x00000C, "Member 'BP_StationProp_Parent_C_BlueprintGetInteractionTime::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BP_StationProp_Parent_C_BlueprintGetInteractionTime, ReturnValue) == 0x00000D, "Member 'BP_StationProp_Parent_C_BlueprintGetInteractionTime::ReturnValue' has a wrong offset!");

}

