#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeSynthController_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TimeSynth_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TimeSynthController_Base.BP_TimeSynthController_Base_C
// 0x0070 (0x02E0 - 0x0270)
class ABP_TimeSynthController_Base_C final : public AFortTimeSynthController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTimeSynthComponent*                    TimeSynth;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_TimeSynthTrackComponent_C*          CurrentTrack;                                      // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TransitionBeats;                                   // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionActive;                                  // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TimeSynthTrackComponent_C*          QueuedTransitionTrack;                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTimeSynthVolumeGroup*>          VolumeGroups;                                      // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTimeSynthClipHandle>           QueuedTransitions;                                 // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBP_TimeSynthTrackComponent_C*>  QueuedTracks;                                      // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsPlaying;                                         // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x02C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponentManager* DataTrackerManager;                                // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStoppedPermenant;                                // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CalculateMaxClipDuration(class UBP_TimeSynthTrackComponent_C* Track, int32* Duration);
	void ChangeTrack(class UBP_TimeSynthTrackComponent_C* New_Track);
	void ExecuteUbergraph_BP_TimeSynthController_Base(int32 EntryPoint);
	void FlushExtraClips(bool Exclude_Current);
	void GetIsPlaying(bool* IsPlaying_0);
	void GetTimeSynthComponent(class UTimeSynthComponent** TimeSynth_0);
	void OnQuantizationBar(ETimeSynthEventQuantization QuantizationType, int32 NumBars, float Beat);
	void OnQuantizationBeat(ETimeSynthEventQuantization QuantizationType, int32 NumBars, float Beat);
	void OnTimeSynthTrackComponentRegistered(const class UBP_TimeSynthTrackComponent_C*& Track);
	void PlayTransition(const struct FTimeSynth_TransitionData& Transition_Data, class UBP_TimeSynthTrackComponent_C* Queued_Track);
	void QueueTrackStartInternal(class UBP_TimeSynthTrackComponent_C* NewTrack);
	void ReceiveBeginPlay();
	void RegisterTrackComponents();
	void RequestTrackChange(class UBP_TimeSynthTrackComponent_C* TrackRequesting, bool* CanChangeTrack);
	void SetVolumeGroup(int32 Index_0, float Volume_Multiplier);
	void StopAllMusic(bool Play_Outro);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TimeSynthController_Base_C">();
	}
	static class ABP_TimeSynthController_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TimeSynthController_Base_C>();
	}
};
static_assert(alignof(ABP_TimeSynthController_Base_C) == 0x000008, "Wrong alignment on ABP_TimeSynthController_Base_C");
static_assert(sizeof(ABP_TimeSynthController_Base_C) == 0x0002E0, "Wrong size on ABP_TimeSynthController_Base_C");
static_assert(offsetof(ABP_TimeSynthController_Base_C, UberGraphFrame) == 0x000270, "Member 'ABP_TimeSynthController_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, TimeSynth) == 0x000278, "Member 'ABP_TimeSynthController_Base_C::TimeSynth' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, CurrentTrack) == 0x000280, "Member 'ABP_TimeSynthController_Base_C::CurrentTrack' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, TransitionBeats) == 0x000288, "Member 'ABP_TimeSynthController_Base_C::TransitionBeats' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, TransitionActive) == 0x00028C, "Member 'ABP_TimeSynthController_Base_C::TransitionActive' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, QueuedTransitionTrack) == 0x000290, "Member 'ABP_TimeSynthController_Base_C::QueuedTransitionTrack' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, VolumeGroups) == 0x000298, "Member 'ABP_TimeSynthController_Base_C::VolumeGroups' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, QueuedTransitions) == 0x0002A8, "Member 'ABP_TimeSynthController_Base_C::QueuedTransitions' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, QueuedTracks) == 0x0002B8, "Member 'ABP_TimeSynthController_Base_C::QueuedTracks' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, IsPlaying) == 0x0002C8, "Member 'ABP_TimeSynthController_Base_C::IsPlaying' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, Debug) == 0x0002C9, "Member 'ABP_TimeSynthController_Base_C::Debug' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, DataTrackerManager) == 0x0002D0, "Member 'ABP_TimeSynthController_Base_C::DataTrackerManager' has a wrong offset!");
static_assert(offsetof(ABP_TimeSynthController_Base_C, IsStoppedPermenant) == 0x0002D8, "Member 'ABP_TimeSynthController_Base_C::IsStoppedPermenant' has a wrong offset!");

}

