#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeSynthTrackComponent_DataTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_TimeSynthTrackComponent_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C
// 0x0078 (0x0220 - 0x01A8)
class UBP_TimeSynthTrackComponent_DataTracker_C : public UBP_TimeSynthTrackComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_TimeSynthTrackComponent_DataTracker_C; // 0x01A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortGameplayDataTrackerComponent*      DataTrackerComponent;                              // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DataTrackerAssigned;                               // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DataTrackerComponentClass;                         // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayDataTrackerComponentManager* DataTrackerComponentManager;                       // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AwaitingCooldownBeforeShutoff;                     // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              SoundMix;                                          // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         EnabledDataRow;                                    // 0x01E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FScalableFloat>                 TrackMixStateVolumeDataRows;                       // 0x0208(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          MixPushed;                                         // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DataTrackerUpdateTime;                             // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AssignDataTrackerComponent(class UFortGameplayDataTrackerComponent* DataTrackerComponent_0);
	void ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker(int32 EntryPoint);
	void GamePhaseChanged(EAthenaGamePhase GamePhase);
	void GetDataTrackerComponent(class UFortGameplayDataTrackerComponent** DataTrackerComponent_0);
	void GetDataTrackerComponentManager();
	void GetIsEnabled(bool* Enabled);
	void GetRemainingEventCooldown(float* Cooldown);
	void OnAnyEventValueChanged(class UFortGameplayDataTrackerComponent* Data_Tracker_Component, bool Has_Event_Values);
	void OnDataTrackerComponentRegistered(class UFortGameplayDataTrackerComponent* Data_Tracker_Component);
	void OnDataTrackerComponentUnRegistered(class UFortGameplayDataTrackerComponent* Data_Tracker_Component);
	void OnDataTrackerEnd();
	void OnDataTrackerStart();
	void OnDataTrackerUpdate();
	void OnReady_FFC0E068479278E143D010AF8EB81D0D(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void QueueTrackStop(bool Play_Outro);
	void ReceiveBeginPlay();
	void StopDataTracker();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TimeSynthTrackComponent_DataTracker_C">();
	}
	static class UBP_TimeSynthTrackComponent_DataTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TimeSynthTrackComponent_DataTracker_C>();
	}
};
static_assert(alignof(UBP_TimeSynthTrackComponent_DataTracker_C) == 0x000008, "Wrong alignment on UBP_TimeSynthTrackComponent_DataTracker_C");
static_assert(sizeof(UBP_TimeSynthTrackComponent_DataTracker_C) == 0x000220, "Wrong size on UBP_TimeSynthTrackComponent_DataTracker_C");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, UberGraphFrame_BP_TimeSynthTrackComponent_DataTracker_C) == 0x0001A8, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::UberGraphFrame_BP_TimeSynthTrackComponent_DataTracker_C' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, DataTrackerComponent) == 0x0001B0, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::DataTrackerComponent' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, DataTrackerAssigned) == 0x0001B8, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::DataTrackerAssigned' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, DataTrackerComponentClass) == 0x0001C0, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::DataTrackerComponentClass' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, DataTrackerComponentManager) == 0x0001C8, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::DataTrackerComponentManager' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, AwaitingCooldownBeforeShutoff) == 0x0001D0, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::AwaitingCooldownBeforeShutoff' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, SoundMix) == 0x0001D8, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::SoundMix' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, EnabledDataRow) == 0x0001E0, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::EnabledDataRow' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, TrackMixStateVolumeDataRows) == 0x000208, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::TrackMixStateVolumeDataRows' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, MixPushed) == 0x000218, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::MixPushed' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_DataTracker_C, DataTrackerUpdateTime) == 0x00021C, "Member 'UBP_TimeSynthTrackComponent_DataTracker_C::DataTrackerUpdateTime' has a wrong offset!");

}

