#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VideoMeshTrigger

#include "Basic.hpp"

#include "MeshNetwork_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootStopVideo
// 0x0028 (0x0028 - 0x0000)
struct BP_VideoMeshTrigger_C_RootStopVideo final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          LeaveScreen_0;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionData;                                        // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootStopVideo) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootStopVideo");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootStopVideo) == 0x000028, "Wrong size on BP_VideoMeshTrigger_C_RootStopVideo");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStopVideo, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootStopVideo::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStopVideo, LeaveScreen_0) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootStopVideo::LeaveScreen_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStopVideo, RegionData) == 0x000018, "Member 'BP_VideoMeshTrigger_C_RootStopVideo::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootStartWarming
// 0x0038 (0x0038 - 0x0000)
struct BP_VideoMeshTrigger_C_RootStartWarming final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Simple;                                            // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CDNWeights_0;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RegionData;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootStartWarming) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootStartWarming");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootStartWarming) == 0x000038, "Wrong size on BP_VideoMeshTrigger_C_RootStartWarming");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartWarming, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootStartWarming::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartWarming, Enable) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootStartWarming::Enable' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartWarming, Simple) == 0x000011, "Member 'BP_VideoMeshTrigger_C_RootStartWarming::Simple' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartWarming, CDNWeights_0) == 0x000018, "Member 'BP_VideoMeshTrigger_C_RootStartWarming::CDNWeights_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartWarming, RegionData) == 0x000028, "Member 'BP_VideoMeshTrigger_C_RootStartWarming::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootStartPiP
// 0x0038 (0x0038 - 0x0000)
struct BP_VideoMeshTrigger_C_RootStartPiP final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VideoUID_0;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LIVE;                                              // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionData;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootStartPiP) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootStartPiP");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootStartPiP) == 0x000038, "Wrong size on BP_VideoMeshTrigger_C_RootStartPiP");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartPiP, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootStartPiP::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartPiP, VideoUID_0) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootStartPiP::VideoUID_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartPiP, Enable) == 0x000020, "Member 'BP_VideoMeshTrigger_C_RootStartPiP::Enable' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartPiP, LIVE) == 0x000021, "Member 'BP_VideoMeshTrigger_C_RootStartPiP::LIVE' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootStartPiP, RegionData) == 0x000028, "Member 'BP_VideoMeshTrigger_C_RootStartPiP::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootSetScreenPrio
// 0x0028 (0x0028 - 0x0000)
struct BP_VideoMeshTrigger_C_RootSetScreenPrio final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Distance;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionData;                                        // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootSetScreenPrio) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootSetScreenPrio");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootSetScreenPrio) == 0x000028, "Wrong size on BP_VideoMeshTrigger_C_RootSetScreenPrio");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetScreenPrio, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootSetScreenPrio::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetScreenPrio, Distance) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootSetScreenPrio::Distance' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetScreenPrio, RegionData) == 0x000018, "Member 'BP_VideoMeshTrigger_C_RootSetScreenPrio::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootSetScreenMirror
// 0x0028 (0x0028 - 0x0000)
struct BP_VideoMeshTrigger_C_RootSetScreenMirror final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionData;                                        // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootSetScreenMirror) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootSetScreenMirror");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootSetScreenMirror) == 0x000028, "Wrong size on BP_VideoMeshTrigger_C_RootSetScreenMirror");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetScreenMirror, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootSetScreenMirror::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetScreenMirror, Enable) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootSetScreenMirror::Enable' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetScreenMirror, RegionData) == 0x000018, "Member 'BP_VideoMeshTrigger_C_RootSetScreenMirror::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootSetMaxBW
// 0x0028 (0x0028 - 0x0000)
struct BP_VideoMeshTrigger_C_RootSetMaxBW final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         MaxBW;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionData;                                        // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootSetMaxBW) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootSetMaxBW");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootSetMaxBW) == 0x000028, "Wrong size on BP_VideoMeshTrigger_C_RootSetMaxBW");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetMaxBW, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootSetMaxBW::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetMaxBW, MaxBW) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootSetMaxBW::MaxBW' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetMaxBW, RegionData) == 0x000018, "Member 'BP_VideoMeshTrigger_C_RootSetMaxBW::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootSetCDNWeights
// 0x0038 (0x0038 - 0x0000)
struct BP_VideoMeshTrigger_C_RootSetCDNWeights final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Weights;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          PIPToo;                                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Clear;                                             // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionData;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootSetCDNWeights) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootSetCDNWeights");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootSetCDNWeights) == 0x000038, "Wrong size on BP_VideoMeshTrigger_C_RootSetCDNWeights");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetCDNWeights, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootSetCDNWeights::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetCDNWeights, Weights) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootSetCDNWeights::Weights' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetCDNWeights, PIPToo) == 0x000020, "Member 'BP_VideoMeshTrigger_C_RootSetCDNWeights::PIPToo' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetCDNWeights, Clear) == 0x000021, "Member 'BP_VideoMeshTrigger_C_RootSetCDNWeights::Clear' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSetCDNWeights, RegionData) == 0x000028, "Member 'BP_VideoMeshTrigger_C_RootSetCDNWeights::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootSeekVideo
// 0x0028 (0x0028 - 0x0000)
struct BP_VideoMeshTrigger_C_RootSeekVideo final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Exact;                                             // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionData;                                        // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootSeekVideo) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootSeekVideo");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootSeekVideo) == 0x000028, "Wrong size on BP_VideoMeshTrigger_C_RootSeekVideo");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSeekVideo, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootSeekVideo::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSeekVideo, Time) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootSeekVideo::Time' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSeekVideo, Exact) == 0x000014, "Member 'BP_VideoMeshTrigger_C_RootSeekVideo::Exact' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootSeekVideo, RegionData) == 0x000018, "Member 'BP_VideoMeshTrigger_C_RootSeekVideo::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootPlayVideo
// 0x0040 (0x0040 - 0x0000)
struct BP_VideoMeshTrigger_C_RootPlayVideo final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VideoUID_0;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         PIP;                                               // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LIVE;                                              // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Distance;                                          // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionData;                                        // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootPlayVideo) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootPlayVideo");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootPlayVideo) == 0x000040, "Wrong size on BP_VideoMeshTrigger_C_RootPlayVideo");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootPlayVideo, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootPlayVideo::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootPlayVideo, VideoUID_0) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootPlayVideo::VideoUID_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootPlayVideo, PIP) == 0x000020, "Member 'BP_VideoMeshTrigger_C_RootPlayVideo::PIP' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootPlayVideo, LIVE) == 0x000024, "Member 'BP_VideoMeshTrigger_C_RootPlayVideo::LIVE' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootPlayVideo, Distance) == 0x000028, "Member 'BP_VideoMeshTrigger_C_RootPlayVideo::Distance' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootPlayVideo, RegionData) == 0x000030, "Member 'BP_VideoMeshTrigger_C_RootPlayVideo::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootForcePiP
// 0x0028 (0x0028 - 0x0000)
struct BP_VideoMeshTrigger_C_RootForcePiP final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int64                                         Counter;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 RegionData;                                        // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootForcePiP) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootForcePiP");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootForcePiP) == 0x000028, "Wrong size on BP_VideoMeshTrigger_C_RootForcePiP");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootForcePiP, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootForcePiP::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootForcePiP, Counter) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootForcePiP::Counter' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootForcePiP, RegionData) == 0x000018, "Member 'BP_VideoMeshTrigger_C_RootForcePiP::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootEnableLoopVideo
// 0x0020 (0x0020 - 0x0000)
struct BP_VideoMeshTrigger_C_RootEnableLoopVideo final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RegionData;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootEnableLoopVideo) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootEnableLoopVideo");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootEnableLoopVideo) == 0x000020, "Wrong size on BP_VideoMeshTrigger_C_RootEnableLoopVideo");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootEnableLoopVideo, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootEnableLoopVideo::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootEnableLoopVideo, RegionData) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootEnableLoopVideo::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootDisableLoopVideo
// 0x0020 (0x0020 - 0x0000)
struct BP_VideoMeshTrigger_C_RootDisableLoopVideo final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RegionData;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootDisableLoopVideo) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootDisableLoopVideo");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootDisableLoopVideo) == 0x000020, "Wrong size on BP_VideoMeshTrigger_C_RootDisableLoopVideo");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootDisableLoopVideo, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootDisableLoopVideo::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootDisableLoopVideo, RegionData) == 0x000010, "Member 'BP_VideoMeshTrigger_C_RootDisableLoopVideo::RegionData' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.RootClearAllData
// 0x0010 (0x0010 - 0x0000)
struct BP_VideoMeshTrigger_C_RootClearAllData final
{
public:
	class FString                                 ScreeName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_RootClearAllData) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_RootClearAllData");
static_assert(sizeof(BP_VideoMeshTrigger_C_RootClearAllData) == 0x000010, "Wrong size on BP_VideoMeshTrigger_C_RootClearAllData");
static_assert(offsetof(BP_VideoMeshTrigger_C_RootClearAllData, ScreeName) == 0x000000, "Member 'BP_VideoMeshTrigger_C_RootClearAllData::ScreeName' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.PrintIncomingData
// 0x0070 (0x0070 - 0x0000)
struct BP_VideoMeshTrigger_C_PrintIncomingData final
{
public:
	class FString                                 ScreenName_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VideoUID_0;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Command;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_PrintIncomingData) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_PrintIncomingData");
static_assert(sizeof(BP_VideoMeshTrigger_C_PrintIncomingData) == 0x000070, "Wrong size on BP_VideoMeshTrigger_C_PrintIncomingData");
static_assert(offsetof(BP_VideoMeshTrigger_C_PrintIncomingData, ScreenName_0) == 0x000000, "Member 'BP_VideoMeshTrigger_C_PrintIncomingData::ScreenName_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PrintIncomingData, VideoUID_0) == 0x000010, "Member 'BP_VideoMeshTrigger_C_PrintIncomingData::VideoUID_0' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PrintIncomingData, Command) == 0x000020, "Member 'BP_VideoMeshTrigger_C_PrintIncomingData::Command' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PrintIncomingData, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_VideoMeshTrigger_C_PrintIncomingData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PrintIncomingData, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'BP_VideoMeshTrigger_C_PrintIncomingData::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PrintIncomingData, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000050, "Member 'BP_VideoMeshTrigger_C_PrintIncomingData::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PrintIncomingData, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000060, "Member 'BP_VideoMeshTrigger_C_PrintIncomingData::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.PIPAlso Version
// 0x0060 (0x0060 - 0x0000)
struct BP_VideoMeshTrigger_C_PIPAlso_Version final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LIVE;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VUID;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionData;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMeshRegionLockData_Int                CallFunc_MeshGetRegionValue_Int_OutItem;           // 0x0038(0x0020)()
	bool                                          CallFunc_MeshGetRegionValue_Int_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_PIPAlso_Version) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_PIPAlso_Version");
static_assert(sizeof(BP_VideoMeshTrigger_C_PIPAlso_Version) == 0x000060, "Wrong size on BP_VideoMeshTrigger_C_PIPAlso_Version");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, Version) == 0x000000, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::Version' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, LIVE) == 0x000004, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::LIVE' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, VUID) == 0x000008, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::VUID' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, Enable) == 0x000018, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::Enable' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, RegionData) == 0x000020, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::RegionData' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000031, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000032, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, CallFunc_BooleanOR_ReturnValue) == 0x000033, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, CallFunc_MeshGetRegionValue_Int_OutItem) == 0x000038, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::CallFunc_MeshGetRegionValue_Int_OutItem' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, CallFunc_MeshGetRegionValue_Int_ReturnValue) == 0x000058, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::CallFunc_MeshGetRegionValue_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00005A, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_PIPAlso_Version, CallFunc_BooleanOR_ReturnValue_1) == 0x00005B, "Member 'BP_VideoMeshTrigger_C_PIPAlso_Version::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.OnRep_StartWarmingUTCTime
// 0x0028 (0x0028 - 0x0000)
struct BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime final
{
public:
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          CallFunc_GetMeshNetworkNodeType_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime");
static_assert(sizeof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime) == 0x000028, "Wrong size on BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000000, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue) == 0x000004, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime, CallFunc_GetMeshNetworkNodeType_ReturnValue) == 0x000010, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime::CallFunc_GetMeshNetworkNodeType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000018, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime, CallFunc_GetTotalSeconds_ReturnValue) == 0x000020, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingUTCTime::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.OnRep_StartWarmingServerTimeSeconds
// 0x0080 (0x0080 - 0x0000)
struct BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds final
{
public:
	float                                         CachedServerWorldTimeSeconds;                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds");
static_assert(sizeof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds) == 0x000080, "Wrong size on BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CachedServerWorldTimeSeconds) == 0x000000, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CachedServerWorldTimeSeconds' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000020, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000058, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'BP_VideoMeshTrigger_C_OnRep_StartWarmingServerTimeSeconds::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.OnRep_Region_StartWarmingUTCTime
// 0x0080 (0x0080 - 0x0000)
struct BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime final
{
public:
	struct FMeshRegionLockData_Float              K2Node_MakeStruct_MeshRegionLockData_Float;        // 0x0000(0x0020)()
	struct FMeshRegionLockData_DateTime           CallFunc_MeshGetRegionValue_DateTime_OutItem;      // 0x0020(0x0020)()
	bool                                          CallFunc_MeshGetRegionValue_DateTime_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMeshRegionLockData_Float              K2Node_MakeStruct_MeshRegionLockData_Float_1;      // 0x0060(0x0020)()
};
static_assert(alignof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime");
static_assert(sizeof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime) == 0x000080, "Wrong size on BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime, K2Node_MakeStruct_MeshRegionLockData_Float) == 0x000000, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime::K2Node_MakeStruct_MeshRegionLockData_Float' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime, CallFunc_MeshGetRegionValue_DateTime_OutItem) == 0x000020, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime::CallFunc_MeshGetRegionValue_DateTime_OutItem' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime, CallFunc_MeshGetRegionValue_DateTime_ReturnValue) == 0x000040, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime::CallFunc_MeshGetRegionValue_DateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000048, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue) == 0x000050, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime, CallFunc_GetTotalSeconds_ReturnValue) == 0x000054, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000058, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime, K2Node_MakeStruct_MeshRegionLockData_Float_1) == 0x000060, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingUTCTime::K2Node_MakeStruct_MeshRegionLockData_Float_1' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.OnRep_Region_StartWarmingServerTimeSeconds
// 0x0070 (0x0070 - 0x0000)
struct BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds final
{
public:
	float                                         CachedServerWorldTimeSeconds;                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMeshRegionLockData_Bool               CallFunc_MeshGetRegionValue_Bool_OutItem;          // 0x0008(0x0020)()
	bool                                          CallFunc_MeshGetRegionValue_Bool_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMeshRegionLockData_Bool               CallFunc_MeshGetRegionValue_Bool_OutItem_1;        // 0x0038(0x0020)()
	bool                                          CallFunc_MeshGetRegionValue_Bool_ReturnValue_1;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          CallFunc_GetMeshNetworkNodeType_ReturnValue;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          CallFunc_GetMeshNetworkNodeType_ReturnValue_1;     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds");
static_assert(sizeof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds) == 0x000070, "Wrong size on BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CachedServerWorldTimeSeconds) == 0x000000, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CachedServerWorldTimeSeconds' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CallFunc_MeshGetRegionValue_Bool_OutItem) == 0x000008, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CallFunc_MeshGetRegionValue_Bool_OutItem' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CallFunc_MeshGetRegionValue_Bool_ReturnValue) == 0x000028, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CallFunc_MeshGetRegionValue_Bool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000029, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CallFunc_MeshGetRegionValue_Bool_OutItem_1) == 0x000038, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CallFunc_MeshGetRegionValue_Bool_OutItem_1' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CallFunc_MeshGetRegionValue_Bool_ReturnValue_1) == 0x000058, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CallFunc_MeshGetRegionValue_Bool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CallFunc_GetMeshNetworkNodeType_ReturnValue) == 0x000059, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CallFunc_GetMeshNetworkNodeType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, K2Node_SwitchEnum_CmpSuccess) == 0x00005A, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000060, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, CallFunc_GetMeshNetworkNodeType_ReturnValue_1) == 0x000068, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::CallFunc_GetMeshNetworkNodeType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds, K2Node_SwitchEnum_CmpSuccess_1) == 0x000069, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_StartWarmingServerTimeSeconds::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function BP_VideoMeshTrigger.BP_VideoMeshTrigger_C.OnRep_Region_PlayUTCTime
// 0x0078 (0x0078 - 0x0000)
struct BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime final
{
public:
	class UMeshNetworkSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          CallFunc_GetMeshNetworkNodeType_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMeshRegionLockData_Float              K2Node_MakeStruct_MeshRegionLockData_Float;        // 0x0010(0x0020)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMeshRegionLockData_Float              K2Node_MakeStruct_MeshRegionLockData_Float_1;      // 0x0058(0x0020)()
};
static_assert(alignof(BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime) == 0x000008, "Wrong alignment on BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime");
static_assert(sizeof(BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime) == 0x000078, "Wrong size on BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime, CallFunc_GetMeshNetworkNodeType_ReturnValue) == 0x000008, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime::CallFunc_GetMeshNetworkNodeType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime, K2Node_MakeStruct_MeshRegionLockData_Float) == 0x000010, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime::K2Node_MakeStruct_MeshRegionLockData_Float' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000034, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue) == 0x000038, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime, CallFunc_UtcNow_ReturnValue) == 0x000040, "Member 'BP_VideoMeshTrigger_C_OnRep_Region_PlayUTCTime::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
