#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VolumetricsFN_Loader

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_VolumetricsFN_Loader.BP_VolumetricsFN_Loader_C.ExecuteUbergraph_BP_VolumetricsFN_Loader
// 0x0088 (0x0088 - 0x0000)
struct BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelLoaded_ReturnValue;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_quality;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& CVarName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_CVarName;                       // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataDrivenCVarEngineSubsystem*         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelLoaded_ReturnValue_1;              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader) == 0x000008, "Wrong alignment on BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader");
static_assert(sizeof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader) == 0x000088, "Wrong size on BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, EntryPoint) == 0x000000, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_GetStreamingLevel_ReturnValue) == 0x000008, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_IsLevelLoaded_ReturnValue) == 0x000012, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_IsLevelLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, K2Node_CustomEvent_quality) == 0x000014, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::K2Node_CustomEvent_quality' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess) == 0x000028, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue) == 0x000030, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_SelectString_ReturnValue) == 0x000048, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, K2Node_CustomEvent_CVarName) == 0x000058, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::K2Node_CustomEvent_CVarName' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000068, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000070, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_IsLevelLoaded_ReturnValue_1) == 0x000079, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_IsLevelLoaded_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x00007C, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_VolumetricsFN_Loader_C_ExecuteUbergraph_BP_VolumetricsFN_Loader::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_VolumetricsFN_Loader.BP_VolumetricsFN_Loader_C.initVolumetricsFromCvar
// 0x0008 (0x0008 - 0x0000)
struct BP_VolumetricsFN_Loader_C_initVolumetricsFromCvar final
{
public:
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolumetricsFN_Loader_C_initVolumetricsFromCvar) == 0x000004, "Wrong alignment on BP_VolumetricsFN_Loader_C_initVolumetricsFromCvar");
static_assert(sizeof(BP_VolumetricsFN_Loader_C_initVolumetricsFromCvar) == 0x000008, "Wrong size on BP_VolumetricsFN_Loader_C_initVolumetricsFromCvar");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_initVolumetricsFromCvar, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000000, "Member 'BP_VolumetricsFN_Loader_C_initVolumetricsFromCvar::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_initVolumetricsFromCvar, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_VolumetricsFN_Loader_C_initVolumetricsFromCvar::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_VolumetricsFN_Loader.BP_VolumetricsFN_Loader_C.OnDataDrivenCVarDelegate_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_VolumetricsFN_Loader_C_OnDataDrivenCVarDelegate_Event_0 final
{
public:
	class FString                                 CVarName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolumetricsFN_Loader_C_OnDataDrivenCVarDelegate_Event_0) == 0x000008, "Wrong alignment on BP_VolumetricsFN_Loader_C_OnDataDrivenCVarDelegate_Event_0");
static_assert(sizeof(BP_VolumetricsFN_Loader_C_OnDataDrivenCVarDelegate_Event_0) == 0x000010, "Wrong size on BP_VolumetricsFN_Loader_C_OnDataDrivenCVarDelegate_Event_0");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_OnDataDrivenCVarDelegate_Event_0, CVarName) == 0x000000, "Member 'BP_VolumetricsFN_Loader_C_OnDataDrivenCVarDelegate_Event_0::CVarName' has a wrong offset!");

// Function BP_VolumetricsFN_Loader.BP_VolumetricsFN_Loader_C.ToggleStormMeshVisibility
// 0x0028 (0x0028 - 0x0000)
struct BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SafeZoneStorm_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_StormMeshRotator_C*                 CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility) == 0x000008, "Wrong alignment on BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility");
static_assert(sizeof(BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility) == 0x000028, "Wrong size on BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility, Visibility) == 0x000000, "Member 'BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility::Visibility' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000018, "Member 'BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_VolumetricsFN_Loader_C_ToggleStormMeshVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_VolumetricsFN_Loader.BP_VolumetricsFN_Loader_C.ValidateVolumetricsFromQuality
// 0x0004 (0x0004 - 0x0000)
struct BP_VolumetricsFN_Loader_C_ValidateVolumetricsFromQuality final
{
public:
	int32                                         Quality;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolumetricsFN_Loader_C_ValidateVolumetricsFromQuality) == 0x000004, "Wrong alignment on BP_VolumetricsFN_Loader_C_ValidateVolumetricsFromQuality");
static_assert(sizeof(BP_VolumetricsFN_Loader_C_ValidateVolumetricsFromQuality) == 0x000004, "Wrong size on BP_VolumetricsFN_Loader_C_ValidateVolumetricsFromQuality");
static_assert(offsetof(BP_VolumetricsFN_Loader_C_ValidateVolumetricsFromQuality, Quality) == 0x000000, "Member 'BP_VolumetricsFN_Loader_C_ValidateVolumetricsFromQuality::Quality' has a wrong offset!");

}

