#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildingInfoIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BuildingInfoIndicator.BuildingInfoIndicator_C
// 0x0240 (0x05F8 - 0x03B8)
class UBuildingInfoIndicator_C final : public UFortBuildingInfoIndicatorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         _Horizontal_Box__Build_Edit;                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         _Horizontal_Box__Edit;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         _Horizontal_Box__Material;                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         _Image__Resource_Type_Icon;                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               _Size_Box__Confirm;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               _Size_Box__Edit__standalone_;                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           _Vertical_Box__Build_Subset;                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildingBar_C*                         _Widget__Building_HP___Trap_Bars;                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_4;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxCycleTrap;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxPlaceTrap;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxUpgradeRepair;                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_QuickEditPreview;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_QuickEditPreview_1;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_QuickEditPreview_2;                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_QuickEditPreview_Touch;                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         ImageResourceTypeIconwithRotate;                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Input;                                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindBuild;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeyBindBuild_Edit;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindConfirm;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindCycleTrapLeft;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindEdit;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindEditstandalone;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindMaterial;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindPickTrapstandalone;                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindPlaceTrapLeft;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindPlaceTrapstandalone;                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindReset;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindRotate;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindTrapLower;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindUpgradeRepair;                              // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxTrapstandalone;                             // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxTriOption;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            SwitcherInteractions;                              // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            SwitcherSideOption1;                               // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            SwitcherSideOption2;                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInteractionCost;                               // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInteractionCostwithRotate;                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInteractionName;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPickTrap;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPickTrapBottom;                                // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPickTrapLabel;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TrapOptions;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxBuildWithRotate;                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxLowerOption;                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxPlaceTrapstandalone;                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortFocusedBuildingInfo               BuildingInfo;                                      // 0x0540(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Current_Health;                                    // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HealthFadeTimerHandle;                             // 0x0590(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Current_Durability;                                // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UMaterialInstance*>   QuickEditMap;                                      // 0x05A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   CurrentQuickEditClass;                             // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent_0(const struct FFortFocusedBuildingInfo& FocusedBuildingInfo);
	void ExecuteUbergraph_BuildingInfoIndicator(int32 EntryPoint);
	void HandleAttachedTrapChanged(class ABuildingTrap* BuildingTrap);
	void HandleBuildingBigHealthChanged(const class FText& HP_Value, float HP_Percent);
	void HandleBuildingFocused(class ABuildingActor* FocusedBuilding);
	void HandleBuildingHealthChanged(float Health);
	void HandleBuildPreviewMarkerVisibilityChanged(bool Hidden);
	void HandlePlayerTargetingChanged(bool bIsTargeting);
	void HandleQuickbarFocusChanged(EFortQuickBars QuickBar, int32 QuickBarSlot);
	void HandleQuickEditOptionChanged(class FName Building_Class_Name, bool Is_Mirrored, uint8 Rotations);
	void HandleTrapDurabilityChanged(float CurrentDurability, float MaxDurability);
	void HideHealth();
	bool IsCurrentBuildingBeingRepaired();
	void IsCurrentWeaponTheMoveTool(bool* Result);
	void OnInputTypeChanged(ECommonInputType Input_Type);
	void RefreshBuildingInfo();
	void UpdateBuildingInfo(struct FFortFocusedBuildingInfo& NewBuildingInfo);
	void UpdateBuildingInfo_InteractionWidgets(bool Interactable, bool CanBePlayerEdited, bool IsAnyTrapAttached, bool IsTrapAttachedFacingPlayer, bool IsPreviewTrapAttached, EFortBuildingInteraction InteractionType, int32 InteractionCost, EFortResourceType BuildingMaterial);
	void UpdateBuildingRepairCost(int32 NewInteractionCost);
	void UpdateTrapWidgets(bool Place_Trap_Available, EFortBuildingInteraction Interaction_Type, class UKeybindWidgetDark_C* KeyBind, class UCommonTextBlock* Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BuildingInfoIndicator_C">();
	}
	static class UBuildingInfoIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingInfoIndicator_C>();
	}
};
static_assert(alignof(UBuildingInfoIndicator_C) == 0x000008, "Wrong alignment on UBuildingInfoIndicator_C");
static_assert(sizeof(UBuildingInfoIndicator_C) == 0x0005F8, "Wrong size on UBuildingInfoIndicator_C");
static_assert(offsetof(UBuildingInfoIndicator_C, UberGraphFrame) == 0x0003B8, "Member 'UBuildingInfoIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Horizontal_Box__Build_Edit) == 0x0003C0, "Member 'UBuildingInfoIndicator_C::_Horizontal_Box__Build_Edit' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Horizontal_Box__Edit) == 0x0003C8, "Member 'UBuildingInfoIndicator_C::_Horizontal_Box__Edit' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Horizontal_Box__Material) == 0x0003D0, "Member 'UBuildingInfoIndicator_C::_Horizontal_Box__Material' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Image__Resource_Type_Icon) == 0x0003D8, "Member 'UBuildingInfoIndicator_C::_Image__Resource_Type_Icon' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Size_Box__Confirm) == 0x0003E0, "Member 'UBuildingInfoIndicator_C::_Size_Box__Confirm' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Size_Box__Edit__standalone_) == 0x0003E8, "Member 'UBuildingInfoIndicator_C::_Size_Box__Edit__standalone_' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Vertical_Box__Build_Subset) == 0x0003F0, "Member 'UBuildingInfoIndicator_C::_Vertical_Box__Build_Subset' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Widget__Building_HP___Trap_Bars) == 0x0003F8, "Member 'UBuildingInfoIndicator_C::_Widget__Building_HP___Trap_Bars' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, CommonTextBlock_0) == 0x000400, "Member 'UBuildingInfoIndicator_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HorizontalBox_4) == 0x000408, "Member 'UBuildingInfoIndicator_C::HorizontalBox_4' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HorizontalBoxCycleTrap) == 0x000410, "Member 'UBuildingInfoIndicator_C::HorizontalBoxCycleTrap' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HorizontalBoxPlaceTrap) == 0x000418, "Member 'UBuildingInfoIndicator_C::HorizontalBoxPlaceTrap' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HorizontalBoxUpgradeRepair) == 0x000420, "Member 'UBuildingInfoIndicator_C::HorizontalBoxUpgradeRepair' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, Image_QuickEditPreview) == 0x000428, "Member 'UBuildingInfoIndicator_C::Image_QuickEditPreview' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, Image_QuickEditPreview_1) == 0x000430, "Member 'UBuildingInfoIndicator_C::Image_QuickEditPreview_1' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, Image_QuickEditPreview_2) == 0x000438, "Member 'UBuildingInfoIndicator_C::Image_QuickEditPreview_2' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, Image_QuickEditPreview_Touch) == 0x000440, "Member 'UBuildingInfoIndicator_C::Image_QuickEditPreview_Touch' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, ImageResourceTypeIconwithRotate) == 0x000448, "Member 'UBuildingInfoIndicator_C::ImageResourceTypeIconwithRotate' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, Input) == 0x000450, "Member 'UBuildingInfoIndicator_C::Input' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindBuild) == 0x000458, "Member 'UBuildingInfoIndicator_C::KeybindBuild' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeyBindBuild_Edit) == 0x000460, "Member 'UBuildingInfoIndicator_C::KeyBindBuild_Edit' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindConfirm) == 0x000468, "Member 'UBuildingInfoIndicator_C::KeybindConfirm' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindCycleTrapLeft) == 0x000470, "Member 'UBuildingInfoIndicator_C::KeybindCycleTrapLeft' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindEdit) == 0x000478, "Member 'UBuildingInfoIndicator_C::KeybindEdit' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindEditstandalone) == 0x000480, "Member 'UBuildingInfoIndicator_C::KeybindEditstandalone' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindMaterial) == 0x000488, "Member 'UBuildingInfoIndicator_C::KeybindMaterial' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindPickTrapstandalone) == 0x000490, "Member 'UBuildingInfoIndicator_C::KeybindPickTrapstandalone' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindPlaceTrapLeft) == 0x000498, "Member 'UBuildingInfoIndicator_C::KeybindPlaceTrapLeft' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindPlaceTrapstandalone) == 0x0004A0, "Member 'UBuildingInfoIndicator_C::KeybindPlaceTrapstandalone' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindReset) == 0x0004A8, "Member 'UBuildingInfoIndicator_C::KeybindReset' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindRotate) == 0x0004B0, "Member 'UBuildingInfoIndicator_C::KeybindRotate' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindTrapLower) == 0x0004B8, "Member 'UBuildingInfoIndicator_C::KeybindTrapLower' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindUpgradeRepair) == 0x0004C0, "Member 'UBuildingInfoIndicator_C::KeybindUpgradeRepair' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SizeBoxTrapstandalone) == 0x0004C8, "Member 'UBuildingInfoIndicator_C::SizeBoxTrapstandalone' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SizeBoxTriOption) == 0x0004D0, "Member 'UBuildingInfoIndicator_C::SizeBoxTriOption' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SwitcherInteractions) == 0x0004D8, "Member 'UBuildingInfoIndicator_C::SwitcherInteractions' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SwitcherSideOption1) == 0x0004E0, "Member 'UBuildingInfoIndicator_C::SwitcherSideOption1' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SwitcherSideOption2) == 0x0004E8, "Member 'UBuildingInfoIndicator_C::SwitcherSideOption2' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextInteractionCost) == 0x0004F0, "Member 'UBuildingInfoIndicator_C::TextInteractionCost' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextInteractionCostwithRotate) == 0x0004F8, "Member 'UBuildingInfoIndicator_C::TextInteractionCostwithRotate' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextInteractionName) == 0x000500, "Member 'UBuildingInfoIndicator_C::TextInteractionName' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextPickTrap) == 0x000508, "Member 'UBuildingInfoIndicator_C::TextPickTrap' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextPickTrapBottom) == 0x000510, "Member 'UBuildingInfoIndicator_C::TextPickTrapBottom' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextPickTrapLabel) == 0x000518, "Member 'UBuildingInfoIndicator_C::TextPickTrapLabel' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TrapOptions) == 0x000520, "Member 'UBuildingInfoIndicator_C::TrapOptions' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, VerticalBoxBuildWithRotate) == 0x000528, "Member 'UBuildingInfoIndicator_C::VerticalBoxBuildWithRotate' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, VerticalBoxLowerOption) == 0x000530, "Member 'UBuildingInfoIndicator_C::VerticalBoxLowerOption' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, VerticalBoxPlaceTrapstandalone) == 0x000538, "Member 'UBuildingInfoIndicator_C::VerticalBoxPlaceTrapstandalone' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, BuildingInfo) == 0x000540, "Member 'UBuildingInfoIndicator_C::BuildingInfo' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, Current_Health) == 0x000588, "Member 'UBuildingInfoIndicator_C::Current_Health' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HealthFadeTimerHandle) == 0x000590, "Member 'UBuildingInfoIndicator_C::HealthFadeTimerHandle' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, Current_Durability) == 0x000598, "Member 'UBuildingInfoIndicator_C::Current_Durability' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, QuickEditMap) == 0x0005A0, "Member 'UBuildingInfoIndicator_C::QuickEditMap' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, CurrentQuickEditClass) == 0x0005F0, "Member 'UBuildingInfoIndicator_C::CurrentQuickEditClass' has a wrong offset!");

}

