#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildingProp_4LayerMaterial_Struct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BuildingProp_4LayerMaterial_Struct.BuildingProp_4LayerMaterial_Struct
// 0x0060 (0x0060 - 0x0000)
struct FBuildingProp_4LayerMaterial_Struct final
{
public:
	int32                                         index_11_82DE82864BFEE42B9F075A9F42967D6C;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_12_A1A3AF804E767F217AE1D1A1E6803A2F;           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FLinearColor>        emissiveColors_13_FB19D1914B992DF77232C1AE3E5E4C83; // 0x0010(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FBuildingProp_4LayerMaterial_Struct) == 0x000008, "Wrong alignment on FBuildingProp_4LayerMaterial_Struct");
static_assert(sizeof(FBuildingProp_4LayerMaterial_Struct) == 0x000060, "Wrong size on FBuildingProp_4LayerMaterial_Struct");
static_assert(offsetof(FBuildingProp_4LayerMaterial_Struct, index_11_82DE82864BFEE42B9F075A9F42967D6C) == 0x000000, "Member 'FBuildingProp_4LayerMaterial_Struct::index_11_82DE82864BFEE42B9F075A9F42967D6C' has a wrong offset!");
static_assert(offsetof(FBuildingProp_4LayerMaterial_Struct, MID_12_A1A3AF804E767F217AE1D1A1E6803A2F) == 0x000008, "Member 'FBuildingProp_4LayerMaterial_Struct::MID_12_A1A3AF804E767F217AE1D1A1E6803A2F' has a wrong offset!");
static_assert(offsetof(FBuildingProp_4LayerMaterial_Struct, emissiveColors_13_FB19D1914B992DF77232C1AE3E5E4C83) == 0x000010, "Member 'FBuildingProp_4LayerMaterial_Struct::emissiveColors_13_FB19D1914B992DF77232C1AE3E5E4C83' has a wrong offset!");

}

