#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Burt_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Burt_AnimBP.Burt_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Burt_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Burt_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Burt_AnimBP_C_AnimGraph");
static_assert(sizeof(Burt_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Burt_AnimBP_C_AnimGraph");
static_assert(offsetof(Burt_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Burt_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Burt_AnimBP.Burt_AnimBP_C.ExecuteUbergraph_Burt_AnimBP
// 0x0008 (0x0008 - 0x0000)
struct Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP) == 0x000004, "Wrong alignment on Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP");
static_assert(sizeof(Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP) == 0x000008, "Wrong size on Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP");
static_assert(offsetof(Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP, EntryPoint) == 0x000000, "Member 'Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'Burt_AnimBP_C_ExecuteUbergraph_Burt_AnimBP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function Burt_AnimBP.Burt_AnimBP_C.Fauna Idle
// 0x0020 (0x0020 - 0x0000)
struct Burt_AnimBP_C_Fauna_Idle final
{
public:
	struct FPoseLink                              InPose_Idle;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Fauna_Idle_0;                                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Burt_AnimBP_C_Fauna_Idle) == 0x000008, "Wrong alignment on Burt_AnimBP_C_Fauna_Idle");
static_assert(sizeof(Burt_AnimBP_C_Fauna_Idle) == 0x000020, "Wrong size on Burt_AnimBP_C_Fauna_Idle");
static_assert(offsetof(Burt_AnimBP_C_Fauna_Idle, InPose_Idle) == 0x000000, "Member 'Burt_AnimBP_C_Fauna_Idle::InPose_Idle' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP_C_Fauna_Idle, Fauna_Idle_0) == 0x000010, "Member 'Burt_AnimBP_C_Fauna_Idle::Fauna_Idle_0' has a wrong offset!");

// Function Burt_AnimBP.Burt_AnimBP_C.Fauna IdleTurn
// 0x0020 (0x0020 - 0x0000)
struct Burt_AnimBP_C_Fauna_IdleTurn final
{
public:
	struct FPoseLink                              InPose_IdleTurn;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Fauna_IdleTurn_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Burt_AnimBP_C_Fauna_IdleTurn) == 0x000008, "Wrong alignment on Burt_AnimBP_C_Fauna_IdleTurn");
static_assert(sizeof(Burt_AnimBP_C_Fauna_IdleTurn) == 0x000020, "Wrong size on Burt_AnimBP_C_Fauna_IdleTurn");
static_assert(offsetof(Burt_AnimBP_C_Fauna_IdleTurn, InPose_IdleTurn) == 0x000000, "Member 'Burt_AnimBP_C_Fauna_IdleTurn::InPose_IdleTurn' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP_C_Fauna_IdleTurn, Fauna_IdleTurn_0) == 0x000010, "Member 'Burt_AnimBP_C_Fauna_IdleTurn::Fauna_IdleTurn_0' has a wrong offset!");

}

