#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButtonReplay

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ButtonReplay.ButtonReplay_C
// 0x0160 (0x1190 - 0x1030)
class UButtonReplay_C final : public UIconTextButtonSpectatorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Background;                                        // 0x1038(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x1040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RightExtraContentSlot;                             // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x1060(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_1078[0x8];                                     // 0x1078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconBrush;                                         // 0x1080(0x00C0)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 ControllerInputStyle;                              // 0x1140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x1148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x1150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1151[0x3];                                     // 0x1151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HoveredColor;                                      // 0x1154(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultColor;                                      // 0x1164(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SelectedColor;                                     // 0x1174(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHideIcon;                                    // 0x1184(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateButton();
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_ButtonReplay(int32 EntryPoint);
	void InitializeButton();
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnCurrentTextStyleChanged();
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void PreConstruct(bool IsDesignTime);
	void Set_Icon(const struct FSlateBrush& IconBrush_0);
	void SetContentAlignment(EHorizontalAlignment ContentAlignment_0);
	void SetControllerStyle(class UClass* ControllerInputStyle_0);
	void SetMouseKeyboardStyle(class UClass* ControllerInputStyle_0);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void SetText(const class FText& Text);
	void UpdateContentAlignment();
	void UpdateStyle(bool UsingGamepad);
	void UpdateText();
	void UpdateTextAndStyle(bool bUsingGamepad);
	void UpdateTextStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ButtonReplay_C">();
	}
	static class UButtonReplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UButtonReplay_C>();
	}
};
static_assert(alignof(UButtonReplay_C) == 0x000010, "Wrong alignment on UButtonReplay_C");
static_assert(sizeof(UButtonReplay_C) == 0x001190, "Wrong size on UButtonReplay_C");
static_assert(offsetof(UButtonReplay_C, UberGraphFrame) == 0x001030, "Member 'UButtonReplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, Background) == 0x001038, "Member 'UButtonReplay_C::Background' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, CenterButtonTextWidget) == 0x001040, "Member 'UButtonReplay_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, ContentBorder) == 0x001048, "Member 'UButtonReplay_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, Image) == 0x001050, "Member 'UButtonReplay_C::Image' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, RightExtraContentSlot) == 0x001058, "Member 'UButtonReplay_C::RightExtraContentSlot' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, ButtonText) == 0x001060, "Member 'UButtonReplay_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, IconBrush) == 0x001080, "Member 'UButtonReplay_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, ControllerInputStyle) == 0x001140, "Member 'UButtonReplay_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, MouseKeyboardStyle) == 0x001148, "Member 'UButtonReplay_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, ContentAlignment) == 0x001150, "Member 'UButtonReplay_C::ContentAlignment' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, HoveredColor) == 0x001154, "Member 'UButtonReplay_C::HoveredColor' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, DefaultColor) == 0x001164, "Member 'UButtonReplay_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, SelectedColor) == 0x001174, "Member 'UButtonReplay_C::SelectedColor' has a wrong offset!");
static_assert(offsetof(UButtonReplay_C, ShouldHideIcon) == 0x001184, "Member 'UButtonReplay_C::ShouldHideIcon' has a wrong offset!");

}

