#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button_EmoteMenu

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Button_EmoteMenu.Button_EmoteMenu_C.ExecuteUbergraph_Button_EmoteMenu
// 0x0040 (0x0040 - 0x0000)
struct Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortHUDState                          K2Node_Event_NewState;                             // 0x0008(0x0004)(ConstParm, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortControllerComponent_ExternalEmote* CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FExternalEmoteCategory>         CallFunc_GetExternalEmotes_ReturnValue;            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu) == 0x000008, "Wrong alignment on Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu");
static_assert(sizeof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu) == 0x000040, "Wrong size on Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, EntryPoint) == 0x000000, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, Temp_byte_Variable) == 0x000004, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, Temp_byte_Variable_1) == 0x000005, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, Temp_bool_Variable) == 0x000006, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, K2Node_Event_NewState) == 0x000008, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, CallFunc_GetExternalEmotes_ReturnValue) == 0x000020, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::CallFunc_GetExternalEmotes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu, K2Node_Select_Default) == 0x000039, "Member 'Button_EmoteMenu_C_ExecuteUbergraph_Button_EmoteMenu::K2Node_Select_Default' has a wrong offset!");

// Function Button_EmoteMenu.Button_EmoteMenu_C.OnHUDStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct Button_EmoteMenu_C_OnHUDStateUpdate final
{
public:
	struct FFortHUDState                          NewState;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Button_EmoteMenu_C_OnHUDStateUpdate) == 0x000004, "Wrong alignment on Button_EmoteMenu_C_OnHUDStateUpdate");
static_assert(sizeof(Button_EmoteMenu_C_OnHUDStateUpdate) == 0x000004, "Wrong size on Button_EmoteMenu_C_OnHUDStateUpdate");
static_assert(offsetof(Button_EmoteMenu_C_OnHUDStateUpdate, NewState) == 0x000000, "Member 'Button_EmoteMenu_C_OnHUDStateUpdate::NewState' has a wrong offset!");

}

