#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButterBarn_Audio_PA_Receiver

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ButterBarn_Audio_PA_Receiver.ButterBarn_Audio_PA_Receiver_C.ExecuteUbergraph_ButterBarn_Audio_PA_Receiver
// 0x00B8 (0x00B8 - 0x0000)
struct ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAudioAnalysisSubsystem*            CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_Static_Mesh;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortAudioAnalysisSubsystem*            CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver) == 0x000008, "Wrong alignment on ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver");
static_assert(sizeof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver) == 0x0000B8, "Wrong size on ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, EntryPoint) == 0x000000, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::EntryPoint' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_Event_EndPlayReason) == 0x000010, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CustomEvent_DestroyedActor) == 0x000018, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CustomEvent_DamagedActor) == 0x000020, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CustomEvent_Damage) == 0x000028, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CustomEvent_InstigatedBy) == 0x000030, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CustomEvent_DamageCauser) == 0x000038, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CustomEvent_HitLocation) == 0x000040, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CustomEvent_FHitComponent) == 0x000058, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CustomEvent_BoneName) == 0x000060, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CustomEvent_Momentum) == 0x000068, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, CallFunc_GetAttachParentActor_ReturnValue) == 0x000080, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_DynamicCast_AsBuilding_Static_Mesh) == 0x000098, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_DynamicCast_AsBuilding_Static_Mesh' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A4, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x0000B0, "Member 'ButterBarn_Audio_PA_Receiver_C_ExecuteUbergraph_ButterBarn_Audio_PA_Receiver::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");

// Function ButterBarn_Audio_PA_Receiver.ButterBarn_Audio_PA_Receiver_C.On Owner Destroyed
// 0x0008 (0x0008 - 0x0000)
struct ButterBarn_Audio_PA_Receiver_C_On_Owner_Destroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Destroyed) == 0x000008, "Wrong alignment on ButterBarn_Audio_PA_Receiver_C_On_Owner_Destroyed");
static_assert(sizeof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Destroyed) == 0x000008, "Wrong size on ButterBarn_Audio_PA_Receiver_C_On_Owner_Destroyed");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Destroyed, DestroyedActor) == 0x000000, "Member 'ButterBarn_Audio_PA_Receiver_C_On_Owner_Destroyed::DestroyedActor' has a wrong offset!");

// Function ButterBarn_Audio_PA_Receiver.ButterBarn_Audio_PA_Receiver_C.On Owner Died
// 0x0060 (0x0060 - 0x0000)
struct ButterBarn_Audio_PA_Receiver_C_On_Owner_Died final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died) == 0x000008, "Wrong alignment on ButterBarn_Audio_PA_Receiver_C_On_Owner_Died");
static_assert(sizeof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died) == 0x000060, "Wrong size on ButterBarn_Audio_PA_Receiver_C_On_Owner_Died");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died, DamagedActor) == 0x000000, "Member 'ButterBarn_Audio_PA_Receiver_C_On_Owner_Died::DamagedActor' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died, Damage) == 0x000008, "Member 'ButterBarn_Audio_PA_Receiver_C_On_Owner_Died::Damage' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died, InstigatedBy) == 0x000010, "Member 'ButterBarn_Audio_PA_Receiver_C_On_Owner_Died::InstigatedBy' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died, DamageCauser) == 0x000018, "Member 'ButterBarn_Audio_PA_Receiver_C_On_Owner_Died::DamageCauser' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died, HitLocation) == 0x000020, "Member 'ButterBarn_Audio_PA_Receiver_C_On_Owner_Died::HitLocation' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died, FHitComponent) == 0x000038, "Member 'ButterBarn_Audio_PA_Receiver_C_On_Owner_Died::FHitComponent' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died, BoneName) == 0x000040, "Member 'ButterBarn_Audio_PA_Receiver_C_On_Owner_Died::BoneName' has a wrong offset!");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_On_Owner_Died, Momentum) == 0x000048, "Member 'ButterBarn_Audio_PA_Receiver_C_On_Owner_Died::Momentum' has a wrong offset!");

// Function ButterBarn_Audio_PA_Receiver.ButterBarn_Audio_PA_Receiver_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct ButterBarn_Audio_PA_Receiver_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ButterBarn_Audio_PA_Receiver_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on ButterBarn_Audio_PA_Receiver_C_ReceiveEndPlay");
static_assert(sizeof(ButterBarn_Audio_PA_Receiver_C_ReceiveEndPlay) == 0x000001, "Wrong size on ButterBarn_Audio_PA_Receiver_C_ReceiveEndPlay");
static_assert(offsetof(ButterBarn_Audio_PA_Receiver_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'ButterBarn_Audio_PA_Receiver_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

