#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarPropData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct CalendarPropData.CalendarPropData
// 0x00B0 (0x00B0 - 0x0000)
struct FCalendarPropData final
{
public:
	TSoftClassPtr<class UClass>                   Actor_27_6A42496A4663E346C97AFEB9993C68F7;         // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform_11_CE6EB422421FE49E3943BDB094B64C74;     // 0x0030(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         ProgressAppear_21_5B07DA4E4FFA7913E1C2EF864C0BDC68; // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProgressDisappear_22_D8FC05F84ECB57E73362DE9563548198; // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingSMActor*                       ParentSMactor_26_E003CE7B46936C6CC054B9AF925C1BDE; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParentArrayElement_30_0DF457554DE47CFC3CCE8DA1B253825E; // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCalendarPropData) == 0x000010, "Wrong alignment on FCalendarPropData");
static_assert(sizeof(FCalendarPropData) == 0x0000B0, "Wrong size on FCalendarPropData");
static_assert(offsetof(FCalendarPropData, Actor_27_6A42496A4663E346C97AFEB9993C68F7) == 0x000000, "Member 'FCalendarPropData::Actor_27_6A42496A4663E346C97AFEB9993C68F7' has a wrong offset!");
static_assert(offsetof(FCalendarPropData, Transform_11_CE6EB422421FE49E3943BDB094B64C74) == 0x000030, "Member 'FCalendarPropData::Transform_11_CE6EB422421FE49E3943BDB094B64C74' has a wrong offset!");
static_assert(offsetof(FCalendarPropData, ProgressAppear_21_5B07DA4E4FFA7913E1C2EF864C0BDC68) == 0x000090, "Member 'FCalendarPropData::ProgressAppear_21_5B07DA4E4FFA7913E1C2EF864C0BDC68' has a wrong offset!");
static_assert(offsetof(FCalendarPropData, ProgressDisappear_22_D8FC05F84ECB57E73362DE9563548198) == 0x000094, "Member 'FCalendarPropData::ProgressDisappear_22_D8FC05F84ECB57E73362DE9563548198' has a wrong offset!");
static_assert(offsetof(FCalendarPropData, ParentSMactor_26_E003CE7B46936C6CC054B9AF925C1BDE) == 0x000098, "Member 'FCalendarPropData::ParentSMactor_26_E003CE7B46936C6CC054B9AF925C1BDE' has a wrong offset!");
static_assert(offsetof(FCalendarPropData, ParentArrayElement_30_0DF457554DE47CFC3CCE8DA1B253825E) == 0x0000A0, "Member 'FCalendarPropData::ParentArrayElement_30_0DF457554DE47CFC3CCE8DA1B253825E' has a wrong offset!");

}

