#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalloutEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function CalloutEntry.CalloutEntry_C.SetCallout
// 0x0038 (0x0038 - 0x0000)
struct CalloutEntry_C_SetCallout final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalloutEntry_C_SetCallout) == 0x000008, "Wrong alignment on CalloutEntry_C_SetCallout");
static_assert(sizeof(CalloutEntry_C_SetCallout) == 0x000038, "Wrong size on CalloutEntry_C_SetCallout");
static_assert(offsetof(CalloutEntry_C_SetCallout, InText) == 0x000000, "Member 'CalloutEntry_C_SetCallout::InText' has a wrong offset!");
static_assert(offsetof(CalloutEntry_C_SetCallout, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'CalloutEntry_C_SetCallout::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalloutEntry_C_SetCallout, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'CalloutEntry_C_SetCallout::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

