#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModifier_Athena_Sliding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraModifier_Athena_Sliding.CameraModifier_Athena_Sliding_C
// 0x0098 (0x00E0 - 0x0048)
class UCameraModifier_Athena_Sliding_C final : public UCameraModifier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         RightOffset;                                       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeightOffset;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interp_Speed;                                      // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraOffsetBlendInSeconds;                        // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraOffsetAlpha;                                 // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlendIn;                                           // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinAdditionalFOV;                                  // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxAdditionalFOV;                                  // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxSlideSpeed;                                     // 0x0070(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinSlideSpeed;                                     // 0x0098(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CameraOffsetBlendOutSeconds;                       // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FovOffsetAlpha;                                    // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FovOffsetBlendOutSeconds;                          // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FovOffsetBlendInSeconds;                           // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ForwardOffset;                                     // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetingAlpha;                                    // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetingBlendInSeconds;                           // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetingBlendOutSeconds;                          // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlendOut();
	void BlueprintModifyCamera(float DeltaTime, const struct FVector& ViewLocation, const struct FRotator& ViewRotation, float FOV, struct FVector* NewViewLocation, struct FRotator* NewViewRotation, float* NewFOV);
	void ExecuteUbergraph_CameraModifier_Athena_Sliding(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraModifier_Athena_Sliding_C">();
	}
	static class UCameraModifier_Athena_Sliding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraModifier_Athena_Sliding_C>();
	}
};
static_assert(alignof(UCameraModifier_Athena_Sliding_C) == 0x000008, "Wrong alignment on UCameraModifier_Athena_Sliding_C");
static_assert(sizeof(UCameraModifier_Athena_Sliding_C) == 0x0000E0, "Wrong size on UCameraModifier_Athena_Sliding_C");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, UberGraphFrame) == 0x000048, "Member 'UCameraModifier_Athena_Sliding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, RightOffset) == 0x000050, "Member 'UCameraModifier_Athena_Sliding_C::RightOffset' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, HeightOffset) == 0x000054, "Member 'UCameraModifier_Athena_Sliding_C::HeightOffset' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, Interp_Speed) == 0x000058, "Member 'UCameraModifier_Athena_Sliding_C::Interp_Speed' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, CameraOffsetBlendInSeconds) == 0x00005C, "Member 'UCameraModifier_Athena_Sliding_C::CameraOffsetBlendInSeconds' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, CameraOffsetAlpha) == 0x000060, "Member 'UCameraModifier_Athena_Sliding_C::CameraOffsetAlpha' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, BlendIn) == 0x000064, "Member 'UCameraModifier_Athena_Sliding_C::BlendIn' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, MinAdditionalFOV) == 0x000068, "Member 'UCameraModifier_Athena_Sliding_C::MinAdditionalFOV' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, MaxAdditionalFOV) == 0x00006C, "Member 'UCameraModifier_Athena_Sliding_C::MaxAdditionalFOV' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, MaxSlideSpeed) == 0x000070, "Member 'UCameraModifier_Athena_Sliding_C::MaxSlideSpeed' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, MinSlideSpeed) == 0x000098, "Member 'UCameraModifier_Athena_Sliding_C::MinSlideSpeed' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, CameraOffsetBlendOutSeconds) == 0x0000C0, "Member 'UCameraModifier_Athena_Sliding_C::CameraOffsetBlendOutSeconds' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, FovOffsetAlpha) == 0x0000C4, "Member 'UCameraModifier_Athena_Sliding_C::FovOffsetAlpha' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, FovOffsetBlendOutSeconds) == 0x0000C8, "Member 'UCameraModifier_Athena_Sliding_C::FovOffsetBlendOutSeconds' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, FovOffsetBlendInSeconds) == 0x0000CC, "Member 'UCameraModifier_Athena_Sliding_C::FovOffsetBlendInSeconds' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, ForwardOffset) == 0x0000D0, "Member 'UCameraModifier_Athena_Sliding_C::ForwardOffset' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, TargetingAlpha) == 0x0000D4, "Member 'UCameraModifier_Athena_Sliding_C::TargetingAlpha' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, TargetingBlendInSeconds) == 0x0000D8, "Member 'UCameraModifier_Athena_Sliding_C::TargetingBlendInSeconds' has a wrong offset!");
static_assert(offsetof(UCameraModifier_Athena_Sliding_C, TargetingBlendOutSeconds) == 0x0000DC, "Member 'UCameraModifier_Athena_Sliding_C::TargetingBlendOutSeconds' has a wrong offset!");

}

