#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModifier_WestSausage

#include "Basic.hpp"

#include "ParallelRuntime_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraModifier_WestSausage.CameraModifier_WestSausage_C
// 0x0060 (0x02E8 - 0x0288)
class UCameraModifier_WestSausage_C : public UFortCameraModifier_WestSausage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ForwardAlpha;                                      // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeightAlpha;                                       // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Right_Alpha;                                       // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentFOV;                                        // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Boosting;                                          // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoostedStartTime;                                  // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoostTime;                                         // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoostAmount_Time;                                  // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditionalForward;                                 // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LastAttachedState;                                 // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoostAmount_Magnitude;                             // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverallAlpha;                                      // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          On;                                                // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Time;                                              // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StoredVelocity;                                    // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlidingHeight_T;                                   // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlidingHeightInterpTime;                           // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DEPRECATED_CameraBoost(float BoostAmount_Time_0, float BoostAmount_Magnitude_0);
	void DEPRECATED_TurnOff();
	void DEPRECATED_TurnOn();
	void ExecuteUbergraph_CameraModifier_WestSausage(int32 EntryPoint);
	void Turn_On();
	void TurnOff();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraModifier_WestSausage_C">();
	}
	static class UCameraModifier_WestSausage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraModifier_WestSausage_C>();
	}
};
static_assert(alignof(UCameraModifier_WestSausage_C) == 0x000008, "Wrong alignment on UCameraModifier_WestSausage_C");
static_assert(sizeof(UCameraModifier_WestSausage_C) == 0x0002E8, "Wrong size on UCameraModifier_WestSausage_C");
static_assert(offsetof(UCameraModifier_WestSausage_C, UberGraphFrame) == 0x000288, "Member 'UCameraModifier_WestSausage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, ForwardAlpha) == 0x000290, "Member 'UCameraModifier_WestSausage_C::ForwardAlpha' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, HeightAlpha) == 0x000294, "Member 'UCameraModifier_WestSausage_C::HeightAlpha' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, Right_Alpha) == 0x000298, "Member 'UCameraModifier_WestSausage_C::Right_Alpha' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, CurrentFOV) == 0x00029C, "Member 'UCameraModifier_WestSausage_C::CurrentFOV' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, Boosting) == 0x0002A0, "Member 'UCameraModifier_WestSausage_C::Boosting' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, BoostedStartTime) == 0x0002A4, "Member 'UCameraModifier_WestSausage_C::BoostedStartTime' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, BoostTime) == 0x0002A8, "Member 'UCameraModifier_WestSausage_C::BoostTime' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, BoostAmount_Time) == 0x0002AC, "Member 'UCameraModifier_WestSausage_C::BoostAmount_Time' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, AdditionalForward) == 0x0002B0, "Member 'UCameraModifier_WestSausage_C::AdditionalForward' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, LastAttachedState) == 0x0002B4, "Member 'UCameraModifier_WestSausage_C::LastAttachedState' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, BoostAmount_Magnitude) == 0x0002B8, "Member 'UCameraModifier_WestSausage_C::BoostAmount_Magnitude' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, OverallAlpha) == 0x0002BC, "Member 'UCameraModifier_WestSausage_C::OverallAlpha' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, On) == 0x0002C0, "Member 'UCameraModifier_WestSausage_C::On' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, Time) == 0x0002C4, "Member 'UCameraModifier_WestSausage_C::Time' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, StoredVelocity) == 0x0002C8, "Member 'UCameraModifier_WestSausage_C::StoredVelocity' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, SlidingHeight_T) == 0x0002E0, "Member 'UCameraModifier_WestSausage_C::SlidingHeight_T' has a wrong offset!");
static_assert(offsetof(UCameraModifier_WestSausage_C, SlidingHeightInterpTime) == 0x0002E4, "Member 'UCameraModifier_WestSausage_C::SlidingHeightInterpTime' has a wrong offset!");

}

