#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModifier_WestSausage

#include "Basic.hpp"


namespace SDK::Params
{

// Function CameraModifier_WestSausage.CameraModifier_WestSausage_C.DEPRECATED_CameraBoost
// 0x0008 (0x0008 - 0x0000)
struct CameraModifier_WestSausage_C_DEPRECATED_CameraBoost final
{
public:
	float                                         BoostAmount_Time_0;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoostAmount_Magnitude_0;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_WestSausage_C_DEPRECATED_CameraBoost) == 0x000004, "Wrong alignment on CameraModifier_WestSausage_C_DEPRECATED_CameraBoost");
static_assert(sizeof(CameraModifier_WestSausage_C_DEPRECATED_CameraBoost) == 0x000008, "Wrong size on CameraModifier_WestSausage_C_DEPRECATED_CameraBoost");
static_assert(offsetof(CameraModifier_WestSausage_C_DEPRECATED_CameraBoost, BoostAmount_Time_0) == 0x000000, "Member 'CameraModifier_WestSausage_C_DEPRECATED_CameraBoost::BoostAmount_Time_0' has a wrong offset!");
static_assert(offsetof(CameraModifier_WestSausage_C_DEPRECATED_CameraBoost, BoostAmount_Magnitude_0) == 0x000004, "Member 'CameraModifier_WestSausage_C_DEPRECATED_CameraBoost::BoostAmount_Magnitude_0' has a wrong offset!");

// Function CameraModifier_WestSausage.CameraModifier_WestSausage_C.ExecuteUbergraph_CameraModifier_WestSausage
// 0x000C (0x000C - 0x0000)
struct CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_BoostAmount_Time;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_BoostAmount_Magnitude;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage) == 0x000004, "Wrong alignment on CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage");
static_assert(sizeof(CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage) == 0x00000C, "Wrong size on CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage");
static_assert(offsetof(CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage, EntryPoint) == 0x000000, "Member 'CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage::EntryPoint' has a wrong offset!");
static_assert(offsetof(CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage, K2Node_CustomEvent_BoostAmount_Time) == 0x000004, "Member 'CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage::K2Node_CustomEvent_BoostAmount_Time' has a wrong offset!");
static_assert(offsetof(CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage, K2Node_CustomEvent_BoostAmount_Magnitude) == 0x000008, "Member 'CameraModifier_WestSausage_C_ExecuteUbergraph_CameraModifier_WestSausage::K2Node_CustomEvent_BoostAmount_Magnitude' has a wrong offset!");

}

