#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModifier_GrappleGloves

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CameraModifier_GrappleGloves.CameraModifier_GrappleGloves_C.BlueprintModifyCamera
// 0x0078 (0x0078 - 0x0000)
struct CameraModifier_GrappleGloves_C_BlueprintModifyCamera final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ViewLocation;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ViewRotation;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         FOV;                                               // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewViewLocation;                                   // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewViewRotation;                                   // 0x0058(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         NewFOV;                                            // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_GrappleGloves_C_BlueprintModifyCamera) == 0x000008, "Wrong alignment on CameraModifier_GrappleGloves_C_BlueprintModifyCamera");
static_assert(sizeof(CameraModifier_GrappleGloves_C_BlueprintModifyCamera) == 0x000078, "Wrong size on CameraModifier_GrappleGloves_C_BlueprintModifyCamera");
static_assert(offsetof(CameraModifier_GrappleGloves_C_BlueprintModifyCamera, DeltaTime) == 0x000000, "Member 'CameraModifier_GrappleGloves_C_BlueprintModifyCamera::DeltaTime' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_BlueprintModifyCamera, ViewLocation) == 0x000008, "Member 'CameraModifier_GrappleGloves_C_BlueprintModifyCamera::ViewLocation' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_BlueprintModifyCamera, ViewRotation) == 0x000020, "Member 'CameraModifier_GrappleGloves_C_BlueprintModifyCamera::ViewRotation' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_BlueprintModifyCamera, FOV) == 0x000038, "Member 'CameraModifier_GrappleGloves_C_BlueprintModifyCamera::FOV' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_BlueprintModifyCamera, NewViewLocation) == 0x000040, "Member 'CameraModifier_GrappleGloves_C_BlueprintModifyCamera::NewViewLocation' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_BlueprintModifyCamera, NewViewRotation) == 0x000058, "Member 'CameraModifier_GrappleGloves_C_BlueprintModifyCamera::NewViewRotation' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_BlueprintModifyCamera, NewFOV) == 0x000070, "Member 'CameraModifier_GrappleGloves_C_BlueprintModifyCamera::NewFOV' has a wrong offset!");

// Function CameraModifier_GrappleGloves.CameraModifier_GrappleGloves_C.ExecuteUbergraph_CameraModifier_GrappleGloves
// 0x0004 (0x0004 - 0x0000)
struct CameraModifier_GrappleGloves_C_ExecuteUbergraph_CameraModifier_GrappleGloves final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_GrappleGloves_C_ExecuteUbergraph_CameraModifier_GrappleGloves) == 0x000004, "Wrong alignment on CameraModifier_GrappleGloves_C_ExecuteUbergraph_CameraModifier_GrappleGloves");
static_assert(sizeof(CameraModifier_GrappleGloves_C_ExecuteUbergraph_CameraModifier_GrappleGloves) == 0x000004, "Wrong size on CameraModifier_GrappleGloves_C_ExecuteUbergraph_CameraModifier_GrappleGloves");
static_assert(offsetof(CameraModifier_GrappleGloves_C_ExecuteUbergraph_CameraModifier_GrappleGloves, EntryPoint) == 0x000000, "Member 'CameraModifier_GrappleGloves_C_ExecuteUbergraph_CameraModifier_GrappleGloves::EntryPoint' has a wrong offset!");

// Function CameraModifier_GrappleGloves.CameraModifier_GrappleGloves_C.UpdateForwardOffsetData
// 0x0070 (0x0070 - 0x0000)
struct CameraModifier_GrappleGloves_C_UpdateForwardOffsetData final
{
public:
	bool                                          bIsAtMaxSpeed;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData) == 0x000008, "Wrong alignment on CameraModifier_GrappleGloves_C_UpdateForwardOffsetData");
static_assert(sizeof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData) == 0x000070, "Wrong size on CameraModifier_GrappleGloves_C_UpdateForwardOffsetData");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, bIsAtMaxSpeed) == 0x000000, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::bIsAtMaxSpeed' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000008, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000018, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, K2Node_DynamicCast_AsFort_Movement_Comp_Character) == 0x000020, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::K2Node_DynamicCast_AsFort_Movement_Comp_Character' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000030, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000040, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_GetValueAtLevel_ReturnValue) == 0x000044, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_BreakVector2D_X) == 0x00004C, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_BreakVector2D_Y) == 0x000050, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_SelectFloat_ReturnValue_1) == 0x000058, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_UpdateForwardOffsetData, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'CameraModifier_GrappleGloves_C_UpdateForwardOffsetData::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function CameraModifier_GrappleGloves.CameraModifier_GrappleGloves_C.CalculateDynamicMultipliers
// 0x0048 (0x0048 - 0x0000)
struct CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers final
{
public:
	float                                         OutFOVBoundsMultiplier;                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutBoostOffsetMultiplier;                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAtMaxSpeed;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers) == 0x000008, "Wrong alignment on CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers");
static_assert(sizeof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers) == 0x000048, "Wrong size on CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, OutFOVBoundsMultiplier) == 0x000000, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::OutFOVBoundsMultiplier' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, OutBoostOffsetMultiplier) == 0x000004, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::OutBoostOffsetMultiplier' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, bIsAtMaxSpeed) == 0x000008, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::bIsAtMaxSpeed' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, CallFunc_SelectFloat_ReturnValue) == 0x00000C, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, CallFunc_SelectFloat_ReturnValue_1) == 0x000010, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000030, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000040, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers, CallFunc_SelectFloat_ReturnValue_2) == 0x000044, "Member 'CameraModifier_GrappleGloves_C_CalculateDynamicMultipliers::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");

}

