#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampsiteMarkerInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CampsiteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CampsiteMarkerInfo.CampsiteMarkerInfo_C
// 0x0048 (0x0338 - 0x02F0)
class UCampsiteMarkerInfo_C final : public UCampsiteMarkerInfoBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Avatar;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PingMarker;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DBNOPulseTimer;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  RelevantPlaylistTags;                              // 0x0310(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsTalking;                                        // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowBackgroundOverridden;                         // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnemyVersion;                                     // 0x0332(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SetBackgroundVisibility(bool bOverride, bool bBackgroundVisible);
	void PreConstruct(bool IsDesignTime);
	void OverrideShowBackground(bool bShowBackground);
	void OnSetPlayerState(class AFortPlayerStateAthena* PSA);
	void OnLoaded_E4E2D6834C8DEFBB195DAFB481D364F0(class UObject* Loaded);
	void ExecuteUbergraph_CampsiteMarkerInfo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CampsiteMarkerInfo_C">();
	}
	static class UCampsiteMarkerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCampsiteMarkerInfo_C>();
	}
};
static_assert(alignof(UCampsiteMarkerInfo_C) == 0x000008, "Wrong alignment on UCampsiteMarkerInfo_C");
static_assert(sizeof(UCampsiteMarkerInfo_C) == 0x000338, "Wrong size on UCampsiteMarkerInfo_C");
static_assert(offsetof(UCampsiteMarkerInfo_C, UberGraphFrame) == 0x0002F0, "Member 'UCampsiteMarkerInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCampsiteMarkerInfo_C, Image_Avatar) == 0x0002F8, "Member 'UCampsiteMarkerInfo_C::Image_Avatar' has a wrong offset!");
static_assert(offsetof(UCampsiteMarkerInfo_C, Image_PingMarker) == 0x000300, "Member 'UCampsiteMarkerInfo_C::Image_PingMarker' has a wrong offset!");
static_assert(offsetof(UCampsiteMarkerInfo_C, DBNOPulseTimer) == 0x000308, "Member 'UCampsiteMarkerInfo_C::DBNOPulseTimer' has a wrong offset!");
static_assert(offsetof(UCampsiteMarkerInfo_C, RelevantPlaylistTags) == 0x000310, "Member 'UCampsiteMarkerInfo_C::RelevantPlaylistTags' has a wrong offset!");
static_assert(offsetof(UCampsiteMarkerInfo_C, bIsTalking) == 0x000330, "Member 'UCampsiteMarkerInfo_C::bIsTalking' has a wrong offset!");
static_assert(offsetof(UCampsiteMarkerInfo_C, bShowBackgroundOverridden) == 0x000331, "Member 'UCampsiteMarkerInfo_C::bShowBackgroundOverridden' has a wrong offset!");
static_assert(offsetof(UCampsiteMarkerInfo_C, bEnemyVersion) == 0x000332, "Member 'UCampsiteMarkerInfo_C::bEnemyVersion' has a wrong offset!");

}

