#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampsitePingMarker

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CampsitePingMarker.CampsitePingMarker_C.OnSetMarkerData
// 0x0160 (0x0160 - 0x0000)
struct CampsitePingMarker_C_OnSetMarkerData final
{
public:
	struct FFortWorldMarkerData                   FortWorldMarkerData;                               // 0x0000(0x0160)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CampsitePingMarker_C_OnSetMarkerData) == 0x000008, "Wrong alignment on CampsitePingMarker_C_OnSetMarkerData");
static_assert(sizeof(CampsitePingMarker_C_OnSetMarkerData) == 0x000160, "Wrong size on CampsitePingMarker_C_OnSetMarkerData");
static_assert(offsetof(CampsitePingMarker_C_OnSetMarkerData, FortWorldMarkerData) == 0x000000, "Member 'CampsitePingMarker_C_OnSetMarkerData::FortWorldMarkerData' has a wrong offset!");

// Function CampsitePingMarker.CampsitePingMarker_C.ExecuteUbergraph_CampsitePingMarker
// 0x01A8 (0x01A8 - 0x0000)
struct CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortWorldMarkerData                   K2Node_Event_FortWorldMarkerData;                  // 0x0008(0x0160)(ConstParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Tent_C*                              K2Node_DynamicCast_AsB_Tent;                       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCampsite_Improvement_Component_C*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker) == 0x000008, "Wrong alignment on CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker");
static_assert(sizeof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker) == 0x0001A8, "Wrong size on CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, EntryPoint) == 0x000000, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::EntryPoint' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, K2Node_Event_FortWorldMarkerData) == 0x000008, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::K2Node_Event_FortWorldMarkerData' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000168, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, K2Node_DynamicCast_AsB_Tent) == 0x000170, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::K2Node_DynamicCast_AsB_Tent' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, CallFunc_GetComponentByClass_ReturnValue) == 0x000180, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, CallFunc_GetOwningPlayer_ReturnValue) == 0x000188, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, CallFunc_IsValid_ReturnValue) == 0x000190, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, CallFunc_IsValid_ReturnValue_1) == 0x000191, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000198, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker, CallFunc_OnSameTeam_ReturnValue) == 0x0001A1, "Member 'CampsitePingMarker_C_ExecuteUbergraph_CampsitePingMarker::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");

}

