#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampaignPurchaseScreen

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CampaignPurchaseScreen.CampaignPurchaseScreen_C.ToggleTimer
// 0x0018 (0x0018 - 0x0000)
struct CampaignPurchaseScreen_C_ToggleTimer final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampaignPurchaseScreen_C_ToggleTimer) == 0x000008, "Wrong alignment on CampaignPurchaseScreen_C_ToggleTimer");
static_assert(sizeof(CampaignPurchaseScreen_C_ToggleTimer) == 0x000018, "Wrong size on CampaignPurchaseScreen_C_ToggleTimer");
static_assert(offsetof(CampaignPurchaseScreen_C_ToggleTimer, Enabled) == 0x000000, "Member 'CampaignPurchaseScreen_C_ToggleTimer::Enabled' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ToggleTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CampaignPurchaseScreen_C_ToggleTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ToggleTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'CampaignPurchaseScreen_C_ToggleTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function CampaignPurchaseScreen.CampaignPurchaseScreen_C.OnStoreScreenCreated
// 0x0008 (0x0008 - 0x0000)
struct CampaignPurchaseScreen_C_OnStoreScreenCreated final
{
public:
	class UFortMtxStoreRootBase*                  StoreScreen;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampaignPurchaseScreen_C_OnStoreScreenCreated) == 0x000008, "Wrong alignment on CampaignPurchaseScreen_C_OnStoreScreenCreated");
static_assert(sizeof(CampaignPurchaseScreen_C_OnStoreScreenCreated) == 0x000008, "Wrong size on CampaignPurchaseScreen_C_OnStoreScreenCreated");
static_assert(offsetof(CampaignPurchaseScreen_C_OnStoreScreenCreated, StoreScreen) == 0x000000, "Member 'CampaignPurchaseScreen_C_OnStoreScreenCreated::StoreScreen' has a wrong offset!");

// Function CampaignPurchaseScreen.CampaignPurchaseScreen_C.IsMinorShutdownWarningEnabled
// 0x0018 (0x0018 - 0x0000)
struct CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled) == 0x000008, "Wrong alignment on CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled");
static_assert(sizeof(CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled) == 0x000018, "Wrong size on CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled");
static_assert(offsetof(CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled, Enabled) == 0x000000, "Member 'CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled, CallFunc_GetFeatureState_OutFeatureState) == 0x000010, "Member 'CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled, CallFunc_GetFeatureState_OutReason) == 0x000011, "Member 'CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'CampaignPurchaseScreen_C_IsMinorShutdownWarningEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function CampaignPurchaseScreen.CampaignPurchaseScreen_C.IsBusyMatchmaking
// 0x0018 (0x0018 - 0x0000)
struct CampaignPurchaseScreen_C_IsBusyMatchmaking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchmakingLocal_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampaignPurchaseScreen_C_IsBusyMatchmaking) == 0x000008, "Wrong alignment on CampaignPurchaseScreen_C_IsBusyMatchmaking");
static_assert(sizeof(CampaignPurchaseScreen_C_IsBusyMatchmaking) == 0x000018, "Wrong size on CampaignPurchaseScreen_C_IsBusyMatchmaking");
static_assert(offsetof(CampaignPurchaseScreen_C_IsBusyMatchmaking, ReturnValue) == 0x000000, "Member 'CampaignPurchaseScreen_C_IsBusyMatchmaking::ReturnValue' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_IsBusyMatchmaking, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'CampaignPurchaseScreen_C_IsBusyMatchmaking::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_IsBusyMatchmaking, CallFunc_IsMatchmakingLocal_ReturnValue) == 0x000010, "Member 'CampaignPurchaseScreen_C_IsBusyMatchmaking::CallFunc_IsMatchmakingLocal_ReturnValue' has a wrong offset!");

// Function CampaignPurchaseScreen.CampaignPurchaseScreen_C.InitializeTextureCycle
// 0x0018 (0x0018 - 0x0000)
struct CampaignPurchaseScreen_C_InitializeTextureCycle final
{
public:
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampaignPurchaseScreen_C_InitializeTextureCycle) == 0x000008, "Wrong alignment on CampaignPurchaseScreen_C_InitializeTextureCycle");
static_assert(sizeof(CampaignPurchaseScreen_C_InitializeTextureCycle) == 0x000018, "Wrong size on CampaignPurchaseScreen_C_InitializeTextureCycle");
static_assert(offsetof(CampaignPurchaseScreen_C_InitializeTextureCycle, CallFunc_Array_Get_Item) == 0x000000, "Member 'CampaignPurchaseScreen_C_InitializeTextureCycle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_InitializeTextureCycle, CallFunc_Array_LastIndex_ReturnValue) == 0x000008, "Member 'CampaignPurchaseScreen_C_InitializeTextureCycle::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_InitializeTextureCycle, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'CampaignPurchaseScreen_C_InitializeTextureCycle::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function CampaignPurchaseScreen.CampaignPurchaseScreen_C.ExecuteUbergraph_CampaignPurchaseScreen
// 0x0050 (0x0050 - 0x0000)
struct CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMtxStoreRootBase*                  K2Node_Event_StoreScreen;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreMain_Root_C*                      K2Node_DynamicCast_AsStore_Main_Root;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen) == 0x000008, "Wrong alignment on CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen");
static_assert(sizeof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen) == 0x000050, "Wrong size on CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, EntryPoint) == 0x000000, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, K2Node_Event_StoreScreen) == 0x000008, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::K2Node_Event_StoreScreen' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, K2Node_DynamicCast_AsStore_Main_Root) == 0x000018, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::K2Node_DynamicCast_AsStore_Main_Root' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x000040, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'CampaignPurchaseScreen_C_ExecuteUbergraph_CampaignPurchaseScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function CampaignPurchaseScreen.CampaignPurchaseScreen_C.BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CampaignPurchaseScreen_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampaignPurchaseScreen_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CampaignPurchaseScreen_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CampaignPurchaseScreen_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CampaignPurchaseScreen_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CampaignPurchaseScreen_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CampaignPurchaseScreen_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CampaignPurchaseScreen.CampaignPurchaseScreen_C.AdvanceTextureCycle
// 0x0028 (0x0028 - 0x0000)
struct CampaignPurchaseScreen_C_AdvanceTextureCycle final
{
public:
	int32                                         NextTextureIndex;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentTextureIndex;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampaignPurchaseScreen_C_AdvanceTextureCycle) == 0x000008, "Wrong alignment on CampaignPurchaseScreen_C_AdvanceTextureCycle");
static_assert(sizeof(CampaignPurchaseScreen_C_AdvanceTextureCycle) == 0x000028, "Wrong size on CampaignPurchaseScreen_C_AdvanceTextureCycle");
static_assert(offsetof(CampaignPurchaseScreen_C_AdvanceTextureCycle, NextTextureIndex) == 0x000000, "Member 'CampaignPurchaseScreen_C_AdvanceTextureCycle::NextTextureIndex' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_AdvanceTextureCycle, CurrentTextureIndex) == 0x000004, "Member 'CampaignPurchaseScreen_C_AdvanceTextureCycle::CurrentTextureIndex' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_AdvanceTextureCycle, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'CampaignPurchaseScreen_C_AdvanceTextureCycle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_AdvanceTextureCycle, CallFunc_Array_Get_Item) == 0x000010, "Member 'CampaignPurchaseScreen_C_AdvanceTextureCycle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_AdvanceTextureCycle, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'CampaignPurchaseScreen_C_AdvanceTextureCycle::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_AdvanceTextureCycle, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'CampaignPurchaseScreen_C_AdvanceTextureCycle::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampaignPurchaseScreen_C_AdvanceTextureCycle, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'CampaignPurchaseScreen_C_AdvanceTextureCycle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

