#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampsiteMarkerInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CampsiteMarkerInfo.CampsiteMarkerInfo_C.SetBackgroundVisibility
// 0x000A (0x000A - 0x0000)
struct CampsiteMarkerInfo_C_SetBackgroundVisibility final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBackgroundVisible;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocal_BackgroundVisible;                          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteMarkerInfo_C_SetBackgroundVisibility) == 0x000001, "Wrong alignment on CampsiteMarkerInfo_C_SetBackgroundVisibility");
static_assert(sizeof(CampsiteMarkerInfo_C_SetBackgroundVisibility) == 0x00000A, "Wrong size on CampsiteMarkerInfo_C_SetBackgroundVisibility");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, bOverride) == 0x000000, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::bOverride' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, bBackgroundVisible) == 0x000001, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::bBackgroundVisible' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, bLocal_BackgroundVisible) == 0x000002, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::bLocal_BackgroundVisible' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, Temp_byte_Variable) == 0x000003, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, Temp_byte_Variable_1) == 0x000004, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, Temp_bool_Variable) == 0x000005, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000006, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, K2Node_Select_Default) == 0x000007, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_SetBackgroundVisibility, CallFunc_BooleanOR_ReturnValue_1) == 0x000009, "Member 'CampsiteMarkerInfo_C_SetBackgroundVisibility::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function CampsiteMarkerInfo.CampsiteMarkerInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CampsiteMarkerInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteMarkerInfo_C_PreConstruct) == 0x000001, "Wrong alignment on CampsiteMarkerInfo_C_PreConstruct");
static_assert(sizeof(CampsiteMarkerInfo_C_PreConstruct) == 0x000001, "Wrong size on CampsiteMarkerInfo_C_PreConstruct");
static_assert(offsetof(CampsiteMarkerInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CampsiteMarkerInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CampsiteMarkerInfo.CampsiteMarkerInfo_C.OverrideShowBackground
// 0x0001 (0x0001 - 0x0000)
struct CampsiteMarkerInfo_C_OverrideShowBackground final
{
public:
	bool                                          bShowBackground;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteMarkerInfo_C_OverrideShowBackground) == 0x000001, "Wrong alignment on CampsiteMarkerInfo_C_OverrideShowBackground");
static_assert(sizeof(CampsiteMarkerInfo_C_OverrideShowBackground) == 0x000001, "Wrong size on CampsiteMarkerInfo_C_OverrideShowBackground");
static_assert(offsetof(CampsiteMarkerInfo_C_OverrideShowBackground, bShowBackground) == 0x000000, "Member 'CampsiteMarkerInfo_C_OverrideShowBackground::bShowBackground' has a wrong offset!");

// Function CampsiteMarkerInfo.CampsiteMarkerInfo_C.OnSetPlayerState
// 0x0008 (0x0008 - 0x0000)
struct CampsiteMarkerInfo_C_OnSetPlayerState final
{
public:
	class AFortPlayerStateAthena*                 PSA;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteMarkerInfo_C_OnSetPlayerState) == 0x000008, "Wrong alignment on CampsiteMarkerInfo_C_OnSetPlayerState");
static_assert(sizeof(CampsiteMarkerInfo_C_OnSetPlayerState) == 0x000008, "Wrong size on CampsiteMarkerInfo_C_OnSetPlayerState");
static_assert(offsetof(CampsiteMarkerInfo_C_OnSetPlayerState, PSA) == 0x000000, "Member 'CampsiteMarkerInfo_C_OnSetPlayerState::PSA' has a wrong offset!");

// Function CampsiteMarkerInfo.CampsiteMarkerInfo_C.OnLoaded_E4E2D6834C8DEFBB195DAFB481D364F0
// 0x0008 (0x0008 - 0x0000)
struct CampsiteMarkerInfo_C_OnLoaded_E4E2D6834C8DEFBB195DAFB481D364F0 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteMarkerInfo_C_OnLoaded_E4E2D6834C8DEFBB195DAFB481D364F0) == 0x000008, "Wrong alignment on CampsiteMarkerInfo_C_OnLoaded_E4E2D6834C8DEFBB195DAFB481D364F0");
static_assert(sizeof(CampsiteMarkerInfo_C_OnLoaded_E4E2D6834C8DEFBB195DAFB481D364F0) == 0x000008, "Wrong size on CampsiteMarkerInfo_C_OnLoaded_E4E2D6834C8DEFBB195DAFB481D364F0");
static_assert(offsetof(CampsiteMarkerInfo_C_OnLoaded_E4E2D6834C8DEFBB195DAFB481D364F0, Loaded) == 0x000000, "Member 'CampsiteMarkerInfo_C_OnLoaded_E4E2D6834C8DEFBB195DAFB481D364F0::Loaded' has a wrong offset!");

// Function CampsiteMarkerInfo.CampsiteMarkerInfo_C.ExecuteUbergraph_CampsiteMarkerInfo
// 0x00C0 (0x00C0 - 0x0000)
struct CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShowBackground;                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_Event_PSA;                                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSocialAvatarBrush_ReturnValue;         // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetPinColor_ReturnValue;                  // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo) == 0x000008, "Wrong alignment on CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo");
static_assert(sizeof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo) == 0x0000C0, "Wrong size on CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, EntryPoint) == 0x000000, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, Temp_bool_Variable) == 0x000004, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, Temp_object_Variable) == 0x000018, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, Temp_object_Variable_1) == 0x000020, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, Temp_bool_Variable_1) == 0x000028, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, Temp_byte_Variable) == 0x000029, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, Temp_byte_Variable_1) == 0x00002A, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, K2Node_CustomEvent_bShowBackground) == 0x00002B, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::K2Node_CustomEvent_bShowBackground' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, K2Node_Event_PSA) == 0x000030, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::K2Node_Event_PSA' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, CallFunc_GetSocialAvatarBrush_ReturnValue) == 0x000050, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::CallFunc_GetSocialAvatarBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, CallFunc_GetPinColor_ReturnValue) == 0x000078, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::CallFunc_GetPinColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, Temp_object_Variable_2) == 0x000088, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, K2Node_DynamicCast_AsTexture_2D) == 0x000090, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, K2Node_Event_IsDesignTime) == 0x000099, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, K2Node_CustomEvent_Loaded) == 0x0000A0, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, K2Node_Select_Default) == 0x0000A8, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B0, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B8, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, K2Node_Select_Default_1) == 0x0000B9, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo, CallFunc_BooleanAND_ReturnValue) == 0x0000BA, "Member 'CampsiteMarkerInfo_C_ExecuteUbergraph_CampsiteMarkerInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

