#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampsiteRequirement_EquippedItemValid

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CampsiteRequirement_EquippedItemValid.CampsiteRequirement_EquippedItemValid_C.IsRequirementMetInternal
// 0x0080 (0x0080 - 0x0000)
struct CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal final
{
public:
	struct FControllerRequirementTestContext      RequestContext;                                    // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetInventoryGUID_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_BP_GetInventoryItemWithGuid_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemAvailable_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal) == 0x000008, "Wrong alignment on CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal");
static_assert(sizeof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal) == 0x000080, "Wrong size on CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, RequestContext) == 0x000000, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::RequestContext' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, ReturnValue) == 0x000020, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_GetPlayerPawn_ReturnValue) == 0x000038, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000048, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_GetInventoryGUID_ReturnValue) == 0x000050, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_GetInventoryGUID_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_BP_GetInventoryItemWithGuid_ReturnValue) == 0x000068, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_BP_GetInventoryItemWithGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_IsItemAvailable_ReturnValue) == 0x000070, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_IsItemAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_IsValid_ReturnValue_3) == 0x000071, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_GetType_ReturnValue) == 0x000072, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000073, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000074, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_IsValid_Guid_ReturnValue) == 0x000075, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_BooleanOR_ReturnValue) == 0x000076, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_Not_PreBool_ReturnValue) == 0x000077, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal, CallFunc_BooleanAND_ReturnValue) == 0x000078, "Member 'CampsiteRequirement_EquippedItemValid_C_IsRequirementMetInternal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

