#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampsiteRequirement_ImprovementOwner

#include "Basic.hpp"

#include "CommonConversationRuntime_structs.hpp"


namespace SDK::Params
{

// Function CampsiteRequirement_ImprovementOwner.CampsiteRequirement_ImprovementOwner_C.IsRequirementSatisfied
// 0x0068 (0x0068 - 0x0000)
struct CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EConversationRequirementResult                ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Satisfied;                                         // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParticipantActorNPC_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParticipantActorPlayer_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCampsite_Improvement_Component_C*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConversationRequirementResult                Temp_byte_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConversationRequirementResult                Temp_byte_Variable_1;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConversationRequirementResult                K2Node_Select_Default;                             // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied) == 0x000008, "Wrong alignment on CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied");
static_assert(sizeof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied) == 0x000068, "Wrong size on CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, Context) == 0x000000, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::Context' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, ReturnValue) == 0x000038, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, Satisfied) == 0x000039, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::Satisfied' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, Temp_bool_Variable) == 0x00003A, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, CallFunc_GetParticipantActorNPC_ReturnValue) == 0x000040, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::CallFunc_GetParticipantActorNPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, CallFunc_GetParticipantActorPlayer_ReturnValue) == 0x000048, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::CallFunc_GetParticipantActorPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000058, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, CallFunc_IsValid_ReturnValue_1) == 0x000062, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000063, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, Temp_byte_Variable) == 0x000064, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, Temp_byte_Variable_1) == 0x000065, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied, K2Node_Select_Default) == 0x000066, "Member 'CampsiteRequirement_ImprovementOwner_C_IsRequirementSatisfied::K2Node_Select_Default' has a wrong offset!");

}

