#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampsiteRequirement_RentStashSlot_SubMenu

#include "Basic.hpp"

#include "Enum_Campsite_Improvements_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonConversationRuntime_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CampsiteRequirement_RentStashSlot_SubMenu.CampsiteRequirement_RentStashSlot_SubMenu_C
// 0x0058 (0x00C8 - 0x0070)
class UCampsiteRequirement_RentStashSlot_SubMenu_C final : public UFortConversationRequirement_ControllerRequirement
{
public:
	Enum_Campsite_Improvements                    Improvement_Type;                                  // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StashedItemIndex;                                  // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FScalableFloat                         SlotMustBeRented_;                                 // 0x0078(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         StashEnabled;                                      // 0x00A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	EConversationRequirementResult IsRequirementSatisfied(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CampsiteRequirement_RentStashSlot_SubMenu_C">();
	}
	static class UCampsiteRequirement_RentStashSlot_SubMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCampsiteRequirement_RentStashSlot_SubMenu_C>();
	}
};
static_assert(alignof(UCampsiteRequirement_RentStashSlot_SubMenu_C) == 0x000008, "Wrong alignment on UCampsiteRequirement_RentStashSlot_SubMenu_C");
static_assert(sizeof(UCampsiteRequirement_RentStashSlot_SubMenu_C) == 0x0000C8, "Wrong size on UCampsiteRequirement_RentStashSlot_SubMenu_C");
static_assert(offsetof(UCampsiteRequirement_RentStashSlot_SubMenu_C, Improvement_Type) == 0x000070, "Member 'UCampsiteRequirement_RentStashSlot_SubMenu_C::Improvement_Type' has a wrong offset!");
static_assert(offsetof(UCampsiteRequirement_RentStashSlot_SubMenu_C, StashedItemIndex) == 0x000074, "Member 'UCampsiteRequirement_RentStashSlot_SubMenu_C::StashedItemIndex' has a wrong offset!");
static_assert(offsetof(UCampsiteRequirement_RentStashSlot_SubMenu_C, SlotMustBeRented_) == 0x000078, "Member 'UCampsiteRequirement_RentStashSlot_SubMenu_C::SlotMustBeRented_' has a wrong offset!");
static_assert(offsetof(UCampsiteRequirement_RentStashSlot_SubMenu_C, StashEnabled) == 0x0000A0, "Member 'UCampsiteRequirement_RentStashSlot_SubMenu_C::StashEnabled' has a wrong offset!");

}

