#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampsiteRequirement_HasStashedItem

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function CampsiteRequirement_HasStashedItem.CampsiteRequirement_HasStashedItem_C.IsRequirementMetInternal
// 0x01E8 (0x01E8 - 0x0000)
struct CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal final
{
public:
	struct FControllerRequirementTestContext      RequestContext;                                    // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           NewLocalVar_0;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class AB_Tent_C*                              K2Node_DynamicCast_AsB_Tent;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortControllerComponent_CampsiteAccountItem* CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemEntry                         CallFunc_GetCurrentlyStashedItemAsItemEntry_ReturnValue; // 0x0040(0x01A0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemEntryAvailable_ReturnValue;         // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCurrentlyStashedItem_ReturnValue;      // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal) == 0x000008, "Wrong alignment on CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal");
static_assert(sizeof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal) == 0x0001E8, "Wrong size on CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, RequestContext) == 0x000000, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::RequestContext' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, ReturnValue) == 0x000020, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, NewLocalVar_0) == 0x000024, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, K2Node_DynamicCast_AsB_Tent) == 0x000028, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::K2Node_DynamicCast_AsB_Tent' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, CallFunc_GetCurrentlyStashedItemAsItemEntry_ReturnValue) == 0x000040, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::CallFunc_GetCurrentlyStashedItemAsItemEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, CallFunc_IsItemEntryAvailable_ReturnValue) == 0x0001E1, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::CallFunc_IsItemEntryAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal, CallFunc_HasCurrentlyStashedItem_ReturnValue) == 0x0001E2, "Member 'CampsiteRequirement_HasStashedItem_C_IsRequirementMetInternal::CallFunc_HasCurrentlyStashedItem_ReturnValue' has a wrong offset!");

}

