#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Car_FoodTruck_Burger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Car_DEFAULT_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Car_FoodTruck_Burger.Car_FoodTruck_Burger_C
// 0x0028 (0x10F8 - 0x10D0)
class ACar_FoodTruck_Burger_C final : public ACar_DEFAULT_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Car_FoodTruck_Burger_C;             // 0x10D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           Alarm_On;                                          // 0x10D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Alarm_Off;                                         // 0x10E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Car_FoodTruck_Burger(int32 EntryPoint);
	void toggle_light_visibility(bool bNewVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Car_FoodTruck_Burger_C">();
	}
	static class ACar_FoodTruck_Burger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACar_FoodTruck_Burger_C>();
	}
};
static_assert(alignof(ACar_FoodTruck_Burger_C) == 0x000008, "Wrong alignment on ACar_FoodTruck_Burger_C");
static_assert(sizeof(ACar_FoodTruck_Burger_C) == 0x0010F8, "Wrong size on ACar_FoodTruck_Burger_C");
static_assert(offsetof(ACar_FoodTruck_Burger_C, UberGraphFrame_Car_FoodTruck_Burger_C) == 0x0010D0, "Member 'ACar_FoodTruck_Burger_C::UberGraphFrame_Car_FoodTruck_Burger_C' has a wrong offset!");
static_assert(offsetof(ACar_FoodTruck_Burger_C, Alarm_On) == 0x0010D8, "Member 'ACar_FoodTruck_Burger_C::Alarm_On' has a wrong offset!");
static_assert(offsetof(ACar_FoodTruck_Burger_C, Alarm_Off) == 0x0010E8, "Member 'ACar_FoodTruck_Burger_C::Alarm_Off' has a wrong offset!");

}

