#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Car_SemiTruck_Container

#include "Basic.hpp"

#include "Car_DEFAULT_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Car_SemiTruck_Container.Car_SemiTruck_Container_C
// 0x0090 (0x1160 - 0x10D0)
class ACar_SemiTruck_Container_C final : public ACar_DEFAULT_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Car_SemiTruck_Container_C;          // 0x10D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   DropLink_02;                                       // 0x10D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DropLink_03;                                       // 0x10E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ClamberLink_02;                                    // 0x10E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ClamberLink_03;                                    // 0x10F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ClamberLink_04;                                    // 0x10F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DropLink_04;                                       // 0x1100(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DropLink_05;                                       // 0x1108(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DropLink_09;                                       // 0x1110(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DropLink_08;                                       // 0x1118(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ClamberLink_08;                                    // 0x1120(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ClamberLink_07;                                    // 0x1128(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DropLink_07;                                       // 0x1130(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ClamberLink_06;                                    // 0x1138(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DropLink_06;                                       // 0x1140(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ClamberLink_05;                                    // 0x1148(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ClamberLink_09;                                    // 0x1150(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CUBE;                                              // 0x1158(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Car_SemiTruck_Container(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Car_SemiTruck_Container_C">();
	}
	static class ACar_SemiTruck_Container_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACar_SemiTruck_Container_C>();
	}
};
static_assert(alignof(ACar_SemiTruck_Container_C) == 0x000008, "Wrong alignment on ACar_SemiTruck_Container_C");
static_assert(sizeof(ACar_SemiTruck_Container_C) == 0x001160, "Wrong size on ACar_SemiTruck_Container_C");
static_assert(offsetof(ACar_SemiTruck_Container_C, UberGraphFrame_Car_SemiTruck_Container_C) == 0x0010D0, "Member 'ACar_SemiTruck_Container_C::UberGraphFrame_Car_SemiTruck_Container_C' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, DropLink_02) == 0x0010D8, "Member 'ACar_SemiTruck_Container_C::DropLink_02' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, DropLink_03) == 0x0010E0, "Member 'ACar_SemiTruck_Container_C::DropLink_03' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, ClamberLink_02) == 0x0010E8, "Member 'ACar_SemiTruck_Container_C::ClamberLink_02' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, ClamberLink_03) == 0x0010F0, "Member 'ACar_SemiTruck_Container_C::ClamberLink_03' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, ClamberLink_04) == 0x0010F8, "Member 'ACar_SemiTruck_Container_C::ClamberLink_04' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, DropLink_04) == 0x001100, "Member 'ACar_SemiTruck_Container_C::DropLink_04' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, DropLink_05) == 0x001108, "Member 'ACar_SemiTruck_Container_C::DropLink_05' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, DropLink_09) == 0x001110, "Member 'ACar_SemiTruck_Container_C::DropLink_09' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, DropLink_08) == 0x001118, "Member 'ACar_SemiTruck_Container_C::DropLink_08' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, ClamberLink_08) == 0x001120, "Member 'ACar_SemiTruck_Container_C::ClamberLink_08' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, ClamberLink_07) == 0x001128, "Member 'ACar_SemiTruck_Container_C::ClamberLink_07' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, DropLink_07) == 0x001130, "Member 'ACar_SemiTruck_Container_C::DropLink_07' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, ClamberLink_06) == 0x001138, "Member 'ACar_SemiTruck_Container_C::ClamberLink_06' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, DropLink_06) == 0x001140, "Member 'ACar_SemiTruck_Container_C::DropLink_06' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, ClamberLink_05) == 0x001148, "Member 'ACar_SemiTruck_Container_C::ClamberLink_05' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, ClamberLink_09) == 0x001150, "Member 'ACar_SemiTruck_Container_C::ClamberLink_09' has a wrong offset!");
static_assert(offsetof(ACar_SemiTruck_Container_C, CUBE) == 0x001158, "Member 'ACar_SemiTruck_Container_C::CUBE' has a wrong offset!");

}

