#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CarPartRotation_Prop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CarPartRotation_Prop.CarPartRotation_Prop_C.Destroy Part
// 0x0068 (0x0068 - 0x0000)
struct CarPartRotation_Prop_C_Destroy_Part final
{
public:
	class UStaticMeshComponent*                   Part;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BeRandom;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Offset;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DestroyChance;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_randomFloatByLocation_float;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CarPartRotation_Prop_C_Destroy_Part) == 0x000008, "Wrong alignment on CarPartRotation_Prop_C_Destroy_Part");
static_assert(sizeof(CarPartRotation_Prop_C_Destroy_Part) == 0x000068, "Wrong size on CarPartRotation_Prop_C_Destroy_Part");
static_assert(offsetof(CarPartRotation_Prop_C_Destroy_Part, Part) == 0x000000, "Member 'CarPartRotation_Prop_C_Destroy_Part::Part' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Destroy_Part, BeRandom) == 0x000008, "Member 'CarPartRotation_Prop_C_Destroy_Part::BeRandom' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Destroy_Part, Offset) == 0x00000C, "Member 'CarPartRotation_Prop_C_Destroy_Part::Offset' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Destroy_Part, DestroyChance) == 0x000010, "Member 'CarPartRotation_Prop_C_Destroy_Part::DestroyChance' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Destroy_Part, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'CarPartRotation_Prop_C_Destroy_Part::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Destroy_Part, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000030, "Member 'CarPartRotation_Prop_C_Destroy_Part::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Destroy_Part, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000048, "Member 'CarPartRotation_Prop_C_Destroy_Part::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Destroy_Part, CallFunc_randomFloatByLocation_float) == 0x000060, "Member 'CarPartRotation_Prop_C_Destroy_Part::CallFunc_randomFloatByLocation_float' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Destroy_Part, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000064, "Member 'CarPartRotation_Prop_C_Destroy_Part::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function CarPartRotation_Prop.CarPartRotation_Prop_C.Randomize Hood
// 0x0150 (0x0150 - 0x0000)
struct CarPartRotation_Prop_C_Randomize_Hood final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_randomFloatByLocation_float;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0070(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CarPartRotation_Prop_C_Randomize_Hood) == 0x000008, "Wrong alignment on CarPartRotation_Prop_C_Randomize_Hood");
static_assert(sizeof(CarPartRotation_Prop_C_Randomize_Hood) == 0x000150, "Wrong size on CarPartRotation_Prop_C_Randomize_Hood");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Hood, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'CarPartRotation_Prop_C_Randomize_Hood::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Hood, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'CarPartRotation_Prop_C_Randomize_Hood::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Hood, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000020, "Member 'CarPartRotation_Prop_C_Randomize_Hood::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Hood, CallFunc_Divide_VectorVector_ReturnValue) == 0x000038, "Member 'CarPartRotation_Prop_C_Randomize_Hood::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Hood, CallFunc_randomFloatByLocation_float) == 0x000050, "Member 'CarPartRotation_Prop_C_Randomize_Hood::CallFunc_randomFloatByLocation_float' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Hood, CallFunc_RLerp_ReturnValue) == 0x000058, "Member 'CarPartRotation_Prop_C_Randomize_Hood::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Hood, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000070, "Member 'CarPartRotation_Prop_C_Randomize_Hood::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function CarPartRotation_Prop.CarPartRotation_Prop_C.Randomize Trunk
// 0x02B8 (0x02B8 - 0x0000)
struct CarPartRotation_Prop_C_Randomize_Trunk final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_randomFloatByLocation_float;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00A8(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_1;        // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_randomFloatByLocation_float_1;            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue_1;                      // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x01D8(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CarPartRotation_Prop_C_Randomize_Trunk) == 0x000008, "Wrong alignment on CarPartRotation_Prop_C_Randomize_Trunk");
static_assert(sizeof(CarPartRotation_Prop_C_Randomize_Trunk) == 0x0002B8, "Wrong size on CarPartRotation_Prop_C_Randomize_Trunk");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000020, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_Divide_VectorVector_ReturnValue) == 0x000050, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_randomFloatByLocation_float) == 0x000068, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_randomFloatByLocation_float' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_RLerp_ReturnValue) == 0x000070, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_NegateRotator_ReturnValue) == 0x000088, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000A0, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000A8, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x000188, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_Divide_VectorVector_ReturnValue_1) == 0x0001A0, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_Divide_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_randomFloatByLocation_float_1) == 0x0001B8, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_randomFloatByLocation_float_1' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_RLerp_ReturnValue_1) == 0x0001C0, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_RLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Randomize_Trunk, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0001D8, "Member 'CarPartRotation_Prop_C_Randomize_Trunk::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");

// Function CarPartRotation_Prop.CarPartRotation_Prop_C.RemoveComponents
// 0x0003 (0x0003 - 0x0000)
struct CarPartRotation_Prop_C_RemoveComponents final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CarPartRotation_Prop_C_RemoveComponents) == 0x000001, "Wrong alignment on CarPartRotation_Prop_C_RemoveComponents");
static_assert(sizeof(CarPartRotation_Prop_C_RemoveComponents) == 0x000003, "Wrong size on CarPartRotation_Prop_C_RemoveComponents");
static_assert(offsetof(CarPartRotation_Prop_C_RemoveComponents, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'CarPartRotation_Prop_C_RemoveComponents::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_RemoveComponents, K2Node_SwitchEnum_CmpSuccess_1) == 0x000001, "Member 'CarPartRotation_Prop_C_RemoveComponents::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_RemoveComponents, K2Node_SwitchEnum_CmpSuccess_2) == 0x000002, "Member 'CarPartRotation_Prop_C_RemoveComponents::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");

// Function CarPartRotation_Prop.CarPartRotation_Prop_C.Set Hood Rotation
// 0x0110 (0x0110 - 0x0000)
struct CarPartRotation_Prop_C_Set_Hood_Rotation final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0030(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CarPartRotation_Prop_C_Set_Hood_Rotation) == 0x000008, "Wrong alignment on CarPartRotation_Prop_C_Set_Hood_Rotation");
static_assert(sizeof(CarPartRotation_Prop_C_Set_Hood_Rotation) == 0x000110, "Wrong size on CarPartRotation_Prop_C_Set_Hood_Rotation");
static_assert(offsetof(CarPartRotation_Prop_C_Set_Hood_Rotation, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'CarPartRotation_Prop_C_Set_Hood_Rotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Set_Hood_Rotation, CallFunc_NegateRotator_ReturnValue) == 0x000018, "Member 'CarPartRotation_Prop_C_Set_Hood_Rotation::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Set_Hood_Rotation, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000030, "Member 'CarPartRotation_Prop_C_Set_Hood_Rotation::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");

// Function CarPartRotation_Prop.CarPartRotation_Prop_C.Set Trunk Rotation
// 0x0208 (0x0208 - 0x0000)
struct CarPartRotation_Prop_C_Set_Trunk_Rotation final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0030(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x0128(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CarPartRotation_Prop_C_Set_Trunk_Rotation) == 0x000008, "Wrong alignment on CarPartRotation_Prop_C_Set_Trunk_Rotation");
static_assert(sizeof(CarPartRotation_Prop_C_Set_Trunk_Rotation) == 0x000208, "Wrong size on CarPartRotation_Prop_C_Set_Trunk_Rotation");
static_assert(offsetof(CarPartRotation_Prop_C_Set_Trunk_Rotation, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'CarPartRotation_Prop_C_Set_Trunk_Rotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Set_Trunk_Rotation, CallFunc_NegateRotator_ReturnValue) == 0x000018, "Member 'CarPartRotation_Prop_C_Set_Trunk_Rotation::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Set_Trunk_Rotation, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000030, "Member 'CarPartRotation_Prop_C_Set_Trunk_Rotation::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Set_Trunk_Rotation, CallFunc_MakeRotator_ReturnValue_1) == 0x000110, "Member 'CarPartRotation_Prop_C_Set_Trunk_Rotation::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_Set_Trunk_Rotation, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x000128, "Member 'CarPartRotation_Prop_C_Set_Trunk_Rotation::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");

// Function CarPartRotation_Prop.CarPartRotation_Prop_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct CarPartRotation_Prop_C_UserConstructionScript final
{
public:
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CarPartRotation_Prop_C_UserConstructionScript) == 0x000008, "Wrong alignment on CarPartRotation_Prop_C_UserConstructionScript");
static_assert(sizeof(CarPartRotation_Prop_C_UserConstructionScript) == 0x000018, "Wrong size on CarPartRotation_Prop_C_UserConstructionScript");
static_assert(offsetof(CarPartRotation_Prop_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'CarPartRotation_Prop_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CarPartRotation_Prop_C_UserConstructionScript, CallFunc_InEditorOrPIE_ReturnValue) == 0x000010, "Member 'CarPartRotation_Prop_C_UserConstructionScript::CallFunc_InEditorOrPIE_ReturnValue' has a wrong offset!");

}

