#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_Parent_Physics

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CBGA_Parent_Physics_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_Physics_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong alignment on CBGA_Parent_Physics_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature");
static_assert(sizeof(CBGA_Parent_Physics_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong size on CBGA_Parent_Physics_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature");
static_assert(offsetof(CBGA_Parent_Physics_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature, DamageCauser) == 0x000000, "Member 'CBGA_Parent_Physics_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature::DamageCauser' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.ExecuteUbergraph_CBGA_Parent_Physics
// 0x02E8 (0x02E8 - 0x0000)
struct CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelayBeforeImpulse;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelayBeforeCollision;           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpulseOrigin;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpulseAmount;                  // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SetCollisionAfterImpulse;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x01C8(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_SimulatingComponent;            // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsAwake;                       // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PerformLinkingCheck_ReturnValue;          // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DB[0x1];                                      // 0x02DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* SimulatingComponent, bool bIsAwake)> K2Node_CreateDelegate_OutputDelegate;              // 0x02DC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics) == 0x000008, "Wrong alignment on CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics");
static_assert(sizeof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics) == 0x0002E8, "Wrong size on CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, EntryPoint) == 0x000000, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::EntryPoint' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_Location) == 0x000020, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_Rotation) == 0x000038, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000050, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000078, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000090, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000A8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_DelayBeforeImpulse) == 0x0000C0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_DelayBeforeImpulse' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_DelayBeforeCollision) == 0x0000C4, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_DelayBeforeCollision' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_ImpulseOrigin) == 0x0000C8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_ImpulseOrigin' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_ImpulseAmount) == 0x0000E0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_ImpulseAmount' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_SetCollisionAfterImpulse) == 0x0000F8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_SetCollisionAfterImpulse' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000100, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_3) == 0x000108, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000110, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Normal_ReturnValue) == 0x000128, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000140, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_4) == 0x000158, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsServer_ReturnValue) == 0x000159, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsServer_ReturnValue_1) == 0x00015A, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_MyComp) == 0x000160, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_Other) == 0x000168, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_OtherComp) == 0x000170, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_bSelfMoved) == 0x000178, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_HitLocation) == 0x000180, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_HitNormal) == 0x000198, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_NormalImpulse) == 0x0001B0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_Hit) == 0x0001C8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0002A8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsServer_ReturnValue_2) == 0x0002C0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_ComponentBoundEvent_DamageCauser) == 0x0002C8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_SimulatingComponent) == 0x0002D0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_SimulatingComponent' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_bIsAwake) == 0x0002D8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_bIsAwake' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_PerformLinkingCheck_ReturnValue) == 0x0002D9, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_PerformLinkingCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_5) == 0x0002DA, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CreateDelegate_OutputDelegate) == 0x0002DC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.Impulse
// 0x0040 (0x0040 - 0x0000)
struct CBGA_Parent_Physics_C_Impulse final
{
public:
	float                                         DelayBeforeImpulse;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeCollision;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpulseOrigin;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpulseAmount;                                     // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetCollisionAfterImpulse;                          // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_Physics_C_Impulse) == 0x000008, "Wrong alignment on CBGA_Parent_Physics_C_Impulse");
static_assert(sizeof(CBGA_Parent_Physics_C_Impulse) == 0x000040, "Wrong size on CBGA_Parent_Physics_C_Impulse");
static_assert(offsetof(CBGA_Parent_Physics_C_Impulse, DelayBeforeImpulse) == 0x000000, "Member 'CBGA_Parent_Physics_C_Impulse::DelayBeforeImpulse' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_Impulse, DelayBeforeCollision) == 0x000004, "Member 'CBGA_Parent_Physics_C_Impulse::DelayBeforeCollision' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_Impulse, ImpulseOrigin) == 0x000008, "Member 'CBGA_Parent_Physics_C_Impulse::ImpulseOrigin' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_Impulse, ImpulseAmount) == 0x000020, "Member 'CBGA_Parent_Physics_C_Impulse::ImpulseAmount' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_Impulse, SetCollisionAfterImpulse) == 0x000038, "Member 'CBGA_Parent_Physics_C_Impulse::SetCollisionAfterImpulse' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.OnAwakeChanged
// 0x0010 (0x0010 - 0x0000)
struct CBGA_Parent_Physics_C_OnAwakeChanged final
{
public:
	class UPrimitiveComponent*                    SimulatingComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAwake;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_Physics_C_OnAwakeChanged) == 0x000008, "Wrong alignment on CBGA_Parent_Physics_C_OnAwakeChanged");
static_assert(sizeof(CBGA_Parent_Physics_C_OnAwakeChanged) == 0x000010, "Wrong size on CBGA_Parent_Physics_C_OnAwakeChanged");
static_assert(offsetof(CBGA_Parent_Physics_C_OnAwakeChanged, SimulatingComponent) == 0x000000, "Member 'CBGA_Parent_Physics_C_OnAwakeChanged::SimulatingComponent' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_OnAwakeChanged, bIsAwake) == 0x000008, "Member 'CBGA_Parent_Physics_C_OnAwakeChanged::bIsAwake' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.OnRep_bResumeSimulation
// 0x0001 (0x0001 - 0x0000)
struct CBGA_Parent_Physics_C_OnRep_bResumeSimulation final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_Physics_C_OnRep_bResumeSimulation) == 0x000001, "Wrong alignment on CBGA_Parent_Physics_C_OnRep_bResumeSimulation");
static_assert(sizeof(CBGA_Parent_Physics_C_OnRep_bResumeSimulation) == 0x000001, "Wrong size on CBGA_Parent_Physics_C_OnRep_bResumeSimulation");
static_assert(offsetof(CBGA_Parent_Physics_C_OnRep_bResumeSimulation, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CBGA_Parent_Physics_C_OnRep_bResumeSimulation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.PlayHitFX
// 0x0030 (0x0030 - 0x0000)
struct CBGA_Parent_Physics_C_PlayHitFX final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CBGA_Parent_Physics_C_PlayHitFX) == 0x000008, "Wrong alignment on CBGA_Parent_Physics_C_PlayHitFX");
static_assert(sizeof(CBGA_Parent_Physics_C_PlayHitFX) == 0x000030, "Wrong size on CBGA_Parent_Physics_C_PlayHitFX");
static_assert(offsetof(CBGA_Parent_Physics_C_PlayHitFX, Location) == 0x000000, "Member 'CBGA_Parent_Physics_C_PlayHitFX::Location' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_PlayHitFX, Rotation) == 0x000018, "Member 'CBGA_Parent_Physics_C_PlayHitFX::Rotation' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.ReceiveHit
// 0x0148 (0x0148 - 0x0000)
struct CBGA_Parent_Physics_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0068(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CBGA_Parent_Physics_C_ReceiveHit) == 0x000008, "Wrong alignment on CBGA_Parent_Physics_C_ReceiveHit");
static_assert(sizeof(CBGA_Parent_Physics_C_ReceiveHit) == 0x000148, "Wrong size on CBGA_Parent_Physics_C_ReceiveHit");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, MyComp) == 0x000000, "Member 'CBGA_Parent_Physics_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, Other) == 0x000008, "Member 'CBGA_Parent_Physics_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, OtherComp) == 0x000010, "Member 'CBGA_Parent_Physics_C_ReceiveHit::OtherComp' has a wrong offset!");
