#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_SilkyMoose_ScaleIn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CBGA_SilkyMoose_ScaleIn.CBGA_SilkyMoose_ScaleIn_C.ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn
// 0x0038 (0x0038 - 0x0000)
struct CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn) == 0x000008, "Wrong alignment on CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn");
static_assert(sizeof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn) == 0x000038, "Wrong size on CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, EntryPoint) == 0x000000, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::EntryPoint' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000008, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, CallFunc_FInterpTo_ReturnValue) == 0x000010, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, CallFunc_Abs_ReturnValue) == 0x000018, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'CBGA_SilkyMoose_ScaleIn_C_ExecuteUbergraph_CBGA_SilkyMoose_ScaleIn::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function CBGA_SilkyMoose_ScaleIn.CBGA_SilkyMoose_ScaleIn_C.Set Weed Scale
// 0x0020 (0x0020 - 0x0000)
struct CBGA_SilkyMoose_ScaleIn_C_Set_Weed_Scale final
{
public:
	float                                         SizeAlpha;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_SilkyMoose_ScaleIn_C_Set_Weed_Scale) == 0x000008, "Wrong alignment on CBGA_SilkyMoose_ScaleIn_C_Set_Weed_Scale");
static_assert(sizeof(CBGA_SilkyMoose_ScaleIn_C_Set_Weed_Scale) == 0x000020, "Wrong size on CBGA_SilkyMoose_ScaleIn_C_Set_Weed_Scale");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_Set_Weed_Scale, SizeAlpha) == 0x000000, "Member 'CBGA_SilkyMoose_ScaleIn_C_Set_Weed_Scale::SizeAlpha' has a wrong offset!");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_Set_Weed_Scale, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'CBGA_SilkyMoose_ScaleIn_C_Set_Weed_Scale::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function CBGA_SilkyMoose_ScaleIn.CBGA_SilkyMoose_ScaleIn_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct CBGA_SilkyMoose_ScaleIn_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_SilkyMoose_ScaleIn_C_UserConstructionScript) == 0x000008, "Wrong alignment on CBGA_SilkyMoose_ScaleIn_C_UserConstructionScript");
static_assert(sizeof(CBGA_SilkyMoose_ScaleIn_C_UserConstructionScript) == 0x000018, "Wrong size on CBGA_SilkyMoose_ScaleIn_C_UserConstructionScript");
static_assert(offsetof(CBGA_SilkyMoose_ScaleIn_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'CBGA_SilkyMoose_ScaleIn_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

