#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CloseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CloseButton.CloseButton_C
// 0x0080 (0x10B0 - 0x1030)
class UCloseButton_C final : public UBacchusCloseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhover;                                           // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed;                                           // 0x1040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Container;                                  // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x1060(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Control;                                   // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x1078(0x0018)(Edit, BlueprintVisible)
	bool                                          FontSizeOveride;                                   // 0x1090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1091[0x3];                                     // 0x1091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x1094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Padding_Overide;                                   // 0x1098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PaddingOveride;                                    // 0x10A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void Construct();
	void ExecuteUbergraph_CloseButton(int32 EntryPoint);
	void HandleSize();
	void SetText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CloseButton_C">();
	}
	static class UCloseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCloseButton_C>();
	}
};
static_assert(alignof(UCloseButton_C) == 0x000010, "Wrong alignment on UCloseButton_C");
static_assert(sizeof(UCloseButton_C) == 0x0010B0, "Wrong size on UCloseButton_C");
static_assert(offsetof(UCloseButton_C, UberGraphFrame) == 0x001030, "Member 'UCloseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Unhover) == 0x001038, "Member 'UCloseButton_C::Unhover' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Pressed) == 0x001040, "Member 'UCloseButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Hover) == 0x001048, "Member 'UCloseButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Border_Container) == 0x001050, "Member 'UCloseButton_C::Border_Container' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, ButtonBacking) == 0x001058, "Member 'UCloseButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, CloseIcon) == 0x001060, "Member 'UCloseButton_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, SizeBox_Control) == 0x001068, "Member 'UCloseButton_C::SizeBox_Control' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Text_ButtonAction) == 0x001070, "Member 'UCloseButton_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Button_Description) == 0x001078, "Member 'UCloseButton_C::Button_Description' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, FontSizeOveride) == 0x001090, "Member 'UCloseButton_C::FontSizeOveride' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, FontSize) == 0x001094, "Member 'UCloseButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Padding_Overide) == 0x001098, "Member 'UCloseButton_C::Padding_Overide' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, PaddingOveride) == 0x0010A8, "Member 'UCloseButton_C::PaddingOveride' has a wrong offset!");

}

