#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonBigHealthBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonBigHealthBar.CommonBigHealthBar_C
// 0x0068 (0x0348 - 0x02E0)
class UCommonBigHealthBar_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         _Horizontal_Box__Health_Stat_Text;                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__HP_Baseplate;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               _Overlay__HP_Bar_Artwork;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           _ProgressBar__HP_Fill;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               _Size_Box__HP_Bar;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               _Size_Box__HP_Bevel;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageHPBevel;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            SwitcherHPText;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBuildModeHPText;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextCurrentHealthStat;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Current_HP_Value;                                  // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_HP_Value;                                      // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Last_HP_Value;                                     // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HP_Fade_Update_Rate;                               // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CommonBigHealthBar(int32 EntryPoint);
	void InitializeBar();
	void PreConstruct(bool IsDesignTime);
	void SetColors(const struct FLinearColor& ColorA, const struct FLinearColor& ColorB, const struct FLinearColor& BevelColor, const struct FLinearColor& BaseplateColor);
	void SetSwitcherTextIndex(int32 Index_0);
	void Update();
	void Update_Current_HP_Value(float Current);
	void Update_HP_Fill(float Percent);
	void Update_HP_Fill_Bar();
	void Update_HP_Text(const class FText& HP_Text);
	void Update_Max_HP_Value(float Max);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CommonBigHealthBar_C">();
	}
	static class UCommonBigHealthBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonBigHealthBar_C>();
	}
};
static_assert(alignof(UCommonBigHealthBar_C) == 0x000008, "Wrong alignment on UCommonBigHealthBar_C");
static_assert(sizeof(UCommonBigHealthBar_C) == 0x000348, "Wrong size on UCommonBigHealthBar_C");
static_assert(offsetof(UCommonBigHealthBar_C, UberGraphFrame) == 0x0002E0, "Member 'UCommonBigHealthBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, _Horizontal_Box__Health_Stat_Text) == 0x0002E8, "Member 'UCommonBigHealthBar_C::_Horizontal_Box__Health_Stat_Text' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, _Image__HP_Baseplate) == 0x0002F0, "Member 'UCommonBigHealthBar_C::_Image__HP_Baseplate' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, _Overlay__HP_Bar_Artwork) == 0x0002F8, "Member 'UCommonBigHealthBar_C::_Overlay__HP_Bar_Artwork' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, _ProgressBar__HP_Fill) == 0x000300, "Member 'UCommonBigHealthBar_C::_ProgressBar__HP_Fill' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, _Size_Box__HP_Bar) == 0x000308, "Member 'UCommonBigHealthBar_C::_Size_Box__HP_Bar' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, _Size_Box__HP_Bevel) == 0x000310, "Member 'UCommonBigHealthBar_C::_Size_Box__HP_Bevel' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, ImageHPBevel) == 0x000318, "Member 'UCommonBigHealthBar_C::ImageHPBevel' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, SwitcherHPText) == 0x000320, "Member 'UCommonBigHealthBar_C::SwitcherHPText' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, TextBuildModeHPText) == 0x000328, "Member 'UCommonBigHealthBar_C::TextBuildModeHPText' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, TextCurrentHealthStat) == 0x000330, "Member 'UCommonBigHealthBar_C::TextCurrentHealthStat' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, Current_HP_Value) == 0x000338, "Member 'UCommonBigHealthBar_C::Current_HP_Value' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, Max_HP_Value) == 0x00033C, "Member 'UCommonBigHealthBar_C::Max_HP_Value' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, Last_HP_Value) == 0x000340, "Member 'UCommonBigHealthBar_C::Last_HP_Value' has a wrong offset!");
static_assert(offsetof(UCommonBigHealthBar_C, HP_Fade_Update_Rate) == 0x000344, "Member 'UCommonBigHealthBar_C::HP_Fade_Update_Rate' has a wrong offset!");

}

