#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// Class CommonUI.CommonUILibrary
// 0x0000 (0x0028 - 0x0028)
class UCommonUILibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UWidget* FindParentWidgetOfType(class UWidget* StartingWidget, TSubclassOf<class UWidget> Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUILibrary">();
	}
	static class UCommonUILibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUILibrary>();
	}
};
static_assert(alignof(UCommonUILibrary) == 0x000008, "Wrong alignment on UCommonUILibrary");
static_assert(sizeof(UCommonUILibrary) == 0x000028, "Wrong size on UCommonUILibrary");

// Class CommonUI.CommonActivatableWidgetContainerBase
// 0x0120 (0x0268 - 0x0148)
class UCommonActivatableWidgetContainerBase : public UWidget
{
public:
	uint8                                         Pad_148[0x18];                                     // 0x0148(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	ECommonSwitcherTransition                     TransitionType;                                    // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETransitionCurve                              TransitionCurveType;                               // 0x0161(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransitionDuration;                                // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCommonActivatableWidget*>       WidgetList;                                        // 0x0168(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UCommonActivatableWidget*               DisplayedWidget;                                   // 0x0178(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUserWidgetPool                        GeneratedWidgetsPool;                              // 0x0180(0x0088)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_208[0x60];                                     // 0x0208(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCommonActivatableWidget* BP_AddWidget(TSubclassOf<class UCommonActivatableWidget> ActivatableWidgetClass);
	void ClearWidgets();
	void RemoveWidget(class UCommonActivatableWidget* WidgetToRemove);
	void SetTransitionDuration(float Duration);

	class UCommonActivatableWidget* GetActiveWidget() const;
	float GetTransitionDuration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonActivatableWidgetContainerBase">();
	}
	static class UCommonActivatableWidgetContainerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonActivatableWidgetContainerBase>();
	}
};
static_assert(alignof(UCommonActivatableWidgetContainerBase) == 0x000008, "Wrong alignment on UCommonActivatableWidgetContainerBase");
static_assert(sizeof(UCommonActivatableWidgetContainerBase) == 0x000268, "Wrong size on UCommonActivatableWidgetContainerBase");
static_assert(offsetof(UCommonActivatableWidgetContainerBase, TransitionType) == 0x000160, "Member 'UCommonActivatableWidgetContainerBase::TransitionType' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidgetContainerBase, TransitionCurveType) == 0x000161, "Member 'UCommonActivatableWidgetContainerBase::TransitionCurveType' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidgetContainerBase, TransitionDuration) == 0x000164, "Member 'UCommonActivatableWidgetContainerBase::TransitionDuration' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidgetContainerBase, WidgetList) == 0x000168, "Member 'UCommonActivatableWidgetContainerBase::WidgetList' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidgetContainerBase, DisplayedWidget) == 0x000178, "Member 'UCommonActivatableWidgetContainerBase::DisplayedWidget' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidgetContainerBase, GeneratedWidgetsPool) == 0x000180, "Member 'UCommonActivatableWidgetContainerBase::GeneratedWidgetsPool' has a wrong offset!");

// Class CommonUI.CommonActivatableWidgetStack
// 0x0010 (0x0278 - 0x0268)
class UCommonActivatableWidgetStack final : public UCommonActivatableWidgetContainerBase
{
public:
	TSubclassOf<class UCommonActivatableWidget>   RootContentWidgetClass;                            // 0x0268(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidget*               RootContentWidget;                                 // 0x0270(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonActivatableWidgetStack">();
	}
	static class UCommonActivatableWidgetStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonActivatableWidgetStack>();
	}
};
static_assert(alignof(UCommonActivatableWidgetStack) == 0x000008, "Wrong alignment on UCommonActivatableWidgetStack");
static_assert(sizeof(UCommonActivatableWidgetStack) == 0x000278, "Wrong size on UCommonActivatableWidgetStack");
static_assert(offsetof(UCommonActivatableWidgetStack, RootContentWidgetClass) == 0x000268, "Member 'UCommonActivatableWidgetStack::RootContentWidgetClass' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidgetStack, RootContentWidget) == 0x000270, "Member 'UCommonActivatableWidgetStack::RootContentWidget' has a wrong offset!");

// Class CommonUI.AnalogSlider
// 0x0020 (0x06B0 - 0x0690)
class UAnalogSlider : public USlider
{
public:
	TMulticastInlineDelegate<void(float Value)>   OnAnalogCapture;                                   // 0x0690(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A0[0x10];                                     // 0x06A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnalogSlider">();
	}
	static class UAnalogSlider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnalogSlider>();
	}
};
static_assert(alignof(UAnalogSlider) == 0x000010, "Wrong alignment on UAnalogSlider");
static_assert(sizeof(UAnalogSlider) == 0x0006B0, "Wrong size on UAnalogSlider");
static_assert(offsetof(UAnalogSlider, OnAnalogCapture) == 0x000690, "Member 'UAnalogSlider::OnAnalogCapture' has a wrong offset!");

// Class CommonUI.CommonActionHandlerInterface
// 0x0000 (0x0028 - 0x0028)
class ICommonActionHandlerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonActionHandlerInterface">();
	}
	static class ICommonActionHandlerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICommonActionHandlerInterface>();
	}
};
static_assert(alignof(ICommonActionHandlerInterface) == 0x000008, "Wrong alignment on ICommonActionHandlerInterface");
static_assert(sizeof(ICommonActionHandlerInterface) == 0x000028, "Wrong size on ICommonActionHandlerInterface");

// Class CommonUI.CommonActionWidget
// 0x02D8 (0x0420 - 0x0148)
class UCommonActionWidget final : public UWidget
{
public:
	TMulticastInlineDelegate<void(bool bUsingGamepad)> OnInputMethodChanged;                              // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ProgressMaterialBrush;                             // 0x0160(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FName                                   ProgressMaterialParam;                             // 0x0220(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_224[0xC];                                      // 0x0224(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconRimBrush;                                      // 0x0230(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FDataTableRowHandle>            InputActions;                                      // 0x02F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ProgressDynamicMaterial;                           // 0x0308(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x110];                                    // 0x0310(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIconRimBrush(const struct FSlateBrush& InIconRimBrush);
	void SetInputAction(const struct FDataTableRowHandle& InputActionRow);
	void SetInputActions(const TArray<struct FDataTableRowHandle>& NewInputActions);

	class FText GetDisplayText() const;
	struct FSlateBrush GetIcon() const;
	bool IsHeldAction() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonActionWidget">();
	}
	static class UCommonActionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonActionWidget>();
	}
};
static_assert(alignof(UCommonActionWidget) == 0x000010, "Wrong alignment on UCommonActionWidget");
static_assert(sizeof(UCommonActionWidget) == 0x000420, "Wrong size on UCommonActionWidget");
static_assert(offsetof(UCommonActionWidget, OnInputMethodChanged) == 0x000148, "Member 'UCommonActionWidget::OnInputMethodChanged' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, ProgressMaterialBrush) == 0x000160, "Member 'UCommonActionWidget::ProgressMaterialBrush' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, ProgressMaterialParam) == 0x000220, "Member 'UCommonActionWidget::ProgressMaterialParam' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, IconRimBrush) == 0x000230, "Member 'UCommonActionWidget::IconRimBrush' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, InputActions) == 0x0002F0, "Member 'UCommonActionWidget::InputActions' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, ProgressDynamicMaterial) == 0x000308, "Member 'UCommonActionWidget::ProgressDynamicMaterial' has a wrong offset!");

// Class CommonUI.CommonUIEditorSettings
// 0x0080 (0x00A8 - 0x0028)
class UCommonUIEditorSettings final : public UObject
{
public:
	TSoftClassPtr<class UClass>                   TemplateTextStyle;                                 // 0x0028(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   TemplateButtonStyle;                               // 0x0050(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   TemplateBorderStyle;                               // 0x0078(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUIEditorSettings">();
	}
	static class UCommonUIEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIEditorSettings>();
	}
};
static_assert(alignof(UCommonUIEditorSettings) == 0x000008, "Wrong alignment on UCommonUIEditorSettings");
static_assert(sizeof(UCommonUIEditorSettings) == 0x0000A8, "Wrong size on UCommonUIEditorSettings");
static_assert(offsetof(UCommonUIEditorSettings, TemplateTextStyle) == 0x000028, "Member 'UCommonUIEditorSettings::TemplateTextStyle' has a wrong offset!");
static_assert(offsetof(UCommonUIEditorSettings, TemplateButtonStyle) == 0x000050, "Member 'UCommonUIEditorSettings::TemplateButtonStyle' has a wrong offset!");
static_assert(offsetof(UCommonUIEditorSettings, TemplateBorderStyle) == 0x000078, "Member 'UCommonUIEditorSettings::TemplateBorderStyle' has a wrong offset!");

// Class CommonUI.CommonUserWidget
// 0x0028 (0x02E0 - 0x02B8)
class UCommonUserWidget : public UUserWidget
{
public:
	bool                                          bDisplayInActionBar;                               // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bConsumePointerInput;                              // 0x02B9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BA[0x26];                                     // 0x02BA(0x0026)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetConsumePointerInput(bool bInConsumePointerInput);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUserWidget">();
	}
	static class UCommonUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUserWidget>();
	}
};
static_assert(alignof(UCommonUserWidget) == 0x000008, "Wrong alignment on UCommonUserWidget");
static_assert(sizeof(UCommonUserWidget) == 0x0002E0, "Wrong size on UCommonUserWidget");
static_assert(offsetof(UCommonUserWidget, bDisplayInActionBar) == 0x0002B8, "Member 'UCommonUserWidget::bDisplayInActionBar' has a wrong offset!");
static_assert(offsetof(UCommonUserWidget, bConsumePointerInput) == 0x0002B9, "Member 'UCommonUserWidget::bConsumePointerInput' has a wrong offset!");

// Class CommonUI.CommonUIInputSettings
// 0x0050 (0x0078 - 0x0028)
class UCommonUIInputSettings final : public UObject
{
public:
	bool                                          bLinkCursorToGamepadFocus;                         // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UIActionProcessingPriority;                        // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FUIInputAction>                 InputActions;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FUIInputAction>                 ActionOverrides;                                   // 0x0040(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	struct FCommonAnalogCursorSettings            AnalogCursorSettings;                              // 0x0050(0x0024)(Edit, Config, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUIInputSettings">();
	}
	static class UCommonUIInputSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIInputSettings>();
	}
};
static_assert(alignof(UCommonUIInputSettings) == 0x000008, "Wrong alignment on UCommonUIInputSettings");
static_assert(sizeof(UCommonUIInputSettings) == 0x000078, "Wrong size on UCommonUIInputSettings");
static_assert(offsetof(UCommonUIInputSettings, bLinkCursorToGamepadFocus) == 0x000028, "Member 'UCommonUIInputSettings::bLinkCursorToGamepadFocus' has a wrong offset!");
static_assert(offsetof(UCommonUIInputSettings, UIActionProcessingPriority) == 0x00002C, "Member 'UCommonUIInputSettings::UIActionProcessingPriority' has a wrong offset!");
static_assert(offsetof(UCommonUIInputSettings, InputActions) == 0x000030, "Member 'UCommonUIInputSettings::InputActions' has a wrong offset!");
static_assert(offsetof(UCommonUIInputSettings, ActionOverrides) == 0x000040, "Member 'UCommonUIInputSettings::ActionOverrides' has a wrong offset!");
static_assert(offsetof(UCommonUIInputSettings, AnalogCursorSettings) == 0x000050, "Member 'UCommonUIInputSettings::AnalogCursorSettings' has a wrong offset!");

// Class CommonUI.CommonActivatableWidget
// 0x0118 (0x03F8 - 0x02E0)
class UCommonActivatableWidget : public UCommonUserWidget
{
public:
	bool                                          bIsBackHandler;                                    // 0x02E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBackActionDisplayedInActionBar;                 // 0x02E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoActivate;                                     // 0x02E2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsActivationFocus;                          // 0x02E3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsModal;                                          // 0x02E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoRestoreFocus;                                 // 0x02E5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideActionDomain;                             // 0x02E6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E7[0x1];                                      // 0x02E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCommonInputActionDomain> ActionDomainOverride;                              // 0x02E8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              BP_OnWidgetActivated;                              // 0x0310(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              BP_OnWidgetDeactivated;                            // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	bool                                          bIsActive;                                         // 0x0330(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UCommonActivatableWidget>> VisibilityBoundWidgets;                            // 0x0338(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0xA8];                                     // 0x0348(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSetVisibilityOnActivated;                         // 0x03F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              ActivatedVisibility;                               // 0x03F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSetVisibilityOnDeactivated;                       // 0x03F2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              DeactivatedVisibility;                             // 0x03F3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateWidget();
	void BindVisibilityToActivation(class UCommonActivatableWidget* ActivatableWidget);
	void BP_OnActivated();
	void BP_OnDeactivated();
	bool BP_OnHandleBackAction();
	void DeactivateWidget();
	void SetBindVisibilities(ESlateVisibility OnActivatedVisibility, ESlateVisibility OnDeactivatedVisibility, bool bInAllActive);

	class UWidget* BP_GetDesiredFocusTarget() const;
	class UWidget* GetDesiredFocusTarget() const;
	bool IsActivated() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonActivatableWidget">();
	}
	static class UCommonActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonActivatableWidget>();
	}
};
static_assert(alignof(UCommonActivatableWidget) == 0x000008, "Wrong alignment on UCommonActivatableWidget");
static_assert(sizeof(UCommonActivatableWidget) == 0x0003F8, "Wrong size on UCommonActivatableWidget");
static_assert(offsetof(UCommonActivatableWidget, bIsBackHandler) == 0x0002E0, "Member 'UCommonActivatableWidget::bIsBackHandler' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bIsBackActionDisplayedInActionBar) == 0x0002E1, "Member 'UCommonActivatableWidget::bIsBackActionDisplayedInActionBar' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bAutoActivate) == 0x0002E2, "Member 'UCommonActivatableWidget::bAutoActivate' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bSupportsActivationFocus) == 0x0002E3, "Member 'UCommonActivatableWidget::bSupportsActivationFocus' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bIsModal) == 0x0002E4, "Member 'UCommonActivatableWidget::bIsModal' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bAutoRestoreFocus) == 0x0002E5, "Member 'UCommonActivatableWidget::bAutoRestoreFocus' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bOverrideActionDomain) == 0x0002E6, "Member 'UCommonActivatableWidget::bOverrideActionDomain' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, ActionDomainOverride) == 0x0002E8, "Member 'UCommonActivatableWidget::ActionDomainOverride' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, BP_OnWidgetActivated) == 0x000310, "Member 'UCommonActivatableWidget::BP_OnWidgetActivated' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, BP_OnWidgetDeactivated) == 0x000320, "Member 'UCommonActivatableWidget::BP_OnWidgetDeactivated' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bIsActive) == 0x000330, "Member 'UCommonActivatableWidget::bIsActive' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, VisibilityBoundWidgets) == 0x000338, "Member 'UCommonActivatableWidget::VisibilityBoundWidgets' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bSetVisibilityOnActivated) == 0x0003F0, "Member 'UCommonActivatableWidget::bSetVisibilityOnActivated' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, ActivatedVisibility) == 0x0003F1, "Member 'UCommonActivatableWidget::ActivatedVisibility' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bSetVisibilityOnDeactivated) == 0x0003F2, "Member 'UCommonActivatableWidget::bSetVisibilityOnDeactivated' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, DeactivatedVisibility) == 0x0003F3, "Member 'UCommonActivatableWidget::DeactivatedVisibility' has a wrong offset!");

// Class CommonUI.CommonUIRichTextData
// 0x0008 (0x0030 - 0x0028)
class UCommonUIRichTextData : public UObject
{
public:
	class UDataTable*                             InlineIconSet;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUIRichTextData">();
	}
	static class UCommonUIRichTextData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIRichTextData>();
	}
};
static_assert(alignof(UCommonUIRichTextData) == 0x000008, "Wrong alignment on UCommonUIRichTextData");
static_assert(sizeof(UCommonUIRichTextData) == 0x000030, "Wrong size on UCommonUIRichTextData");
static_assert(offsetof(UCommonUIRichTextData, InlineIconSet) == 0x000028, "Member 'UCommonUIRichTextData::InlineIconSet' has a wrong offset!");

// Class CommonUI.CommonActivatableWidgetQueue
// 0x0000 (0x0268 - 0x0268)
class UCommonActivatableWidgetQueue final : public UCommonActivatableWidgetContainerBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonActivatableWidgetQueue">();
	}
	static class UCommonActivatableWidgetQueue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonActivatableWidgetQueue>();
	}
};
static_assert(alignof(UCommonActivatableWidgetQueue) == 0x000008, "Wrong alignment on UCommonActivatableWidgetQueue");
static_assert(sizeof(UCommonActivatableWidgetQueue) == 0x000268, "Wrong size on UCommonActivatableWidgetQueue");

// Class CommonUI.CommonAnimatedSwitcher
// 0x0070 (0x01E8 - 0x0178)
class UCommonAnimatedSwitcher : public UWidgetSwitcher
{
public:
	uint8                                         Pad_178[0x30];                                     // 0x0178(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	ECommonSwitcherTransition                     TransitionType;                                    // 0x01A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETransitionCurve                              TransitionCurveType;                               // 0x01A9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransitionDuration;                                // 0x01AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B0[0x38];                                     // 0x01B0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateNextWidget(bool bCanWrap);
	void ActivatePreviousWidget(bool bCanWrap);
	void SetDisableTransitionAnimation(bool bDisableAnimation);

	bool HasWidgets() const;
	bool IsCurrentlySwitching() const;
	bool IsTransitionPlaying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonAnimatedSwitcher">();
	}
	static class UCommonAnimatedSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonAnimatedSwitcher>();
	}
};
static_assert(alignof(UCommonAnimatedSwitcher) == 0x000008, "Wrong alignment on UCommonAnimatedSwitcher");
static_assert(sizeof(UCommonAnimatedSwitcher) == 0x0001E8, "Wrong size on UCommonAnimatedSwitcher");
static_assert(offsetof(UCommonAnimatedSwitcher, TransitionType) == 0x0001A8, "Member 'UCommonAnimatedSwitcher::TransitionType' has a wrong offset!");
static_assert(offsetof(UCommonAnimatedSwitcher, TransitionCurveType) == 0x0001A9, "Member 'UCommonAnimatedSwitcher::TransitionCurveType' has a wrong offset!");
static_assert(offsetof(UCommonAnimatedSwitcher, TransitionDuration) == 0x0001AC, "Member 'UCommonAnimatedSwitcher::TransitionDuration' has a wrong offset!");

// Class CommonUI.CommonUISubsystemBase
// 0x0010 (0x0040 - 0x0030)
class UCommonUISubsystemBase : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FSlateBrush GetInputActionButtonIcon(const struct FDataTableRowHandle& InputActionRowHandle, ECommonInputType InputType, const class FName& GamepadName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUISubsystemBase">();
	}
	static class UCommonUISubsystemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUISubsystemBase>();
	}
};
static_assert(alignof(UCommonUISubsystemBase) == 0x000008, "Wrong alignment on UCommonUISubsystemBase");
static_assert(sizeof(UCommonUISubsystemBase) == 0x000040, "Wrong size on UCommonUISubsystemBase");

// Class CommonUI.CommonActivatableWidgetSwitcher
// 0x0010 (0x01F8 - 0x01E8)
class UCommonActivatableWidgetSwitcher final : public UCommonAnimatedSwitcher
{
public:
	uint8                                         Pad_1E8[0x10];                                     // 0x01E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonActivatableWidgetSwitcher">();
	}
	static class UCommonActivatableWidgetSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonActivatableWidgetSwitcher>();
	}
};
static_assert(alignof(UCommonActivatableWidgetSwitcher) == 0x000008, "Wrong alignment on UCommonActivatableWidgetSwitcher");
static_assert(sizeof(UCommonActivatableWidgetSwitcher) == 0x0001F8, "Wrong size on UCommonActivatableWidgetSwitcher");

// Class CommonUI.CommonUIVisibilitySubsystem
// 0x0058 (0x0088 - 0x0030)
class UCommonUIVisibilitySubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonUIVisibilitySubsystem">();
	}
	static class UCommonUIVisibilitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIVisibilitySubsystem>();
	}
};
static_assert(alignof(UCommonUIVisibilitySubsystem) == 0x000008, "Wrong alignment on UCommonUIVisibilitySubsystem");
static_assert(sizeof(UCommonUIVisibilitySubsystem) == 0x000088, "Wrong size on UCommonUIVisibilitySubsystem");

// Class CommonUI.CommonBorderStyle
// 0x00C8 (0x00F0 - 0x0028)
class UCommonBorderStyle : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Background;                                        // 0x0030(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	void GetBackgroundBrush(struct FSlateBrush* Brush) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonBorderStyle">();
	}
	static class UCommonBorderStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonBorderStyle>();
	}
};
static_assert(alignof(UCommonBorderStyle) == 0x000010, "Wrong alignment on UCommonBorderStyle");
static_assert(sizeof(UCommonBorderStyle) == 0x0000F0, "Wrong size on UCommonBorderStyle");
static_assert(offsetof(UCommonBorderStyle, Background) == 0x000030, "Member 'UCommonBorderStyle::Background' has a wrong offset!");

// Class CommonUI.CommonVisibilitySwitcher
// 0x0028 (0x0198 - 0x0170)
class UCommonVisibilitySwitcher : public UOverlay
{
public:
	ESlateVisibility                              ShownVisibility;                                   // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ActiveWidgetIndex;                                 // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoActivateSlot;                                 // 0x0178(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bActivateFirstSlotOnAdding;                        // 0x0179(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_17A[0x1E];                                     // 0x017A(0x001E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateVisibleSlot();
	void DeactivateVisibleSlot();
	void DecrementActiveWidgetIndex(bool bAllowWrapping);
	void IncrementActiveWidgetIndex(bool bAllowWrapping);
	void SetActiveWidget(const class UWidget* Widget);
	void SetActiveWidgetIndex(int32 Index_0);

	class UWidget* GetActiveWidget() const;
	int32 GetActiveWidgetIndex() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonVisibilitySwitcher">();
	}
	static class UCommonVisibilitySwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonVisibilitySwitcher>();
	}
};
static_assert(alignof(UCommonVisibilitySwitcher) == 0x000008, "Wrong alignment on UCommonVisibilitySwitcher");
static_assert(sizeof(UCommonVisibilitySwitcher) == 0x000198, "Wrong size on UCommonVisibilitySwitcher");
static_assert(offsetof(UCommonVisibilitySwitcher, ShownVisibility) == 0x000170, "Member 'UCommonVisibilitySwitcher::ShownVisibility' has a wrong offset!");
static_assert(offsetof(UCommonVisibilitySwitcher, ActiveWidgetIndex) == 0x000174, "Member 'UCommonVisibilitySwitcher::ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(UCommonVisibilitySwitcher, bAutoActivateSlot) == 0x000178, "Member 'UCommonVisibilitySwitcher::bAutoActivateSlot' has a wrong offset!");
static_assert(offsetof(UCommonVisibilitySwitcher, bActivateFirstSlotOnAdding) == 0x000179, "Member 'UCommonVisibilitySwitcher::bActivateFirstSlotOnAdding' has a wrong offset!");

// Class CommonUI.CommonBorder
// 0x0020 (0x02F0 - 0x02D0)
class UCommonBorder : public UBorder
{
public:
	TSubclassOf<class UCommonBorderStyle>         style;                                             // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReducePaddingBySafezone;                          // 0x02D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                MinimumPadding;                                    // 0x02DC(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetStyle(TSubclassOf<class UCommonBorderStyle> InStyle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonBorder">();
	}
	static class UCommonBorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonBorder>();
	}
};
static_assert(alignof(UCommonBorder) == 0x000010, "Wrong alignment on UCommonBorder");
static_assert(sizeof(UCommonBorder) == 0x0002F0, "Wrong size on UCommonBorder");
static_assert(offsetof(UCommonBorder, style) == 0x0002D0, "Member 'UCommonBorder::style' has a wrong offset!");
static_assert(offsetof(UCommonBorder, bReducePaddingBySafezone) == 0x0002D8, "Member 'UCommonBorder::bReducePaddingBySafezone' has a wrong offset!");
static_assert(offsetof(UCommonBorder, MinimumPadding) == 0x0002DC, "Member 'UCommonBorder::MinimumPadding' has a wrong offset!");

// Class CommonUI.CommonVisibilitySwitcherSlot
// 0x0010 (0x0068 - 0x0058)
class UCommonVisibilitySwitcherSlot final : public UOverlaySlot
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonVisibilitySwitcherSlot">();
	}
	static class UCommonVisibilitySwitcherSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonVisibilitySwitcherSlot>();
	}
};
static_assert(alignof(UCommonVisibilitySwitcherSlot) == 0x000008, "Wrong alignment on UCommonVisibilitySwitcherSlot");
static_assert(sizeof(UCommonVisibilitySwitcherSlot) == 0x000068, "Wrong size on UCommonVisibilitySwitcherSlot");

// Class CommonUI.CommonBoundActionBar
// 0x0010 (0x0238 - 0x0228)
class UCommonBoundActionBar final : public UDynamicEntryBoxBase
{
public:
	TSubclassOf<class UCommonBoundActionButton>   ActionButtonClass;                                 // 0x0228(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayOwningPlayerActionsOnly;                   // 0x0230(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIgnoreDuplicateActions;                           // 0x0231(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDisplayOwningPlayerActionsOnly(bool bShouldOnlyDisplayOwningPlayerActions);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonBoundActionBar">();
	}
	static class UCommonBoundActionBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonBoundActionBar>();
	}
};
static_assert(alignof(UCommonBoundActionBar) == 0x000008, "Wrong alignment on UCommonBoundActionBar");
static_assert(sizeof(UCommonBoundActionBar) == 0x000238, "Wrong size on UCommonBoundActionBar");
static_assert(offsetof(UCommonBoundActionBar, ActionButtonClass) == 0x000228, "Member 'UCommonBoundActionBar::ActionButtonClass' has a wrong offset!");
static_assert(offsetof(UCommonBoundActionBar, bDisplayOwningPlayerActionsOnly) == 0x000230, "Member 'UCommonBoundActionBar::bDisplayOwningPlayerActionsOnly' has a wrong offset!");
static_assert(offsetof(UCommonBoundActionBar, bIgnoreDuplicateActions) == 0x000231, "Member 'UCommonBoundActionBar::bIgnoreDuplicateActions' has a wrong offset!");

// Class CommonUI.UCommonVisibilityWidgetBase
// 0x0060 (0x0350 - 0x02F0)
class UUCommonVisibilityWidgetBase final : public UCommonBorder
{
public:
	TMap<class FName, bool>                       VisibilityControls;                                // 0x02F0(0x0050)(Edit, EditFixedSize, NativeAccessSpecifierPublic)
	bool                                          bShowForGamepad;                                   // 0x0340(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForMouseAndKeyboard;                          // 0x0341(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForTouch;                                     // 0x0342(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              VisibleType;                                       // 0x0343(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              HiddenType;                                        // 0x0344(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_345[0xB];                                      // 0x0345(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static const TArray<class FName> GetRegisteredPlatforms();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UCommonVisibilityWidgetBase">();
	}
	static class UUCommonVisibilityWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUCommonVisibilityWidgetBase>();
	}
};
static_assert(alignof(UUCommonVisibilityWidgetBase) == 0x000010, "Wrong alignment on UUCommonVisibilityWidgetBase");
static_assert(sizeof(UUCommonVisibilityWidgetBase) == 0x000350, "Wrong size on UUCommonVisibilityWidgetBase");
static_assert(offsetof(UUCommonVisibilityWidgetBase, VisibilityControls) == 0x0002F0, "Member 'UUCommonVisibilityWidgetBase::VisibilityControls' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, bShowForGamepad) == 0x000340, "Member 'UUCommonVisibilityWidgetBase::bShowForGamepad' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, bShowForMouseAndKeyboard) == 0x000341, "Member 'UUCommonVisibilityWidgetBase::bShowForMouseAndKeyboard' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, bShowForTouch) == 0x000342, "Member 'UUCommonVisibilityWidgetBase::bShowForTouch' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, VisibleType) == 0x000343, "Member 'UUCommonVisibilityWidgetBase::VisibleType' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, HiddenType) == 0x000344, "Member 'UUCommonVisibilityWidgetBase::HiddenType' has a wrong offset!");

// Class CommonUI.CommonButtonBase
// 0x0D00 (0x0FE0 - 0x02E0)
#pragma pack(push, 0x1)
class alignas(0x10) UCommonButtonBase : public UCommonUserWidget
{
public:
	int32                                         MinWidth;                                          // 0x02E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MinHeight;                                         // 0x02E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonButtonStyle>         style;                                             // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHideInputAction;                                  // 0x02F0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateSound                            PressedSlateSoundOverride;                         // 0x02F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSlateSound                            HoveredSlateSoundOverride;                         // 0x0310(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bApplyAlphaOnDisable : 1;                          // 0x0328(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bSelectable : 1;                                   // 0x0328(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldSelectUponReceivingFocus : 1;               // 0x0328(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bInteractableWhenSelected : 1;                     // 0x0328(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bToggleable : 1;                                   // 0x0328(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bDisplayInputActionWhenNotInteractable : 1;        // 0x0328(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHideInputActionWithKeyboard : 1;                  // 0x0328(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldUseFallbackDefaultInputAction : 1;          // 0x0328(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_329[0x1];                                      // 0x0329(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EButtonClickMethod                            ClickMethod;                                       // 0x032A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonTouchMethod                            TouchMethod;                                       // 0x032B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonPressMethod                            PressMethod;                                       // 0x032C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InputPriority;                                     // 0x0330(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    TriggeringInputAction;                             // 0x0338(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x10];                                     // 0x0348(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button, bool Selected)> OnSelectedChangedBase;                             // 0x0358(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnButtonBaseClicked;                               // 0x0368(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnButtonBaseDoubleClicked;                         // 0x0378(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnButtonBaseHovered;                               // 0x0388(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnButtonBaseUnhovered;                             // 0x0398(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x4];                                      // 0x03A8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsPersistentBinding;                              // 0x03AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECommonInputMode                              InputModeOverride;                                 // 0x03AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3AE[0x32];                                     // 0x03AE(0x0032)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               SingleMaterialStyleMID;                            // 0x03E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           NormalStyle;                                       // 0x03F0(0x03B0)(NativeAccessSpecifierPrivate)
	struct FButtonStyle                           SelectedStyle;                                     // 0x07A0(0x03B0)(NativeAccessSpecifierPrivate)
	struct FButtonStyle                           DisabledStyle;                                     // 0x0B50(0x03B0)(NativeAccessSpecifierPrivate)
	uint8                                         bStopDoubleClickPropagation : 1;                   // 0x0F00(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_F01[0xCF];                                     // 0x0F01(0x00CF)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActionWidget*                    InputActionWidget;                                 // 0x0FD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnDisabled();
	void BP_OnDoubleClicked();
	void BP_OnEnabled();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ClearSelection();
	void DisableButtonWithReason(const class FText& DisabledReason);
	void HandleButtonClicked();
	void HandleButtonPressed();
	void HandleButtonReleased();
	void HandleFocusReceived();
	void HandleTriggeringActionCommited(bool* bPassThrough);
	void NativeOnActionComplete();
	void NativeOnActionProgress(float HeldPercent);
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnCurrentTextStyleChanged();
	void OnInputMethodChanged(ECommonInputType CurrentInputType);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void SetClickMethod(EButtonClickMethod InClickMethod);
	void SetHoveredSoundOverride(class USoundBase* sound);
	void SetInputActionProgressMaterial(const struct FSlateBrush& InProgressMaterialBrush, const class FName& InProgressMaterialParam);
	void SetIsFocusable(bool bInIsFocusable);
	void SetIsInteractableWhenSelected(bool bInInteractableWhenSelected);
	void SetIsInteractionEnabled(bool bInIsInteractionEnabled);
	void SetIsSelectable(bool bInIsSelectable);
	void SetIsSelected(bool InSelected, bool bGiveClickFeedback);
	void SetIsToggleable(bool bInIsToggleable);
	void SetMinDimensions(int32 InMinWidth, int32 InMinHeight);
	void SetPressedSoundOverride(class USoundBase* sound);
	void SetPressMethod(EButtonPressMethod InPressMethod);
	void SetSelectedInternal(bool bInSelected, bool bAllowSound, bool bBroadcast);
	void SetShouldSelectUponReceivingFocus(bool bInShouldSelectUponReceivingFocus);
	void SetShouldUseFallbackDefaultInputAction(bool bInShouldUseFallbackDefaultInputAction);
	void SetStyle(TSubclassOf<class UCommonButtonStyle> InStyle);
	void SetTouchMethod(EButtonTouchMethod InTouchMethod);
	void SetTriggeredInputAction(const struct FDataTableRowHandle& InputActionRow);
	void SetTriggeringInputAction(const struct FDataTableRowHandle& InputActionRow);
	void StopDoubleClickPropagation();

	void GetCurrentButtonPadding(struct FMargin* OutButtonPadding) const;
	void GetCurrentCustomPadding(struct FMargin* OutCustomPadding) const;
	class UCommonTextStyle* GetCurrentTextStyle() const;
	TSubclassOf<class UCommonTextStyle> GetCurrentTextStyleClass() const;
	bool GetInputAction(struct FDataTableRowHandle* InputActionRow) const;
	bool GetIsFocusable() const;
	bool GetSelected() const;
	bool GetShouldSelectUponReceivingFocus() const;
	class UMaterialInstanceDynamic* GetSingleMaterialStyleMID() const;
	class UCommonButtonStyle* GetStyle() const;
	bool IsInteractionEnabled() const;
	bool IsPressed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonButtonBase">();
	}
	static class UCommonButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonButtonBase>();
	}
};
#pragma pack(pop)
static_assert(alignof(UCommonButtonBase) == 0x000010, "Wrong alignment on UCommonButtonBase");
static_assert(sizeof(UCommonButtonBase) == 0x000FE0, "Wrong size on UCommonButtonBase");
static_assert(offsetof(UCommonButtonBase, MinWidth) == 0x0002E0, "Member 'UCommonButtonBase::MinWidth' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, MinHeight) == 0x0002E4, "Member 'UCommonButtonBase::MinHeight' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, style) == 0x0002E8, "Member 'UCommonButtonBase::style' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, bHideInputAction) == 0x0002F0, "Member 'UCommonButtonBase::bHideInputAction' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, PressedSlateSoundOverride) == 0x0002F8, "Member 'UCommonButtonBase::PressedSlateSoundOverride' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, HoveredSlateSoundOverride) == 0x000310, "Member 'UCommonButtonBase::HoveredSlateSoundOverride' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, ClickMethod) == 0x00032A, "Member 'UCommonButtonBase::ClickMethod' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, TouchMethod) == 0x00032B, "Member 'UCommonButtonBase::TouchMethod' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, PressMethod) == 0x00032C, "Member 'UCommonButtonBase::PressMethod' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, InputPriority) == 0x000330, "Member 'UCommonButtonBase::InputPriority' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, TriggeringInputAction) == 0x000338, "Member 'UCommonButtonBase::TriggeringInputAction' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, OnSelectedChangedBase) == 0x000358, "Member 'UCommonButtonBase::OnSelectedChangedBase' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, OnButtonBaseClicked) == 0x000368, "Member 'UCommonButtonBase::OnButtonBaseClicked' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, OnButtonBaseDoubleClicked) == 0x000378, "Member 'UCommonButtonBase::OnButtonBaseDoubleClicked' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, OnButtonBaseHovered) == 0x000388, "Member 'UCommonButtonBase::OnButtonBaseHovered' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, OnButtonBaseUnhovered) == 0x000398, "Member 'UCommonButtonBase::OnButtonBaseUnhovered' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, bIsPersistentBinding) == 0x0003AC, "Member 'UCommonButtonBase::bIsPersistentBinding' has a wrong offset!");
static_assert(offsetof(UCommonButtonBase, InputModeOverride) == 0x0003AD, "Member 'UCommonButtonBase::InputModeOverride' has a wrong offset!");
