#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Continue

#include "Basic.hpp"

#include "CommonConversationRuntime_structs.hpp"


namespace SDK::Params
{

// Function Continue.Continue_C.ExecuteTaskNode
// 0x0138 (0x0138 - 0x0000)
struct Continue_C_ExecuteTaskNode final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FConversationTaskResult                ReturnValue;                                       // 0x0038(0x0080)(Parm, OutParm, ReturnParm)
	struct FConversationTaskResult                CallFunc_AdvanceConversation_ReturnValue;          // 0x00B8(0x0080)()
};
static_assert(alignof(Continue_C_ExecuteTaskNode) == 0x000008, "Wrong alignment on Continue_C_ExecuteTaskNode");
static_assert(sizeof(Continue_C_ExecuteTaskNode) == 0x000138, "Wrong size on Continue_C_ExecuteTaskNode");
static_assert(offsetof(Continue_C_ExecuteTaskNode, Context) == 0x000000, "Member 'Continue_C_ExecuteTaskNode::Context' has a wrong offset!");
static_assert(offsetof(Continue_C_ExecuteTaskNode, ReturnValue) == 0x000038, "Member 'Continue_C_ExecuteTaskNode::ReturnValue' has a wrong offset!");
static_assert(offsetof(Continue_C_ExecuteTaskNode, CallFunc_AdvanceConversation_ReturnValue) == 0x0000B8, "Member 'Continue_C_ExecuteTaskNode::CallFunc_AdvanceConversation_ReturnValue' has a wrong offset!");

}

