#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContentOnDemand

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ContentOnDemand.ContentOnDemand_C
// 0x0038 (0x03E0 - 0x03A8)
class UContentOnDemand_C final : public UFortContentOnDemand
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Downloaded;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Downloading;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LastNotifiedNumDownload;                           // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastDisplayedNumDownload;                          // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ContentOnDemand(int32 EntryPoint);
	void OnUpdatedState(int32 NumActiveDownloads, int32 NumErrors);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ContentOnDemand_C">();
	}
	static class UContentOnDemand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentOnDemand_C>();
	}
};
static_assert(alignof(UContentOnDemand_C) == 0x000008, "Wrong alignment on UContentOnDemand_C");
static_assert(sizeof(UContentOnDemand_C) == 0x0003E0, "Wrong size on UContentOnDemand_C");
static_assert(offsetof(UContentOnDemand_C, UberGraphFrame) == 0x0003A8, "Member 'UContentOnDemand_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Intro) == 0x0003B0, "Member 'UContentOnDemand_C::Intro' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Outro) == 0x0003B8, "Member 'UContentOnDemand_C::Outro' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Check) == 0x0003C0, "Member 'UContentOnDemand_C::Check' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Text_Downloaded) == 0x0003C8, "Member 'UContentOnDemand_C::Text_Downloaded' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, Text_Downloading) == 0x0003D0, "Member 'UContentOnDemand_C::Text_Downloading' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, LastNotifiedNumDownload) == 0x0003D8, "Member 'UContentOnDemand_C::LastNotifiedNumDownload' has a wrong offset!");
static_assert(offsetof(UContentOnDemand_C, LastDisplayedNumDownload) == 0x0003DC, "Member 'UContentOnDemand_C::LastDisplayedNumDownload' has a wrong offset!");

}

