#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContextTutorialIndicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function ContextTutorialIndicator.ContextTutorialIndicator_C.ExecuteUbergraph_ContextTutorialIndicator
// 0x00E0 (0x00E0 - 0x0000)
struct ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0030(0x0018)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0074(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_3;  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator) == 0x000008, "Wrong alignment on ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator");
static_assert(sizeof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator) == 0x0000E0, "Wrong size on ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, EntryPoint) == 0x000000, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, K2Node_CreateDelegate_OutputDelegate_2) == 0x00001C, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000028, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, K2Node_Event_Text) == 0x000030, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000048, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000050, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000060, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000068, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_IsVisible_ReturnValue) == 0x000071, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, K2Node_CreateDelegate_OutputDelegate_3) == 0x000074, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_CreatePlayAnimationProxyObject_Result_2) == 0x000080, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_CreatePlayAnimationProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2) == 0x000088, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_CreatePlayAnimationProxyObject_Result_3) == 0x0000A0, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_CreatePlayAnimationProxyObject_Result_3' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3) == 0x0000A8, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000B0, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_IsValid_ReturnValue_3) == 0x0000B8, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000C0, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000C8, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x0000D0, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000D8, "Member 'ContextTutorialIndicator_C_ExecuteUbergraph_ContextTutorialIndicator::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");

// Function ContextTutorialIndicator.ContextTutorialIndicator_C.SetIndicatorText
// 0x0018 (0x0018 - 0x0000)
struct ContextTutorialIndicator_C_SetIndicatorText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ContextTutorialIndicator_C_SetIndicatorText) == 0x000008, "Wrong alignment on ContextTutorialIndicator_C_SetIndicatorText");
static_assert(sizeof(ContextTutorialIndicator_C_SetIndicatorText) == 0x000018, "Wrong size on ContextTutorialIndicator_C_SetIndicatorText");
static_assert(offsetof(ContextTutorialIndicator_C_SetIndicatorText, Text) == 0x000000, "Member 'ContextTutorialIndicator_C_SetIndicatorText::Text' has a wrong offset!");

}

