#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContentOnDemand

#include "Basic.hpp"


namespace SDK::Params
{

// Function ContentOnDemand.ContentOnDemand_C.ExecuteUbergraph_ContentOnDemand
// 0x0030 (0x0030 - 0x0000)
struct ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NumActiveDownloads;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumErrors;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand) == 0x000008, "Wrong alignment on ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand");
static_assert(sizeof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand) == 0x000030, "Wrong size on ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, EntryPoint) == 0x000000, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::EntryPoint' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, CallFunc_Greater_IntInt_ReturnValue) == 0x000005, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, K2Node_Event_NumActiveDownloads) == 0x000008, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::K2Node_Event_NumActiveDownloads' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, K2Node_Event_NumErrors) == 0x00000C, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::K2Node_Event_NumErrors' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000020, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000021, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'ContentOnDemand_C_ExecuteUbergraph_ContentOnDemand::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function ContentOnDemand.ContentOnDemand_C.OnUpdatedState
// 0x0008 (0x0008 - 0x0000)
struct ContentOnDemand_C_OnUpdatedState final
{
public:
	int32                                         NumActiveDownloads;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumErrors;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContentOnDemand_C_OnUpdatedState) == 0x000004, "Wrong alignment on ContentOnDemand_C_OnUpdatedState");
static_assert(sizeof(ContentOnDemand_C_OnUpdatedState) == 0x000008, "Wrong size on ContentOnDemand_C_OnUpdatedState");
static_assert(offsetof(ContentOnDemand_C_OnUpdatedState, NumActiveDownloads) == 0x000000, "Member 'ContentOnDemand_C_OnUpdatedState::NumActiveDownloads' has a wrong offset!");
static_assert(offsetof(ContentOnDemand_C_OnUpdatedState, NumErrors) == 0x000004, "Member 'ContentOnDemand_C_OnUpdatedState::NumErrors' has a wrong offset!");

}

