#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConvertedMarkerInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ConvertedMarkerInfo.ConvertedMarkerInfo_C.ExecuteUbergraph_ConvertedMarkerInfo
// 0x0098 (0x0098 - 0x0000)
struct ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShowBackground;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 K2Node_CustomEvent_PSA;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSocialAvatarBrush_ReturnValue;         // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetPinColor_ReturnValue;                  // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo) == 0x000008, "Wrong alignment on ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo");
static_assert(sizeof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo) == 0x000098, "Wrong size on ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, EntryPoint) == 0x000000, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, K2Node_CustomEvent_bShowBackground) == 0x000010, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::K2Node_CustomEvent_bShowBackground' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, Temp_object_Variable) == 0x000018, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, K2Node_DynamicCast_AsTexture_2D) == 0x000020, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, K2Node_Event_IsDesignTime) == 0x000029, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, K2Node_CustomEvent_PSA) == 0x000038, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::K2Node_CustomEvent_PSA' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000040, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, CallFunc_GetSocialAvatarBrush_ReturnValue) == 0x000050, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::CallFunc_GetSocialAvatarBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, CallFunc_GetPinColor_ReturnValue) == 0x000078, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::CallFunc_GetPinColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo, K2Node_CustomEvent_Loaded) == 0x000090, "Member 'ConvertedMarkerInfo_C_ExecuteUbergraph_ConvertedMarkerInfo::K2Node_CustomEvent_Loaded' has a wrong offset!");

// Function ConvertedMarkerInfo.ConvertedMarkerInfo_C.InitPlayerState
// 0x0008 (0x0008 - 0x0000)
struct ConvertedMarkerInfo_C_InitPlayerState final
{
public:
	class AFortPlayerStateAthena*                 PSA;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConvertedMarkerInfo_C_InitPlayerState) == 0x000008, "Wrong alignment on ConvertedMarkerInfo_C_InitPlayerState");
static_assert(sizeof(ConvertedMarkerInfo_C_InitPlayerState) == 0x000008, "Wrong size on ConvertedMarkerInfo_C_InitPlayerState");
static_assert(offsetof(ConvertedMarkerInfo_C_InitPlayerState, PSA) == 0x000000, "Member 'ConvertedMarkerInfo_C_InitPlayerState::PSA' has a wrong offset!");

// Function ConvertedMarkerInfo.ConvertedMarkerInfo_C.OnLoaded_68559753464A154900ECA9BC6BB940C0
// 0x0008 (0x0008 - 0x0000)
struct ConvertedMarkerInfo_C_OnLoaded_68559753464A154900ECA9BC6BB940C0 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConvertedMarkerInfo_C_OnLoaded_68559753464A154900ECA9BC6BB940C0) == 0x000008, "Wrong alignment on ConvertedMarkerInfo_C_OnLoaded_68559753464A154900ECA9BC6BB940C0");
static_assert(sizeof(ConvertedMarkerInfo_C_OnLoaded_68559753464A154900ECA9BC6BB940C0) == 0x000008, "Wrong size on ConvertedMarkerInfo_C_OnLoaded_68559753464A154900ECA9BC6BB940C0");
static_assert(offsetof(ConvertedMarkerInfo_C_OnLoaded_68559753464A154900ECA9BC6BB940C0, Loaded) == 0x000000, "Member 'ConvertedMarkerInfo_C_OnLoaded_68559753464A154900ECA9BC6BB940C0::Loaded' has a wrong offset!");

// Function ConvertedMarkerInfo.ConvertedMarkerInfo_C.OverrideShowBackground
// 0x0001 (0x0001 - 0x0000)
struct ConvertedMarkerInfo_C_OverrideShowBackground final
{
public:
	bool                                          bShowBackground;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConvertedMarkerInfo_C_OverrideShowBackground) == 0x000001, "Wrong alignment on ConvertedMarkerInfo_C_OverrideShowBackground");
static_assert(sizeof(ConvertedMarkerInfo_C_OverrideShowBackground) == 0x000001, "Wrong size on ConvertedMarkerInfo_C_OverrideShowBackground");
static_assert(offsetof(ConvertedMarkerInfo_C_OverrideShowBackground, bShowBackground) == 0x000000, "Member 'ConvertedMarkerInfo_C_OverrideShowBackground::bShowBackground' has a wrong offset!");

// Function ConvertedMarkerInfo.ConvertedMarkerInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ConvertedMarkerInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConvertedMarkerInfo_C_PreConstruct) == 0x000001, "Wrong alignment on ConvertedMarkerInfo_C_PreConstruct");
static_assert(sizeof(ConvertedMarkerInfo_C_PreConstruct) == 0x000001, "Wrong size on ConvertedMarkerInfo_C_PreConstruct");
static_assert(offsetof(ConvertedMarkerInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ConvertedMarkerInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ConvertedMarkerInfo.ConvertedMarkerInfo_C.SetBackgroundVisibility
// 0x000A (0x000A - 0x0000)
struct ConvertedMarkerInfo_C_SetBackgroundVisibility final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBackgroundVisible;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocal_BackgroundVisible;                          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConvertedMarkerInfo_C_SetBackgroundVisibility) == 0x000001, "Wrong alignment on ConvertedMarkerInfo_C_SetBackgroundVisibility");
static_assert(sizeof(ConvertedMarkerInfo_C_SetBackgroundVisibility) == 0x00000A, "Wrong size on ConvertedMarkerInfo_C_SetBackgroundVisibility");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, bOverride) == 0x000000, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::bOverride' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, bBackgroundVisible) == 0x000001, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::bBackgroundVisible' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, bLocal_BackgroundVisible) == 0x000002, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::bLocal_BackgroundVisible' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, Temp_byte_Variable) == 0x000003, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, Temp_byte_Variable_1) == 0x000004, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, Temp_bool_Variable) == 0x000005, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000006, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, K2Node_Select_Default) == 0x000007, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConvertedMarkerInfo_C_SetBackgroundVisibility, CallFunc_BooleanOR_ReturnValue_1) == 0x000009, "Member 'ConvertedMarkerInfo_C_SetBackgroundVisibility::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

}

