#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cooler_Container

#include "Basic.hpp"


namespace SDK::Params
{

// Function Cooler_Container.Cooler_Container_C.BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Cooler_Container_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cooler_Container_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong alignment on Cooler_Container_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature");
static_assert(sizeof(Cooler_Container_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature) == 0x000008, "Wrong size on Cooler_Container_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature");
static_assert(offsetof(Cooler_Container_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature, DamageCauser) == 0x000000, "Member 'Cooler_Container_C_BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_0_OnLinkedActorDestroyed__DelegateSignature::DamageCauser' has a wrong offset!");

// Function Cooler_Container.Cooler_Container_C.ExecuteUbergraph_Cooler_Container
// 0x0018 (0x0018 - 0x0000)
struct Cooler_Container_C_ExecuteUbergraph_Cooler_Container final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cooler_Container_C_ExecuteUbergraph_Cooler_Container) == 0x000008, "Wrong alignment on Cooler_Container_C_ExecuteUbergraph_Cooler_Container");
static_assert(sizeof(Cooler_Container_C_ExecuteUbergraph_Cooler_Container) == 0x000018, "Wrong size on Cooler_Container_C_ExecuteUbergraph_Cooler_Container");
static_assert(offsetof(Cooler_Container_C_ExecuteUbergraph_Cooler_Container, EntryPoint) == 0x000000, "Member 'Cooler_Container_C_ExecuteUbergraph_Cooler_Container::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cooler_Container_C_ExecuteUbergraph_Cooler_Container, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Cooler_Container_C_ExecuteUbergraph_Cooler_Container::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cooler_Container_C_ExecuteUbergraph_Cooler_Container, K2Node_ComponentBoundEvent_DamageCauser) == 0x000010, "Member 'Cooler_Container_C_ExecuteUbergraph_Cooler_Container::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");

}

