#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CraftingInteractContextInfoWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CraftingInteractContextInfoWidget.CraftingInteractContextInfoWidget_C
// 0x0020 (0x02D8 - 0x02B8)
class UCraftingInteractContextInfoWidget_C final : public UFortInteractContextInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       ActionText;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemPreviewImage;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialExpressionTextureObjectParameter* Image;                                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CraftingInteractContextInfoWidget(int32 EntryPoint);
	void OnContextInfoUpdated(const class UFortInteractContextInfo* ContextInfo);
	void OnLoaded_5CA0AB9C4E28FABDE17BA4B37923A52F(class UObject* Loaded);
	void SetCraftingPreviewImage(const struct FItemAndCount& ItemAndCount, class UTexture* ItemIcon);
	void SetCraftingResult(class UFortInteractContextInfo*& ContextInfo, struct FItemAndCount& CraftingResult);
	void SetDefaultText(class UFortInteractContextInfo*& ContextInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CraftingInteractContextInfoWidget_C">();
	}
	static class UCraftingInteractContextInfoWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingInteractContextInfoWidget_C>();
	}
};
static_assert(alignof(UCraftingInteractContextInfoWidget_C) == 0x000008, "Wrong alignment on UCraftingInteractContextInfoWidget_C");
static_assert(sizeof(UCraftingInteractContextInfoWidget_C) == 0x0002D8, "Wrong size on UCraftingInteractContextInfoWidget_C");
static_assert(offsetof(UCraftingInteractContextInfoWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UCraftingInteractContextInfoWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCraftingInteractContextInfoWidget_C, ActionText) == 0x0002C0, "Member 'UCraftingInteractContextInfoWidget_C::ActionText' has a wrong offset!");
static_assert(offsetof(UCraftingInteractContextInfoWidget_C, ItemPreviewImage) == 0x0002C8, "Member 'UCraftingInteractContextInfoWidget_C::ItemPreviewImage' has a wrong offset!");
static_assert(offsetof(UCraftingInteractContextInfoWidget_C, Image) == 0x0002D0, "Member 'UCraftingInteractContextInfoWidget_C::Image' has a wrong offset!");

}

