#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeTeamColors

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CreativeTeamColors.CreativeTeamColors_C
// 0x0030 (0x02D0 - 0x02A0)
class UCreativeTeamColors_C final : public USceneComponent
{
public:
	TArray<struct FLinearColor>                   TeamLightColors;                                   // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLinearColor>                   TeamSelectorColors;                                // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLinearColor>                   TeamBoldColors;                                    // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeTeamColors_C">();
	}
	static class UCreativeTeamColors_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeTeamColors_C>();
	}
};
static_assert(alignof(UCreativeTeamColors_C) == 0x000010, "Wrong alignment on UCreativeTeamColors_C");
static_assert(sizeof(UCreativeTeamColors_C) == 0x0002D0, "Wrong size on UCreativeTeamColors_C");
static_assert(offsetof(UCreativeTeamColors_C, TeamLightColors) == 0x0002A0, "Member 'UCreativeTeamColors_C::TeamLightColors' has a wrong offset!");
static_assert(offsetof(UCreativeTeamColors_C, TeamSelectorColors) == 0x0002B0, "Member 'UCreativeTeamColors_C::TeamSelectorColors' has a wrong offset!");
static_assert(offsetof(UCreativeTeamColors_C, TeamBoldColors) == 0x0002C0, "Member 'UCreativeTeamColors_C::TeamBoldColors' has a wrong offset!");

}

