#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Creative_CommonDeviceFunctionLibrary

#include "Basic.hpp"

#include "EAwardScoreType_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "ECreativeColorSetType_structs.hpp"
#include "EBoolWithUnset_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "ECreativeTeamColor_structs.hpp"


namespace SDK::Params
{

// Function Creative_CommonDeviceFunctionLibrary.Creative_CommonDeviceFunctionLibrary_C.ActorCanTrigger
// 0x00C0 (0x00C0 - 0x0000)
struct Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger final
{
public:
	class AActor*                                 Actor_To_Check;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Overlap_Component;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanTrigger;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            Controller;                                        // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_CanTrigger;                                  // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DeviceDontTriggerTags;                             // 0x0030(0x0020)(Edit, BlueprintVisible)
	class AController*                            local_controller;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetDriver_ReturnValue;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger) == 0x000008, "Wrong alignment on Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger");
static_assert(sizeof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger) == 0x0000C0, "Wrong size on Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, Actor_To_Check) == 0x000000, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::Actor_To_Check' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, Overlap_Component) == 0x000008, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::Overlap_Component' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, __WorldContext) == 0x000010, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::__WorldContext' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CanTrigger) == 0x000018, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CanTrigger' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, Controller) == 0x000020, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::Controller' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, local_CanTrigger) == 0x000028, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::local_CanTrigger' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, DeviceDontTriggerTags) == 0x000030, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::DeviceDontTriggerTags' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, local_controller) == 0x000050, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::local_controller' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, Temp_object_Variable) == 0x000058, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_GetController_ReturnValue) == 0x000068, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000070, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000078, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000080, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000090, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_Not_PreBool_ReturnValue) == 0x000092, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_IsValid_ReturnValue_2) == 0x000093, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000098, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_GetDriver_ReturnValue) == 0x0000B0, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_GetDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_GetCollisionObjectType_ReturnValue) == 0x0000B8, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B9, "Member 'Creative_CommonDeviceFunctionLibrary_C_ActorCanTrigger::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Creative_CommonDeviceFunctionLibrary.Creative_CommonDeviceFunctionLibrary_C.Animate Float Curve
// 0x0060 (0x0060 - 0x0000)
struct Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve final
{
public:
	float                                         Delta_Time;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Current_Time;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            FCurve;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Animation_Time;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Invert_Time;                                       // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsComplete;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EndTime;                                           // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurveFloatResult;                                  // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeAlpha;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve) == 0x000008, "Wrong alignment on Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve");
static_assert(sizeof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve) == 0x000060, "Wrong size on Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, Delta_Time) == 0x000000, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::Delta_Time' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, Current_Time) == 0x000004, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::Current_Time' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, FCurve) == 0x000008, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::FCurve' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, Animation_Time) == 0x000010, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::Animation_Time' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, Invert_Time) == 0x000014, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::Invert_Time' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, __WorldContext) == 0x000018, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::__WorldContext' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, Value) == 0x000020, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::Value' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, bIsComplete) == 0x000024, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::bIsComplete' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, EndTime) == 0x000028, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::EndTime' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, CurveFloatResult) == 0x00002C, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::CurveFloatResult' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, TimeAlpha) == 0x000030, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::TimeAlpha' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, Temp_bool_Variable) == 0x000035, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000038, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, CallFunc_Add_FloatFloat_ReturnValue) == 0x00003C, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, K2Node_Select_Default) == 0x000044, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, CallFunc_GetFloatValue_ReturnValue) == 0x00004C, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, Temp_float_Variable) == 0x000050, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, Temp_bool_Variable_1) == 0x000054, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, K2Node_Select_Default_1) == 0x000058, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00005C, "Member 'Creative_CommonDeviceFunctionLibrary_C_Animate_Float_Curve::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function Creative_CommonDeviceFunctionLibrary.Creative_CommonDeviceFunctionLibrary_C.Apply Vent Recently Launched Tag or Abort Launch
// 0x0078 (0x0078 - 0x0000)
struct Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch final
{
public:
	class AActor*                                 Actor_To_Launch;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Vent_Actor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldLaunch;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UGameplayEffect>>    K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
};
static_assert(alignof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch) == 0x000008, "Wrong alignment on Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch");
static_assert(sizeof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch) == 0x000078, "Wrong size on Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, Actor_To_Launch) == 0x000000, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::Actor_To_Launch' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, Vent_Actor) == 0x000008, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::Vent_Actor' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, __WorldContext) == 0x000010, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::__WorldContext' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, ShouldLaunch) == 0x000018, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::ShouldLaunch' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, Temp_bool_Variable) == 0x000019, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000050, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000061, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, CallFunc_IsValid_ReturnValue_1) == 0x000062, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch, K2Node_MakeArray_Array) == 0x000068, "Member 'Creative_CommonDeviceFunctionLibrary_C_Apply_Vent_Recently_Launched_Tag_or_Abort_Launch::K2Node_MakeArray_Array' has a wrong offset!");

// Function Creative_CommonDeviceFunctionLibrary.Creative_CommonDeviceFunctionLibrary_C.AwardScore
// 0x00F0 (0x00F0 - 0x0000)
struct Creative_CommonDeviceFunctionLibrary_C_AwardScore final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Score;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAwardScoreType                               Type;                                              // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            Controller;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMinigameLogicComponent*            Minigame_Logic;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TargetTags;                                        // 0x0020(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_Score;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMinigameManager*                   local_MinigameManager;                             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAwardScoreType                               Temp_byte_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMinigameManager*                   CallFunc_GetMinigameManager_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMinigameStatsComponent*            CallFunc_GetMinigameStatsComponent_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMinigameStatFilter*                CallFunc_GetLoadedStatFromClass_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerState*                       K2Node_DynamicCast_AsFort_Player_State;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStatForPlayer_ReturnValue;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetSourceAndContextTags_OutSourceTags;    // 0x00A8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_GetSourceAndContextTags_OutContextTags;   // 0x00C8(0x0020)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_CommonDeviceFunctionLibrary_C_AwardScore) == 0x000008, "Wrong alignment on Creative_CommonDeviceFunctionLibrary_C_AwardScore");
static_assert(sizeof(Creative_CommonDeviceFunctionLibrary_C_AwardScore) == 0x0000F0, "Wrong size on Creative_CommonDeviceFunctionLibrary_C_AwardScore");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, Actor) == 0x000000, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::Actor' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, Score) == 0x000008, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::Score' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, Type) == 0x00000C, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::Type' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, Controller) == 0x000010, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::Controller' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, Minigame_Logic) == 0x000018, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::Minigame_Logic' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, TargetTags) == 0x000020, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::TargetTags' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, __WorldContext) == 0x000040, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::__WorldContext' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, local_Score) == 0x000048, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::local_Score' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, local_MinigameManager) == 0x000050, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::local_MinigameManager' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000058, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, Temp_int_Variable) == 0x00005C, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_Multiply_IntInt_ReturnValue) == 0x000060, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, Temp_byte_Variable) == 0x000064, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000068, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_GetMinigameManager_ReturnValue) == 0x000078, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_GetMinigameManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_GetMinigameStatsComponent_ReturnValue) == 0x000080, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_GetMinigameStatsComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_GetLoadedStatFromClass_ReturnValue) == 0x000090, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_GetLoadedStatFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, K2Node_DynamicCast_AsFort_Player_State) == 0x000098, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::K2Node_DynamicCast_AsFort_Player_State' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_GetStatForPlayer_ReturnValue) == 0x0000A4, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_GetStatForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_GetSourceAndContextTags_OutSourceTags) == 0x0000A8, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_GetSourceAndContextTags_OutSourceTags' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_GetSourceAndContextTags_OutContextTags) == 0x0000C8, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_GetSourceAndContextTags_OutContextTags' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E8, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_AwardScore, K2Node_Select_Default) == 0x0000EC, "Member 'Creative_CommonDeviceFunctionLibrary_C_AwardScore::K2Node_Select_Default' has a wrong offset!");

// Function Creative_CommonDeviceFunctionLibrary.Creative_CommonDeviceFunctionLibrary_C.Bool to Bool with Unset
// 0x0018 (0x0018 - 0x0000)
struct Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset final
{
public:
	bool                                          Input;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolWithUnset                                Output;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolWithUnset                                Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolWithUnset                                Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolWithUnset                                K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset) == 0x000008, "Wrong alignment on Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset");
static_assert(sizeof(Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset) == 0x000018, "Wrong size on Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset, Input) == 0x000000, "Member 'Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset::Input' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset, __WorldContext) == 0x000008, "Member 'Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset::__WorldContext' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset, Output) == 0x000010, "Member 'Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset::Output' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset, Temp_bool_Variable) == 0x000011, "Member 'Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset, Temp_byte_Variable) == 0x000012, "Member 'Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset, Temp_byte_Variable_1) == 0x000013, "Member 'Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset, K2Node_Select_Default) == 0x000014, "Member 'Creative_CommonDeviceFunctionLibrary_C_Bool_to_Bool_with_Unset::K2Node_Select_Default' has a wrong offset!");

// Function Creative_CommonDeviceFunctionLibrary.Creative_CommonDeviceFunctionLibrary_C.Get Driver or Pawn Controller
// 0x00A8 (0x00A8 - 0x0000)
struct Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller final
{
public:
	class AActor*                                 Actor_To_Check;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid_Controller;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            Controller;                                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  DeviceDontTriggerTags;                             // 0x0020(0x0020)(Edit, BlueprintVisible)
	class AController*                            _Controller;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_DynamicCast_AsController;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetDriver_ReturnValue;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller) == 0x000008, "Wrong alignment on Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller");
static_assert(sizeof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller) == 0x0000A8, "Wrong size on Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, Actor_To_Check) == 0x000000, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::Actor_To_Check' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, __WorldContext) == 0x000008, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::__WorldContext' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, Valid_Controller) == 0x000010, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::Valid_Controller' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, Controller) == 0x000018, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::Controller' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, DeviceDontTriggerTags) == 0x000020, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::DeviceDontTriggerTags' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, _Controller) == 0x000040, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::_Controller' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, Temp_object_Variable) == 0x000048, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, K2Node_DynamicCast_AsController) == 0x000050, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::K2Node_DynamicCast_AsController' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, CallFunc_GetController_ReturnValue) == 0x000060, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000068, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000078, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000088, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller, CallFunc_GetDriver_ReturnValue) == 0x0000A0, "Member 'Creative_CommonDeviceFunctionLibrary_C_Get_Driver_or_Pawn_Controller::CallFunc_GetDriver_ReturnValue' has a wrong offset!");

// Function Creative_CommonDeviceFunctionLibrary.Creative_CommonDeviceFunctionLibrary_C.Get Dynamic Team Color
// 0x0080 (0x0080 - 0x0000)
struct Creative_CommonDeviceFunctionLibrary_C_Get_Dynamic_Team_Color final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortMinigame*                          Minigame;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeColorSetType                         Color_Type;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Array_Index;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   GameplayTags;                                      // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<struct FGameplayTag>                   GameplayColorTags;                                 // 0x0038(0x0010)(Edit, BlueprintVisible)
	ECreativeTeamColor                            Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
