#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeMeleeOptions

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CreativeMeleeKnockbackOptions_structs.hpp"
#include "CreativeMeleeHitOptions_structs.hpp"
#include "CreativeMeleeSecondaryAttacks_structs.hpp"
#include "Creative_Melee_Feedback_Scale_structs.hpp"
#include "CreativeMeleeLockOnOptions_structs.hpp"
#include "CreativeMelee_TargetAction_Selection_structs.hpp"


namespace SDK
{

// UserDefinedStruct CreativeMeleeOptions.CreativeMeleeOptions
// 0x00B8 (0x00B8 - 0x0000)
struct FCreativeMeleeOptions final
{
public:
	float                                         BaseDamage_16_B01234DF44393696F04C92B8D351E18E;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseAIDamage_92_50312EC54DCA1E86AE32918D5BE84B5D;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnvironmentDamage_28_0A4087964FB24D1FCB33038D472CE9CB; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SecondaryDamage_32_EB6925F04B8C5CA1EA314ABBC9C1B68F; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CritChance_18_B6BD1E7E4D026531DE947FA85545974C;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CritMultiplier_44_3919D87C484C89957BEE4B9F19883947; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovementSpeed_30_9444E7814D756147DBA496BB6EA702C5; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Knockback_20_288C1DE84FB83660A91876B19B39EE3B;     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AIKnockback_86_3C11A6804D38DCE230C48086A05545B1;   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FCreativeMeleeHitOptions> HitMultipliers_37_7079495847780DE7215D1AA2CD31F255; // 0x0028(0x0050)(Edit, BlueprintVisible)
	ECreativeMeleeSecondaryAttacks                SecondaryAttack_40_BA7F00FC4A13EBC0912B909733AAB0B7; // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SecondaryKnockback_47_20879CE6494D1742B4C73D8863396A13; // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ModifyingActor_42_FAB96FA64E1C8BA22AE938A79EF432CB; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalChargetime_51_158E8C1D4AD3710B7BABDFB2EDAB874F; // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitialChargeDelay_53_99DC99E247202E2739F893849657E5E8; // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeMeleeKnockbackOptions                KnockbackOptions_60_A986923D49CC93FB58A9339ADDAC9667; // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JumpAttackDamage_63_E597E76D4747BCAD2A2D05AA4ABC4F9E; // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpAttackKnockbackPower_65_446E41444A48E9BEF6552C85CAB864CB; // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CannonballImpactRadius_69_26C5E7CB4235537A4D8442B515F9460F; // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SecondaryAttackBlockBreakEnabled_74_350CF60342FE6D3F7387468F77C1E524; // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreative_Melee_Feedback_Scale                SecondaryFeedbackScale_77_9F2DDC464FD0D7A38477C0AC136D7699; // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeMelee_TargetAction_Selection         TargetActionSelection_80_830D772E40CA5D733FC80DBFCD605BC9; // 0x00A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ModifierRank_83_093388ED43E4F56520692FBE3FD09CDC;  // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECreativeMeleeLockOnOptions                   LockOn_89_D7A1968E484421556A3A1F8484F7BD0B;        // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DamageResistance_95_77FE74874590CC7B0BAD9DA0361692BE; // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCreativeMeleeOptions) == 0x000008, "Wrong alignment on FCreativeMeleeOptions");
static_assert(sizeof(FCreativeMeleeOptions) == 0x0000B8, "Wrong size on FCreativeMeleeOptions");
static_assert(offsetof(FCreativeMeleeOptions, BaseDamage_16_B01234DF44393696F04C92B8D351E18E) == 0x000000, "Member 'FCreativeMeleeOptions::BaseDamage_16_B01234DF44393696F04C92B8D351E18E' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, BaseAIDamage_92_50312EC54DCA1E86AE32918D5BE84B5D) == 0x000004, "Member 'FCreativeMeleeOptions::BaseAIDamage_92_50312EC54DCA1E86AE32918D5BE84B5D' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, EnvironmentDamage_28_0A4087964FB24D1FCB33038D472CE9CB) == 0x000008, "Member 'FCreativeMeleeOptions::EnvironmentDamage_28_0A4087964FB24D1FCB33038D472CE9CB' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, SecondaryDamage_32_EB6925F04B8C5CA1EA314ABBC9C1B68F) == 0x00000C, "Member 'FCreativeMeleeOptions::SecondaryDamage_32_EB6925F04B8C5CA1EA314ABBC9C1B68F' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, CritChance_18_B6BD1E7E4D026531DE947FA85545974C) == 0x000010, "Member 'FCreativeMeleeOptions::CritChance_18_B6BD1E7E4D026531DE947FA85545974C' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, CritMultiplier_44_3919D87C484C89957BEE4B9F19883947) == 0x000014, "Member 'FCreativeMeleeOptions::CritMultiplier_44_3919D87C484C89957BEE4B9F19883947' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, MovementSpeed_30_9444E7814D756147DBA496BB6EA702C5) == 0x000018, "Member 'FCreativeMeleeOptions::MovementSpeed_30_9444E7814D756147DBA496BB6EA702C5' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, Knockback_20_288C1DE84FB83660A91876B19B39EE3B) == 0x00001C, "Member 'FCreativeMeleeOptions::Knockback_20_288C1DE84FB83660A91876B19B39EE3B' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, AIKnockback_86_3C11A6804D38DCE230C48086A05545B1) == 0x000020, "Member 'FCreativeMeleeOptions::AIKnockback_86_3C11A6804D38DCE230C48086A05545B1' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, HitMultipliers_37_7079495847780DE7215D1AA2CD31F255) == 0x000028, "Member 'FCreativeMeleeOptions::HitMultipliers_37_7079495847780DE7215D1AA2CD31F255' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, SecondaryAttack_40_BA7F00FC4A13EBC0912B909733AAB0B7) == 0x000078, "Member 'FCreativeMeleeOptions::SecondaryAttack_40_BA7F00FC4A13EBC0912B909733AAB0B7' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, SecondaryKnockback_47_20879CE6494D1742B4C73D8863396A13) == 0x00007C, "Member 'FCreativeMeleeOptions::SecondaryKnockback_47_20879CE6494D1742B4C73D8863396A13' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, ModifyingActor_42_FAB96FA64E1C8BA22AE938A79EF432CB) == 0x000080, "Member 'FCreativeMeleeOptions::ModifyingActor_42_FAB96FA64E1C8BA22AE938A79EF432CB' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, TotalChargetime_51_158E8C1D4AD3710B7BABDFB2EDAB874F) == 0x000088, "Member 'FCreativeMeleeOptions::TotalChargetime_51_158E8C1D4AD3710B7BABDFB2EDAB874F' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, InitialChargeDelay_53_99DC99E247202E2739F893849657E5E8) == 0x00008C, "Member 'FCreativeMeleeOptions::InitialChargeDelay_53_99DC99E247202E2739F893849657E5E8' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, KnockbackOptions_60_A986923D49CC93FB58A9339ADDAC9667) == 0x000090, "Member 'FCreativeMeleeOptions::KnockbackOptions_60_A986923D49CC93FB58A9339ADDAC9667' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, JumpAttackDamage_63_E597E76D4747BCAD2A2D05AA4ABC4F9E) == 0x000094, "Member 'FCreativeMeleeOptions::JumpAttackDamage_63_E597E76D4747BCAD2A2D05AA4ABC4F9E' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, JumpAttackKnockbackPower_65_446E41444A48E9BEF6552C85CAB864CB) == 0x000098, "Member 'FCreativeMeleeOptions::JumpAttackKnockbackPower_65_446E41444A48E9BEF6552C85CAB864CB' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, CannonballImpactRadius_69_26C5E7CB4235537A4D8442B515F9460F) == 0x00009C, "Member 'FCreativeMeleeOptions::CannonballImpactRadius_69_26C5E7CB4235537A4D8442B515F9460F' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, SecondaryAttackBlockBreakEnabled_74_350CF60342FE6D3F7387468F77C1E524) == 0x0000A0, "Member 'FCreativeMeleeOptions::SecondaryAttackBlockBreakEnabled_74_350CF60342FE6D3F7387468F77C1E524' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, SecondaryFeedbackScale_77_9F2DDC464FD0D7A38477C0AC136D7699) == 0x0000A4, "Member 'FCreativeMeleeOptions::SecondaryFeedbackScale_77_9F2DDC464FD0D7A38477C0AC136D7699' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, TargetActionSelection_80_830D772E40CA5D733FC80DBFCD605BC9) == 0x0000A5, "Member 'FCreativeMeleeOptions::TargetActionSelection_80_830D772E40CA5D733FC80DBFCD605BC9' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, ModifierRank_83_093388ED43E4F56520692FBE3FD09CDC) == 0x0000A8, "Member 'FCreativeMeleeOptions::ModifierRank_83_093388ED43E4F56520692FBE3FD09CDC' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, LockOn_89_D7A1968E484421556A3A1F8484F7BD0B) == 0x0000AC, "Member 'FCreativeMeleeOptions::LockOn_89_D7A1968E484421556A3A1F8484F7BD0B' has a wrong offset!");
static_assert(offsetof(FCreativeMeleeOptions, DamageResistance_95_77FE74874590CC7B0BAD9DA0361692BE) == 0x0000B0, "Member 'FCreativeMeleeOptions::DamageResistance_95_77FE74874590CC7B0BAD9DA0361692BE' has a wrong offset!");

}

