#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewPurchaseScreen

#include "Basic.hpp"

#include "CrewUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.BeginProgress
// 0x0018 (0x0018 - 0x0000)
struct CrewPurchaseScreen_C_BeginProgress final
{
public:
	class FText                                   ProgressLabel;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CrewPurchaseScreen_C_BeginProgress) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_BeginProgress");
static_assert(sizeof(CrewPurchaseScreen_C_BeginProgress) == 0x000018, "Wrong size on CrewPurchaseScreen_C_BeginProgress");
static_assert(offsetof(CrewPurchaseScreen_C_BeginProgress, ProgressLabel) == 0x000000, "Member 'CrewPurchaseScreen_C_BeginProgress::ProgressLabel' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.ExecuteUbergraph_CrewPurchaseScreen
// 0x0180 (0x0180 - 0x0000)
struct CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_NewBackground;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBorder*>                        K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPurchaseNavButton_C*                   K2Node_DynamicCast_AsPurchase_Nav_Button;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorder*                                CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTabsVisible;                         // 0x0102(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_SpacingAdjustmentForTabs;             // 0x0104(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowNotification;                    // 0x0110(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_NotificationText;                     // 0x0118(0x0018)(ConstParm)
	bool                                          Temp_bool_Variable_2;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_UserInformationText1;                 // 0x0138(0x0018)(ConstParm)
	class FText                                   K2Node_Event_UserInformationText2;                 // 0x0150(0x0018)(ConstParm)
	EMcpSubscriptionState                         K2Node_Event_SubscriptionState;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScaleBoxSlot*                          CallFunc_SlotAsScaleBoxSlot_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen");
static_assert(sizeof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen) == 0x000180, "Wrong size on CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, EntryPoint) == 0x000000, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_float_Variable) == 0x00000C, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_float_Variable_1) == 0x000010, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_IsDesignTime) == 0x000014, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_NewBackground) == 0x000020, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_NewBackground' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_bool_Variable) == 0x000030, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_GetEndTime_ReturnValue) == 0x000040, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_struct_Variable) == 0x000048, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_MakeArray_Array) == 0x000060, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_DynamicCast_AsPurchase_Nav_Button) == 0x000070, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_DynamicCast_AsPurchase_Nav_Button' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_struct_Variable_1) == 0x000080, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_int_Array_Index_Variable) == 0x000090, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Array_Get_Item) == 0x000098, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Select_Default) == 0x0000A0, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000A4, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_MakeStruct_Margin) == 0x0000A8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000B8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_bool_Variable_1) == 0x0000C0, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Select_Default_1) == 0x0000C8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000D8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_byte_Variable) == 0x0000E0, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000E8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_byte_Variable_1) == 0x0000F0, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_DynamicCast_AsTexture) == 0x0000F8, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_bVisible) == 0x000101, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_bTabsVisible) == 0x000102, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_bTabsVisible' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_SpacingAdjustmentForTabs) == 0x000104, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_SpacingAdjustmentForTabs' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000108, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_bShowNotification) == 0x000110, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_bShowNotification' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_NotificationText) == 0x000118, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_NotificationText' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, Temp_bool_Variable_2) == 0x000130, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Select_Default_2) == 0x000131, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_UserInformationText1) == 0x000138, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_UserInformationText1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_UserInformationText2) == 0x000150, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_UserInformationText2' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, K2Node_Event_SubscriptionState) == 0x000168, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::K2Node_Event_SubscriptionState' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_IsMobileGame_ReturnValue) == 0x000169, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000170, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen, CallFunc_SlotAsScaleBoxSlot_ReturnValue) == 0x000178, "Member 'CrewPurchaseScreen_C_ExecuteUbergraph_CrewPurchaseScreen::CallFunc_SlotAsScaleBoxSlot_ReturnValue' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnContainerTabVisibilityUpdated
// 0x0008 (0x0008 - 0x0000)
struct CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated final
{
public:
	bool                                          bTabsVisible;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingAdjustmentForTabs;                          // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated) == 0x000004, "Wrong alignment on CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated");
static_assert(sizeof(CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated) == 0x000008, "Wrong size on CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated");
static_assert(offsetof(CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated, bTabsVisible) == 0x000000, "Member 'CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated::bTabsVisible' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated, SpacingAdjustmentForTabs) == 0x000004, "Member 'CrewPurchaseScreen_C_OnContainerTabVisibilityUpdated::SpacingAdjustmentForTabs' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnDownloadBackgroundComplete
// 0x0008 (0x0008 - 0x0000)
struct CrewPurchaseScreen_C_OnDownloadBackgroundComplete final
{
public:
	class UTexture2D*                             NewBackground;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnDownloadBackgroundComplete) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_OnDownloadBackgroundComplete");
static_assert(sizeof(CrewPurchaseScreen_C_OnDownloadBackgroundComplete) == 0x000008, "Wrong size on CrewPurchaseScreen_C_OnDownloadBackgroundComplete");
static_assert(offsetof(CrewPurchaseScreen_C_OnDownloadBackgroundComplete, NewBackground) == 0x000000, "Member 'CrewPurchaseScreen_C_OnDownloadBackgroundComplete::NewBackground' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnSetNavButtonNotificationText
// 0x0018 (0x0018 - 0x0000)
struct CrewPurchaseScreen_C_OnSetNavButtonNotificationText final
{
public:
	class FText                                   NotificationText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CrewPurchaseScreen_C_OnSetNavButtonNotificationText) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_OnSetNavButtonNotificationText");
static_assert(sizeof(CrewPurchaseScreen_C_OnSetNavButtonNotificationText) == 0x000018, "Wrong size on CrewPurchaseScreen_C_OnSetNavButtonNotificationText");
static_assert(offsetof(CrewPurchaseScreen_C_OnSetNavButtonNotificationText, NotificationText) == 0x000000, "Member 'CrewPurchaseScreen_C_OnSetNavButtonNotificationText::NotificationText' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnShowNavButtonNotification
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_C_OnShowNavButtonNotification final
{
public:
	bool                                          bShowNotification;                                 // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnShowNavButtonNotification) == 0x000001, "Wrong alignment on CrewPurchaseScreen_C_OnShowNavButtonNotification");
static_assert(sizeof(CrewPurchaseScreen_C_OnShowNavButtonNotification) == 0x000001, "Wrong size on CrewPurchaseScreen_C_OnShowNavButtonNotification");
static_assert(offsetof(CrewPurchaseScreen_C_OnShowNavButtonNotification, bShowNotification) == 0x000000, "Member 'CrewPurchaseScreen_C_OnShowNavButtonNotification::bShowNotification' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnUpdatePurchaseButtonState
// 0x0010 (0x0010 - 0x0000)
struct CrewPurchaseScreen_C_OnUpdatePurchaseButtonState final
{
public:
	ECrewPurchaseButtonState                      ButtonState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrewPurchaseButtonState                      Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          K2Node_Select_Default;                             // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_OnUpdatePurchaseButtonState");
static_assert(sizeof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState) == 0x000010, "Wrong size on CrewPurchaseScreen_C_OnUpdatePurchaseButtonState");
static_assert(offsetof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState, ButtonState) == 0x000000, "Member 'CrewPurchaseScreen_C_OnUpdatePurchaseButtonState::ButtonState' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState, Temp_byte_Variable) == 0x000001, "Member 'CrewPurchaseScreen_C_OnUpdatePurchaseButtonState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_OnUpdatePurchaseButtonState, K2Node_Select_Default) == 0x000008, "Member 'CrewPurchaseScreen_C_OnUpdatePurchaseButtonState::K2Node_Select_Default' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnUpdateVBuckRefundVisibility
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility) == 0x000001, "Wrong alignment on CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility");
static_assert(sizeof(CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility) == 0x000001, "Wrong size on CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility");
static_assert(offsetof(CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility, bVisible) == 0x000000, "Member 'CrewPurchaseScreen_C_OnUpdateVBuckRefundVisibility::bVisible' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.OnUserInformationTextsUpdated
// 0x0038 (0x0038 - 0x0000)
struct CrewPurchaseScreen_C_OnUserInformationTextsUpdated final
{
public:
	class FText                                   UserInformationText1;                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   UserInformationText2;                              // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EMcpSubscriptionState                         SubscriptionState;                                 // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_OnUserInformationTextsUpdated) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_OnUserInformationTextsUpdated");
static_assert(sizeof(CrewPurchaseScreen_C_OnUserInformationTextsUpdated) == 0x000038, "Wrong size on CrewPurchaseScreen_C_OnUserInformationTextsUpdated");
static_assert(offsetof(CrewPurchaseScreen_C_OnUserInformationTextsUpdated, UserInformationText1) == 0x000000, "Member 'CrewPurchaseScreen_C_OnUserInformationTextsUpdated::UserInformationText1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_OnUserInformationTextsUpdated, UserInformationText2) == 0x000018, "Member 'CrewPurchaseScreen_C_OnUserInformationTextsUpdated::UserInformationText2' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_OnUserInformationTextsUpdated, SubscriptionState) == 0x000030, "Member 'CrewPurchaseScreen_C_OnUserInformationTextsUpdated::SubscriptionState' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_PreConstruct) == 0x000001, "Wrong alignment on CrewPurchaseScreen_C_PreConstruct");
static_assert(sizeof(CrewPurchaseScreen_C_PreConstruct) == 0x000001, "Wrong size on CrewPurchaseScreen_C_PreConstruct");
static_assert(offsetof(CrewPurchaseScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CrewPurchaseScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.Set Up Error Info Flags
// 0x0038 (0x0038 - 0x0000)
struct CrewPurchaseScreen_C_Set_Up_Error_Info_Flags final
{
public:
	class FText                                   UserInformationText_1;                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   UserInformationText_2;                             // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EMcpSubscriptionState                         SubscriptionState;                                 // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CrewPurchaseScreen_C_Set_Up_Error_Info_Flags) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_Set_Up_Error_Info_Flags");
static_assert(sizeof(CrewPurchaseScreen_C_Set_Up_Error_Info_Flags) == 0x000038, "Wrong size on CrewPurchaseScreen_C_Set_Up_Error_Info_Flags");
static_assert(offsetof(CrewPurchaseScreen_C_Set_Up_Error_Info_Flags, UserInformationText_1) == 0x000000, "Member 'CrewPurchaseScreen_C_Set_Up_Error_Info_Flags::UserInformationText_1' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_Set_Up_Error_Info_Flags, UserInformationText_2) == 0x000018, "Member 'CrewPurchaseScreen_C_Set_Up_Error_Info_Flags::UserInformationText_2' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_Set_Up_Error_Info_Flags, SubscriptionState) == 0x000030, "Member 'CrewPurchaseScreen_C_Set_Up_Error_Info_Flags::SubscriptionState' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_Set_Up_Error_Info_Flags, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'CrewPurchaseScreen_C_Set_Up_Error_Info_Flags::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function CrewPurchaseScreen.CrewPurchaseScreen_C.UpdateLayoutForTabs
// 0x0038 (0x0038 - 0x0000)
struct CrewPurchaseScreen_C_UpdateLayoutForTabs final
{
public:
	bool                                          bTabsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingAdjustmentForTabs;                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CrewPurchaseScreen_C_UpdateLayoutForTabs) == 0x000008, "Wrong alignment on CrewPurchaseScreen_C_UpdateLayoutForTabs");
static_assert(sizeof(CrewPurchaseScreen_C_UpdateLayoutForTabs) == 0x000038, "Wrong size on CrewPurchaseScreen_C_UpdateLayoutForTabs");
static_assert(offsetof(CrewPurchaseScreen_C_UpdateLayoutForTabs, bTabsVisible) == 0x000000, "Member 'CrewPurchaseScreen_C_UpdateLayoutForTabs::bTabsVisible' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_UpdateLayoutForTabs, SpacingAdjustmentForTabs) == 0x000004, "Member 'CrewPurchaseScreen_C_UpdateLayoutForTabs::SpacingAdjustmentForTabs' has a wrong offset!");
static_assert(offsetof(CrewPurchaseScreen_C_UpdateLayoutForTabs, Temp_bool_Variable) == 0x000008, "Member 'CrewPurchaseScreen_C_UpdateLayoutForTabs::Temp_bool_Variable' has a wrong offset!");
