#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableObjectPopulation

#include "Basic.hpp"

#include "CustomizableObjectPopulation_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CustomizableObjectPopulation.CustomizableObjectPopulation
// 0x0028 (0x0050 - 0x0028)
class UCustomizableObjectPopulation final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FClassWeightPair>               ClassWeights;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UCustomizableObjectPopulationGenerator* Generator;                                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	int32 GeneratePopulation(TArray<class UCustomizableObjectInstance*>* OutInstances, int32 NumInstancesToGenerate) const;
	bool RegeneratePopulation(int32 Seed, TArray<class UCustomizableObjectInstance*>* OutInstances, int32 NumInstancesToGenerate) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectPopulation">();
	}
	static class UCustomizableObjectPopulation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectPopulation>();
	}
};
static_assert(alignof(UCustomizableObjectPopulation) == 0x000008, "Wrong alignment on UCustomizableObjectPopulation");
static_assert(sizeof(UCustomizableObjectPopulation) == 0x000050, "Wrong size on UCustomizableObjectPopulation");
static_assert(offsetof(UCustomizableObjectPopulation, Name_0) == 0x000028, "Member 'UCustomizableObjectPopulation::Name_0' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPopulation, ClassWeights) == 0x000038, "Member 'UCustomizableObjectPopulation::ClassWeights' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPopulation, Generator) == 0x000048, "Member 'UCustomizableObjectPopulation::Generator' has a wrong offset!");

// Class CustomizableObjectPopulation.CustomizableObjectPopulationClass
// 0x0068 (0x0090 - 0x0028)
class UCustomizableObjectPopulationClass final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomizableObject*                    CustomizableObject;                                // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         WhiteList;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         BlackList;                                         // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectPopulationCharacteristic> Characteristics;                                   // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectPopulationClass">();
	}
	static class UCustomizableObjectPopulationClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectPopulationClass>();
	}
};
static_assert(alignof(UCustomizableObjectPopulationClass) == 0x000008, "Wrong alignment on UCustomizableObjectPopulationClass");
static_assert(sizeof(UCustomizableObjectPopulationClass) == 0x000090, "Wrong size on UCustomizableObjectPopulationClass");
static_assert(offsetof(UCustomizableObjectPopulationClass, Name_0) == 0x000028, "Member 'UCustomizableObjectPopulationClass::Name_0' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPopulationClass, CustomizableObject) == 0x000038, "Member 'UCustomizableObjectPopulationClass::CustomizableObject' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPopulationClass, WhiteList) == 0x000040, "Member 'UCustomizableObjectPopulationClass::WhiteList' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPopulationClass, BlackList) == 0x000050, "Member 'UCustomizableObjectPopulationClass::BlackList' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPopulationClass, Characteristics) == 0x000060, "Member 'UCustomizableObjectPopulationClass::Characteristics' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectPopulationClass, Tags) == 0x000070, "Member 'UCustomizableObjectPopulationClass::Tags' has a wrong offset!");

// Class CustomizableObjectPopulation.CustomizableObjectPopulationGenerator
// 0x0020 (0x0048 - 0x0028)
class UCustomizableObjectPopulationGenerator final : public UObject
{
public:
	TArray<class UCustomizableObject*>            PopulationObjects;                                 // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectPopulationGenerator">();
	}
	static class UCustomizableObjectPopulationGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectPopulationGenerator>();
	}
};
static_assert(alignof(UCustomizableObjectPopulationGenerator) == 0x000008, "Wrong alignment on UCustomizableObjectPopulationGenerator");
static_assert(sizeof(UCustomizableObjectPopulationGenerator) == 0x000048, "Wrong size on UCustomizableObjectPopulationGenerator");
static_assert(offsetof(UCustomizableObjectPopulationGenerator, PopulationObjects) == 0x000028, "Member 'UCustomizableObjectPopulationGenerator::PopulationObjects' has a wrong offset!");

}

