#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableObject

#include "Basic.hpp"

#include "CustomizableObject_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CustomizableObject.CustomizableObject.CreateInstance
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObject_CreateInstance final
{
public:
	class UCustomizableObjectInstance*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_CreateInstance) == 0x000008, "Wrong alignment on CustomizableObject_CreateInstance");
static_assert(sizeof(CustomizableObject_CreateInstance) == 0x000008, "Wrong size on CustomizableObject_CreateInstance");
static_assert(offsetof(CustomizableObject_CreateInstance, ReturnValue) == 0x000000, "Member 'CustomizableObject_CreateInstance::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.FindParameter
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_FindParameter final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObject_FindParameter) == 0x000008, "Wrong alignment on CustomizableObject_FindParameter");
static_assert(sizeof(CustomizableObject_FindParameter) == 0x000018, "Wrong size on CustomizableObject_FindParameter");
static_assert(offsetof(CustomizableObject_FindParameter, Name_0) == 0x000000, "Member 'CustomizableObject_FindParameter::Name_0' has a wrong offset!");
static_assert(offsetof(CustomizableObject_FindParameter, ReturnValue) == 0x000010, "Member 'CustomizableObject_FindParameter::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetIntParameterAvailableOption
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetIntParameterAvailableOption final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         K;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetIntParameterAvailableOption) == 0x000008, "Wrong alignment on CustomizableObject_GetIntParameterAvailableOption");
static_assert(sizeof(CustomizableObject_GetIntParameterAvailableOption) == 0x000018, "Wrong size on CustomizableObject_GetIntParameterAvailableOption");
static_assert(offsetof(CustomizableObject_GetIntParameterAvailableOption, ParamIndex) == 0x000000, "Member 'CustomizableObject_GetIntParameterAvailableOption::ParamIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetIntParameterAvailableOption, K) == 0x000004, "Member 'CustomizableObject_GetIntParameterAvailableOption::K' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetIntParameterAvailableOption, ReturnValue) == 0x000008, "Member 'CustomizableObject_GetIntParameterAvailableOption::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetIntParameterNumOptions
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObject_GetIntParameterNumOptions final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetIntParameterNumOptions) == 0x000004, "Wrong alignment on CustomizableObject_GetIntParameterNumOptions");
static_assert(sizeof(CustomizableObject_GetIntParameterNumOptions) == 0x000008, "Wrong size on CustomizableObject_GetIntParameterNumOptions");
static_assert(offsetof(CustomizableObject_GetIntParameterNumOptions, ParamIndex) == 0x000000, "Member 'CustomizableObject_GetIntParameterNumOptions::ParamIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetIntParameterNumOptions, ReturnValue) == 0x000004, "Member 'CustomizableObject_GetIntParameterNumOptions::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetParameterCount
// 0x0004 (0x0004 - 0x0000)
struct CustomizableObject_GetParameterCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetParameterCount) == 0x000004, "Wrong alignment on CustomizableObject_GetParameterCount");
static_assert(sizeof(CustomizableObject_GetParameterCount) == 0x000004, "Wrong size on CustomizableObject_GetParameterCount");
static_assert(offsetof(CustomizableObject_GetParameterCount, ReturnValue) == 0x000000, "Member 'CustomizableObject_GetParameterCount::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetParameterDescriptionCount
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetParameterDescriptionCount final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObject_GetParameterDescriptionCount) == 0x000008, "Wrong alignment on CustomizableObject_GetParameterDescriptionCount");
static_assert(sizeof(CustomizableObject_GetParameterDescriptionCount) == 0x000018, "Wrong size on CustomizableObject_GetParameterDescriptionCount");
static_assert(offsetof(CustomizableObject_GetParameterDescriptionCount, ParamName) == 0x000000, "Member 'CustomizableObject_GetParameterDescriptionCount::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetParameterDescriptionCount, ReturnValue) == 0x000010, "Member 'CustomizableObject_GetParameterDescriptionCount::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetParameterName
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetParameterName final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetParameterName) == 0x000008, "Wrong alignment on CustomizableObject_GetParameterName");
static_assert(sizeof(CustomizableObject_GetParameterName) == 0x000018, "Wrong size on CustomizableObject_GetParameterName");
static_assert(offsetof(CustomizableObject_GetParameterName, ParamIndex) == 0x000000, "Member 'CustomizableObject_GetParameterName::ParamIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetParameterName, ReturnValue) == 0x000008, "Member 'CustomizableObject_GetParameterName::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetParameterType
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObject_GetParameterType final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMutableParameterType                         ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObject_GetParameterType) == 0x000004, "Wrong alignment on CustomizableObject_GetParameterType");
static_assert(sizeof(CustomizableObject_GetParameterType) == 0x000008, "Wrong size on CustomizableObject_GetParameterType");
static_assert(offsetof(CustomizableObject_GetParameterType, ParamIndex) == 0x000000, "Member 'CustomizableObject_GetParameterType::ParamIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetParameterType, ReturnValue) == 0x000004, "Member 'CustomizableObject_GetParameterType::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetParameterTypeByName
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetParameterTypeByName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMutableParameterType                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObject_GetParameterTypeByName) == 0x000008, "Wrong alignment on CustomizableObject_GetParameterTypeByName");
static_assert(sizeof(CustomizableObject_GetParameterTypeByName) == 0x000018, "Wrong size on CustomizableObject_GetParameterTypeByName");
static_assert(offsetof(CustomizableObject_GetParameterTypeByName, Name_0) == 0x000000, "Member 'CustomizableObject_GetParameterTypeByName::Name_0' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetParameterTypeByName, ReturnValue) == 0x000010, "Member 'CustomizableObject_GetParameterTypeByName::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetParameterUIMetadata
// 0x0188 (0x0188 - 0x0000)
struct CustomizableObject_GetParameterUIMetadata final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FParameterUIData                       ReturnValue;                                       // 0x0010(0x0178)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetParameterUIMetadata) == 0x000008, "Wrong alignment on CustomizableObject_GetParameterUIMetadata");
static_assert(sizeof(CustomizableObject_GetParameterUIMetadata) == 0x000188, "Wrong size on CustomizableObject_GetParameterUIMetadata");
static_assert(offsetof(CustomizableObject_GetParameterUIMetadata, ParamName) == 0x000000, "Member 'CustomizableObject_GetParameterUIMetadata::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetParameterUIMetadata, ReturnValue) == 0x000010, "Member 'CustomizableObject_GetParameterUIMetadata::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetParameterUIMetadataFromIndex
// 0x0180 (0x0180 - 0x0000)
struct CustomizableObject_GetParameterUIMetadataFromIndex final
{
public:
	int32                                         ParamIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParameterUIData                       ReturnValue;                                       // 0x0008(0x0178)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetParameterUIMetadataFromIndex) == 0x000008, "Wrong alignment on CustomizableObject_GetParameterUIMetadataFromIndex");
static_assert(sizeof(CustomizableObject_GetParameterUIMetadataFromIndex) == 0x000180, "Wrong size on CustomizableObject_GetParameterUIMetadataFromIndex");
static_assert(offsetof(CustomizableObject_GetParameterUIMetadataFromIndex, ParamIndex) == 0x000000, "Member 'CustomizableObject_GetParameterUIMetadataFromIndex::ParamIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetParameterUIMetadataFromIndex, ReturnValue) == 0x000008, "Member 'CustomizableObject_GetParameterUIMetadataFromIndex::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetStateCount
// 0x0004 (0x0004 - 0x0000)
struct CustomizableObject_GetStateCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetStateCount) == 0x000004, "Wrong alignment on CustomizableObject_GetStateCount");
static_assert(sizeof(CustomizableObject_GetStateCount) == 0x000004, "Wrong size on CustomizableObject_GetStateCount");
static_assert(offsetof(CustomizableObject_GetStateCount, ReturnValue) == 0x000000, "Member 'CustomizableObject_GetStateCount::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetStateName
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetStateName final
{
public:
	int32                                         StateIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetStateName) == 0x000008, "Wrong alignment on CustomizableObject_GetStateName");
static_assert(sizeof(CustomizableObject_GetStateName) == 0x000018, "Wrong size on CustomizableObject_GetStateName");
static_assert(offsetof(CustomizableObject_GetStateName, StateIndex) == 0x000000, "Member 'CustomizableObject_GetStateName::StateIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetStateName, ReturnValue) == 0x000008, "Member 'CustomizableObject_GetStateName::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetStateParameterCount
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObject_GetStateParameterCount final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObject_GetStateParameterCount) == 0x000008, "Wrong alignment on CustomizableObject_GetStateParameterCount");
static_assert(sizeof(CustomizableObject_GetStateParameterCount) == 0x000018, "Wrong size on CustomizableObject_GetStateParameterCount");
static_assert(offsetof(CustomizableObject_GetStateParameterCount, StateName) == 0x000000, "Member 'CustomizableObject_GetStateParameterCount::StateName' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetStateParameterCount, ReturnValue) == 0x000010, "Member 'CustomizableObject_GetStateParameterCount::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetStateParameterName
// 0x0028 (0x0028 - 0x0000)
struct CustomizableObject_GetStateParameterName final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParameterIndex;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetStateParameterName) == 0x000008, "Wrong alignment on CustomizableObject_GetStateParameterName");
static_assert(sizeof(CustomizableObject_GetStateParameterName) == 0x000028, "Wrong size on CustomizableObject_GetStateParameterName");
static_assert(offsetof(CustomizableObject_GetStateParameterName, StateName) == 0x000000, "Member 'CustomizableObject_GetStateParameterName::StateName' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetStateParameterName, ParameterIndex) == 0x000010, "Member 'CustomizableObject_GetStateParameterName::ParameterIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetStateParameterName, ReturnValue) == 0x000018, "Member 'CustomizableObject_GetStateParameterName::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetStateUIMetadata
// 0x0188 (0x0188 - 0x0000)
struct CustomizableObject_GetStateUIMetadata final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FParameterUIData                       ReturnValue;                                       // 0x0010(0x0178)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetStateUIMetadata) == 0x000008, "Wrong alignment on CustomizableObject_GetStateUIMetadata");
static_assert(sizeof(CustomizableObject_GetStateUIMetadata) == 0x000188, "Wrong size on CustomizableObject_GetStateUIMetadata");
static_assert(offsetof(CustomizableObject_GetStateUIMetadata, StateName) == 0x000000, "Member 'CustomizableObject_GetStateUIMetadata::StateName' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetStateUIMetadata, ReturnValue) == 0x000010, "Member 'CustomizableObject_GetStateUIMetadata::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.GetStateUIMetadataFromIndex
// 0x0180 (0x0180 - 0x0000)
struct CustomizableObject_GetStateUIMetadataFromIndex final
{
public:
	int32                                         StateIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParameterUIData                       ReturnValue;                                       // 0x0008(0x0178)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_GetStateUIMetadataFromIndex) == 0x000008, "Wrong alignment on CustomizableObject_GetStateUIMetadataFromIndex");
static_assert(sizeof(CustomizableObject_GetStateUIMetadataFromIndex) == 0x000180, "Wrong size on CustomizableObject_GetStateUIMetadataFromIndex");
static_assert(offsetof(CustomizableObject_GetStateUIMetadataFromIndex, StateIndex) == 0x000000, "Member 'CustomizableObject_GetStateUIMetadataFromIndex::StateIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObject_GetStateUIMetadataFromIndex, ReturnValue) == 0x000008, "Member 'CustomizableObject_GetStateUIMetadataFromIndex::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObject.IsCompiled
// 0x0001 (0x0001 - 0x0000)
struct CustomizableObject_IsCompiled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObject_IsCompiled) == 0x000001, "Wrong alignment on CustomizableObject_IsCompiled");
static_assert(sizeof(CustomizableObject_IsCompiled) == 0x000001, "Wrong size on CustomizableObject_IsCompiled");
static_assert(offsetof(CustomizableObject_IsCompiled, ReturnValue) == 0x000000, "Member 'CustomizableObject_IsCompiled::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.AddValueToFloatRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_AddValueToFloatRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_AddValueToFloatRange) == 0x000008, "Wrong alignment on CustomizableObjectInstance_AddValueToFloatRange");
static_assert(sizeof(CustomizableObjectInstance_AddValueToFloatRange) == 0x000018, "Wrong size on CustomizableObjectInstance_AddValueToFloatRange");
static_assert(offsetof(CustomizableObjectInstance_AddValueToFloatRange, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_AddValueToFloatRange::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_AddValueToFloatRange, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_AddValueToFloatRange::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.AddValueToIntRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_AddValueToIntRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_AddValueToIntRange) == 0x000008, "Wrong alignment on CustomizableObjectInstance_AddValueToIntRange");
static_assert(sizeof(CustomizableObjectInstance_AddValueToIntRange) == 0x000018, "Wrong size on CustomizableObjectInstance_AddValueToIntRange");
static_assert(offsetof(CustomizableObjectInstance_AddValueToIntRange, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_AddValueToIntRange::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_AddValueToIntRange, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_AddValueToIntRange::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.AddValueToProjectorRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_AddValueToProjectorRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_AddValueToProjectorRange) == 0x000008, "Wrong alignment on CustomizableObjectInstance_AddValueToProjectorRange");
static_assert(sizeof(CustomizableObjectInstance_AddValueToProjectorRange) == 0x000018, "Wrong size on CustomizableObjectInstance_AddValueToProjectorRange");
static_assert(offsetof(CustomizableObjectInstance_AddValueToProjectorRange, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_AddValueToProjectorRange::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_AddValueToProjectorRange, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_AddValueToProjectorRange::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.Clone
// 0x0008 (0x0008 - 0x0000)
struct CustomizableObjectInstance_Clone final
{
public:
	class UCustomizableObjectInstance*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_Clone) == 0x000008, "Wrong alignment on CustomizableObjectInstance_Clone");
static_assert(sizeof(CustomizableObjectInstance_Clone) == 0x000008, "Wrong size on CustomizableObjectInstance_Clone");
static_assert(offsetof(CustomizableObjectInstance_Clone, ReturnValue) == 0x000000, "Member 'CustomizableObjectInstance_Clone::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.CloneStatic
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_CloneStatic final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomizableObjectInstance*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_CloneStatic) == 0x000008, "Wrong alignment on CustomizableObjectInstance_CloneStatic");
static_assert(sizeof(CustomizableObjectInstance_CloneStatic) == 0x000010, "Wrong size on CustomizableObjectInstance_CloneStatic");
static_assert(offsetof(CustomizableObjectInstance_CloneStatic, Outer_0) == 0x000000, "Member 'CustomizableObjectInstance_CloneStatic::Outer_0' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_CloneStatic, ReturnValue) == 0x000008, "Member 'CustomizableObjectInstance_CloneStatic::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.GetParameterDescription
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObjectInstance_GetParameterDescription final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DescIndex;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_GetParameterDescription) == 0x000008, "Wrong alignment on CustomizableObjectInstance_GetParameterDescription");
static_assert(sizeof(CustomizableObjectInstance_GetParameterDescription) == 0x000020, "Wrong size on CustomizableObjectInstance_GetParameterDescription");
static_assert(offsetof(CustomizableObjectInstance_GetParameterDescription, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_GetParameterDescription::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_GetParameterDescription, DescIndex) == 0x000010, "Member 'CustomizableObjectInstance_GetParameterDescription::DescIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_GetParameterDescription, ReturnValue) == 0x000018, "Member 'CustomizableObjectInstance_GetParameterDescription::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.GetSkeletalMesh
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_GetSkeletalMesh final
{
public:
	int32                                         ComponentIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_GetSkeletalMesh) == 0x000008, "Wrong alignment on CustomizableObjectInstance_GetSkeletalMesh");
static_assert(sizeof(CustomizableObjectInstance_GetSkeletalMesh) == 0x000010, "Wrong size on CustomizableObjectInstance_GetSkeletalMesh");
static_assert(offsetof(CustomizableObjectInstance_GetSkeletalMesh, ComponentIndex) == 0x000000, "Member 'CustomizableObjectInstance_GetSkeletalMesh::ComponentIndex' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_GetSkeletalMesh, ReturnValue) == 0x000008, "Member 'CustomizableObjectInstance_GetSkeletalMesh::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.RemoveValueFromFloatRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_RemoveValueFromFloatRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_RemoveValueFromFloatRange) == 0x000008, "Wrong alignment on CustomizableObjectInstance_RemoveValueFromFloatRange");
static_assert(sizeof(CustomizableObjectInstance_RemoveValueFromFloatRange) == 0x000018, "Wrong size on CustomizableObjectInstance_RemoveValueFromFloatRange");
static_assert(offsetof(CustomizableObjectInstance_RemoveValueFromFloatRange, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_RemoveValueFromFloatRange::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_RemoveValueFromFloatRange, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_RemoveValueFromFloatRange::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.RemoveValueFromIntRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_RemoveValueFromIntRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_RemoveValueFromIntRange) == 0x000008, "Wrong alignment on CustomizableObjectInstance_RemoveValueFromIntRange");
static_assert(sizeof(CustomizableObjectInstance_RemoveValueFromIntRange) == 0x000018, "Wrong size on CustomizableObjectInstance_RemoveValueFromIntRange");
static_assert(offsetof(CustomizableObjectInstance_RemoveValueFromIntRange, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_RemoveValueFromIntRange::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_RemoveValueFromIntRange, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_RemoveValueFromIntRange::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.RemoveValueFromProjectorRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_RemoveValueFromProjectorRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_RemoveValueFromProjectorRange) == 0x000008, "Wrong alignment on CustomizableObjectInstance_RemoveValueFromProjectorRange");
static_assert(sizeof(CustomizableObjectInstance_RemoveValueFromProjectorRange) == 0x000018, "Wrong size on CustomizableObjectInstance_RemoveValueFromProjectorRange");
static_assert(offsetof(CustomizableObjectInstance_RemoveValueFromProjectorRange, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_RemoveValueFromProjectorRange::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_RemoveValueFromProjectorRange, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_RemoveValueFromProjectorRange::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.SetBoolParameterSelectedOption
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_SetBoolParameterSelectedOption final
{
public:
	class FString                                 BoolParamName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolValue;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_SetBoolParameterSelectedOption) == 0x000008, "Wrong alignment on CustomizableObjectInstance_SetBoolParameterSelectedOption");
static_assert(sizeof(CustomizableObjectInstance_SetBoolParameterSelectedOption) == 0x000018, "Wrong size on CustomizableObjectInstance_SetBoolParameterSelectedOption");
static_assert(offsetof(CustomizableObjectInstance_SetBoolParameterSelectedOption, BoolParamName) == 0x000000, "Member 'CustomizableObjectInstance_SetBoolParameterSelectedOption::BoolParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetBoolParameterSelectedOption, BoolValue) == 0x000010, "Member 'CustomizableObjectInstance_SetBoolParameterSelectedOption::BoolValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.SetColorParameterSelectedOption
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObjectInstance_SetColorParameterSelectedOption final
{
public:
	class FString                                 ColorParamName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorValue;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_SetColorParameterSelectedOption) == 0x000008, "Wrong alignment on CustomizableObjectInstance_SetColorParameterSelectedOption");
static_assert(sizeof(CustomizableObjectInstance_SetColorParameterSelectedOption) == 0x000020, "Wrong size on CustomizableObjectInstance_SetColorParameterSelectedOption");
static_assert(offsetof(CustomizableObjectInstance_SetColorParameterSelectedOption, ColorParamName) == 0x000000, "Member 'CustomizableObjectInstance_SetColorParameterSelectedOption::ColorParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetColorParameterSelectedOption, ColorValue) == 0x000010, "Member 'CustomizableObjectInstance_SetColorParameterSelectedOption::ColorValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.SetCurrentState
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectInstance_SetCurrentState final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_SetCurrentState) == 0x000008, "Wrong alignment on CustomizableObjectInstance_SetCurrentState");
static_assert(sizeof(CustomizableObjectInstance_SetCurrentState) == 0x000010, "Wrong size on CustomizableObjectInstance_SetCurrentState");
static_assert(offsetof(CustomizableObjectInstance_SetCurrentState, StateName) == 0x000000, "Member 'CustomizableObjectInstance_SetCurrentState::StateName' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.SetFloatParameterSelectedOption
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_SetFloatParameterSelectedOption final
{
public:
	class FString                                 FloatParamName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_SetFloatParameterSelectedOption) == 0x000008, "Wrong alignment on CustomizableObjectInstance_SetFloatParameterSelectedOption");
static_assert(sizeof(CustomizableObjectInstance_SetFloatParameterSelectedOption) == 0x000018, "Wrong size on CustomizableObjectInstance_SetFloatParameterSelectedOption");
static_assert(offsetof(CustomizableObjectInstance_SetFloatParameterSelectedOption, FloatParamName) == 0x000000, "Member 'CustomizableObjectInstance_SetFloatParameterSelectedOption::FloatParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetFloatParameterSelectedOption, FloatValue) == 0x000010, "Member 'CustomizableObjectInstance_SetFloatParameterSelectedOption::FloatValue' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetFloatParameterSelectedOption, RangeIndex) == 0x000014, "Member 'CustomizableObjectInstance_SetFloatParameterSelectedOption::RangeIndex' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.SetIntParameterSelectedOption
// 0x0028 (0x0028 - 0x0000)
struct CustomizableObjectInstance_SetIntParameterSelectedOption final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SelectedOptionName;                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_SetIntParameterSelectedOption) == 0x000008, "Wrong alignment on CustomizableObjectInstance_SetIntParameterSelectedOption");
static_assert(sizeof(CustomizableObjectInstance_SetIntParameterSelectedOption) == 0x000028, "Wrong size on CustomizableObjectInstance_SetIntParameterSelectedOption");
static_assert(offsetof(CustomizableObjectInstance_SetIntParameterSelectedOption, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_SetIntParameterSelectedOption::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetIntParameterSelectedOption, SelectedOptionName) == 0x000010, "Member 'CustomizableObjectInstance_SetIntParameterSelectedOption::SelectedOptionName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetIntParameterSelectedOption, RangeIndex) == 0x000020, "Member 'CustomizableObjectInstance_SetIntParameterSelectedOption::RangeIndex' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.SetProjectorValue
// 0x0078 (0x0078 - 0x0000)
struct CustomizableObjectInstance_SetProjectorValue final
{
public:
	class FString                                 ProjectorParamName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Pos;                                               // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Up;                                                // 0x0040(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0058(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RangeIndex;                                        // 0x0074(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_SetProjectorValue) == 0x000008, "Wrong alignment on CustomizableObjectInstance_SetProjectorValue");
static_assert(sizeof(CustomizableObjectInstance_SetProjectorValue) == 0x000078, "Wrong size on CustomizableObjectInstance_SetProjectorValue");
static_assert(offsetof(CustomizableObjectInstance_SetProjectorValue, ProjectorParamName) == 0x000000, "Member 'CustomizableObjectInstance_SetProjectorValue::ProjectorParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetProjectorValue, Pos) == 0x000010, "Member 'CustomizableObjectInstance_SetProjectorValue::Pos' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetProjectorValue, Direction) == 0x000028, "Member 'CustomizableObjectInstance_SetProjectorValue::Direction' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetProjectorValue, Up) == 0x000040, "Member 'CustomizableObjectInstance_SetProjectorValue::Up' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetProjectorValue, Scale) == 0x000058, "Member 'CustomizableObjectInstance_SetProjectorValue::Scale' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetProjectorValue, Angle) == 0x000070, "Member 'CustomizableObjectInstance_SetProjectorValue::Angle' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetProjectorValue, RangeIndex) == 0x000074, "Member 'CustomizableObjectInstance_SetProjectorValue::RangeIndex' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.SetVectorParameterSelectedOption
// 0x0020 (0x0020 - 0x0000)
struct CustomizableObjectInstance_SetVectorParameterSelectedOption final
{
public:
	class FString                                 VectorParamName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VectorValue;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_SetVectorParameterSelectedOption) == 0x000008, "Wrong alignment on CustomizableObjectInstance_SetVectorParameterSelectedOption");
static_assert(sizeof(CustomizableObjectInstance_SetVectorParameterSelectedOption) == 0x000020, "Wrong size on CustomizableObjectInstance_SetVectorParameterSelectedOption");
static_assert(offsetof(CustomizableObjectInstance_SetVectorParameterSelectedOption, VectorParamName) == 0x000000, "Member 'CustomizableObjectInstance_SetVectorParameterSelectedOption::VectorParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_SetVectorParameterSelectedOption, VectorValue) == 0x000010, "Member 'CustomizableObjectInstance_SetVectorParameterSelectedOption::VectorValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.UpdateSkeletalMeshAsync
// 0x0002 (0x0002 - 0x0000)
struct CustomizableObjectInstance_UpdateSkeletalMeshAsync final
{
public:
	bool                                          bIgnoreCloseDist;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceHighPriority;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomizableObjectInstance_UpdateSkeletalMeshAsync) == 0x000001, "Wrong alignment on CustomizableObjectInstance_UpdateSkeletalMeshAsync");
static_assert(sizeof(CustomizableObjectInstance_UpdateSkeletalMeshAsync) == 0x000002, "Wrong size on CustomizableObjectInstance_UpdateSkeletalMeshAsync");
static_assert(offsetof(CustomizableObjectInstance_UpdateSkeletalMeshAsync, bIgnoreCloseDist) == 0x000000, "Member 'CustomizableObjectInstance_UpdateSkeletalMeshAsync::bIgnoreCloseDist' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_UpdateSkeletalMeshAsync, bForceHighPriority) == 0x000001, "Member 'CustomizableObjectInstance_UpdateSkeletalMeshAsync::bForceHighPriority' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.CurrentParamRange
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_CurrentParamRange final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_CurrentParamRange) == 0x000008, "Wrong alignment on CustomizableObjectInstance_CurrentParamRange");
static_assert(sizeof(CustomizableObjectInstance_CurrentParamRange) == 0x000018, "Wrong size on CustomizableObjectInstance_CurrentParamRange");
static_assert(offsetof(CustomizableObjectInstance_CurrentParamRange, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_CurrentParamRange::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_CurrentParamRange, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_CurrentParamRange::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.FindBoolParameterNameIndex
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_FindBoolParameterNameIndex final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_FindBoolParameterNameIndex) == 0x000008, "Wrong alignment on CustomizableObjectInstance_FindBoolParameterNameIndex");
static_assert(sizeof(CustomizableObjectInstance_FindBoolParameterNameIndex) == 0x000018, "Wrong size on CustomizableObjectInstance_FindBoolParameterNameIndex");
static_assert(offsetof(CustomizableObjectInstance_FindBoolParameterNameIndex, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_FindBoolParameterNameIndex::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_FindBoolParameterNameIndex, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_FindBoolParameterNameIndex::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.FindFloatParameterNameIndex
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_FindFloatParameterNameIndex final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_FindFloatParameterNameIndex) == 0x000008, "Wrong alignment on CustomizableObjectInstance_FindFloatParameterNameIndex");
static_assert(sizeof(CustomizableObjectInstance_FindFloatParameterNameIndex) == 0x000018, "Wrong size on CustomizableObjectInstance_FindFloatParameterNameIndex");
static_assert(offsetof(CustomizableObjectInstance_FindFloatParameterNameIndex, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_FindFloatParameterNameIndex::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_FindFloatParameterNameIndex, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_FindFloatParameterNameIndex::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.FindIntParameterNameIndex
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_FindIntParameterNameIndex final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_FindIntParameterNameIndex) == 0x000008, "Wrong alignment on CustomizableObjectInstance_FindIntParameterNameIndex");
static_assert(sizeof(CustomizableObjectInstance_FindIntParameterNameIndex) == 0x000018, "Wrong size on CustomizableObjectInstance_FindIntParameterNameIndex");
static_assert(offsetof(CustomizableObjectInstance_FindIntParameterNameIndex, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_FindIntParameterNameIndex::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_FindIntParameterNameIndex, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_FindIntParameterNameIndex::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.FindProjectorParameterNameIndex
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_FindProjectorParameterNameIndex final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_FindProjectorParameterNameIndex) == 0x000008, "Wrong alignment on CustomizableObjectInstance_FindProjectorParameterNameIndex");
static_assert(sizeof(CustomizableObjectInstance_FindProjectorParameterNameIndex) == 0x000018, "Wrong size on CustomizableObjectInstance_FindProjectorParameterNameIndex");
static_assert(offsetof(CustomizableObjectInstance_FindProjectorParameterNameIndex, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_FindProjectorParameterNameIndex::ParamName' has a wrong offset!");
static_assert(offsetof(CustomizableObjectInstance_FindProjectorParameterNameIndex, ReturnValue) == 0x000010, "Member 'CustomizableObjectInstance_FindProjectorParameterNameIndex::ReturnValue' has a wrong offset!");

// Function CustomizableObject.CustomizableObjectInstance.FindVectorParameterNameIndex
// 0x0018 (0x0018 - 0x0000)
struct CustomizableObjectInstance_FindVectorParameterNameIndex final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomizableObjectInstance_FindVectorParameterNameIndex) == 0x000008, "Wrong alignment on CustomizableObjectInstance_FindVectorParameterNameIndex");
static_assert(sizeof(CustomizableObjectInstance_FindVectorParameterNameIndex) == 0x000018, "Wrong size on CustomizableObjectInstance_FindVectorParameterNameIndex");
static_assert(offsetof(CustomizableObjectInstance_FindVectorParameterNameIndex, ParamName) == 0x000000, "Member 'CustomizableObjectInstance_FindVectorParameterNameIndex::ParamName' has a wrong offset!");
