#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_BoostJumpPack

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function DA_BoostJumpPack.DA_BoostJumpPack_C.BPPressTrigger
// 0x0008 (0x0008 - 0x0000)
struct DA_BoostJumpPack_C_BPPressTrigger final
{
public:
	class AFortDecoHelper*                        FortDecoHelper;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DA_BoostJumpPack_C_BPPressTrigger) == 0x000008, "Wrong alignment on DA_BoostJumpPack_C_BPPressTrigger");
static_assert(sizeof(DA_BoostJumpPack_C_BPPressTrigger) == 0x000008, "Wrong size on DA_BoostJumpPack_C_BPPressTrigger");
static_assert(offsetof(DA_BoostJumpPack_C_BPPressTrigger, FortDecoHelper) == 0x000000, "Member 'DA_BoostJumpPack_C_BPPressTrigger::FortDecoHelper' has a wrong offset!");

// Function DA_BoostJumpPack.DA_BoostJumpPack_C.ExecuteUbergraph_DA_BoostJumpPack
// 0x0048 (0x0048 - 0x0000)
struct DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDecoHelper*                        K2Node_Event_FortDecoHelper;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Select_Default;                             // 0x0028(0x0020)(ConstParm)
};
static_assert(alignof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack) == 0x000008, "Wrong alignment on DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack");
static_assert(sizeof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack) == 0x000048, "Wrong size on DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack");
static_assert(offsetof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack, EntryPoint) == 0x000000, "Member 'DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack::EntryPoint' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack, CallFunc_IsErebus_ReturnValue) == 0x000004, "Member 'DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack, K2Node_Event_FortDecoHelper) == 0x000018, "Member 'DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack::K2Node_Event_FortDecoHelper' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack, CallFunc_BooleanOR_ReturnValue) == 0x000021, "Member 'DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack, Temp_bool_Variable) == 0x000022, "Member 'DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack, K2Node_Select_Default) == 0x000028, "Member 'DA_BoostJumpPack_C_ExecuteUbergraph_DA_BoostJumpPack::K2Node_Select_Default' has a wrong offset!");

// Function DA_BoostJumpPack.DA_BoostJumpPack_C.IsOnGround
// 0x0020 (0x0020 - 0x0000)
struct DA_BoostJumpPack_C_IsOnGround final
{
public:
	bool                                          bOnGround;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DA_BoostJumpPack_C_IsOnGround) == 0x000008, "Wrong alignment on DA_BoostJumpPack_C_IsOnGround");
static_assert(sizeof(DA_BoostJumpPack_C_IsOnGround) == 0x000020, "Wrong size on DA_BoostJumpPack_C_IsOnGround");
static_assert(offsetof(DA_BoostJumpPack_C_IsOnGround, bOnGround) == 0x000000, "Member 'DA_BoostJumpPack_C_IsOnGround::bOnGround' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_IsOnGround, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'DA_BoostJumpPack_C_IsOnGround::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_IsOnGround, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'DA_BoostJumpPack_C_IsOnGround::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_IsOnGround, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DA_BoostJumpPack_C_IsOnGround::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_IsOnGround, CallFunc_IsFalling_ReturnValue) == 0x000019, "Member 'DA_BoostJumpPack_C_IsOnGround::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_IsOnGround, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'DA_BoostJumpPack_C_IsOnGround::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function DA_BoostJumpPack.DA_BoostJumpPack_C.RaiseUsageError
// 0x0038 (0x0038 - 0x0000)
struct DA_BoostJumpPack_C_RaiseUsageError final
{
public:
	struct FGameplayTagContainer                  FailedReason;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DA_BoostJumpPack_C_RaiseUsageError) == 0x000008, "Wrong alignment on DA_BoostJumpPack_C_RaiseUsageError");
static_assert(sizeof(DA_BoostJumpPack_C_RaiseUsageError) == 0x000038, "Wrong size on DA_BoostJumpPack_C_RaiseUsageError");
static_assert(offsetof(DA_BoostJumpPack_C_RaiseUsageError, FailedReason) == 0x000000, "Member 'DA_BoostJumpPack_C_RaiseUsageError::FailedReason' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_RaiseUsageError, CallFunc_GetInstigator_ReturnValue) == 0x000020, "Member 'DA_BoostJumpPack_C_RaiseUsageError::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_RaiseUsageError, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000028, "Member 'DA_BoostJumpPack_C_RaiseUsageError::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(DA_BoostJumpPack_C_RaiseUsageError, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'DA_BoostJumpPack_C_RaiseUsageError::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

