#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DaDoorHealthWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DaDoorHealthWidget.DaDoorHealthWidget_C
// 0x0048 (0x0300 - 0x02B8)
class UDaDoorHealthWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNPCStatusWidgetBar_C*                  Bar_Health;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNPCStatusWidgetBar_C*                  Bar_Shield;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HealthNumbers;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           VisibiltyTimer;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool bVisible)> VisibilityChanged;                                 // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         StatusWidgetVisibleDuration;                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHealthPercent;                              // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentShieldPercent;                              // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KeepVisibilityOn;                                  // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TryCallEventHideByTimer();
	void SetKeepVisibilityOn(bool KeepVisibilityOn_0);
	void ExecuteUbergraph_DaDoorHealthWidget(int32 EntryPoint);
	void EventUpdateStatus(float Health, float Shield, bool ShowShield);
	void EventShowNumbers(int64 Health);
	void EventHideStatus();
	void Construct();
	void ChangeWidgetVisibleDuration(float StatusWidgetVisibleDuration_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DaDoorHealthWidget_C">();
	}
	static class UDaDoorHealthWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaDoorHealthWidget_C>();
	}
};
static_assert(alignof(UDaDoorHealthWidget_C) == 0x000008, "Wrong alignment on UDaDoorHealthWidget_C");
static_assert(sizeof(UDaDoorHealthWidget_C) == 0x000300, "Wrong size on UDaDoorHealthWidget_C");
static_assert(offsetof(UDaDoorHealthWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UDaDoorHealthWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDaDoorHealthWidget_C, Bar_Health) == 0x0002C0, "Member 'UDaDoorHealthWidget_C::Bar_Health' has a wrong offset!");
static_assert(offsetof(UDaDoorHealthWidget_C, Bar_Shield) == 0x0002C8, "Member 'UDaDoorHealthWidget_C::Bar_Shield' has a wrong offset!");
static_assert(offsetof(UDaDoorHealthWidget_C, HealthNumbers) == 0x0002D0, "Member 'UDaDoorHealthWidget_C::HealthNumbers' has a wrong offset!");
static_assert(offsetof(UDaDoorHealthWidget_C, VisibiltyTimer) == 0x0002D8, "Member 'UDaDoorHealthWidget_C::VisibiltyTimer' has a wrong offset!");
static_assert(offsetof(UDaDoorHealthWidget_C, VisibilityChanged) == 0x0002E0, "Member 'UDaDoorHealthWidget_C::VisibilityChanged' has a wrong offset!");
static_assert(offsetof(UDaDoorHealthWidget_C, StatusWidgetVisibleDuration) == 0x0002F0, "Member 'UDaDoorHealthWidget_C::StatusWidgetVisibleDuration' has a wrong offset!");
static_assert(offsetof(UDaDoorHealthWidget_C, CurrentHealthPercent) == 0x0002F4, "Member 'UDaDoorHealthWidget_C::CurrentHealthPercent' has a wrong offset!");
static_assert(offsetof(UDaDoorHealthWidget_C, CurrentShieldPercent) == 0x0002F8, "Member 'UDaDoorHealthWidget_C::CurrentShieldPercent' has a wrong offset!");
static_assert(offsetof(UDaDoorHealthWidget_C, KeepVisibilityOn) == 0x0002FC, "Member 'UDaDoorHealthWidget_C::KeepVisibilityOn' has a wrong offset!");

}

