#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Decal_CampsiteRadius

#include "Basic.hpp"


namespace SDK::Params
{

// Function Decal_CampsiteRadius.Decal_CampsiteRadius_C.ExecuteUbergraph_Decal_CampsiteRadius
// 0x0004 (0x0004 - 0x0000)
struct Decal_CampsiteRadius_C_ExecuteUbergraph_Decal_CampsiteRadius final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Decal_CampsiteRadius_C_ExecuteUbergraph_Decal_CampsiteRadius) == 0x000004, "Wrong alignment on Decal_CampsiteRadius_C_ExecuteUbergraph_Decal_CampsiteRadius");
static_assert(sizeof(Decal_CampsiteRadius_C_ExecuteUbergraph_Decal_CampsiteRadius) == 0x000004, "Wrong size on Decal_CampsiteRadius_C_ExecuteUbergraph_Decal_CampsiteRadius");
static_assert(offsetof(Decal_CampsiteRadius_C_ExecuteUbergraph_Decal_CampsiteRadius, EntryPoint) == 0x000000, "Member 'Decal_CampsiteRadius_C_ExecuteUbergraph_Decal_CampsiteRadius::EntryPoint' has a wrong offset!");

// Function Decal_CampsiteRadius.Decal_CampsiteRadius_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Decal_CampsiteRadius_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Decal_CampsiteRadius_C_UserConstructionScript) == 0x000008, "Wrong alignment on Decal_CampsiteRadius_C_UserConstructionScript");
static_assert(sizeof(Decal_CampsiteRadius_C_UserConstructionScript) == 0x000010, "Wrong size on Decal_CampsiteRadius_C_UserConstructionScript");
static_assert(offsetof(Decal_CampsiteRadius_C_UserConstructionScript, CallFunc_GetDecalMaterial_ReturnValue) == 0x000000, "Member 'Decal_CampsiteRadius_C_UserConstructionScript::CallFunc_GetDecalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Decal_CampsiteRadius_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Decal_CampsiteRadius_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

