#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeveloperSettings

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DeveloperSettings.PlatformSettings
// 0x0010 (0x0038 - 0x0028)
class UPlatformSettings : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlatformSettings">();
	}
	static class UPlatformSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlatformSettings>();
	}
};
static_assert(alignof(UPlatformSettings) == 0x000008, "Wrong alignment on UPlatformSettings");
static_assert(sizeof(UPlatformSettings) == 0x000038, "Wrong size on UPlatformSettings");

// Class DeveloperSettings.DeveloperSettings
// 0x0008 (0x0030 - 0x0028)
class UDeveloperSettings : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeveloperSettings">();
	}
	static class UDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeveloperSettings>();
	}
};
static_assert(alignof(UDeveloperSettings) == 0x000008, "Wrong alignment on UDeveloperSettings");
static_assert(sizeof(UDeveloperSettings) == 0x000030, "Wrong size on UDeveloperSettings");

// Class DeveloperSettings.DeveloperSettingsBackedByCVars
// 0x0000 (0x0030 - 0x0030)
class UDeveloperSettingsBackedByCVars final : public UDeveloperSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeveloperSettingsBackedByCVars">();
	}
	static class UDeveloperSettingsBackedByCVars* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeveloperSettingsBackedByCVars>();
	}
};
static_assert(alignof(UDeveloperSettingsBackedByCVars) == 0x000008, "Wrong alignment on UDeveloperSettingsBackedByCVars");
static_assert(sizeof(UDeveloperSettingsBackedByCVars) == 0x000030, "Wrong size on UDeveloperSettingsBackedByCVars");

}

