#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicUI

#include "Basic.hpp"


namespace SDK
{

// Enum DynamicUI.EDynamicUIStrength
// NumValues: 0x0005
enum class EDynamicUIStrength : uint8
{
	Weak                                     = 0,
	Medium                                   = 1,
	Strong                                   = 2,
	Required                                 = 3,
	EDynamicUIStrength_MAX                   = 4,
};

// Enum DynamicUI.EDynamicUIAnchor
// NumValues: 0x000A
enum class EDynamicUIAnchor : uint32
{
	TopLeft                                  = 0,
	TopCenter                                = 1,
	TopRight                                 = 2,
	CenterLeft                               = 3,
	CenterCenter                             = 4,
	CenterRight                              = 5,
	BottomLeft                               = 6,
	BottomCenter                             = 7,
	BottomRight                              = 8,
	EDynamicUIAnchor_MAX                     = 9,
};

// Enum DynamicUI.EDynamicUIAspectRatio
// NumValues: 0x0008
enum class EDynamicUIAspectRatio : uint32
{
	AspectRatio_1_1                          = 0,
	AspectRatio_4_3                          = 1,
	AspectRatio_5_4                          = 2,
	AspectRatio_16_9                         = 3,
	AspectRatio_16_10                        = 4,
	AspectRatio_21_9                         = 5,
	Custom                                   = 6,
	EDynamicUIAspectRatio_MAX                = 7,
};

// Enum DynamicUI.EDynamicUIZOrder
// NumValues: 0x0009
enum class EDynamicUIZOrder : uint32
{
	Back                                     = 1000,
	Middle                                   = 2000,
	Front                                    = 3000,
	Custom                                   = 2500,
	CustomMin                                = 0,
	CustomMax                                = 5000,
	Loading                                  = 30000,
	Top                                      = 50000,
	EDynamicUIZOrder_MAX                     = 50001,
};

// Enum DynamicUI.EDynamicUIUnallowedBehavior
// NumValues: 0x0004
enum class EDynamicUIUnallowedBehavior : uint32
{
	Hide                                     = 0,
	Collapse                                 = 1,
	Destroy                                  = 2,
	EDynamicUIUnallowedBehavior_MAX          = 3,
};

// Enum DynamicUI.EDynamicUIDebugDisplayMode
// NumValues: 0x0004
enum class EDynamicUIDebugDisplayMode : uint8
{
	Hide                                     = 0,
	ShowSelected                             = 1,
	ShowAll                                  = 2,
	EDynamicUIDebugDisplayMode_MAX           = 3,
};

// ScriptStruct DynamicUI.DynamicUIAspectRatio
// 0x0008 (0x0008 - 0x0000)
struct FDynamicUIAspectRatio final
{
public:
	EDynamicUIAspectRatio                         AspectRatio;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomAspectRatio;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDynamicUIAspectRatio) == 0x000004, "Wrong alignment on FDynamicUIAspectRatio");
static_assert(sizeof(FDynamicUIAspectRatio) == 0x000008, "Wrong size on FDynamicUIAspectRatio");
static_assert(offsetof(FDynamicUIAspectRatio, AspectRatio) == 0x000000, "Member 'FDynamicUIAspectRatio::AspectRatio' has a wrong offset!");
static_assert(offsetof(FDynamicUIAspectRatio, CustomAspectRatio) == 0x000004, "Member 'FDynamicUIAspectRatio::CustomAspectRatio' has a wrong offset!");

// ScriptStruct DynamicUI.DynamicUIContraintTarget
// 0x0038 (0x0038 - 0x0000)
struct FDynamicUIContraintTarget final
{
public:
	class FName                                   WidgetPath;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0008(0x0028)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UniqueId;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseUniqueID : 1;                                  // 0x0034(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDynamicUIContraintTarget) == 0x000008, "Wrong alignment on FDynamicUIContraintTarget");
static_assert(sizeof(FDynamicUIContraintTarget) == 0x000038, "Wrong size on FDynamicUIContraintTarget");
static_assert(offsetof(FDynamicUIContraintTarget, WidgetPath) == 0x000000, "Member 'FDynamicUIContraintTarget::WidgetPath' has a wrong offset!");
static_assert(offsetof(FDynamicUIContraintTarget, WidgetClass) == 0x000008, "Member 'FDynamicUIContraintTarget::WidgetClass' has a wrong offset!");
static_assert(offsetof(FDynamicUIContraintTarget, UniqueId) == 0x000030, "Member 'FDynamicUIContraintTarget::UniqueId' has a wrong offset!");

// ScriptStruct DynamicUI.DynamicUIAllowed
// 0x0078 (0x0078 - 0x0000)
struct FDynamicUIAllowed final
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicUIZOrder                              ZOrder;                                            // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomZOrder;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UniqueId;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCommonInputActionDomain> ActionDomain;                                      // 0x0038(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicUIConstraintBase*               LayoutConstraint;                                  // 0x0060(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsUnique : 1;                                     // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseActionDomain : 1;                              // 0x0068(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_69[0xF];                                       // 0x0069(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDynamicUIAllowed) == 0x000008, "Wrong alignment on FDynamicUIAllowed");
static_assert(sizeof(FDynamicUIAllowed) == 0x000078, "Wrong size on FDynamicUIAllowed");
static_assert(offsetof(FDynamicUIAllowed, Widget) == 0x000000, "Member 'FDynamicUIAllowed::Widget' has a wrong offset!");
static_assert(offsetof(FDynamicUIAllowed, ZOrder) == 0x000028, "Member 'FDynamicUIAllowed::ZOrder' has a wrong offset!");
static_assert(offsetof(FDynamicUIAllowed, CustomZOrder) == 0x00002C, "Member 'FDynamicUIAllowed::CustomZOrder' has a wrong offset!");
static_assert(offsetof(FDynamicUIAllowed, UniqueId) == 0x000030, "Member 'FDynamicUIAllowed::UniqueId' has a wrong offset!");
static_assert(offsetof(FDynamicUIAllowed, ActionDomain) == 0x000038, "Member 'FDynamicUIAllowed::ActionDomain' has a wrong offset!");
static_assert(offsetof(FDynamicUIAllowed, LayoutConstraint) == 0x000060, "Member 'FDynamicUIAllowed::LayoutConstraint' has a wrong offset!");

// ScriptStruct DynamicUI.DynamicUIUnallowed
// 0x0038 (0x0038 - 0x0000)
struct FDynamicUIUnallowed final
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UniqueId;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicUIUnallowedBehavior                   Behavior;                                          // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bTargetAll : 1;                                    // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseUniqueID : 1;                                  // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDynamicUIUnallowed) == 0x000008, "Wrong alignment on FDynamicUIUnallowed");
static_assert(sizeof(FDynamicUIUnallowed) == 0x000038, "Wrong size on FDynamicUIUnallowed");
static_assert(offsetof(FDynamicUIUnallowed, Widget) == 0x000000, "Member 'FDynamicUIUnallowed::Widget' has a wrong offset!");
static_assert(offsetof(FDynamicUIUnallowed, UniqueId) == 0x000028, "Member 'FDynamicUIUnallowed::UniqueId' has a wrong offset!");
static_assert(offsetof(FDynamicUIUnallowed, Behavior) == 0x00002C, "Member 'FDynamicUIUnallowed::Behavior' has a wrong offset!");

// ScriptStruct DynamicUI.DynamicUIPreload
// 0x0028 (0x0028 - 0x0000)
struct FDynamicUIPreload final
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDynamicUIPreload) == 0x000008, "Wrong alignment on FDynamicUIPreload");
static_assert(sizeof(FDynamicUIPreload) == 0x000028, "Wrong size on FDynamicUIPreload");
static_assert(offsetof(FDynamicUIPreload, Widget) == 0x000000, "Member 'FDynamicUIPreload::Widget' has a wrong offset!");

// ScriptStruct DynamicUI.DynamicUISceneData
// 0x0010 (0x0010 - 0x0000)
struct FDynamicUISceneData final
{
public:
	TArray<TWeakObjectPtr<class UObject>>         Contexts;                                          // 0x0000(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDynamicUISceneData) == 0x000008, "Wrong alignment on FDynamicUISceneData");
static_assert(sizeof(FDynamicUISceneData) == 0x000010, "Wrong size on FDynamicUISceneData");
static_assert(offsetof(FDynamicUISceneData, Contexts) == 0x000000, "Member 'FDynamicUISceneData::Contexts' has a wrong offset!");

// ScriptStruct DynamicUI.DynamicUIDirectorData
// 0x0038 (0x0038 - 0x0000)
struct FDynamicUIDirectorData final
{
public:
	TSoftClassPtr<class UClass>                   DirectorClass;                                     // 0x0000(0x0028)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Instance;                                          // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDynamicUIDirectorData) == 0x000008, "Wrong alignment on FDynamicUIDirectorData");
static_assert(sizeof(FDynamicUIDirectorData) == 0x000038, "Wrong size on FDynamicUIDirectorData");
static_assert(offsetof(FDynamicUIDirectorData, DirectorClass) == 0x000000, "Member 'FDynamicUIDirectorData::DirectorClass' has a wrong offset!");
static_assert(offsetof(FDynamicUIDirectorData, Instance) == 0x000028, "Member 'FDynamicUIDirectorData::Instance' has a wrong offset!");

// ScriptStruct DynamicUI.DynamicUIPlayerData
// 0x00E8 (0x00E8 - 0x0000)
struct FDynamicUIPlayerData final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FDynamicUIDirectorData> ActiveDirectors;                                   // 0x0040(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<TWeakObjectPtr<class UDynamicUIScene>, struct FDynamicUISceneData> ActiveScenes;                                      // 0x0090(0x0050)(Transient, NativeAccessSpecifierPublic)
	class UDynamicUIScene*                        SingleWidgetAPIScene;                              // 0x00E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDynamicUIPlayerData) == 0x000008, "Wrong alignment on FDynamicUIPlayerData");
static_assert(sizeof(FDynamicUIPlayerData) == 0x0000E8, "Wrong size on FDynamicUIPlayerData");
static_assert(offsetof(FDynamicUIPlayerData, ActiveDirectors) == 0x000040, "Member 'FDynamicUIPlayerData::ActiveDirectors' has a wrong offset!");
static_assert(offsetof(FDynamicUIPlayerData, ActiveScenes) == 0x000090, "Member 'FDynamicUIPlayerData::ActiveScenes' has a wrong offset!");
static_assert(offsetof(FDynamicUIPlayerData, SingleWidgetAPIScene) == 0x0000E0, "Member 'FDynamicUIPlayerData::SingleWidgetAPIScene' has a wrong offset!");

// ScriptStruct DynamicUI.DynamicUIKey
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDynamicUIKey final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDynamicUIKey) == 0x000008, "Wrong alignment on FDynamicUIKey");
static_assert(sizeof(FDynamicUIKey) == 0x000008, "Wrong size on FDynamicUIKey");

}

