#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function DynamicUI.DynamicUIDirectorBase.AddScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIDirectorBase_AddScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIDirectorBase_AddScene) == 0x000008, "Wrong alignment on DynamicUIDirectorBase_AddScene");
static_assert(sizeof(DynamicUIDirectorBase_AddScene) == 0x000010, "Wrong size on DynamicUIDirectorBase_AddScene");
static_assert(offsetof(DynamicUIDirectorBase_AddScene, Scene) == 0x000000, "Member 'DynamicUIDirectorBase_AddScene::Scene' has a wrong offset!");
static_assert(offsetof(DynamicUIDirectorBase_AddScene, OptionalContext) == 0x000008, "Member 'DynamicUIDirectorBase_AddScene::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIDirectorBase.RemoveScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIDirectorBase_RemoveScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIDirectorBase_RemoveScene) == 0x000008, "Wrong alignment on DynamicUIDirectorBase_RemoveScene");
static_assert(sizeof(DynamicUIDirectorBase_RemoveScene) == 0x000010, "Wrong size on DynamicUIDirectorBase_RemoveScene");
static_assert(offsetof(DynamicUIDirectorBase_RemoveScene, Scene) == 0x000000, "Member 'DynamicUIDirectorBase_RemoveScene::Scene' has a wrong offset!");
static_assert(offsetof(DynamicUIDirectorBase_RemoveScene, OptionalContext) == 0x000008, "Member 'DynamicUIDirectorBase_RemoveScene::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIDirectorBase.GetOwningLocalPlayerController
// 0x0008 (0x0008 - 0x0000)
struct DynamicUIDirectorBase_GetOwningLocalPlayerController final
{
public:
	class APlayerController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIDirectorBase_GetOwningLocalPlayerController) == 0x000008, "Wrong alignment on DynamicUIDirectorBase_GetOwningLocalPlayerController");
static_assert(sizeof(DynamicUIDirectorBase_GetOwningLocalPlayerController) == 0x000008, "Wrong size on DynamicUIDirectorBase_GetOwningLocalPlayerController");
static_assert(offsetof(DynamicUIDirectorBase_GetOwningLocalPlayerController, ReturnValue) == 0x000000, "Member 'DynamicUIDirectorBase_GetOwningLocalPlayerController::ReturnValue' has a wrong offset!");

// Function DynamicUI.DynamicUIManager.AddScene
// 0x0018 (0x0018 - 0x0000)
struct DynamicUIManager_AddScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULocalPlayer*                     Player;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_AddScene) == 0x000008, "Wrong alignment on DynamicUIManager_AddScene");
static_assert(sizeof(DynamicUIManager_AddScene) == 0x000018, "Wrong size on DynamicUIManager_AddScene");
static_assert(offsetof(DynamicUIManager_AddScene, Scene) == 0x000000, "Member 'DynamicUIManager_AddScene::Scene' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_AddScene, Player) == 0x000008, "Member 'DynamicUIManager_AddScene::Player' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_AddScene, OptionalContext) == 0x000010, "Member 'DynamicUIManager_AddScene::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIManager.AddScenes
// 0x0020 (0x0020 - 0x0000)
struct DynamicUIManager_AddScenes final
{
public:
	TArray<class UDynamicUIScene*>                Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class ULocalPlayer*                     Player;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_AddScenes) == 0x000008, "Wrong alignment on DynamicUIManager_AddScenes");
static_assert(sizeof(DynamicUIManager_AddScenes) == 0x000020, "Wrong size on DynamicUIManager_AddScenes");
static_assert(offsetof(DynamicUIManager_AddScenes, Scenes) == 0x000000, "Member 'DynamicUIManager_AddScenes::Scenes' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_AddScenes, Player) == 0x000010, "Member 'DynamicUIManager_AddScenes::Player' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_AddScenes, OptionalContext) == 0x000018, "Member 'DynamicUIManager_AddScenes::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIManager.AddSceneToFirstLocalPlayer
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIManager_AddSceneToFirstLocalPlayer final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_AddSceneToFirstLocalPlayer) == 0x000008, "Wrong alignment on DynamicUIManager_AddSceneToFirstLocalPlayer");
static_assert(sizeof(DynamicUIManager_AddSceneToFirstLocalPlayer) == 0x000010, "Wrong size on DynamicUIManager_AddSceneToFirstLocalPlayer");
static_assert(offsetof(DynamicUIManager_AddSceneToFirstLocalPlayer, Scene) == 0x000000, "Member 'DynamicUIManager_AddSceneToFirstLocalPlayer::Scene' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_AddSceneToFirstLocalPlayer, OptionalContext) == 0x000008, "Member 'DynamicUIManager_AddSceneToFirstLocalPlayer::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIManager.RemoveScene
// 0x0018 (0x0018 - 0x0000)
struct DynamicUIManager_RemoveScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULocalPlayer*                     Player;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_RemoveScene) == 0x000008, "Wrong alignment on DynamicUIManager_RemoveScene");
static_assert(sizeof(DynamicUIManager_RemoveScene) == 0x000018, "Wrong size on DynamicUIManager_RemoveScene");
static_assert(offsetof(DynamicUIManager_RemoveScene, Scene) == 0x000000, "Member 'DynamicUIManager_RemoveScene::Scene' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_RemoveScene, Player) == 0x000008, "Member 'DynamicUIManager_RemoveScene::Player' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_RemoveScene, OptionalContext) == 0x000010, "Member 'DynamicUIManager_RemoveScene::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIManager.RemoveSceneFromFirstLocalPlayer
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIManager_RemoveSceneFromFirstLocalPlayer final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_RemoveSceneFromFirstLocalPlayer) == 0x000008, "Wrong alignment on DynamicUIManager_RemoveSceneFromFirstLocalPlayer");
static_assert(sizeof(DynamicUIManager_RemoveSceneFromFirstLocalPlayer) == 0x000010, "Wrong size on DynamicUIManager_RemoveSceneFromFirstLocalPlayer");
static_assert(offsetof(DynamicUIManager_RemoveSceneFromFirstLocalPlayer, Scene) == 0x000000, "Member 'DynamicUIManager_RemoveSceneFromFirstLocalPlayer::Scene' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_RemoveSceneFromFirstLocalPlayer, OptionalContext) == 0x000008, "Member 'DynamicUIManager_RemoveSceneFromFirstLocalPlayer::OptionalContext' has a wrong offset!");

// Function DynamicUI.DynamicUIManager.RemoveScenes
// 0x0020 (0x0020 - 0x0000)
struct DynamicUIManager_RemoveScenes final
{
public:
	TArray<class UDynamicUIScene*>                Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class ULocalPlayer*                     Player;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicUIManager_RemoveScenes) == 0x000008, "Wrong alignment on DynamicUIManager_RemoveScenes");
static_assert(sizeof(DynamicUIManager_RemoveScenes) == 0x000020, "Wrong size on DynamicUIManager_RemoveScenes");
static_assert(offsetof(DynamicUIManager_RemoveScenes, Scenes) == 0x000000, "Member 'DynamicUIManager_RemoveScenes::Scenes' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_RemoveScenes, Player) == 0x000010, "Member 'DynamicUIManager_RemoveScenes::Player' has a wrong offset!");
static_assert(offsetof(DynamicUIManager_RemoveScenes, OptionalContext) == 0x000018, "Member 'DynamicUIManager_RemoveScenes::OptionalContext' has a wrong offset!");

}

