#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndOfMatch_QuestProgessRecap

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function EndOfMatch_QuestProgessRecap.EndOfMatch_QuestProgessRecap_C.ExecuteUbergraph_EndOfMatch_QuestProgessRecap
// 0x0010 (0x0010 - 0x0000)
struct EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap) == 0x000004, "Wrong alignment on EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap");
static_assert(sizeof(EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap) == 0x000010, "Wrong size on EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap");
static_assert(offsetof(EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap, EntryPoint) == 0x000000, "Member 'EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap::EntryPoint' has a wrong offset!");
static_assert(offsetof(EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap, Temp_int_Variable) == 0x000004, "Member 'EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap, Temp_byte_Variable) == 0x000008, "Member 'EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap, Temp_byte_Variable_1) == 0x000009, "Member 'EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap, Temp_byte_Variable_2) == 0x00000A, "Member 'EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap, K2Node_Event_IsDesignTime) == 0x00000B, "Member 'EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap, K2Node_Select_Default) == 0x00000C, "Member 'EndOfMatch_QuestProgessRecap_C_ExecuteUbergraph_EndOfMatch_QuestProgessRecap::K2Node_Select_Default' has a wrong offset!");

// Function EndOfMatch_QuestProgessRecap.EndOfMatch_QuestProgessRecap_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct EndOfMatch_QuestProgessRecap_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EndOfMatch_QuestProgessRecap_C_PreConstruct) == 0x000001, "Wrong alignment on EndOfMatch_QuestProgessRecap_C_PreConstruct");
static_assert(sizeof(EndOfMatch_QuestProgessRecap_C_PreConstruct) == 0x000001, "Wrong size on EndOfMatch_QuestProgessRecap_C_PreConstruct");
static_assert(offsetof(EndOfMatch_QuestProgessRecap_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'EndOfMatch_QuestProgessRecap_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

