#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnvQueryContext_AllRiversWaterBodies

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Water_structs.hpp"


namespace SDK::Params
{

// Function EnvQueryContext_AllRiversWaterBodies.EnvQueryContext_AllRiversWaterBodies_C.ProvideActorsSet
// 0x0090 (0x0090 - 0x0000)
struct EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ResultingActorsSet;                                // 0x0010(0x0010)(Parm, OutParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortWaterBodyActor*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ReferenceParm)
	class AFortWaterBodyActor*                    CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWaterBodyType                                CallFunc_GetWaterBodyType_ReturnValue;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet) == 0x000008, "Wrong alignment on EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet");
static_assert(sizeof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet) == 0x000090, "Wrong size on EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, QuerierObject) == 0x000000, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::QuerierObject' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, QuerierActor) == 0x000008, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::QuerierActor' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, ResultingActorsSet) == 0x000010, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::ResultingActorsSet' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, Temp_int_Array_Index_Variable) == 0x000038, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_Array_Get_Item) == 0x000058, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_GetWaterBodyType_ReturnValue) == 0x000069, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_GetWaterBodyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006A, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_Vector_Distance2D_ReturnValue) == 0x000088, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet, CallFunc_Less_FloatFloat_ReturnValue) == 0x00008C, "Member 'EnvQueryContext_AllRiversWaterBodies_C_ProvideActorsSet::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

