#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesEngine

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EpicGamesEngine.VerseUEInputComponentBase.ServerTriggerAction
// 0x0008 (0x0008 - 0x0000)
struct VerseUEInputComponentBase_ServerTriggerAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VerseUEInputComponentBase_ServerTriggerAction) == 0x000004, "Wrong alignment on VerseUEInputComponentBase_ServerTriggerAction");
static_assert(sizeof(VerseUEInputComponentBase_ServerTriggerAction) == 0x000008, "Wrong size on VerseUEInputComponentBase_ServerTriggerAction");
static_assert(offsetof(VerseUEInputComponentBase_ServerTriggerAction, ActionName) == 0x000000, "Member 'VerseUEInputComponentBase_ServerTriggerAction::ActionName' has a wrong offset!");
static_assert(offsetof(VerseUEInputComponentBase_ServerTriggerAction, InputEvent) == 0x000004, "Member 'VerseUEInputComponentBase_ServerTriggerAction::InputEvent' has a wrong offset!");

// Function EpicGamesEngine.VerseUEInputComponentBase.ServerTriggerAxis
// 0x0008 (0x0008 - 0x0000)
struct VerseUEInputComponentBase_ServerTriggerAxis final
{
public:
	class FName                                   AxisName;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseUEInputComponentBase_ServerTriggerAxis) == 0x000004, "Wrong alignment on VerseUEInputComponentBase_ServerTriggerAxis");
static_assert(sizeof(VerseUEInputComponentBase_ServerTriggerAxis) == 0x000008, "Wrong size on VerseUEInputComponentBase_ServerTriggerAxis");
static_assert(offsetof(VerseUEInputComponentBase_ServerTriggerAxis, AxisName) == 0x000000, "Member 'VerseUEInputComponentBase_ServerTriggerAxis::AxisName' has a wrong offset!");
static_assert(offsetof(VerseUEInputComponentBase_ServerTriggerAxis, Value) == 0x000004, "Member 'VerseUEInputComponentBase_ServerTriggerAxis::Value' has a wrong offset!");

}

