#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesEngine_0

#include "Basic.hpp"

#include "SolarisInterop_0_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "EpicGamesEngine_0_structs.hpp"
#include "EpicGamesEngine_classes.hpp"


namespace SDK
{

// SolarisGeneratedClass EpicGamesEngine.verse_ue_input_component
// 0x01B8 (0x0608 - 0x0450)
class Uverse_ue_input_component final : public UVerseUEInputComponentBase
{
public:
	uint8                                         Pad_450[0x8];                                      // 0x0450(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_R& __verse_0xB2CDDD72_Argument)> __verse_0xA0CE540B__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_R; // 0x0458(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_L_Kchar_Minput__event_Mtuple_L_R_Tvoid_R& __verse_0xB2CDDD72_Argument)> __verse_0x7C4A751D__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionBinding_L_N_Kchar_M_Ninput__event_M_Ntuple_L_R_Tvoid_R; // 0x0464(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_R& __verse_0xB2CDDD72_Argument)> __verse_0x90867C45__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_R; // 0x0470(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_L_Kchar_M_Q_Lfloat_Tvoid_R_R& __verse_0xB2CDDD72_Argument)> __verse_0xC0AAB7CB__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisBinding_L_N_Kchar_M_N_Q_Lfloat_Tvoid_R_R; // 0x047C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0xFA4BD56F__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMapping_L_N_Kchar_R; // 0x0488(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_L_Kchar_Minput__event_R& __verse_0xB2CDDD72_Argument)> __verse_0x6DA54EE3__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionBinding_L_N_Kchar_M_Ninput__event_R; // 0x0494(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0x983150DC__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveAxisBinding_L_N_Kchar_R; // 0x04A0(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct EpicGamesEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x35F32F07__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearActionMappings; // 0x04AC(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct EpicGamesEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x35A10119__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearAxisMappings; // 0x04B8(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct EpicGamesEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0x961F7CD2__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputBindings; // 0x04C4(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(FVerseStringProperty_ __verse_0xB2CDDD72_Argument)> __verse_0x84FE24F8__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RGetAxisValue_L_N_Kchar_R; // 0x04D0(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R& __verse_0xB2CDDD72_Argument)> __verse_0x42760BD5_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R; // 0x04DC(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_Minput__event_Mtuple_L_R_Tvoid_R& __verse_0xB2CDDD72_Argument)> __verse_0x990BA955__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_Ninput__event_M_Ntuple_L_R_Tvoid_R; // 0x04E8(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_L_Kchar_Minput__event_R& __verse_0xB2CDDD72_Argument)> __verse_0xE39C826C__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMappingAndBinding_L_N_Kchar_M_Ninput__event_R; // 0x04F4(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_M_Q_Lfloat_Tvoid_R_R& __verse_0xB2CDDD72_Argument)> __verse_0x2D555026__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_M_N_Q_Lfloat_Tvoid_R_R; // 0x0500(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct EpicGamesEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument)> __verse_0xC3127334__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputMappingsAndBindings; // 0x050C(0x000C)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_518[0xF0];                                     // 0x0518(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionBinding_L_N_Kchar_M_Ninput__event_M_Ntuple_L_R_Tvoid_R(const struct Ftuple_L_Kchar_Minput__event_Mtuple_L_R_Tvoid_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_R(const struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_Ninput__event_M_Ntuple_L_R_Tvoid_R(const struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_Minput__event_Mtuple_L_R_Tvoid_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisBinding_L_N_Kchar_M_N_Q_Lfloat_Tvoid_R_R(const struct Ftuple_L_Kchar_M_Q_Lfloat_Tvoid_R_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_R(const struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_M_N_Q_Lfloat_Tvoid_R_R(const struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_M_Q_Lfloat_Tvoid_R_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearActionMappings(const struct EpicGamesEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearAxisMappings(const struct EpicGamesEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputBindings(const struct EpicGamesEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputMappingsAndBindings(const struct EpicGamesEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RGetAxisValue_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionBinding_L_N_Kchar_M_Ninput__event_R(const struct Ftuple_L_Kchar_Minput__event_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMapping_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMappingAndBinding_L_N_Kchar_M_Ninput__event_R(const struct Ftuple_L_Kchar_Minput__event_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveAxisBinding_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	class Utask* WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R(class Utask* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"verse_ue_input_component">();
	}
	static class Uverse_ue_input_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uverse_ue_input_component>();
	}
};
static_assert(alignof(Uverse_ue_input_component) == 0x000008, "Wrong alignment on Uverse_ue_input_component");
static_assert(sizeof(Uverse_ue_input_component) == 0x000608, "Wrong size on Uverse_ue_input_component");
static_assert(offsetof(Uverse_ue_input_component, __verse_0xA0CE540B__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_R) == 0x000458, "Member 'Uverse_ue_input_component::__verse_0xA0CE540B__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x7C4A751D__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionBinding_L_N_Kchar_M_Ninput__event_M_Ntuple_L_R_Tvoid_R) == 0x000464, "Member 'Uverse_ue_input_component::__verse_0x7C4A751D__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionBinding_L_N_Kchar_M_Ninput__event_M_Ntuple_L_R_Tvoid_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x90867C45__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_R) == 0x000470, "Member 'Uverse_ue_input_component::__verse_0x90867C45__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0xC0AAB7CB__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisBinding_L_N_Kchar_M_N_Q_Lfloat_Tvoid_R_R) == 0x00047C, "Member 'Uverse_ue_input_component::__verse_0xC0AAB7CB__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisBinding_L_N_Kchar_M_N_Q_Lfloat_Tvoid_R_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0xFA4BD56F__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMapping_L_N_Kchar_R) == 0x000488, "Member 'Uverse_ue_input_component::__verse_0xFA4BD56F__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMapping_L_N_Kchar_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x6DA54EE3__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionBinding_L_N_Kchar_M_Ninput__event_R) == 0x000494, "Member 'Uverse_ue_input_component::__verse_0x6DA54EE3__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionBinding_L_N_Kchar_M_Ninput__event_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x983150DC__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveAxisBinding_L_N_Kchar_R) == 0x0004A0, "Member 'Uverse_ue_input_component::__verse_0x983150DC__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveAxisBinding_L_N_Kchar_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x35F32F07__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearActionMappings) == 0x0004AC, "Member 'Uverse_ue_input_component::__verse_0x35F32F07__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearActionMappings' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x35A10119__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearAxisMappings) == 0x0004B8, "Member 'Uverse_ue_input_component::__verse_0x35A10119__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearAxisMappings' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x961F7CD2__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputBindings) == 0x0004C4, "Member 'Uverse_ue_input_component::__verse_0x961F7CD2__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputBindings' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x84FE24F8__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RGetAxisValue_L_N_Kchar_R) == 0x0004D0, "Member 'Uverse_ue_input_component::__verse_0x84FE24F8__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RGetAxisValue_L_N_Kchar_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x42760BD5_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R) == 0x0004DC, "Member 'Uverse_ue_input_component::__verse_0x42760BD5_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x990BA955__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_Ninput__event_M_Ntuple_L_R_Tvoid_R) == 0x0004E8, "Member 'Uverse_ue_input_component::__verse_0x990BA955__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_Ninput__event_M_Ntuple_L_R_Tvoid_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0xE39C826C__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMappingAndBinding_L_N_Kchar_M_Ninput__event_R) == 0x0004F4, "Member 'Uverse_ue_input_component::__verse_0xE39C826C__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMappingAndBinding_L_N_Kchar_M_Ninput__event_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0x2D555026__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_M_N_Q_Lfloat_Tvoid_R_R) == 0x000500, "Member 'Uverse_ue_input_component::__verse_0x2D555026__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_M_N_Q_Lfloat_Tvoid_R_R' has a wrong offset!");
static_assert(offsetof(Uverse_ue_input_component, __verse_0xC3127334__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputMappingsAndBindings) == 0x00050C, "Member 'Uverse_ue_input_component::__verse_0xC3127334__L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputMappingsAndBindings' has a wrong offset!");

// SolarisGeneratedClass EpicGamesEngine.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class EpicGamesEngine_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SolarisGeneratedClass EpicGamesEngine.$SolarisSignatureFunctionOuter", true>();
	}
	static class EpicGamesEngine_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<EpicGamesEngine_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(EpicGamesEngine_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on EpicGamesEngine_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(EpicGamesEngine_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on EpicGamesEngine_0::U_SolarisSignatureFunctionOuter");

// SolarisGeneratedClass EpicGamesEngine.Context_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R
// 0x0028 (0x0158 - 0x0130)
class UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R final : public Utask
{
public:
	class Uverse_ue_input_component*              _Self;                                             // 0x0130(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument;                       // 0x0138(0x0020)(Parm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Context_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R">();
	}
	static class UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R>();
	}
};
static_assert(alignof(UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R) == 0x000008, "Wrong alignment on UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R");
static_assert(sizeof(UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R) == 0x000158, "Wrong size on UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R");
static_assert(offsetof(UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R, _Self) == 0x000130, "Member 'UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R::_Self' has a wrong offset!");
static_assert(offsetof(UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R, __verse_0xB2CDDD72_Argument) == 0x000138, "Member 'UContext_verse_ue_input_component_WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

}

