#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQSC_Athena_Booty

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQSC_Athena_Booty.EQSC_Athena_Booty_C.ProvideSingleLocation
// 0x0070 (0x0070 - 0x0000)
struct EQSC_Athena_Booty_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZLoc;                                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQSC_Athena_Booty_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQSC_Athena_Booty_C_ProvideSingleLocation");
static_assert(sizeof(EQSC_Athena_Booty_C_ProvideSingleLocation) == 0x000070, "Wrong size on EQSC_Athena_Booty_C_ProvideSingleLocation");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, ZLoc) == 0x000028, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::ZLoc' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, CallFunc_BreakVector_X) == 0x000048, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, CallFunc_BreakVector_Y) == 0x00004C, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, CallFunc_BreakVector_Z) == 0x000050, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_Booty_C_ProvideSingleLocation, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'EQSC_Athena_Booty_C_ProvideSingleLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

