#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorWindow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ErrorWindow.ErrorWindow_C.ExecuteUbergraph_ErrorWindow
// 0x0118 (0x0118 - 0x0000)
struct ErrorWindow_C_ExecuteUbergraph_ErrorWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class UErrorLlama_C*>                  K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UErrorLlama_C*                          CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0098(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_2;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_OverrideText;                         // 0x00F0(0x0018)(ConstParm)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow) == 0x000008, "Wrong alignment on ErrorWindow_C_ExecuteUbergraph_ErrorWindow");
static_assert(sizeof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow) == 0x000118, "Wrong size on ErrorWindow_C_ExecuteUbergraph_ErrorWindow");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, EntryPoint) == 0x000000, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, Temp_int_Variable) == 0x000004, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, Temp_int_Variable_1) == 0x000008, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000018, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_Select_Default) == 0x000020, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_PlayAnimation_ReturnValue_2) == 0x000048, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000054, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_MakeArray_Array) == 0x000078, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_Array_Get_Item) == 0x000088, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_CreateDelegate_OutputDelegate_4) == 0x000098, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000A4, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000B0, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000B8, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_IsMobileGame_ReturnValue) == 0x0000C0, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_GetEndTime_ReturnValue) == 0x0000C4, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_GetEndTime_ReturnValue_1) == 0x0000C8, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000D0, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000D8, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_GetEndTime_ReturnValue_2) == 0x0000E0, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_GetEndTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000E8, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_Event_OverrideText) == 0x0000F0, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_Event_OverrideText' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000108, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_ExecuteUbergraph_ErrorWindow, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'ErrorWindow_C_ExecuteUbergraph_ErrorWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ErrorWindow.ErrorWindow_C.Initialize Close Button
// 0x0010 (0x0010 - 0x0000)
struct ErrorWindow_C_Initialize_Close_Button final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInputPriority_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErrorWindow_C_Initialize_Close_Button) == 0x000008, "Wrong alignment on ErrorWindow_C_Initialize_Close_Button");
static_assert(sizeof(ErrorWindow_C_Initialize_Close_Button) == 0x000010, "Wrong size on ErrorWindow_C_Initialize_Close_Button");
static_assert(offsetof(ErrorWindow_C_Initialize_Close_Button, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'ErrorWindow_C_Initialize_Close_Button::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_Initialize_Close_Button, CallFunc_GetInputPriority_ReturnValue) == 0x000008, "Member 'ErrorWindow_C_Initialize_Close_Button::CallFunc_GetInputPriority_ReturnValue' has a wrong offset!");

// Function ErrorWindow.ErrorWindow_C.OnAnalogValueChanged
// 0x01F0 (0x01F0 - 0x0000)
struct ErrorWindow_C_OnAnalogValueChanged final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FAnalogInputEvent                      InAnalogInputEvent;                                // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0138(0x00B8)()
};
static_assert(alignof(ErrorWindow_C_OnAnalogValueChanged) == 0x000008, "Wrong alignment on ErrorWindow_C_OnAnalogValueChanged");
static_assert(sizeof(ErrorWindow_C_OnAnalogValueChanged) == 0x0001F0, "Wrong size on ErrorWindow_C_OnAnalogValueChanged");
static_assert(offsetof(ErrorWindow_C_OnAnalogValueChanged, MyGeometry) == 0x000000, "Member 'ErrorWindow_C_OnAnalogValueChanged::MyGeometry' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_OnAnalogValueChanged, InAnalogInputEvent) == 0x000040, "Member 'ErrorWindow_C_OnAnalogValueChanged::InAnalogInputEvent' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_OnAnalogValueChanged, ReturnValue) == 0x000080, "Member 'ErrorWindow_C_OnAnalogValueChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(ErrorWindow_C_OnAnalogValueChanged, CallFunc_Unhandled_ReturnValue) == 0x000138, "Member 'ErrorWindow_C_OnAnalogValueChanged::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function ErrorWindow.ErrorWindow_C.OnOverrideCloseButtonText
// 0x0018 (0x0018 - 0x0000)
struct ErrorWindow_C_OnOverrideCloseButtonText final
{
public:
	class FText                                   OverrideText;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ErrorWindow_C_OnOverrideCloseButtonText) == 0x000008, "Wrong alignment on ErrorWindow_C_OnOverrideCloseButtonText");
static_assert(sizeof(ErrorWindow_C_OnOverrideCloseButtonText) == 0x000018, "Wrong size on ErrorWindow_C_OnOverrideCloseButtonText");
static_assert(offsetof(ErrorWindow_C_OnOverrideCloseButtonText, OverrideText) == 0x000000, "Member 'ErrorWindow_C_OnOverrideCloseButtonText::OverrideText' has a wrong offset!");

}

