#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventModeRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function EventModeRuntime.FortGameFrameworkComponent_EventMode.OnPlayerPawnPossessed
// 0x0008 (0x0008 - 0x0000)
struct FortGameFrameworkComponent_EventMode_OnPlayerPawnPossessed final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGameFrameworkComponent_EventMode_OnPlayerPawnPossessed) == 0x000008, "Wrong alignment on FortGameFrameworkComponent_EventMode_OnPlayerPawnPossessed");
static_assert(sizeof(FortGameFrameworkComponent_EventMode_OnPlayerPawnPossessed) == 0x000008, "Wrong size on FortGameFrameworkComponent_EventMode_OnPlayerPawnPossessed");
static_assert(offsetof(FortGameFrameworkComponent_EventMode_OnPlayerPawnPossessed, PossessedPawn) == 0x000000, "Member 'FortGameFrameworkComponent_EventMode_OnPlayerPawnPossessed::PossessedPawn' has a wrong offset!");

// Function EventModeRuntime.FortGameFrameworkComponent_EventMode.GetIsEventModeActive
// 0x0001 (0x0001 - 0x0000)
struct FortGameFrameworkComponent_EventMode_GetIsEventModeActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGameFrameworkComponent_EventMode_GetIsEventModeActive) == 0x000001, "Wrong alignment on FortGameFrameworkComponent_EventMode_GetIsEventModeActive");
static_assert(sizeof(FortGameFrameworkComponent_EventMode_GetIsEventModeActive) == 0x000001, "Wrong size on FortGameFrameworkComponent_EventMode_GetIsEventModeActive");
static_assert(offsetof(FortGameFrameworkComponent_EventMode_GetIsEventModeActive, ReturnValue) == 0x000000, "Member 'FortGameFrameworkComponent_EventMode_GetIsEventModeActive::ReturnValue' has a wrong offset!");

// Function EventModeRuntime.FortGameFrameworkComponent_EventMode.GetIsFocusAvailable
// 0x0001 (0x0001 - 0x0000)
struct FortGameFrameworkComponent_EventMode_GetIsFocusAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGameFrameworkComponent_EventMode_GetIsFocusAvailable) == 0x000001, "Wrong alignment on FortGameFrameworkComponent_EventMode_GetIsFocusAvailable");
static_assert(sizeof(FortGameFrameworkComponent_EventMode_GetIsFocusAvailable) == 0x000001, "Wrong size on FortGameFrameworkComponent_EventMode_GetIsFocusAvailable");
static_assert(offsetof(FortGameFrameworkComponent_EventMode_GetIsFocusAvailable, ReturnValue) == 0x000000, "Member 'FortGameFrameworkComponent_EventMode_GetIsFocusAvailable::ReturnValue' has a wrong offset!");

// Function EventModeRuntime.FortGameFrameworkComponent_EventMode.GetIsFocusing
// 0x0001 (0x0001 - 0x0000)
struct FortGameFrameworkComponent_EventMode_GetIsFocusing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGameFrameworkComponent_EventMode_GetIsFocusing) == 0x000001, "Wrong alignment on FortGameFrameworkComponent_EventMode_GetIsFocusing");
static_assert(sizeof(FortGameFrameworkComponent_EventMode_GetIsFocusing) == 0x000001, "Wrong size on FortGameFrameworkComponent_EventMode_GetIsFocusing");
static_assert(offsetof(FortGameFrameworkComponent_EventMode_GetIsFocusing, ReturnValue) == 0x000000, "Member 'FortGameFrameworkComponent_EventMode_GetIsFocusing::ReturnValue' has a wrong offset!");

}

