#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FireHydrant__2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Curie_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FireHydrant__2.FireHydrant__2_C
// 0x00A0 (0x0F10 - 0x0E70)
class AFireHydrant__2_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Touch_Cylinder;                                    // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Water_Loop_Audio;                                  // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Launch_Audio;                                      // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Water_Effect;                                      // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Jump;                                          // 0x0E98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E99[0x7];                                      // 0x0E99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   LaunchForceFeedback;                               // 0x0EA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_PlayerLaunched;                                 // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, struct FCurieInteractHandle> InteractHandleMap;                                 // 0x0EB0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UStaticMesh*                            Mesh_Default;                                      // 0x0F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Mesh_Damaged;                                      // 0x0F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Touch_Cylinder_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Touch_Cylinder_K2Node_ComponentBoundEvent_5_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CustomStateChanged();
	void ExecuteUbergraph_FireHydrant__2(int32 EntryPoint);
	void HandleExplodedState();
	void LaunchActor(class AActor* ActorToLaunch, class UPrimitiveComponent* ComponentTriggeringLaunch);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FireHydrant__2_C">();
	}
	static class AFireHydrant__2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFireHydrant__2_C>();
	}
};
static_assert(alignof(AFireHydrant__2_C) == 0x000008, "Wrong alignment on AFireHydrant__2_C");
static_assert(sizeof(AFireHydrant__2_C) == 0x000F10, "Wrong size on AFireHydrant__2_C");
static_assert(offsetof(AFireHydrant__2_C, UberGraphFrame) == 0x000E70, "Member 'AFireHydrant__2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, Touch_Cylinder) == 0x000E78, "Member 'AFireHydrant__2_C::Touch_Cylinder' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, Water_Loop_Audio) == 0x000E80, "Member 'AFireHydrant__2_C::Water_Loop_Audio' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, Launch_Audio) == 0x000E88, "Member 'AFireHydrant__2_C::Launch_Audio' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, Water_Effect) == 0x000E90, "Member 'AFireHydrant__2_C::Water_Effect' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, Can_Jump) == 0x000E98, "Member 'AFireHydrant__2_C::Can_Jump' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, LaunchForceFeedback) == 0x000EA0, "Member 'AFireHydrant__2_C::LaunchForceFeedback' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, GE_PlayerLaunched) == 0x000EA8, "Member 'AFireHydrant__2_C::GE_PlayerLaunched' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, InteractHandleMap) == 0x000EB0, "Member 'AFireHydrant__2_C::InteractHandleMap' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, Mesh_Default) == 0x000F00, "Member 'AFireHydrant__2_C::Mesh_Default' has a wrong offset!");
static_assert(offsetof(AFireHydrant__2_C, Mesh_Damaged) == 0x000F08, "Member 'AFireHydrant__2_C::Mesh_Damaged' has a wrong offset!");

}

