#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Floor_Player_Launch_Pad_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Floor_Player_Launch_Pad_Parent.Floor_Player_Launch_Pad_Parent_C
// 0x00A8 (0x1130 - 0x1088)
class AFloor_Player_Launch_Pad_Parent_C : public AFortLauncherAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1088(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Athena_LaunchPad_temp;                           // 0x1090(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PlacementSoundLocation;                            // 0x1098(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Athena_Launchpad_Collision;                      // 0x10A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene1;                                            // 0x10A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Placed_Sound;                                 // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x10B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x10C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Reload_Sound;                                 // 0x10C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x10D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             VehicleActivate_3P_Sound;                          // 0x10D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         VehiclePitchMagnitude;                             // 0x10E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VehicleZ_LaunchMagnitude;                          // 0x1108(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__Floor_Player_Launch_Pad_Parent_S_Athena_Launchpad_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	struct FVector CalculateVehiclePitchDirection(class AFortAthenaVehicle* Vehicle, float PitchMagnitude);
	void ExecuteUbergraph_Floor_Player_Launch_Pad_Parent(int32 EntryPoint);
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Activation_Traps_ReloadBegin(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnFinishedBuilding();
	void OnOutOfDurability();
	void OnPlaced();
	void OnReloadEnd();
	void TriggerLaunchEffects(class AFortPawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Floor_Player_Launch_Pad_Parent_C">();
	}
	static class AFloor_Player_Launch_Pad_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFloor_Player_Launch_Pad_Parent_C>();
	}
};
static_assert(alignof(AFloor_Player_Launch_Pad_Parent_C) == 0x000008, "Wrong alignment on AFloor_Player_Launch_Pad_Parent_C");
static_assert(sizeof(AFloor_Player_Launch_Pad_Parent_C) == 0x001130, "Wrong size on AFloor_Player_Launch_Pad_Parent_C");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, UberGraphFrame) == 0x001088, "Member 'AFloor_Player_Launch_Pad_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, P_Athena_LaunchPad_temp) == 0x001090, "Member 'AFloor_Player_Launch_Pad_Parent_C::P_Athena_LaunchPad_temp' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, PlacementSoundLocation) == 0x001098, "Member 'AFloor_Player_Launch_Pad_Parent_C::PlacementSoundLocation' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, S_Athena_Launchpad_Collision) == 0x0010A0, "Member 'AFloor_Player_Launch_Pad_Parent_C::S_Athena_Launchpad_Collision' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, Scene1) == 0x0010A8, "Member 'AFloor_Player_Launch_Pad_Parent_C::Scene1' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, Trap_Placed_Sound) == 0x0010B0, "Member 'AFloor_Player_Launch_Pad_Parent_C::Trap_Placed_Sound' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, Trap_Active_Sound) == 0x0010B8, "Member 'AFloor_Player_Launch_Pad_Parent_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, Trap_Fire_Sound) == 0x0010C0, "Member 'AFloor_Player_Launch_Pad_Parent_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, Trap_Reload_Sound) == 0x0010C8, "Member 'AFloor_Player_Launch_Pad_Parent_C::Trap_Reload_Sound' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, Trap_Explode_Sound) == 0x0010D0, "Member 'AFloor_Player_Launch_Pad_Parent_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, VehicleActivate_3P_Sound) == 0x0010D8, "Member 'AFloor_Player_Launch_Pad_Parent_C::VehicleActivate_3P_Sound' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, VehiclePitchMagnitude) == 0x0010E0, "Member 'AFloor_Player_Launch_Pad_Parent_C::VehiclePitchMagnitude' has a wrong offset!");
static_assert(offsetof(AFloor_Player_Launch_Pad_Parent_C, VehicleZ_LaunchMagnitude) == 0x001108, "Member 'AFloor_Player_Launch_Pad_Parent_C::VehicleZ_LaunchMagnitude' has a wrong offset!");

}

