#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FloppingRabbitLayerAnimBP

#include "Basic.hpp"

#include "FloppingRabbitLayerAnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C
// 0x16B0 (0x1B60 - 0x04B0)
class UFloppingRabbitLayerAnimBP_C final : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FloppingRabbitLayerAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x04B8(0x0006)(HasGetValueTypeHash)
	uint8                                         Pad_4BE[0x2];                                      // 0x04BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04C0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04C8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x04D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x04F0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x05B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x05D0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0690(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x06B0(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0770(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x0830(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0850(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0910(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0930(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0970(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x09B8(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x09F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0A18(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0A58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0AA0(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0AE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0B00(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0B40(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0B88(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0BC8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0BE8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0C28(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0C70(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0CB0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0CD0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0D90(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0DB0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0E70(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0E90(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0F50(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0F70(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0F90(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x0FB0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x0FD0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x0FF0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x1010(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1030(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1050(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1070(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x1090(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x10B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x10D0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1190(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x11B0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x1270(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1290(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x1350(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x1370(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1430(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x1450(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1510(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1530(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x15F0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1610(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x16D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x16F0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x17B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x17D0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1890(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x18B0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1970(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1990(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1A50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1A70(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1AB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1AF8(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1B38(0x0020)()
	bool                                          OneHandGrip;                                       // 0x1B58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ExecuteUbergraph_FloppingRabbitLayerAnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FloppingRabbitLayerAnimBP_C">();
	}
	static class UFloppingRabbitLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloppingRabbitLayerAnimBP_C>();
	}
};
static_assert(alignof(UFloppingRabbitLayerAnimBP_C) == 0x000010, "Wrong alignment on UFloppingRabbitLayerAnimBP_C");
static_assert(sizeof(UFloppingRabbitLayerAnimBP_C) == 0x001B60, "Wrong size on UFloppingRabbitLayerAnimBP_C");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, UberGraphFrame) == 0x0004B0, "Member 'UFloppingRabbitLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, __AnimBlueprintMutables) == 0x0004B8, "Member 'UFloppingRabbitLayerAnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0004C0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimBlueprintExtension_Base) == 0x0004C8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_34) == 0x0004D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_34' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_18) == 0x0004F0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_18' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_33) == 0x0005B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_33' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_17) == 0x0005D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_17' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_32) == 0x000690, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_32' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_16) == 0x0006B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_16' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_15) == 0x000770, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_15' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_31) == 0x000830, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_31' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_14) == 0x000850, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_14' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_30) == 0x000910, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_30' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x000930, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000970, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x0009B8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_29) == 0x0009F8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_29' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000A18, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000A58, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000AA0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_28) == 0x000AE0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_28' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000B00, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000B40, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000B88, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_27) == 0x000BC8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_27' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000BE8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x000C28, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000C70, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_26) == 0x000CB0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_26' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_13) == 0x000CD0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_25) == 0x000D90, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_25' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_12) == 0x000DB0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_24) == 0x000E70, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_24' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_11) == 0x000E90, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_23) == 0x000F50, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_23' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_22) == 0x000F70, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_21) == 0x000F90, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_20) == 0x000FB0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_19) == 0x000FD0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_18) == 0x000FF0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_17) == 0x001010, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_16) == 0x001030, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_15) == 0x001050, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_14) == 0x001070, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_13) == 0x001090, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_12) == 0x0010B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_10) == 0x0010D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_11) == 0x001190, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_9) == 0x0011B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_10) == 0x001270, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_8) == 0x001290, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_9) == 0x001350, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_7) == 0x001370, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_8) == 0x001430, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x001450, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_7) == 0x001510, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x001530, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_6) == 0x0015F0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x001610, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_5) == 0x0016D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x0016F0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_4) == 0x0017B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x0017D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_3) == 0x001890, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x0018B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_2) == 0x001970, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001990, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_1) == 0x001A50, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001A70, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool) == 0x001AB0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer) == 0x001AF8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root) == 0x001B38, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, OneHandGrip) == 0x001B58, "Member 'UFloppingRabbitLayerAnimBP_C::OneHandGrip' has a wrong offset!");

}

