#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint.Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x012F (0x0130 - 0x0001)
struct Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_87;                             // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_88;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_89;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_90;                             // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_91;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_92;                                  // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_93;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_94;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_95;                               // 0x0030(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_96;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_97;                             // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_98;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_99;                                 // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_100;                                // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_101;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_102;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_103;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_104;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_105;                              // 0x0080(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
};
static_assert(alignof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000130, "Wrong size on Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_87) == 0x000008, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_87' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_88) == 0x000010, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_88' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_89) == 0x000014, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_89' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_90) == 0x000018, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_90' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_91) == 0x000020, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_91' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_92) == 0x000024, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_92' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_93) == 0x000028, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_93' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_94) == 0x00002C, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_94' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_95) == 0x000030, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_95' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_96) == 0x00005C, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_96' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_97) == 0x000060, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_97' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_98) == 0x000068, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_98' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_99) == 0x000069, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_99' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_100) == 0x00006A, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_100' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_101) == 0x00006C, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_101' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_102) == 0x000070, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_102' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_103) == 0x000074, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_103' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_104) == 0x000078, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_104' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_105) == 0x000080, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_105' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'Flopping_Rabbit_Gadget_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

