#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flopper_Gadget_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Flopper_Gadget_AnimBP.Flopper_Gadget_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	ERefPoseType                                  __ByteProperty_16;                                 // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_17;                               // 0x0008(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_18;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_19;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_16) == 0x000001, "Member 'Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_16' has a wrong offset!");
static_assert(offsetof(Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_17) == 0x000008, "Member 'Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_17' has a wrong offset!");
static_assert(offsetof(Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_18) == 0x000020, "Member 'Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_18' has a wrong offset!");
static_assert(offsetof(Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_19) == 0x000024, "Member 'Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_19' has a wrong offset!");
static_assert(offsetof(Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'Flopper_Gadget_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

