#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortMaterialStyle_VendMonitor

#include "Basic.hpp"

#include "VendingMachineMaterialStyle_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FortMaterialStyle_VendMonitor.FortMaterialStyle_VendMonitor_C.ApplyMaterialStyleToVendingMachine
// 0x0068 (0x0068 - 0x0000)
struct FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVendingMachineMaterialStyle           DesiredStyleProperties;                            // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_StationProp_VendingMachine_Emote_Base_C* K2Node_DynamicCast_AsBP_Station_Prop_Vending_Machine_Emote_Base; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine) == 0x000008, "Wrong alignment on FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine");
static_assert(sizeof(FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine) == 0x000068, "Wrong size on FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine");
static_assert(offsetof(FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine, Target) == 0x000000, "Member 'FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine::Target' has a wrong offset!");
static_assert(offsetof(FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine, DesiredStyleProperties) == 0x000008, "Member 'FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine::DesiredStyleProperties' has a wrong offset!");
static_assert(offsetof(FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine, K2Node_DynamicCast_AsBP_Station_Prop_Vending_Machine_Emote_Base) == 0x000058, "Member 'FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine::K2Node_DynamicCast_AsBP_Station_Prop_Vending_Machine_Emote_Base' has a wrong offset!");
static_assert(offsetof(FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'FortMaterialStyle_VendMonitor_C_ApplyMaterialStyleToVendingMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FortMaterialStyle_VendMonitor.FortMaterialStyle_VendMonitor_C.ApplyTo
// 0x0018 (0x0018 - 0x0000)
struct FortMaterialStyle_VendMonitor_C_ApplyTo final
{
public:
	struct FFortMaterialStyleApplyParams          Params_0;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FortMaterialStyle_VendMonitor_C_ApplyTo) == 0x000008, "Wrong alignment on FortMaterialStyle_VendMonitor_C_ApplyTo");
static_assert(sizeof(FortMaterialStyle_VendMonitor_C_ApplyTo) == 0x000018, "Wrong size on FortMaterialStyle_VendMonitor_C_ApplyTo");
static_assert(offsetof(FortMaterialStyle_VendMonitor_C_ApplyTo, Params_0) == 0x000000, "Member 'FortMaterialStyle_VendMonitor_C_ApplyTo::Params_0' has a wrong offset!");

}

