#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_SkyDiveAndGlide_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Fortnite_SkyDiveAndGlide_AnimBlueprint_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C
// 0x8910 (0x90F0 - 0x07E0)
class UFortnite_SkyDiveAndGlide_AnimBlueprint_C final : public UFortSkydivingAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x07E8(0x0860)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1048(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1050(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1058(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3;                      // 0x1078(0x0010)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x1088(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_38;                    // 0x10C8(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_37;                    // 0x1190(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_114;                // 0x1258(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_113;                // 0x12C0(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_36;                    // 0x1328(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x13F0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x1430(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_35;                    // 0x1470(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x1538(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x1578(0x0040)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_4;                    // 0x15B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x1600(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0x1620(0x00B8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x16D8(0x0010)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_39;                  // 0x16E8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_112;                // 0x1730(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_111;                // 0x1798(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_34;                    // 0x1800(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_38;                  // 0x18C8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_110;                // 0x1910(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_33;                    // 0x1978(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_109;                // 0x1A40(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_32;                    // 0x1AA8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_108;                // 0x1B70(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_107;                // 0x1BD8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_106;                // 0x1C40(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_105;                // 0x1CA8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_104;                // 0x1D10(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_103;                // 0x1D78(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_102;                // 0x1DE0(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_31;                    // 0x1E48(0x00C8)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x1F10(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x1F58(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0x1F78(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2030(0x0100)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2130(0x0100)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x2230(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x2258(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x2280(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x22A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x22D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x22F8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_10;                      // 0x2320(0x00C0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_101;                // 0x23E0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_100;                // 0x2448(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_30;                    // 0x24B0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_29;                    // 0x2578(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9;                       // 0x2640(0x00C0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_99;                 // 0x2700(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_98;                 // 0x2768(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x27D0(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x2818(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_97;                 // 0x2860(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_96;                 // 0x28C8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_95;                 // 0x2930(0x0068)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x2998(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x29E0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x2A20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x2A60(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x2AA0(0x0020)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2AC0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x2B08(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x2B48(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x2B88(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x2BC8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x2BE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x2C10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x2C38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x2C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x2C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x2CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x2CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x2D00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x2D28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x2D50(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_94;                 // 0x2D78(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_93;                 // 0x2DE0(0x0068)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_8;                       // 0x2E48(0x00C0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_28;                    // 0x2F08(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7;                       // 0x2FD0(0x00C0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_92;                 // 0x3090(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_91;                 // 0x30F8(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_27;                    // 0x3160(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_90;                 // 0x3228(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x3290(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_89;                 // 0x32B0(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_37;                  // 0x3318(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_88;                 // 0x3360(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_36;                  // 0x33C8(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_6;                       // 0x3410(0x00C0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_87;                 // 0x34D0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_86;                 // 0x3538(0x0068)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5;                       // 0x35A0(0x00C0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_85;                 // 0x3660(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_84;                 // 0x36C8(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_26;                    // 0x3730(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_25;                    // 0x37F8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_83;                 // 0x38C0(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x3928(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x3948(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x3958(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_24;                    // 0x3978(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3A40(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_82;                 // 0x3A68(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x3AD0(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_23;                    // 0x3AF0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3BB8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_81;                 // 0x3BE0(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x3C48(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0x3C68(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x3D20(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x3D40(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_80;                 // 0x3D68(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_79;                 // 0x3DD0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_78;                 // 0x3E38(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_77;                 // 0x3EA0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_76;                 // 0x3F08(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_75;                 // 0x3F70(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_74;                 // 0x3FD8(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_35;                  // 0x4040(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_34;                  // 0x4088(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_33;                  // 0x40D0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_73;                 // 0x4118(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_72;                 // 0x4180(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_71;                 // 0x41E8(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_22;                    // 0x4250(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_21;                    // 0x4318(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_32;                  // 0x43E0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_31;                  // 0x4428(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_30;                  // 0x4470(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_70;                 // 0x44B8(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x4520(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_69;                 // 0x4540(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_68;                 // 0x45A8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_67;                 // 0x4610(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_66;                 // 0x4678(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_65;                 // 0x46E0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_64;                 // 0x4748(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_63;                 // 0x47B0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_62;                 // 0x4818(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_29;                  // 0x4880(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_28;                  // 0x48C8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_27;                  // 0x4910(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_61;                 // 0x4958(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_20;                    // 0x49C0(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_60;                 // 0x4A88(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_26;                  // 0x4AF0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_25;                  // 0x4B38(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_19;                    // 0x4B80(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_59;                 // 0x4C48(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_24;                  // 0x4CB0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x4CF8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x4D18(0x00B8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_23;                  // 0x4DD0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x4E18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x4E40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x4E68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x4E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x4EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x4EE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x4F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x4F30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x4F58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x4F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x4FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x4FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x4FF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x5020(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x5048(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x5070(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x5098(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x50C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x50E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x5110(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x5138(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x5160(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x5188(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x51C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x51E8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x5228(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x5248(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x5288(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x52A8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x52E8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x5308(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x5318(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x5338(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x53F0(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_22;                  // 0x5410(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x5458(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x5498(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x54D8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x5518(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x5558(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x5598(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_58;                 // 0x55B8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_57;                 // 0x5620(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_56;                 // 0x5688(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_55;                 // 0x56F0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_54;                 // 0x5758(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_21;                  // 0x57C0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_20;                  // 0x5808(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_19;                  // 0x5850(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x5898(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x58B8(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x58C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x58E8(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x59A0(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_18;                    // 0x59C8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_53;                 // 0x5A90(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x5AF8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x5B18(0x00B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_17;                    // 0x5BD0(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_52;                 // 0x5C98(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_16;                    // 0x5D00(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_51;                 // 0x5DC8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_50;                 // 0x5E30(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x5E98(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_18;                  // 0x5EB8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_49;                 // 0x5F00(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_48;                 // 0x5F68(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_15;                    // 0x5FD0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_14;                    // 0x6098(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_47;                 // 0x6160(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_46;                 // 0x61C8(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x6230(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x6250(0x00B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_13;                    // 0x6308(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x63D0(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_12;                    // 0x63F8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_45;                 // 0x64C0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_44;                 // 0x6528(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x6590(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_43;                 // 0x65B0(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_11;                    // 0x6618(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_42;                 // 0x66E0(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x6748(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x6768(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x6820(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_41;                 // 0x6848(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_40;                 // 0x68B0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_39;                 // 0x6918(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_38;                 // 0x6980(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_37;                 // 0x69E8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_36;                 // 0x6A50(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_35;                 // 0x6AB8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_34;                 // 0x6B20(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_33;                 // 0x6B88(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_32;                 // 0x6BF0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_31;                 // 0x6C58(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_30;                 // 0x6CC0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_29;                 // 0x6D28(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_28;                 // 0x6D90(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_27;                 // 0x6DF8(0x0068)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4;                       // 0x6E60(0x00C0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_17;                  // 0x6F20(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_16;                  // 0x6F68(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_15;                  // 0x6FB0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_14;                  // 0x6FF8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_13;                  // 0x7040(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_12;                  // 0x7088(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10;                    // 0x70D0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_9;                     // 0x7198(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_11;                  // 0x7260(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_10;                  // 0x72A8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_9;                   // 0x72F0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_26;                 // 0x7338(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x73A0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_25;                 // 0x73C0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_24;                 // 0x7428(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_23;                 // 0x7490(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_22;                 // 0x74F8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_21;                 // 0x7560(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_20;                 // 0x75C8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_19;                 // 0x7630(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_18;                 // 0x7698(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_8;                   // 0x7700(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7;                   // 0x7748(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6;                   // 0x7790(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_17;                 // 0x77D8(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_8;                     // 0x7840(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_16;                 // 0x7908(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x7970(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x79B8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x7A00(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_15;                 // 0x7AC8(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x7B30(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x7B78(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x7B98(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x7C50(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x7C70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x7C98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x7CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x7CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x7D10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x7D38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x7D60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x7D88(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x7DB0(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x7DC0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_14;                 // 0x7DE0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_13;                 // 0x7E48(0x0068)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3;                       // 0x7EB0(0x00C0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x7F70(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0x8038(0x00C0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_12;                 // 0x80F8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_11;                 // 0x8160(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x81C8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x8290(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x82F8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x8318(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x8380(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x83C8(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x8430(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x8478(0x00C0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x8538(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x85A0(0x0068)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x8608(0x00C0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x86C8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x8730(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x8798(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x8860(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x8928(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x8990(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x89B0(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x89F0(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x8A58(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x8AC0(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x8B88(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x8BD0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x8C98(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x8CC0(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x8CE0(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x8DA8(0x0068)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x8E10(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x8E38(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x8E58(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x8F10(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x8F30(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x8FE8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x9008(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x9030(0x00B8)()
	bool                                          ParaGlide_TriggerAnim;                             // 0x90E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockAnimRule;                                     // 0x90E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Fortnite_SkyDiveAndGlide_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fortnite_SkyDiveAndGlide_AnimBlueprint_C">();
	}
	static class UFortnite_SkyDiveAndGlide_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortnite_SkyDiveAndGlide_AnimBlueprint_C>();
	}
};
static_assert(alignof(UFortnite_SkyDiveAndGlide_AnimBlueprint_C) == 0x000010, "Wrong alignment on UFortnite_SkyDiveAndGlide_AnimBlueprint_C");
static_assert(sizeof(UFortnite_SkyDiveAndGlide_AnimBlueprint_C) == 0x0090F0, "Wrong size on UFortnite_SkyDiveAndGlide_AnimBlueprint_C");
