#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteAI

#include "Basic.hpp"

#include "NavigationSystem_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FortniteAI_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "GameplayTags_0_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class FortniteAI.FortAthenaAISpawnerDataComponent
// 0x0008 (0x0030 - 0x0028)
class UFortAthenaAISpawnerDataComponent : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent">();
	}
	static class UFortAthenaAISpawnerDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent) == 0x000030, "Wrong size on UFortAthenaAISpawnerDataComponent");

// Class FortniteAI.FortAITask_FuzzyQueue
// 0x0020 (0x0130 - 0x0110)
class UFortAITask_FuzzyQueue final : public UAITask_MoveTo
{
public:
	uint8                                         Pad_110[0x20];                                     // 0x0110(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAITask_FuzzyQueue">();
	}
	static class UFortAITask_FuzzyQueue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAITask_FuzzyQueue>();
	}
};
static_assert(alignof(UFortAITask_FuzzyQueue) == 0x000008, "Wrong alignment on UFortAITask_FuzzyQueue");
static_assert(sizeof(UFortAITask_FuzzyQueue) == 0x000130, "Wrong size on UFortAITask_FuzzyQueue");

// Class FortniteAI.FortNavMesh
// 0x0008 (0x0558 - 0x0550)
class AFortNavMesh : public ARecastNavMesh
{
public:
	class UFortAIHotSpotManager*                  HotSpotManager;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNavMesh">();
	}
	static class AFortNavMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortNavMesh>();
	}
};
static_assert(alignof(AFortNavMesh) == 0x000008, "Wrong alignment on AFortNavMesh");
static_assert(sizeof(AFortNavMesh) == 0x000558, "Wrong size on AFortNavMesh");
static_assert(offsetof(AFortNavMesh, HotSpotManager) == 0x000550, "Member 'AFortNavMesh::HotSpotManager' has a wrong offset!");

// Class FortniteAI.FortAthenaAISpawnerDataComponent_ScriptBase
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaAISpawnerDataComponent_ScriptBase : public UFortAthenaAISpawnerDataComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_ScriptBase">();
	}
	static class UFortAthenaAISpawnerDataComponent_ScriptBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_ScriptBase>();
	}
};
static_assert(alignof(UFortAthenaAISpawnerDataComponent_ScriptBase) == 0x000008, "Wrong alignment on UFortAthenaAISpawnerDataComponent_ScriptBase");
static_assert(sizeof(UFortAthenaAISpawnerDataComponent_ScriptBase) == 0x000030, "Wrong size on UFortAthenaAISpawnerDataComponent_ScriptBase");

// Class FortniteAI.FortAthenaAIBotSkillSet
// 0x0008 (0x0030 - 0x0028)
class UFortAthenaAIBotSkillSet : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotSkillSet">();
	}
	static class UFortAthenaAIBotSkillSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotSkillSet>();
	}
};
static_assert(alignof(UFortAthenaAIBotSkillSet) == 0x000008, "Wrong alignment on UFortAthenaAIBotSkillSet");
static_assert(sizeof(UFortAthenaAIBotSkillSet) == 0x000030, "Wrong size on UFortAthenaAIBotSkillSet");

// Class FortniteAI.FortAthenaAIBotUnstuckSkillSet
// 0x0320 (0x0350 - 0x0030)
class UFortAthenaAIBotUnstuckSkillSet final : public UFortAthenaAIBotSkillSet
{
public:
	struct FScalableFloat                         CanTeleportWhenStuck;                              // 0x0030(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         CanTeleportWhenStuckWithPlayerAround;              // 0x0058(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxDistanceToPlayerToTeleport;                     // 0x0080(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         PlayerToPhoebeAngleVisibilityConeToTeleport;       // 0x00A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSafeZoneIndexToAllowTeleport;                   // 0x00D0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeToCloseBlockingDoor;                           // 0x00F8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeToBreakBlockingDoor;                           // 0x0120(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RiverbedObstacleCollisionNormalThreshold;          // 0x0148(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         CanUseSteeringWhenStuckOnIsolatedIsland;           // 0x0170(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSteeringDirectionAttempts;                      // 0x0198(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SteeringAttemptDuration;                           // 0x01C0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EvaluateIsolatedIslandSteeringTime;                // 0x01E8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeBetweenPartialPathToConsiderPathStuck;         // 0x0210(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ConsecutivePartialPathCountToConsiderPathStuck;    // 0x0238(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DistanceBetweenSampleToConsiderPathStuckInWater;   // 0x0260(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeBetweenSampleToConsiderPathStuckInWater;       // 0x0288(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DistanceBetweenSampleToConsiderPathStuckOnGround;  // 0x02B0(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeBetweenSampleToConsiderPathStuckOnGround;      // 0x02D8(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DistanceBetweenBlockedPathToConsiderPathStuck;     // 0x0300(0x0028)(Transient, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ConsecutiveBlockedPathCountToConsiderPathStuck;    // 0x0328(0x0028)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotUnstuckSkillSet">();
	}
	static class UFortAthenaAIBotUnstuckSkillSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotUnstuckSkillSet>();
	}
};
static_assert(alignof(UFortAthenaAIBotUnstuckSkillSet) == 0x000008, "Wrong alignment on UFortAthenaAIBotUnstuckSkillSet");
static_assert(sizeof(UFortAthenaAIBotUnstuckSkillSet) == 0x000350, "Wrong size on UFortAthenaAIBotUnstuckSkillSet");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, CanTeleportWhenStuck) == 0x000030, "Member 'UFortAthenaAIBotUnstuckSkillSet::CanTeleportWhenStuck' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, CanTeleportWhenStuckWithPlayerAround) == 0x000058, "Member 'UFortAthenaAIBotUnstuckSkillSet::CanTeleportWhenStuckWithPlayerAround' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, MaxDistanceToPlayerToTeleport) == 0x000080, "Member 'UFortAthenaAIBotUnstuckSkillSet::MaxDistanceToPlayerToTeleport' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, PlayerToPhoebeAngleVisibilityConeToTeleport) == 0x0000A8, "Member 'UFortAthenaAIBotUnstuckSkillSet::PlayerToPhoebeAngleVisibilityConeToTeleport' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, MaxSafeZoneIndexToAllowTeleport) == 0x0000D0, "Member 'UFortAthenaAIBotUnstuckSkillSet::MaxSafeZoneIndexToAllowTeleport' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, TimeToCloseBlockingDoor) == 0x0000F8, "Member 'UFortAthenaAIBotUnstuckSkillSet::TimeToCloseBlockingDoor' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, TimeToBreakBlockingDoor) == 0x000120, "Member 'UFortAthenaAIBotUnstuckSkillSet::TimeToBreakBlockingDoor' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, RiverbedObstacleCollisionNormalThreshold) == 0x000148, "Member 'UFortAthenaAIBotUnstuckSkillSet::RiverbedObstacleCollisionNormalThreshold' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, CanUseSteeringWhenStuckOnIsolatedIsland) == 0x000170, "Member 'UFortAthenaAIBotUnstuckSkillSet::CanUseSteeringWhenStuckOnIsolatedIsland' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, MaxSteeringDirectionAttempts) == 0x000198, "Member 'UFortAthenaAIBotUnstuckSkillSet::MaxSteeringDirectionAttempts' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, SteeringAttemptDuration) == 0x0001C0, "Member 'UFortAthenaAIBotUnstuckSkillSet::SteeringAttemptDuration' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, EvaluateIsolatedIslandSteeringTime) == 0x0001E8, "Member 'UFortAthenaAIBotUnstuckSkillSet::EvaluateIsolatedIslandSteeringTime' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, TimeBetweenPartialPathToConsiderPathStuck) == 0x000210, "Member 'UFortAthenaAIBotUnstuckSkillSet::TimeBetweenPartialPathToConsiderPathStuck' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, ConsecutivePartialPathCountToConsiderPathStuck) == 0x000238, "Member 'UFortAthenaAIBotUnstuckSkillSet::ConsecutivePartialPathCountToConsiderPathStuck' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, DistanceBetweenSampleToConsiderPathStuckInWater) == 0x000260, "Member 'UFortAthenaAIBotUnstuckSkillSet::DistanceBetweenSampleToConsiderPathStuckInWater' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, TimeBetweenSampleToConsiderPathStuckInWater) == 0x000288, "Member 'UFortAthenaAIBotUnstuckSkillSet::TimeBetweenSampleToConsiderPathStuckInWater' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, DistanceBetweenSampleToConsiderPathStuckOnGround) == 0x0002B0, "Member 'UFortAthenaAIBotUnstuckSkillSet::DistanceBetweenSampleToConsiderPathStuckOnGround' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, TimeBetweenSampleToConsiderPathStuckOnGround) == 0x0002D8, "Member 'UFortAthenaAIBotUnstuckSkillSet::TimeBetweenSampleToConsiderPathStuckOnGround' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, DistanceBetweenBlockedPathToConsiderPathStuck) == 0x000300, "Member 'UFortAthenaAIBotUnstuckSkillSet::DistanceBetweenBlockedPathToConsiderPathStuck' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotUnstuckSkillSet, ConsecutiveBlockedPathCountToConsiderPathStuck) == 0x000328, "Member 'UFortAthenaAIBotUnstuckSkillSet::ConsecutiveBlockedPathCountToConsiderPathStuck' has a wrong offset!");

// Class FortniteAI.AITask_ExecuteAbility
// 0x0028 (0x0090 - 0x0068)
class UAITask_ExecuteAbility : public UAITask
{
public:
	uint8                                         Pad_68[0x28];                                      // 0x0068(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AITask_ExecuteAbility">();
	}
	static class UAITask_ExecuteAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITask_ExecuteAbility>();
	}
};
static_assert(alignof(UAITask_ExecuteAbility) == 0x000008, "Wrong alignment on UAITask_ExecuteAbility");
static_assert(sizeof(UAITask_ExecuteAbility) == 0x000090, "Wrong size on UAITask_ExecuteAbility");

// Class FortniteAI.FortAthenaAIRuntimeParameters
// 0x0008 (0x0030 - 0x0028)
class UFortAthenaAIRuntimeParameters : public UObject
{
public:
	int32                                         ExtractedLevel;                                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIRuntimeParameters">();
	}
	static class UFortAthenaAIRuntimeParameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIRuntimeParameters>();
	}
};
static_assert(alignof(UFortAthenaAIRuntimeParameters) == 0x000008, "Wrong alignment on UFortAthenaAIRuntimeParameters");
static_assert(sizeof(UFortAthenaAIRuntimeParameters) == 0x000030, "Wrong size on UFortAthenaAIRuntimeParameters");
static_assert(offsetof(UFortAthenaAIRuntimeParameters, ExtractedLevel) == 0x000028, "Member 'UFortAthenaAIRuntimeParameters::ExtractedLevel' has a wrong offset!");

// Class FortniteAI.FortAthenaAIRuntimeParameters_Analytic
// 0x0020 (0x0050 - 0x0030)
class UFortAthenaAIRuntimeParameters_Analytic : public UFortAthenaAIRuntimeParameters
{
public:
	struct FGameplayTagContainer                  OnDeathGameplayTags;                               // 0x0030(0x0020)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIRuntimeParameters_Analytic">();
	}
	static class UFortAthenaAIRuntimeParameters_Analytic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIRuntimeParameters_Analytic>();
	}
};
static_assert(alignof(UFortAthenaAIRuntimeParameters_Analytic) == 0x000008, "Wrong alignment on UFortAthenaAIRuntimeParameters_Analytic");
static_assert(sizeof(UFortAthenaAIRuntimeParameters_Analytic) == 0x000050, "Wrong size on UFortAthenaAIRuntimeParameters_Analytic");
static_assert(offsetof(UFortAthenaAIRuntimeParameters_Analytic, OnDeathGameplayTags) == 0x000030, "Member 'UFortAthenaAIRuntimeParameters_Analytic::OnDeathGameplayTags' has a wrong offset!");

// Class FortniteAI.FortAIComponent_Telemetry
// 0x0058 (0x00F8 - 0x00A0)
class UFortAIComponent_Telemetry : public UActorComponent
{
public:
	class AFortAIPawn*                            PossessedPawn;                                     // 0x00A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AAthenaAIController*                    CachedAIController;                                // 0x00A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AController*                            DeathInstigator;                                   // 0x00B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortItemDefinition*>            GrabbedPickups;                                    // 0x00B8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UFortItemDefinition*>            DroppedPickups;                                    // 0x00C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UFortAthenaAIRuntimeParameters_AIAnalytic* AnalyticRuntimeParameters;                         // 0x00D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x18];                                      // 0x00E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDidDamage(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnTetheredFollowerChanged(class AFortPawn* NewFollower, class AFortPawn* OldFollower);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIComponent_Telemetry">();
	}
	static class UFortAIComponent_Telemetry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIComponent_Telemetry>();
	}
};
static_assert(alignof(UFortAIComponent_Telemetry) == 0x000008, "Wrong alignment on UFortAIComponent_Telemetry");
static_assert(sizeof(UFortAIComponent_Telemetry) == 0x0000F8, "Wrong size on UFortAIComponent_Telemetry");
static_assert(offsetof(UFortAIComponent_Telemetry, PossessedPawn) == 0x0000A0, "Member 'UFortAIComponent_Telemetry::PossessedPawn' has a wrong offset!");
static_assert(offsetof(UFortAIComponent_Telemetry, CachedAIController) == 0x0000A8, "Member 'UFortAIComponent_Telemetry::CachedAIController' has a wrong offset!");
static_assert(offsetof(UFortAIComponent_Telemetry, DeathInstigator) == 0x0000B0, "Member 'UFortAIComponent_Telemetry::DeathInstigator' has a wrong offset!");
static_assert(offsetof(UFortAIComponent_Telemetry, GrabbedPickups) == 0x0000B8, "Member 'UFortAIComponent_Telemetry::GrabbedPickups' has a wrong offset!");
static_assert(offsetof(UFortAIComponent_Telemetry, DroppedPickups) == 0x0000C8, "Member 'UFortAIComponent_Telemetry::DroppedPickups' has a wrong offset!");
static_assert(offsetof(UFortAIComponent_Telemetry, AnalyticRuntimeParameters) == 0x0000D8, "Member 'UFortAIComponent_Telemetry::AnalyticRuntimeParameters' has a wrong offset!");

// Class FortniteAI.AISenseScalableConfig
// 0x0000 (0x0028 - 0x0028)
class UAISenseScalableConfig : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISenseScalableConfig">();
	}
	static class UAISenseScalableConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISenseScalableConfig>();
	}
};
static_assert(alignof(UAISenseScalableConfig) == 0x000008, "Wrong alignment on UAISenseScalableConfig");
static_assert(sizeof(UAISenseScalableConfig) == 0x000028, "Wrong size on UAISenseScalableConfig");

// Class FortniteAI.AthenaAIPopulationTracker
// 0x0128 (0x0160 - 0x0038)
class alignas(0x10) UAthenaAIPopulationTracker final : public UAISubsystem
{
public:
	TMulticastInlineDelegate<void(class AController* KilledController, bool bIsABot, class AFortPawn* KilledAIPawn, class AFortPlayerPawn* KilledPlayerPawn, class AController* KillerController)> OnAIPawnDied;                                      // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AController* SpawnedController, bool bIsABot, class AFortPawn* FortAIPawn, class AFortPlayerPawn* PlayerPawn)> OnAIPawnSpawned;                                   // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x60];                                      // 0x0058(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AController*>                    AIList;                                            // 0x00B8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class AFortGameModeAthena*                    CachedGameMode;                                    // 0x00C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x90];                                      // 0x00D0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAgentGameOver(class AFortAthenaAIBotController* AIBotController, class AFortPawn* Pawn, class AController* Instigator);
	void OnAISpawned(class APawn* Pawn, const int32 RequestId);
	void OnFortPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);

	TArray<class AController*> GetAIMatchingQuery(const struct FGameplayTagQuery& TagQuery) const;
	struct FAIPopulationCountSnapshot GetAIPopulationTrackerCount() const;
	int32 GetNumAIPawn() const;
	int32 GetNumNonAthenaParticipantBots() const;
	int32 GetNumPlayerBots() const;
	int32 GetNumTotalBots() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAIPopulationTracker">();
	}
	static class UAthenaAIPopulationTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIPopulationTracker>();
	}
};
static_assert(alignof(UAthenaAIPopulationTracker) == 0x000010, "Wrong alignment on UAthenaAIPopulationTracker");
static_assert(sizeof(UAthenaAIPopulationTracker) == 0x000160, "Wrong size on UAthenaAIPopulationTracker");
static_assert(offsetof(UAthenaAIPopulationTracker, OnAIPawnDied) == 0x000038, "Member 'UAthenaAIPopulationTracker::OnAIPawnDied' has a wrong offset!");
static_assert(offsetof(UAthenaAIPopulationTracker, OnAIPawnSpawned) == 0x000048, "Member 'UAthenaAIPopulationTracker::OnAIPawnSpawned' has a wrong offset!");
static_assert(offsetof(UAthenaAIPopulationTracker, AIList) == 0x0000B8, "Member 'UAthenaAIPopulationTracker::AIList' has a wrong offset!");
static_assert(offsetof(UAthenaAIPopulationTracker, CachedGameMode) == 0x0000C8, "Member 'UAthenaAIPopulationTracker::CachedGameMode' has a wrong offset!");

// Class FortniteAI.FortAthenaAIBotController
// 0x0E18 (0x11B0 - 0x0398)
class AFortAthenaAIBotController final : public AAIController
{
public:
	uint8                                         Pad_398[0x40];                                     // 0x0398(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PreviousVehicle;                                   // 0x03D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E0[0x10];                                     // 0x03E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, struct FFortAbilitySetHandle> AppliedInGameModifierAbilitySetHandles;            // 0x03F0(0x0050)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSet<struct FGuid>                            GadgetTrackedAttributeItemInstanceIds;             // 0x0440(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_490[0x50];                                     // 0x0490(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortBotTargetHandler                  TargetHandler;                                     // 0x04E0(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_508[0x1];                                      // 0x0508(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         BitPad_509_0 : 1;                                  // 0x0509(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bIsAnAthenaGameParticipant : 1;                    // 0x0509(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	EReachLocationValidationMode                  ReachLocationValidationMode;                       // 0x050A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50B[0x5];                                      // 0x050B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          BehaviorTree;                                      // 0x0510(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortBotInventoryInfo                  SlotItems[0x6];                                    // 0x0518(0x0018)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A8[0x18];                                     // 0x05A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaAIBotInventoryDigestedSkillSet* CacheInventoryDigestedSkillSet;                    // 0x05C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  PlayerBotPawn;                                     // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaAIServicePlayerBots*             CachedAIServicePlayerBots;                         // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortGameModeAthena*                    CachedGameMode;                                    // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIRuntimeParametersComponent* CachedAIRuntimeParametersComponent;                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIRuntimeParameters_Leash*   CachedLeashRuntimeParameters;                      // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIRuntimeParameters_AffiliationBase* CachedAffiliationRuntimeParameters;                // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaNpcPatrollingComponent*      CachedPatrollingComponent;                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAIControllerPerksComponent*        CachedAIPerksComponent;                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_610[0x8];                                      // 0x0610(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBotDelayedStimulus>            DelayedStimulus;                                   // 0x0618(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_628[0x18];                                     // 0x0628(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortBotThreatActorInfo>        ObjectsThreatList;                                 // 0x0640(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortBotThreatActorInfo>        TrapsThreatList;                                   // 0x0650(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	EAlertLevel                                   CurrentAlertLevel;                                 // 0x0660(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAlertLevelInfo                        DefaultAlertLevelInfo;                             // 0x0668(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AFortAthenaAIBotController* BotController, EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel)> OnAlertLevelChangedEventDelegate;                  // 0x0678(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AFortAthenaAIBotController* BotController, float StealthMeterTarget, float StealthMeterTargetTime)> OnStealthMeterChangedEventDelegate;                // 0x0688(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AFortAthenaAIBotController* BotController, bool bIsDBNO)> OnAgentDBNOStatusChangedEventDelegate;             // 0x06A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AFortAthenaAIBotController* BotController, class AFortPawn* AgentPawn)> OnAgentDiedEventDelegate;                          // 0x06B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AFortAthenaAIBotController* BotController, class AFortPawn* AgentPawn, class AController* InstigatedBy)> OnAgentGameOver;                                   // 0x06C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_6D0[0x48];                                     // 0x06D0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AFortPlayerPawn* KilledPlayerPawn)> OnPlayerPawnKilledByBot;                           // 0x0718(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AFortAIPawn* KilledAIPawn)> OnAIPawnKilledByBot;                               // 0x0728(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class AFortInventory*                         Inventory;                                         // 0x0738(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Skill;                                             // 0x0740(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bAllowUnsupportedItemsInDefaultInventory : 1;      // 0x0744(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UFortAthenaAIBotSkillSet>> BotSkillSetClasses;                                // 0x0748(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_758[0x20];                                     // 0x0758(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaAIBotInventoryItems*         StartupInventory;                                  // 0x0778(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TStructCycleFixup<struct FFortAthenaLoadout, 0x0168, 0x08> CosmeticLoadoutBC;                                 // 0x0780(0x0168)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UCustomCharacterPart*>           CustomCharacterPartOverridesBC;                    // 0x08E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortBotNameSettings*                   NameSettingsBC;                                    // 0x08F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpectateOnDeathMinTime;                            // 0x0900(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpectateOnDeathMaxTime;                            // 0x0928(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EmotesMaxCount;                                    // 0x0950(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortAthenaAIBotPerceptionDigestedSkillSet* CachePerceptionDigestedSkillSet;                   // 0x0978(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIBotHarvestDigestedSkillSet* CacheHarvestDigestedSkillSet;                      // 0x0980(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIBotMovementDigestedSkillSet* CacheMovementSkillSet;                             // 0x0988(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIBotLootingDigestedSkillSet* CacheLootingSkillSet;                              // 0x0990(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIBotAttackingDigestedSkillSet* CacheAttackingSkillSet;                            // 0x0998(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIBotPlayStyleDigestedSkillSet* CachePlayStyleSkillSet;                            // 0x09A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIBotUnstuckDigestedSkillSet* CacheUnstuckSkillSet;                              // 0x09A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaAIBotRangeAttackDigestedSkillSet* CacheRangeAttackSkillSet;                          // 0x09B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9B8[0x60];                                     // 0x09B8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInteractContextInfo*               InteractContextInfo;                               // 0x0A18(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A20[0x50];                                     // 0x0A20(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaAIBotAimingDigestedSkillSet* CacheAimingDigestedSkillSet;                       // 0x0A70(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A78[0x4];                                      // 0x0A78(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCanBeDestroyedOnDeath : 1;                        // 0x0A7C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_A7D[0xB];                                      // 0x0A7D(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastDeathLocation;                                 // 0x0A88(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               LastDeathRotation;                                 // 0x0AA0(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UFortWorldItem*                         CachedWorldItem;                                   // 0x0AB8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC0[0x8];                                      // 0x0AC0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CacheWeaponUsedToCalculateType;                    // 0x0AC8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCachedIsUsingArcedProjectileWeapon;               // 0x0AD0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AD1[0x3];                                      // 0x0AD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CachedProjectileGravityScale;                      // 0x0AD4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortWeapon*                            CachedWeaponUsedToCalculateProjectileData;         // 0x0AD8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStatManager*                           StatManager;                                       // 0x0AE0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FBuildingWeakSpotData>          ActiveWeakSpots;                                   // 0x0AE8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_AF8[0x28];                                     // 0x0AF8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AFortPawn>                  CacheBotPawnClass;                                 // 0x0B20(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B28[0x8];                                      // 0x0B28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CurrentLootActor;                                  // 0x0B30(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaMarkerComponent*                 MarkerComponent;                                   // 0x0B38(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BotPlayerName;                                     // 0x0B40(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BotIDSuffix;                                       // 0x0B50(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BotPlayerNameWithSkillRating;                      // 0x0B60(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B70[0x10];                                     // 0x0B70(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaMutator_SpawningPolicyData*  PolicyDataSpawner;                                 // 0x0B80(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B88[0xD8];                                     // 0x0B88(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortControllerComponent_Telemetry*     FortControllerComponent_Telemetry;                 // 0x0C60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceUsingBuildingTool;                           // 0x0C68(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceHolsterWeapon;                               // 0x0C69(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C6A[0x6];                                      // 0x0C6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItem*                         PendingEquipWeapon;                                // 0x0C70(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C78[0x48];                                     // 0x0C78(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  PlayerToSpectateOnDeath;                           // 0x0CC0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AFortAthenaAIBotController* BotController, class AFortPlayerPawnAthena* BotPawn)> OnPlayerPawnAISpawnedDelegate;                     // 0x0CC8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_CD8[0xF0];                                     // 0x0CD8(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	class UAISenseConfig_Sight*                   AISenseConfig_SightOverride;                       // 0x0DC8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DD0[0x10];                                     // 0x0DD0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 BotOwner;                                          // 0x0DE0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BotControllerUID;                                  // 0x0DE8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DEC[0x4];                                      // 0x0DEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  ReviveTarget;                                      // 0x0DF0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DF8[0x90];                                     // 0x0DF8(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaAIBotCustomizationData*      BotData;                                           // 0x0E88(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDebugMinimapData                      DebugMinimapData;                                  // 0x0E90(0x01B0)(Transient, Protected, NativeAccessSpecifierProtected)
	class AFortPlayerPawnAthena*                  RevivePlayerPawnToken;                             // 0x1040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1048[0x18];                                    // 0x1048(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LeashActorToFollow;                                // 0x1060(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LeashActorToFollowLocalOffset;                     // 0x1068(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaAILeashVolume*               LeashVolume;                                       // 0x1080(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortGameStateComponent_AffiliationManager* CachedAffiliationManager;                          // 0x1088(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActorComponent_Affiliation*        CachedAffiliationComponent;                        // 0x1090(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAffectedByMutatorHealthAndShieldModifiers;      // 0x1098(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1099[0x7];                                     // 0x1099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasChangedPawnCullDistanceToAggroMode;            // 0x10A0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10A1[0x7];                                     // 0x10A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaAIRuntimeParameters_AIBotRespawn* RespawnRuntimeParameters;                          // 0x10A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingWall*                          CurrentBlockingDoor;                               // 0x10B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10B8[0x10];                                    // 0x10B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  FinisherPawn;                                      // 0x10C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10D0[0x54];                                    // 0x10D0(0x0054)(Fixing Size After Last Property [ Dumper-7 ])
	EFortPawnStasisMode                           PreviousStasisMode;                                // 0x1124(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPostponeGiveWeaponCheat;                          // 0x1125(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPostponeGiveMaterialsCheat;                       // 0x1126(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1127[0x1];                                     // 0x1127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartSpectatingTime;                               // 0x1128(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_112C[0x3C];                                    // 0x112C(0x003C)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaDanceItemDefinition*             RequestedEmoteAsset;                               // 0x1168(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1170[0x8];                                     // 0x1170(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          BTAssetToRunOnPawnAISpawned;                       // 0x1178(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1180[0x30];                                    // 0x1180(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTargetInfo(class AActor* Target, const bool bForceTarget, const EPerceptionState PerceptionState, const float ForgetTime, const float ForgetDistance);
	void AddTargetInfos(const TArray<class AActor*>& Targets, const EPerceptionState PerceptionState, const float ForgetTime, const float ForgetDistance);
	void BlueprintOnBehaviorTreeStarted();
	void ChangeActiveVariantForCosmeticItem(class FName ItemTemplateToChange, const struct FGameplayTag& VariantChannelToChange, const struct FGameplayTag& DesiredActiveVariant);
	class AFortWeapon* EquipBestWeapon();
	class AFortWeapon* EquipMeleeWeapon();
	class AFortWeapon* EquipWeapon(const class UFortWorldItem* Weapon);
	class AFortWeapon* EquipWeaponByTag(const struct FGameplayTag& WeaponTag);
	void NotifyPickupsSpawnedOnDeath(const TArray<class AFortPickup*>& SpawnedPickups);
	void OnAgentDBNO(class AFortPawn* InPlayer, bool bInIsDBNO);
	void OnAlertLevelChanged(const EAlertLevel OldAlertLevel, const EAlertLevel NewAlertLevel);
	void OnBeginSpectating(class AFortPlayerStateZone* Spectator);
	void OnCurrentHarvestableDestroyed(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnEndSpectating(class AFortPlayerStateZone* Spectator);
	void OnGamePhaseChanged(EAthenaGamePhase GamePhase);
	void OnGamePhaseStepChanged(const TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, const EAthenaGamePhaseStep GamePhaseStep);
	void OnKnockbacked(const struct FGameplayTag& KnockbackTypeTag);
	void OnLaunched(const struct FVector& LaunchVelocity, const bool bXYOverride, const bool bZOverride);
	void OnMovementModeChange(class ACharacter* InCharacter, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnPawnDidDamage(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnPawnWeaponChanged(class AFortWeapon* NewWeapon, class AFortWeapon* OldWeapon);
	void OnPerceptionSensed(class AActor* SourceActor, const struct FAIStimulus& Stim);
	void OnPossesedPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnPossessedPawnReceiveDamage(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnSafezoneStateChanged(const EFortSafeZoneState NewState);
	void OnSafeZoneUpdated();
	void OnServerMarkerAdded(const struct FFortWorldMarkerData& MarkerData);
	void OnTargetActorDestroyed(class AActor* DestroyedActor);
	void OnTargetBuildingDestroyed(class ABuildingActor* Building, class AAthenaAIController* AIController);
	void OnTargetPawnDead(class AFortPawn* FortPawn);
	void OnTargetPawnDestroyed();
	void OverrideAggressivenessPlayStyle(bool bInIsAggressive);
	void OverrideSkill(const float NewSkill);
	void PlayEmote(const struct FPrimaryAssetId& EmotePrimaryAssetId);
	void QueueStim(class AActor* SourceActor, const struct FVector& SourceLocation, const struct FVector& SourceDirection, const EStimType NewStimType, const float StimStrength, const class FName StimTag);
	void ReleaseBuildTool();
	void RemoveEmoteRequest();
	void RemoveSkillSet(TSubclassOf<class UFortAthenaAIBotSkillSet> SkillSetClass);
	void RequestEmote(const struct FPrimaryAssetId& EmotePrimaryAssetId, float InfiniteEmoteMaxDuration);
	void SetBotOwner(class AActor* InBotOwner);
	void SetLeashActorToFollow(const class AActor* ActorToFollow, const float LeashLocationUpdateRate, const struct FVector& LocalOffset);
	void SetLeashReturnLocationMode(ELeashReturnLocationMode ReturnMode);
	void SetLeashVolume(class AFortAthenaAILeashVolume* InLeashVolume);
	void SetPatrollingEnable(const bool bEnable);
	void SetRadialLeashInnerRadius(const float InnerRadius);
	void SetRadialLeashOuterRadius(const float OuterRadius);
	void SetSkillSet(TSubclassOf<class UFortAthenaAIBotSkillSet> SkillSetClass);
	void StartFire();
	void StartSecondaryFire();
	void StopEmote();
	void StopFire();
	void StopSecondaryFire(const bool bFireWhenStopping);
	void SwitchTeam(uint8 TeamIndex);
	void ThankBusDriver();
	void UpdateLeashActorToFollowLocation();

	class AActor* GetBotOwner() const;
	class AActor* GetCurrentThreat() const;
	class UAthenaMarkerComponent* GetMarkerComponent() const;
	bool IsAnAthenaGameParticipant() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotController">();
	}
	static class AFortAthenaAIBotController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaAIBotController>();
	}
};
static_assert(alignof(AFortAthenaAIBotController) == 0x000010, "Wrong alignment on AFortAthenaAIBotController");
static_assert(sizeof(AFortAthenaAIBotController) == 0x0011B0, "Wrong size on AFortAthenaAIBotController");
static_assert(offsetof(AFortAthenaAIBotController, PreviousVehicle) == 0x0003D8, "Member 'AFortAthenaAIBotController::PreviousVehicle' has a wrong offset!");
static_assert(offsetof(AFortAthenaAIBotController, AppliedInGameModifierAbilitySetHandles) == 0x0003F0, "Member 'AFortAthenaAIBotController::AppliedInGameModifierAbilitySetHandles' has a wrong offset!");
static_assert(offsetof(AFortAthenaAIBotController, GadgetTrackedAttributeItemInstanceIds) == 0x000440, "Member 'AFortAthenaAIBotController::GadgetTrackedAttributeItemInstanceIds' has a wrong offset!");
static_assert(offsetof(AFortAthenaAIBotController, TargetHandler) == 0x0004E0, "Member 'AFortAthenaAIBotController::TargetHandler' has a wrong offset!");
static_assert(offsetof(AFortAthenaAIBotController, ReachLocationValidationMode) == 0x00050A, "Member 'AFortAthenaAIBotController::ReachLocationValidationMode' has a wrong offset!");
static_assert(offsetof(AFortAthenaAIBotController, BehaviorTree) == 0x000510, "Member 'AFortAthenaAIBotController::BehaviorTree' has a wrong offset!");
static_assert(offsetof(AFortAthenaAIBotController, SlotItems) == 0x000518, "Member 'AFortAthenaAIBotController::SlotItems' has a wrong offset!");
