#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortBroadcastCameraSettingsTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C
// 0x00C8 (0x0600 - 0x0538)
class UFortBroadcastCameraSettingsTab_C final : public UFortSpectatorCameraSettingsTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatorSelectorReplaySettings_C*       BattleMapAutomaticCameraPlacement;                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       BattleMapShowAllSquadMembers;                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       BattleMapShowNearbyChests;                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       BattleMapShowTimeIndicator;                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       BlendSettings;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       DamageEffects;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       DroneIgnoreJump;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       FirstPlaceHighlight;                               // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       HighQualityFX;                                     // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             OutsideSafeZoneOpacity;                            // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       RelevancyZone;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       SessionIDwatermark;                                // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       ShareLensSettings;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       StormEffects;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       TPAutoFollow;                                      // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       TPCameraCollision;                                 // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             TPDistanceToSubject;                               // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OffText;                                           // 0x05D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   OnText;                                            // 0x05E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__FortBroadcastCameraSettingsTab_FirstPlaceHighlight_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void CenterOnTab();
	void Construct();
	void ExecuteUbergraph_FortBroadcastCameraSettingsTab(int32 EntryPoint);
	void OnBattleMapAutomaticCameraPlacementChanged(bool bInBattleMapAutomaticCameraPlacement);
	void OnBattleMapShowAllSquadMembersChanged(bool bBattleMapShowAllSquadMembers);
	void OnBattleMapShowNearbyChestsChanged(bool bBattleMapShowNearbyChests);
	void OnBattleMapShowTimeIndicatorChanged(bool bBattleMapShowTimeIndicator);
	void OnCameraTypeChanged(class AFortPlayerControllerSpectating* FortPlayerControllerSpectating, ESpectatorCameraType CameraType);
	void OnDamageFxEnabledChanged(bool bDamageFxEnabled);
	void OnDroneIgnoreJumpChanged(bool bDroneIgnoreJump);
	void OnFirstPlaceHighlightEnabledChanged(bool bFirstPlaceHighlightEnabled);
	void OnHighQualityFxEnabledChanged(bool bHighQualityFxEnabled);
	void OnPlayerOutlinesEnabledChanged(bool bPlayerOutlinesEnabled);
	void OnRelevancyZoneVisibleChanged(bool bRelevancyZoneVisible);
	void OnSafeZoneOpacityChanged(float SafeZoneOpacity);
	void OnSessionIDWatermarkChanged(bool bShowSessionIDWatermark);
	void OnShareLensSettingsChanged(bool bShareLensSettings);
	void OnStormEffectsEnabledChanged(bool bStormEffectsEnabled);
	void OnThirdPersonAutoFollowModeChanged(EThirdPersonAutoFollowMode ThirdPersonAutoFollowMode);
	void OnThirdPersonCameraCollisionChanged(bool bThirdPersonCameraCollision);
	void OnThirdPersonDistanceToSubjectChanged(float ThirdPersonDistanceToSubject);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortBroadcastCameraSettingsTab_C">();
	}
	static class UFortBroadcastCameraSettingsTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBroadcastCameraSettingsTab_C>();
	}
};
static_assert(alignof(UFortBroadcastCameraSettingsTab_C) == 0x000008, "Wrong alignment on UFortBroadcastCameraSettingsTab_C");
static_assert(sizeof(UFortBroadcastCameraSettingsTab_C) == 0x000600, "Wrong size on UFortBroadcastCameraSettingsTab_C");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, UberGraphFrame) == 0x000538, "Member 'UFortBroadcastCameraSettingsTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BattleMapAutomaticCameraPlacement) == 0x000540, "Member 'UFortBroadcastCameraSettingsTab_C::BattleMapAutomaticCameraPlacement' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BattleMapShowAllSquadMembers) == 0x000548, "Member 'UFortBroadcastCameraSettingsTab_C::BattleMapShowAllSquadMembers' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BattleMapShowNearbyChests) == 0x000550, "Member 'UFortBroadcastCameraSettingsTab_C::BattleMapShowNearbyChests' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BattleMapShowTimeIndicator) == 0x000558, "Member 'UFortBroadcastCameraSettingsTab_C::BattleMapShowTimeIndicator' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BlendSettings) == 0x000560, "Member 'UFortBroadcastCameraSettingsTab_C::BlendSettings' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, DamageEffects) == 0x000568, "Member 'UFortBroadcastCameraSettingsTab_C::DamageEffects' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, DroneIgnoreJump) == 0x000570, "Member 'UFortBroadcastCameraSettingsTab_C::DroneIgnoreJump' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, FirstPlaceHighlight) == 0x000578, "Member 'UFortBroadcastCameraSettingsTab_C::FirstPlaceHighlight' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, HighQualityFX) == 0x000580, "Member 'UFortBroadcastCameraSettingsTab_C::HighQualityFX' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, OutsideSafeZoneOpacity) == 0x000588, "Member 'UFortBroadcastCameraSettingsTab_C::OutsideSafeZoneOpacity' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, RelevancyZone) == 0x000590, "Member 'UFortBroadcastCameraSettingsTab_C::RelevancyZone' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, SessionIDwatermark) == 0x000598, "Member 'UFortBroadcastCameraSettingsTab_C::SessionIDwatermark' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, ShareLensSettings) == 0x0005A0, "Member 'UFortBroadcastCameraSettingsTab_C::ShareLensSettings' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, StormEffects) == 0x0005A8, "Member 'UFortBroadcastCameraSettingsTab_C::StormEffects' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, TPAutoFollow) == 0x0005B0, "Member 'UFortBroadcastCameraSettingsTab_C::TPAutoFollow' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, TPCameraCollision) == 0x0005B8, "Member 'UFortBroadcastCameraSettingsTab_C::TPCameraCollision' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, TPDistanceToSubject) == 0x0005C0, "Member 'UFortBroadcastCameraSettingsTab_C::TPDistanceToSubject' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, VerticalBox) == 0x0005C8, "Member 'UFortBroadcastCameraSettingsTab_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, OffText) == 0x0005D0, "Member 'UFortBroadcastCameraSettingsTab_C::OffText' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, OnText) == 0x0005E8, "Member 'UFortBroadcastCameraSettingsTab_C::OnText' has a wrong offset!");

}

