#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortSocialEventRSVPWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortSocialEventRSVPWidget.FortSocialEventRSVPWidget_C.ExecuteUbergraph_FortSocialEventRSVPWidget
// 0x0058 (0x0058 - 0x0000)
struct FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_EventName;                            // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Date;                                 // 0x0020(0x0018)(ConstParm)
	class FText                                   K2Node_Event_AdditionalEvents;                     // 0x0038(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget) == 0x000008, "Wrong alignment on FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget");
static_assert(sizeof(FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget) == 0x000058, "Wrong size on FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget");
static_assert(offsetof(FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget, EntryPoint) == 0x000000, "Member 'FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget, K2Node_Event_EventName) == 0x000008, "Member 'FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget::K2Node_Event_EventName' has a wrong offset!");
static_assert(offsetof(FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget, K2Node_Event_Date) == 0x000020, "Member 'FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget::K2Node_Event_Date' has a wrong offset!");
static_assert(offsetof(FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget, K2Node_Event_AdditionalEvents) == 0x000038, "Member 'FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget::K2Node_Event_AdditionalEvents' has a wrong offset!");
static_assert(offsetof(FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget, CallFunc_TextIsEmpty_ReturnValue) == 0x000050, "Member 'FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000051, "Member 'FortSocialEventRSVPWidget_C_ExecuteUbergraph_FortSocialEventRSVPWidget::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");

// Function FortSocialEventRSVPWidget.FortSocialEventRSVPWidget_C.OnRefreshDisplay
// 0x0048 (0x0048 - 0x0000)
struct FortSocialEventRSVPWidget_C_OnRefreshDisplay final
{
public:
	class FText                                   EventName;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Date;                                              // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   AdditionalEvents;                                  // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(FortSocialEventRSVPWidget_C_OnRefreshDisplay) == 0x000008, "Wrong alignment on FortSocialEventRSVPWidget_C_OnRefreshDisplay");
static_assert(sizeof(FortSocialEventRSVPWidget_C_OnRefreshDisplay) == 0x000048, "Wrong size on FortSocialEventRSVPWidget_C_OnRefreshDisplay");
static_assert(offsetof(FortSocialEventRSVPWidget_C_OnRefreshDisplay, EventName) == 0x000000, "Member 'FortSocialEventRSVPWidget_C_OnRefreshDisplay::EventName' has a wrong offset!");
static_assert(offsetof(FortSocialEventRSVPWidget_C_OnRefreshDisplay, Date) == 0x000018, "Member 'FortSocialEventRSVPWidget_C_OnRefreshDisplay::Date' has a wrong offset!");
static_assert(offsetof(FortSocialEventRSVPWidget_C_OnRefreshDisplay, AdditionalEvents) == 0x000030, "Member 'FortSocialEventRSVPWidget_C_OnRefreshDisplay::AdditionalEvents' has a wrong offset!");

}

