#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Player_DBNOCarried_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Fortnite_Player_DBNOCarried_AnimBP.Fortnite_Player_DBNOCarried_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0237 (0x0238 - 0x0001)
struct Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_551;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_552;                            // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_553;                            // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_554;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_555;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_556;                                  // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_557;                                  // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_558;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_559;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_560;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_561;                            // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_562;                                  // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_563;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_564;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_565;                                 // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_566;                            // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_567;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_568;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_569;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_570;                                 // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_571;                            // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_572;                            // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_573;                               // 0x00A0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_574;                               // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_575;                            // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_576;                            // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_577;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_578;                                // 0x00D1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_579;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_580;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_581;                               // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_582;                            // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_583;                              // 0x00E8(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_584;                               // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_585;                            // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_586;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_587;                                // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_588;                                 // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_589;                               // 0x012C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_590;                                // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_591;                                // 0x0131(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_592;                            // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_593;                                // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_594;                                // 0x0141(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_595;                                // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_596;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_597;                                 // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_598;                               // 0x0150(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_599;                                // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_600;                                  // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_601;                                // 0x0170(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_602;                                // 0x0171(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_603;                                // 0x0172(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_604;                               // 0x0178(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_605;                              // 0x0188(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0220(0x0018)()
};
static_assert(alignof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000238, "Wrong size on Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_551) == 0x000004, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_551' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_552) == 0x000008, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_552' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_553) == 0x000010, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_553' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_554) == 0x000018, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_554' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_555) == 0x000020, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_555' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_556) == 0x000028, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_556' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_557) == 0x000030, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_557' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_558) == 0x000038, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_558' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_559) == 0x000040, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_559' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_560) == 0x000044, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_560' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_561) == 0x000048, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_561' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_562) == 0x000050, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_562' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_563) == 0x000058, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_563' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_564) == 0x00005C, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_564' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_565) == 0x000060, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_565' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_566) == 0x000068, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_566' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_567) == 0x000070, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_567' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_568) == 0x000080, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_568' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_569) == 0x000088, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_569' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_570) == 0x00008C, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_570' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_571) == 0x000090, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_571' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_572) == 0x000098, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_572' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_573) == 0x0000A0, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_573' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_574) == 0x0000B0, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_574' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_575) == 0x0000C0, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_575' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_576) == 0x0000C8, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_576' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_577) == 0x0000D0, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_577' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_578) == 0x0000D1, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_578' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_579) == 0x0000D4, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_579' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_580) == 0x0000D8, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_580' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_581) == 0x0000DC, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_581' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_582) == 0x0000E0, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_582' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_583) == 0x0000E8, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_583' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_584) == 0x000114, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_584' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_585) == 0x000118, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_585' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_586) == 0x000120, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_586' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_587) == 0x000124, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_587' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_588) == 0x000128, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_588' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_589) == 0x00012C, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_589' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_590) == 0x000130, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_590' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_591) == 0x000131, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_591' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_592) == 0x000138, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_592' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_593) == 0x000140, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_593' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_594) == 0x000141, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_594' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_595) == 0x000144, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_595' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_596) == 0x000148, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_596' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_597) == 0x00014C, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_597' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_598) == 0x000150, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_598' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_599) == 0x000160, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_599' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_600) == 0x000168, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_600' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_601) == 0x000170, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_601' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_602) == 0x000171, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_602' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_603) == 0x000172, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_603' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_604) == 0x000178, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_604' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_605) == 0x000188, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_605' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001A0, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000220, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Fortnite_Player_DBNOCarried_AnimBP.Fortnite_Player_DBNOCarried_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x004B (0x004C - 0x0001)
struct Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x001D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0036(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_15;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x003D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x003E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_19;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_21;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00004C, "Wrong size on Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
