#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteAI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "AIModule_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "FortniteVersion_structs.hpp"
#include "SlateCore_structs.hpp"
#include "NetCore_structs.hpp"


namespace SDK
{

// Enum FortniteAI.EAlertLevel
// NumValues: 0x0006
enum class EAlertLevel : uint8
{
	Unaware                                  = 0,
	Alerted                                  = 1,
	LKP                                      = 2,
	Threatened                               = 3,
	Count                                    = 4,
	EAlertLevel_MAX                          = 5,
};

// Enum FortniteAI.ENavigationObstacleOverride
// NumValues: 0x0005
enum class ENavigationObstacleOverride : uint8
{
	UseMeshSettings                          = 0,
	ForceEnabled                             = 1,
	ForceDisabled                            = 2,
	ExportAsPrimitive                        = 3,
	ENavigationObstacleOverride_MAX          = 4,
};

// Enum FortniteAI.EAIHotSpotSlotFilter
// NumValues: 0x0004
enum class EAIHotSpotSlotFilter : uint8
{
	All                                      = 0,
	AvailableOnly                            = 1,
	UnavailableOnly                          = 2,
	EAIHotSpotSlotFilter_MAX                 = 3,
};

// Enum FortniteAI.EAIHotSpotAssignmentFilter
// NumValues: 0x0004
enum class EAIHotSpotAssignmentFilter : uint8
{
	All                                      = 0,
	WithSlots                                = 1,
	WaitingList                              = 2,
	EAIHotSpotAssignmentFilter_MAX           = 3,
};

// Enum FortniteAI.EAIHotSpotSlot
// NumValues: 0x0006
enum class EAIHotSpotSlot : uint8
{
	Free                                     = 0,
	Claimed                                  = 1,
	Occupied                                 = 2,
	Blocked                                  = 3,
	Disabled                                 = 4,
	EAIHotSpotSlot_MAX                       = 5,
};

// Enum FortniteAI.EBoundingBoxSlotDirectionCalculation
// NumValues: 0x0005
enum class EBoundingBoxSlotDirectionCalculation : uint8
{
	Auto                                     = 0,
	FaceWall                                 = 1,
	FaceAwayFromWall                         = 2,
	FaceCenter                               = 3,
	EBoundingBoxSlotDirectionCalculation_MAX = 4,
};

// Enum FortniteAI.EInBoundsState
// NumValues: 0x0004
enum class EInBoundsState : uint8
{
	NoBounds                                 = 0,
	NotInBounds                              = 1,
	InBounds                                 = 2,
	EInBoundsState_MAX                       = 3,
};

// Enum FortniteAI.EAthenaAITelemetryEventType
// NumValues: 0x0003
enum class EAthenaAITelemetryEventType : uint8
{
	Spawn                                    = 0,
	Despawn                                  = 1,
	EAthenaAITelemetryEventType_MAX          = 2,
};

// Enum FortniteAI.EAICustomTargetRequestType
// NumValues: 0x0004
enum class EAICustomTargetRequestType : uint8
{
	Movement                                 = 1,
	MeleeAttack                              = 2,
	RangedAttack                             = 4,
	EAICustomTargetRequestType_MAX           = 5,
};

// Enum FortniteAI.EFortEncounterUtilityDesire
// NumValues: 0x0006
enum class EFortEncounterUtilityDesire : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	VeryHigh                                 = 3,
	Max_None                                 = 4,
	EFortEncounterUtilityDesire_MAX          = 5,
};

// Enum FortniteAI.EDespawnAIType
// NumValues: 0x0003
enum class EDespawnAIType : uint8
{
	Relevancy                                = 0,
	Distance                                 = 1,
	EDespawnAIType_MAX                       = 2,
};

// Enum FortniteAI.EFortAIDirectorEventContribution
// NumValues: 0x0003
enum class EFortAIDirectorEventContribution : uint8
{
	Increment                                = 0,
	Set                                      = 1,
	EFortAIDirectorEventContribution_MAX     = 2,
};

// Enum FortniteAI.EFortAIDirectorFactorContribution
// NumValues: 0x0003
enum class EFortAIDirectorFactorContribution : uint8
{
	Direct                                   = 0,
	Inverse                                  = 1,
	EFortAIDirectorFactorContribution_MAX    = 2,
};

// Enum FortniteAI.EFortEncounterPacingState
// NumValues: 0x0006
enum class EFortEncounterPacingState : uint8
{
	Ramp                                     = 0,
	Peak                                     = 1,
	Fade                                     = 2,
	Rest                                     = 3,
	Max_None                                 = 4,
	EFortEncounterPacingState_MAX            = 5,
};

// Enum FortniteAI.EFortEncounterState
// NumValues: 0x0008
enum class EFortEncounterState : uint8
{
	Uninitialized                            = 0,
	InitializingProperties                   = 1,
	InitializingRiftManager                  = 2,
	AwaitingActivation                       = 3,
	Active                                   = 4,
	ReplacingRifts                           = 5,
	Max_None                                 = 6,
	EFortEncounterState_MAX                  = 7,
};

// Enum FortniteAI.EFortAIWaveProgressSection
// NumValues: 0x0004
enum class EFortAIWaveProgressSection : uint8
{
	SectionOne                               = 0,
	SectionTwo                               = 1,
	Max_None                                 = 2,
	EFortAIWaveProgressSection_MAX           = 3,
};

// Enum FortniteAI.EFortEncounterSequenceResult
// NumValues: 0x0004
enum class EFortEncounterSequenceResult : uint8
{
	Success                                  = 0,
	FailedEncounterInProgress                = 1,
	Failed                                   = 2,
	EFortEncounterSequenceResult_MAX         = 3,
};

// Enum FortniteAI.EAssignmentCreationResult
// NumValues: 0x0004
enum class EAssignmentCreationResult : uint8
{
	AssignmentNotFoundOrCreated              = 0,
	AssignmentCreated                        = 1,
	AssignmentFound                          = 2,
	EAssignmentCreationResult_MAX            = 3,
};

// Enum FortniteAI.ETagGoalScoringCategory
// NumValues: 0x0004
enum class ETagGoalScoringCategory : uint8
{
	Ignore                                   = 0,
	HighInterest                             = 1,
	NumCategories                            = 2,
	ETagGoalScoringCategory_MAX              = 3,
};

// Enum FortniteAI.ECorePerceptionTypes
// NumValues: 0x0007
enum class ECorePerceptionTypes : uint8
{
	Sight                                    = 0,
	Hearing                                  = 1,
	Damage                                   = 2,
	Touch                                    = 3,
	Team                                     = 4,
	Prediction                               = 5,
	MAX                                      = 6,
};

// Enum FortniteAI.EFortAILODLevel
// NumValues: 0x000A
enum class EFortAILODLevel : uint8
{
	Invalid                                  = 0,
	MIN                                      = 0,
	Dormant                                  = 1,
	BelowLower                               = 2,
	Lower                                    = 3,
	AboveLower                               = 4,
	BelowNormal                              = 5,
	Normal                                   = 6,
	AboveNormal                              = 7,
	MAX                                      = 8,
};

// Enum FortniteAI.EAssignmentType
// NumValues: 0x0006
enum class EAssignmentType : uint8
{
	Invalid                                  = 0,
	Encounter                                = 1,
	World                                    = 2,
	Enemy                                    = 3,
	NumAssignmentTypes                       = 4,
	EAssignmentType_MAX                      = 5,
};

// Enum FortniteAI.EBuildingWallArea
// NumValues: 0x0004
enum class EBuildingWallArea : uint8
{
	Regular                                  = 0,
	Flat                                     = 1,
	Special                                  = 2,
	EBuildingWallArea_MAX                    = 3,
};

// Enum FortniteAI.EBuildingStairsRailing
// NumValues: 0x0004
enum class EBuildingStairsRailing : uint8
{
	None                                     = 0,
	Partial                                  = 1,
	Full                                     = 2,
	EBuildingStairsRailing_MAX               = 3,
};

// Enum FortniteAI.EBuildingFloorRailing
// NumValues: 0x0003
enum class EBuildingFloorRailing : uint8
{
	None                                     = 0,
	Balcony                                  = 1,
	EBuildingFloorRailing_MAX                = 2,
};

// Enum FortniteAI.EFortHotSpotSlot
// NumValues: 0x0005
enum class EFortHotSpotSlot : uint8
{
	Melee                                    = 0,
	MeleeHuge                                = 1,
	Ranged                                   = 2,
	None                                     = 3,
	EFortHotSpotSlot_MAX                     = 4,
};

// Enum FortniteAI.EFortHotSpotDirection
// NumValues: 0x0008
enum class EFortHotSpotDirection : uint8
{
	PositiveX                                = 0,
	NegativeX                                = 1,
	PositiveY                                = 2,
	NegativeY                                = 3,
	PositiveZ                                = 4,
	NegativeZ                                = 5,
	Any                                      = 6,
	EFortHotSpotDirection_MAX                = 7,
};

// Enum FortniteAI.EFortHotSpotPreview
// NumValues: 0x0004
enum class EFortHotSpotPreview : uint8
{
	None                                     = 0,
	Smashing                                 = 1,
	Shooting                                 = 2,
	EFortHotSpotPreview_MAX                  = 3,
};

// Enum FortniteAI.EHotspotTypeConfigMode
// NumValues: 0x0004
enum class EHotspotTypeConfigMode : uint8
{
	AlwaysAdd                                = 0,
	WhenNotDefined                           = 1,
	WhenNotValid                             = 2,
	EHotspotTypeConfigMode_MAX               = 3,
};

// Enum FortniteAI.EFortPartialPathUsage
// NumValues: 0x0004
enum class EFortPartialPathUsage : uint8
{
	Always                                   = 0,
	OnlyGoalsOnDestructible                  = 1,
	Never                                    = 2,
	EFortPartialPathUsage_MAX                = 3,
};

// Enum FortniteAI.ETargetDistanceComparisonType
// NumValues: 0x0004
enum class ETargetDistanceComparisonType : uint8
{
	TwoDimensions                            = 0,
	ThreeDimensions                          = 1,
	CollisionHalfHeightMultiplier            = 2,
	ETargetDistanceComparisonType_MAX        = 3,
};

// Enum FortniteAI.EAIScalableFloatScalingType
// NumValues: 0x0003
enum class EAIScalableFloatScalingType : uint32
{
	Disabled                                 = 0,
	ReceivedDamageByTarget                   = 1,
	EAIScalableFloatScalingType_MAX          = 2,
};

// Enum FortniteAI.EAIBotBuildingTemplate
// NumValues: 0x0006
enum class EAIBotBuildingTemplate : uint8
{
	SingleWall                               = 0,
	SingleRamp                               = 1,
	SingleRoof                               = 2,
	SingleBrace                              = 3,
	SingleWallWindow                         = 4,
	MAX                                      = 5,
};

// Enum FortniteAI.EObstacleType
// NumValues: 0x0006
enum class EObstacleType : uint8
{
	IncomingSmashable                        = 0,
	BlockingSmashable                        = 1,
	BlockingDetectedTrap                     = 2,
	Unknown                                  = 3,
	Count                                    = 3,
	EObstacleType_MAX                        = 4,
};

// Enum FortniteAI.EHarvestResult
// NumValues: 0x0005
enum class EHarvestResult : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Success                                  = 2,
	Fail                                     = 3,
	EHarvestResult_MAX                       = 4,
};

// Enum FortniteAI.EReachLocationValidationMode
// NumValues: 0x0005
enum class EReachLocationValidationMode : uint8
{
	None                                     = 0,
	Storm                                    = 1,
	Leash                                    = 2,
	SoftLeash                                = 3,
	EReachLocationValidationMode_MAX         = 4,
};

// Enum FortniteAI.EBotNamingMode
// NumValues: 0x0007
enum class EBotNamingMode : uint8
{
	RealName                                 = 0,
	SkinName                                 = 1,
	Anonymous                                = 2,
	Custom                                   = 3,
	CharacterDataDisplayName                 = 4,
	CustomIncremental                        = 5,
	EBotNamingMode_MAX                       = 6,
};

// Enum FortniteAI.EBotControllerClamberStatus
// NumValues: 0x0005
enum class EBotControllerClamberStatus : uint8
{
	Invalid                                  = 0,
	MoveStarted                              = 1,
	MoveDone                                 = 2,
	MoveFailed                               = 3,
	EBotControllerClamberStatus_MAX          = 4,
};

// Enum FortniteAI.EDefensivePlayerStyleSource
// NumValues: 0x0003
enum class EDefensivePlayerStyleSource : uint8
{
	Unknown                                  = 0,
	Escape                                   = 1,
	MAX                                      = 2,
};

// Enum FortniteAI.BotDataOverrideCosmeticMode
// NumValues: 0x0003
enum class EBotDataOverrideCosmeticMode : uint8
{
	SpecificLoadout                          = 0,
	CosmeticLibrary                          = 1,
	BotDataOverrideCosmeticMode_MAX          = 2,
};

// Enum FortniteAI.EFortAthenaAICanMoveState
// NumValues: 0x0007
enum class EFortAthenaAICanMoveState : uint8
{
	None                                     = 0,
	Failed_AgentOffNavmesh                   = 1,
	Failed_GoalOffNavmesh                    = 2,
	Failed_Falling                           = 3,
	Success                                  = 4,
	Success_Partial                          = 5,
	EFortAthenaAICanMoveState_MAX            = 6,
};

// Enum FortniteAI.EEvasiveManeuverType
// NumValues: 0x0006
enum class EEvasiveManeuverType : uint8
{
	Crouch                                   = 0,
	Dodge                                    = 1,
	Jump                                     = 2,
	JetpackStrafe                            = 3,
	None                                     = 4,
	EEvasiveManeuverType_MAX                 = 5,
};

// Enum FortniteAI.EFreeFallingMode
// NumValues: 0x0005
enum class EFreeFallingMode : uint8
{
	Idle                                     = 0,
	Random                                   = 1,
	TowardNearestAlly                        = 2,
	PatrolPath                               = 3,
	EFreeFallingMode_MAX                     = 4,
};

// Enum FortniteAI.EFocusingBehavior
// NumValues: 0x000A
enum class EFocusingBehavior : uint8
{
	FocusCurrentTarget                       = 0,
	IgnoreThreatAfterTimer                   = 1,
	IgnoreThreatAlways                       = 2,
	LookAtInvestigate                        = 3,
	LookAtAmbush                             = 4,
	LookAtHeardSound                         = 5,
	LookAtScanAround                         = 6,
	LookAtScanAroundOnly                     = 7,
	Invalid                                  = 8,
	EFocusingBehavior_MAX                    = 9,
};

// Enum FortniteAI.EAILootBlackListReason
// NumValues: 0x000D
enum class EAILootBlackListReason : uint8
{
	Invalid                                  = 0,
	ExecutionError                           = 1,
	CannotReachLootLocation                  = 2,
	OutsideSafeZoneRadius                    = 3,
	NoInventorySpace                         = 4,
	LootStateUnavailable                     = 5,
	PathNotFound                             = 6,
	GoalOffNavmesh                           = 7,
	AgentBlocked                             = 8,
	IsolatedIsland                           = 9,
	UnsupportedItem                          = 10,
	Count                                    = 11,
	EAILootBlackListReason_MAX               = 12,
};

// Enum FortniteAI.EBotMovementState
// NumValues: 0x000D
enum class EBotMovementState : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Failed_NoPathFound                       = 2,
	Failed_Aborted                           = 3,
	Failed_AgentOffNavmesh                   = 4,
	Failed_GoalOffNavmesh                    = 5,
	Failed_Blocked                           = 6,
	Failed_OffPath                           = 7,
	Failed_Falling                           = 8,
	Success                                  = 9,
	Success_Partial                          = 10,
	Success_AlreadyAtGoal                    = 11,
	EBotMovementState_MAX                    = 12,
};

// Enum FortniteAI.EBotUnstuckSteeringReason
// NumValues: 0x0004
enum class EBotUnstuckSteeringReason : uint8
{
	Unknown                                  = 0,
	OffNavMesh                               = 1,
	IsolatedIsland                           = 2,
	EBotUnstuckSteeringReason_MAX            = 3,
};

// Enum FortniteAI.EPathTestQueryType
// NumValues: 0x0004
enum class EPathTestQueryType : uint8
{
	NavmeshRaycast2D                         = 0,
	HierarchicalQuery                        = 1,
	RegularPathFinding                       = 2,
	EPathTestQueryType_MAX                   = 3,
};

// Enum FortniteAI.EExecutionStatus
// NumValues: 0x0006
enum class EExecutionStatus : uint8
{
	ExecutionError                           = 0,
	ExecutionDenied                          = 1,
	ExecutionSuccess                         = 2,
	ExecutionPending                         = 3,
	ExecutionAllowed                         = 4,
	EExecutionStatus_MAX                     = 5,
};

// Enum FortniteAI.ELootElementType
// NumValues: 0x0005
enum class ELootElementType : uint8
{
	Pickup                                   = 0,
	Chest                                    = 1,
	SupplyDrop                               = 2,
	Invalid                                  = 255,
	//ELootElementType_MAX                     = 256,
};

// Enum FortniteAI.EFortAthenaAISpawnerDataComponentTriBool
// NumValues: 0x0004
enum class EFortAthenaAISpawnerDataComponentTriBool : uint8
{
	Yes                                      = 0,
	No                                       = 1,
	DoNotModify                              = 2,
	EFortAthenaAISpawnerDataComponentTriBool_MAX = 3,
};

// Enum FortniteAI.EBehaviorTreeBranches
// NumValues: 0x0014
enum class EBehaviorTreeBranches : uint8
{
	CanUseDiving                             = 0,
	CanUseGliding                            = 1,
	CanReactToProjectile                     = 2,
	CanReactToTraps                          = 3,
	CanAvoidDangerArea                       = 4,
	CanBeConverted                           = 5,
	CanPropagateAwareness                    = 6,
	CanUseThreatenedBehaviors                = 7,
	CanUseLastKnownPositionBehavior          = 8,
	CanUseAlertedBehavior                    = 9,
	CanUseSmartObjects                       = 10,
	CanReviveDBNOTeammates                   = 11,
	CanPlayEmote                             = 12,
	CanConverse                              = 13,
	CanPatrolOnPath                          = 14,
	CanPatrolAround                          = 15,
	CanTeleportWhenStuck                     = 16,
	CanEmoteWhenStuck                        = 17,
	Count                                    = 18,
	EBehaviorTreeBranches_MAX                = 19,
};

// Enum FortniteAI.EBehaviorTreeBranchesBitmask
// NumValues: 0x0014
enum class EBehaviorTreeBranchesBitmask : uint8
{
	CanUseDiving                             = 0,
	CanUseGliding                            = 1,
	CanReactToProjectile                     = 2,
	CanReactToTraps                          = 3,
	CanAvoidDangerArea                       = 4,
	CanBeConverted                           = 5,
	CanPropagateAwareness                    = 6,
	CanUseThreatenedBehaviors                = 7,
	CanUseLastKnownPositionBehavior          = 8,
	CanUseAlertedBehavior                    = 9,
	CanUseSmartObjects                       = 10,
	CanReviveDBNOTeammates                   = 11,
	CanPlayEmote                             = 12,
	CanConverse                              = 13,
	CanPatrolOnPath                          = 14,
	CanPatrolAround                          = 15,
	CanTeleportWhenStuck                     = 16,
	CanEmoteWhenStuck                        = 17,
	Count                                    = 18,
	EBehaviorTreeBranchesBitmask_MAX         = 19,
};

// Enum FortniteAI.ETeleportReason
// NumValues: 0x0006
enum class ETeleportReason : uint8
{
	AgentNotOnNavmesh                        = 0,
	AgentDestinationNotOnNavMesh             = 1,
	AgentStuckInRepetitivePartialPaths       = 2,
	AgentBlocked                             = 3,
	Unknown                                  = 4,
	ETeleportReason_MAX                      = 5,
};

// Enum FortniteAI.EActionState
// NumValues: 0x0008
enum class EActionState : uint8
{
	TryingToEquip                            = 0,
	EquippingItem                            = 1,
	UsingItem                                = 2,
	WaitingItemTermination                   = 3,
	WaitBeforeEquippingNextItem              = 4,
	ActionEndedWithNoError                   = 5,
	ActionEndedWithError                     = 6,
	EActionState_MAX                         = 7,
};

// Enum FortniteAI.SwitchSeatType
// NumValues: 0x0005
enum class ESwitchSeatType : uint8
{
	ToDriver                                 = 0,
	ToPassenger                              = 1,
	ToGunner                                 = 2,
	ToSpotter                                = 3,
	SwitchSeatType_MAX                       = 4,
};

// Enum FortniteAI.EEncampmentRole
// NumValues: 0x0004
enum class EEncampmentRole : uint8
{
	Guard                                    = 0,
	Build                                    = 1,
	Count                                    = 2,
	EEncampmentRole_MAX                      = 3,
};

// Enum FortniteAI.EPatrollingMode
// NumValues: 0x0003
enum class EPatrollingMode : uint8
{
	BackAndForth                             = 0,
	Loop                                     = 1,
	EPatrollingMode_MAX                      = 2,
};

// Enum FortniteAI.SeatStatusType
// NumValues: 0x0005
enum class ESeatStatusType : uint8
{
	Driver                                   = 0,
	Passenger                                = 1,
	Gunner                                   = 2,
	Spotter                                  = 3,
	SeatStatusType_MAX                       = 4,
};

// Enum FortniteAI.EFortCreativePatrolPathGroup
// NumValues: 0x001C
enum class EFortCreativePatrolPathGroup : uint8
{
	Group_A                                  = 0,
	Group_B                                  = 1,
	Group_C                                  = 2,
	Group_D                                  = 3,
	Group_E                                  = 4,
	Group_F                                  = 5,
	Group_G                                  = 6,
	Group_H                                  = 7,
	Group_I                                  = 8,
	Group_J                                  = 9,
	Group_K                                  = 10,
	Group_L                                  = 11,
	Group_M                                  = 12,
	Group_N                                  = 13,
	Group_O                                  = 14,
	Group_P                                  = 15,
	Group_Q                                  = 16,
	Group_R                                  = 17,
	Group_S                                  = 18,
	Group_T                                  = 19,
	Group_U                                  = 20,
	Group_V                                  = 21,
	Group_W                                  = 22,
	Group_X                                  = 23,
	Group_Y                                  = 24,
	Group_Z                                  = 25,
	Group_None                               = 26,
	Group_MAX                                = 27,
};

// Enum FortniteAI.ERatingsEnforcementType
// NumValues: 0x0005
enum class ERatingsEnforcementType : uint8
{
	Default                                  = 0,
	IgnoreMaximums                           = 1,
	IgnoreParty                              = 2,
	IgnorePartyMaximum                       = 3,
	ERatingsEnforcementType_MAX              = 4,
};

// Enum FortniteAI.EClampType
// NumValues: 0x0003
enum class EClampType : uint8
{
	Minimum                                  = 0,
	Maximum                                  = 1,
	EClampType_MAX                           = 2,
};

// Enum FortniteAI.EFortIntensityCurveSequenceType
// NumValues: 0x0005
enum class EFortIntensityCurveSequenceType : uint8
{
	Sequence                                 = 0,
	Loop                                     = 1,
	Random                                   = 2,
	Max_None                                 = 3,
	EFortIntensityCurveSequenceType_MAX      = 4,
};

// Enum FortniteAI.EFortAreaFlag
// NumValues: 0x0006
enum class EFortAreaFlag : uint8
{
	Default                                  = 0,
	Obstacle                                 = 1,
	Smashable                                = 2,
	Unwalkable                               = 3,
	Interactable                             = 4,
	EFortAreaFlag_MAX                        = 5,
};

// Enum FortniteAI.EFortNavLinkPattern
// NumValues: 0x0005
enum class EFortNavLinkPattern : uint8
{
	Floor                                    = 0,
	Stairs                                   = 1,
	Roof                                     = 2,
	Manual                                   = 3,
	EFortNavLinkPattern_MAX                  = 4,
};

// Enum FortniteAI.EFortNamedNavmesh
// NumValues: 0x0003
enum class EFortNamedNavmesh : uint8
{
	Husk                                     = 0,
	Smasher                                  = 1,
	MAX                                      = 2,
};

// Enum FortniteAI.EPathObstacleAction
// NumValues: 0x0005
enum class EPathObstacleAction : uint8
{
	Melee                                    = 0,
	Ignore                                   = 1,
	AbortMoveAsFailed                        = 2,
	FinishMoveAsSucceeded                    = 3,
	EPathObstacleAction_MAX                  = 4,
};

// Enum FortniteAI.EPathUndermineEvent
// NumValues: 0x0004
enum class EPathUndermineEvent : uint8
{
	Predicted                                = 0,
	Started                                  = 1,
	Finished                                 = 2,
	EPathUndermineEvent_MAX                  = 3,
};

// Enum FortniteAI.EWardAffectType
// NumValues: 0x0004
enum class EWardAffectType : uint8
{
	AffectsBothStartAndEndPoints             = 0,
	AffectsOnlyStartPoints                   = 1,
	AffectsOnlyEndPoints                     = 2,
	EWardAffectType_MAX                      = 3,
};

// Enum FortniteAI.EDBNOPlayStyle
// NumValues: 0x0006
enum class EDBNOPlayStyle : uint8
{
	Thirsty                                  = 0,
	Default                                  = 1,
	Passive                                  = 2,
	ThristyButPassiveOnPlayers               = 3,
	DefaultButPassiveOnPlayers               = 4,
	EDBNOPlayStyle_MAX                       = 5,
};

// Enum FortniteAI.EStimType
// NumValues: 0x000A
enum class EStimType : uint8
{
	Seeing                                   = 0,
	Seen                                     = 1,
	MightHaveSeen                            = 2,
	Hurt                                     = 3,
	Heard                                    = 4,
	Obstacle                                 = 5,
	Enemy                                    = 6,
	Unknown                                  = 7,
	Count                                    = 7,
	EStimType_MAX                            = 8,
};

// Enum FortniteAI.EPerceptionState
// NumValues: 0x000A
enum class EPerceptionState : uint8
{
	Threat_Seeing                            = 0,
	Threat_LKP                               = 1,
	Threat_Alerted                           = 2,
	ObstacleIncoming                         = 3,
	ObstacleBlockedBy                        = 4,
	ObstacleDetectedTrap                     = 5,
	Unknown                                  = 6,
	Count                                    = 6,
	Threat_Count                             = 3,
	EPerceptionState_MAX                     = 7,
};

// Enum FortniteAI.ETrackingOffsetModifierCurve
// NumValues: 0x0004
enum class ETrackingOffsetModifierCurve : uint8
{
	Default                                  = 0,
	CombatStart                              = 1,
	TargetLowHealth                          = 2,
	MAX                                      = 3,
};

// Enum FortniteAI.EPerceptionSoundType
// NumValues: 0x0008
enum class EPerceptionSoundType : uint8
{
	Default                                  = 0,
	Explosion                                = 1,
	ProjectileFlyBy                          = 2,
	ProjectileImpact                         = 3,
	WeaponFiring                             = 4,
	Building                                 = 5,
	MeleeImpact                              = 6,
	MAX                                      = 7,
};

// Enum FortniteAI.ELookAtType
// NumValues: 0x0005
enum class ELookAtType : uint8
{
	ScanAround                               = 0,
	Investigate                              = 1,
	HeardSound                               = 2,
	Ambush                                   = 3,
	MAX                                      = 4,
};

// Enum FortniteAI.ELeashReturnLocationMode
// NumValues: 0x0003
enum class ELeashReturnLocationMode : uint8
{
	Closest                                  = 0,
	Random                                   = 1,
	ELeashReturnLocationMode_MAX             = 2,
};

// Enum FortniteAI.EOrientedConstructionBuildingType
// NumValues: 0x0010
enum class EOrientedConstructionBuildingType : uint8
{
	WallX                                    = 0,
	WallY                                    = 1,
	Floor                                    = 2,
	StairsUpX                                = 3,
	StairsUpY                                = 4,
	StairsDownX                              = 5,
	StairsDownY                              = 6,
	Roof                                     = 7,
	BraceLeftX                               = 8,
	BraceRightX                              = 9,
	BraceLeftY                               = 10,
	BraceRightY                              = 11,
	WallWindowX                              = 12,
	WallWindowY                              = 13,
	Count                                    = 14,
	EOrientedConstructionBuildingType_MAX    = 15,
};

// Enum FortniteAI.EConstructionBuildingType
// NumValues: 0x0008
enum class EConstructionBuildingType : uint8
{
	Wall                                     = 0,
	Floor                                    = 1,
	Stairs                                   = 2,
	Roof                                     = 3,
	Brace                                    = 4,
	WallWindow                               = 5,
	Count                                    = 6,
	EConstructionBuildingType_MAX            = 7,
};

// Enum FortniteAI.EFortPointsFromNavGraphGoalPathDistanceFilterOperator
// NumValues: 0x0003
enum class EFortPointsFromNavGraphGoalPathDistanceFilterOperator : uint8
{
	AllGoalsInRange                          = 0,
	AnyGoalInRange                           = 1,
	EFortPointsFromNavGraphGoalPathDistanceFilterOperator_MAX = 2,
};

// Enum FortniteAI.EFortTestGoalActorDot
// NumValues: 0x0003
enum class EFortTestGoalActorDot : uint8
{
	Dot3D                                    = 0,
	Dot2D                                    = 1,
	EFortTestGoalActorDot_MAX                = 2,
};

// Enum FortniteAI.EDistanceMode
// NumValues: 0x0004
enum class EDistanceMode : uint8
{
	DistItemToContext                        = 0,
	DistItemGoalActorToContext               = 1,
	DistItemToItemGoalActor                  = 2,
	EDistanceMode_MAX                        = 3,
};

// Enum FortniteAI.ECountAIAssignedToType
// NumValues: 0x0004
enum class ECountAIAssignedToType : uint8
{
	Goal                                     = 0,
	Actor                                    = 1,
	Assignment                               = 2,
	ECountAIAssignedToType_MAX               = 3,
};

// Enum FortniteAI.ETwoPointSolverRotationA
// NumValues: 0x0006
enum class ETwoPointSolverRotationA : uint8
{
	PointAToQuerier                          = 0,
	QuerierToPointA                          = 1,
	PointAToQuerierWithRandomOffset          = 2,
	QuerierToPointAWithRandomOffset          = 3,
	Custom                                   = 4,
	ETwoPointSolverRotationA_MAX             = 5,
};

// Enum FortniteAI.EFortThreatDeactivationType
// NumValues: 0x0003
enum class EFortThreatDeactivationType : uint8
{
	Off                                      = 0,
	Dormant                                  = 1,
	EFortThreatDeactivationType_MAX          = 2,
};

// ScriptStruct FortniteAI.AIHotSpotSlotConfig
// 0x0038 (0x0038 - 0x0000)
struct FAIHotSpotSlotConfig final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0018(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortHotSpotSlot                              SlotType;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAIHotSpotSlotConfig) == 0x000008, "Wrong alignment on FAIHotSpotSlotConfig");
static_assert(sizeof(FAIHotSpotSlotConfig) == 0x000038, "Wrong size on FAIHotSpotSlotConfig");
static_assert(offsetof(FAIHotSpotSlotConfig, Offset) == 0x000000, "Member 'FAIHotSpotSlotConfig::Offset' has a wrong offset!");
static_assert(offsetof(FAIHotSpotSlotConfig, Direction) == 0x000018, "Member 'FAIHotSpotSlotConfig::Direction' has a wrong offset!");
static_assert(offsetof(FAIHotSpotSlotConfig, SlotType) == 0x000030, "Member 'FAIHotSpotSlotConfig::SlotType' has a wrong offset!");

// ScriptStruct FortniteAI.FortAIEncounterRequirements
// 0x0050 (0x0050 - 0x0000)
struct FFortAIEncounterRequirements final
{
public:
	EFortMissionType                              AssociatedMissionType;                             // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0008(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FFortAIEncounterRequirements) == 0x000008, "Wrong alignment on FFortAIEncounterRequirements");
static_assert(sizeof(FFortAIEncounterRequirements) == 0x000050, "Wrong size on FFortAIEncounterRequirements");
static_assert(offsetof(FFortAIEncounterRequirements, AssociatedMissionType) == 0x000000, "Member 'FFortAIEncounterRequirements::AssociatedMissionType' has a wrong offset!");
static_assert(offsetof(FFortAIEncounterRequirements, TagQuery) == 0x000008, "Member 'FFortAIEncounterRequirements::TagQuery' has a wrong offset!");

// ScriptStruct FortniteAI.AimingCircleSettings
// 0x01B8 (0x01B8 - 0x0000)
struct FAimingCircleSettings final
{
public:
	struct FScalableFloat                         UseAimingCircle;                                   // 0x0000(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CircleCenterOffsetZ;                               // 0x0028(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinCircleOpeningAngleVertical;                     // 0x0050(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxCircleOpeningAngleVertical;                     // 0x0078(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinCircleOpeningAngleHorizontal;                   // 0x00A0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxCircleOpeningAngleHorizontal;                   // 0x00C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinCursorRotationSpeed;                            // 0x00F0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxCursorRotationSpeed;                            // 0x0118(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinCursorUpdateInterval;                           // 0x0140(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxCursorUpdateInterval;                           // 0x0168(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ShrinkTimeBetweenHits;                             // 0x0190(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FAimingCircleSettings) == 0x000008, "Wrong alignment on FAimingCircleSettings");
static_assert(sizeof(FAimingCircleSettings) == 0x0001B8, "Wrong size on FAimingCircleSettings");
static_assert(offsetof(FAimingCircleSettings, UseAimingCircle) == 0x000000, "Member 'FAimingCircleSettings::UseAimingCircle' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, CircleCenterOffsetZ) == 0x000028, "Member 'FAimingCircleSettings::CircleCenterOffsetZ' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, MinCircleOpeningAngleVertical) == 0x000050, "Member 'FAimingCircleSettings::MinCircleOpeningAngleVertical' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, MaxCircleOpeningAngleVertical) == 0x000078, "Member 'FAimingCircleSettings::MaxCircleOpeningAngleVertical' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, MinCircleOpeningAngleHorizontal) == 0x0000A0, "Member 'FAimingCircleSettings::MinCircleOpeningAngleHorizontal' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, MaxCircleOpeningAngleHorizontal) == 0x0000C8, "Member 'FAimingCircleSettings::MaxCircleOpeningAngleHorizontal' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, MinCursorRotationSpeed) == 0x0000F0, "Member 'FAimingCircleSettings::MinCursorRotationSpeed' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, MaxCursorRotationSpeed) == 0x000118, "Member 'FAimingCircleSettings::MaxCursorRotationSpeed' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, MinCursorUpdateInterval) == 0x000140, "Member 'FAimingCircleSettings::MinCursorUpdateInterval' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, MaxCursorUpdateInterval) == 0x000168, "Member 'FAimingCircleSettings::MaxCursorUpdateInterval' has a wrong offset!");
static_assert(offsetof(FAimingCircleSettings, ShrinkTimeBetweenHits) == 0x000190, "Member 'FAimingCircleSettings::ShrinkTimeBetweenHits' has a wrong offset!");

// ScriptStruct FortniteAI.WeaponAccuracy
// 0x0508 (0x0508 - 0x0000)
struct FWeaponAccuracy final
{
public:
	struct FScalableFloat                         MaxTrackingOffsetError;                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetingMaxTrackingOffsetError;                   // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxTrackingDistanceFarError;                       // 0x0050(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetingMaxTrackingDistanceFarError;              // 0x0078(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxTrackingDistanceNearError;                      // 0x00A0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetingMaxTrackingDistanceNearError;             // 0x00C8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TrackingDistanceNearErrorProbability;              // 0x00F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetingActivationProbability;                    // 0x0118(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         FiringRestrictedToTargetingActive;                 // 0x0140(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinimumDistanceForAiming;                          // 0x0168(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinimumDistanceForPawnAiming;                      // 0x0190(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         IdealAttackRange;                                  // 0x01B8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetingIdealAttackRange;                         // 0x01E0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxAttackRangeFactor;                              // 0x0208(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ShouldAimAtTargetsFeet;                            // 0x0230(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ShouldUseProjectileArcForAiming;                   // 0x0258(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         KeepAimingOnSameSideWhileFiring;                   // 0x0280(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxTrackingHeightOffsetError;                      // 0x02A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinRotationInterpSpeed;                            // 0x02D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxRotationInterpSpeed;                            // 0x02F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ConsiderProjectileTravelTime;                      // 0x0320(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bOverrideAimingCircleSettings;                     // 0x0348(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAimingCircleSettings                  AimingCircleSettingsOverride;                      // 0x0350(0x01B8)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FWeaponAccuracy) == 0x000008, "Wrong alignment on FWeaponAccuracy");
static_assert(sizeof(FWeaponAccuracy) == 0x000508, "Wrong size on FWeaponAccuracy");
static_assert(offsetof(FWeaponAccuracy, MaxTrackingOffsetError) == 0x000000, "Member 'FWeaponAccuracy::MaxTrackingOffsetError' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, TargetingMaxTrackingOffsetError) == 0x000028, "Member 'FWeaponAccuracy::TargetingMaxTrackingOffsetError' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, MaxTrackingDistanceFarError) == 0x000050, "Member 'FWeaponAccuracy::MaxTrackingDistanceFarError' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, TargetingMaxTrackingDistanceFarError) == 0x000078, "Member 'FWeaponAccuracy::TargetingMaxTrackingDistanceFarError' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, MaxTrackingDistanceNearError) == 0x0000A0, "Member 'FWeaponAccuracy::MaxTrackingDistanceNearError' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, TargetingMaxTrackingDistanceNearError) == 0x0000C8, "Member 'FWeaponAccuracy::TargetingMaxTrackingDistanceNearError' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, TrackingDistanceNearErrorProbability) == 0x0000F0, "Member 'FWeaponAccuracy::TrackingDistanceNearErrorProbability' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, TargetingActivationProbability) == 0x000118, "Member 'FWeaponAccuracy::TargetingActivationProbability' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, FiringRestrictedToTargetingActive) == 0x000140, "Member 'FWeaponAccuracy::FiringRestrictedToTargetingActive' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, MinimumDistanceForAiming) == 0x000168, "Member 'FWeaponAccuracy::MinimumDistanceForAiming' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, MinimumDistanceForPawnAiming) == 0x000190, "Member 'FWeaponAccuracy::MinimumDistanceForPawnAiming' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, IdealAttackRange) == 0x0001B8, "Member 'FWeaponAccuracy::IdealAttackRange' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, TargetingIdealAttackRange) == 0x0001E0, "Member 'FWeaponAccuracy::TargetingIdealAttackRange' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, MaxAttackRangeFactor) == 0x000208, "Member 'FWeaponAccuracy::MaxAttackRangeFactor' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, ShouldAimAtTargetsFeet) == 0x000230, "Member 'FWeaponAccuracy::ShouldAimAtTargetsFeet' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, ShouldUseProjectileArcForAiming) == 0x000258, "Member 'FWeaponAccuracy::ShouldUseProjectileArcForAiming' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, KeepAimingOnSameSideWhileFiring) == 0x000280, "Member 'FWeaponAccuracy::KeepAimingOnSameSideWhileFiring' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, MaxTrackingHeightOffsetError) == 0x0002A8, "Member 'FWeaponAccuracy::MaxTrackingHeightOffsetError' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, MinRotationInterpSpeed) == 0x0002D0, "Member 'FWeaponAccuracy::MinRotationInterpSpeed' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, MaxRotationInterpSpeed) == 0x0002F8, "Member 'FWeaponAccuracy::MaxRotationInterpSpeed' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, ConsiderProjectileTravelTime) == 0x000320, "Member 'FWeaponAccuracy::ConsiderProjectileTravelTime' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, bOverrideAimingCircleSettings) == 0x000348, "Member 'FWeaponAccuracy::bOverrideAimingCircleSettings' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracy, AimingCircleSettingsOverride) == 0x000350, "Member 'FWeaponAccuracy::AimingCircleSettingsOverride' has a wrong offset!");

// ScriptStruct FortniteAI.WeaponAccuracyCategorySpecialization
// 0x0528 (0x0528 - 0x0000)
struct FWeaponAccuracyCategorySpecialization final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FWeaponAccuracy                        WeaponAccuracy;                                    // 0x0020(0x0508)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FWeaponAccuracyCategorySpecialization) == 0x000008, "Wrong alignment on FWeaponAccuracyCategorySpecialization");
static_assert(sizeof(FWeaponAccuracyCategorySpecialization) == 0x000528, "Wrong size on FWeaponAccuracyCategorySpecialization");
static_assert(offsetof(FWeaponAccuracyCategorySpecialization, Tags) == 0x000000, "Member 'FWeaponAccuracyCategorySpecialization::Tags' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracyCategorySpecialization, WeaponAccuracy) == 0x000020, "Member 'FWeaponAccuracyCategorySpecialization::WeaponAccuracy' has a wrong offset!");

// ScriptStruct FortniteAI.WeaponAccuracyCategory
// 0x0538 (0x0538 - 0x0000)
struct FWeaponAccuracyCategory final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FWeaponAccuracy                        WeaponAccuracy;                                    // 0x0020(0x0508)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponAccuracyCategorySpecialization> Specializations;                                   // 0x0528(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FWeaponAccuracyCategory) == 0x000008, "Wrong alignment on FWeaponAccuracyCategory");
static_assert(sizeof(FWeaponAccuracyCategory) == 0x000538, "Wrong size on FWeaponAccuracyCategory");
static_assert(offsetof(FWeaponAccuracyCategory, Tags) == 0x000000, "Member 'FWeaponAccuracyCategory::Tags' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracyCategory, WeaponAccuracy) == 0x000020, "Member 'FWeaponAccuracyCategory::WeaponAccuracy' has a wrong offset!");
static_assert(offsetof(FWeaponAccuracyCategory, Specializations) == 0x000528, "Member 'FWeaponAccuracyCategory::Specializations' has a wrong offset!");

// ScriptStruct FortniteAI.AIHotSpotSlotInfo
// 0x0010 (0x0010 - 0x0000)
struct FAIHotSpotSlotInfo
{
public:
	class AAIHotSpot*                             HotSpot;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAIHotSpotSlotInfo) == 0x000008, "Wrong alignment on FAIHotSpotSlotInfo");
static_assert(sizeof(FAIHotSpotSlotInfo) == 0x000010, "Wrong size on FAIHotSpotSlotInfo");
static_assert(offsetof(FAIHotSpotSlotInfo, HotSpot) == 0x000000, "Member 'FAIHotSpotSlotInfo::HotSpot' has a wrong offset!");
static_assert(offsetof(FAIHotSpotSlotInfo, SlotIndex) == 0x000008, "Member 'FAIHotSpotSlotInfo::SlotIndex' has a wrong offset!");

// ScriptStruct FortniteAI.ClientAILODMovementCompOptimizationConfiguration
// 0x01E0 (0x01E0 - 0x0000)
struct FClientAILODMovementCompOptimizationConfiguration final
{
public:
	struct FScalableFloat                         bEnable;                                           // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bEnableSimulationDataOptimizations;                // 0x0028(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinDistanceToApplyFrameSkippingWhenVisible;        // 0x0050(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         FrameSkippingOnLOD1;                               // 0x0078(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bRequireHittingPawnThresholdForLOD1;               // 0x00A0(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         FrameSkippingOnLOD2;                               // 0x00C8(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bRequireHittingPawnThresholdForLOD2;               // 0x00F0(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         FrameSkippingOnLowestLOD;                          // 0x0118(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         FrameSkippingOnLowestLODWithSmallViewAngleRendered; // 0x0140(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         FrameSkippingOnLowestLODWithSmallViewAngleNotRendered; // 0x0168(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         FrameSkippingInvisible;                            // 0x0190(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bForceInvisibleValueWhenNotRenderedForThreshold;   // 0x01B8(0x0028)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClientAILODMovementCompOptimizationConfiguration) == 0x000008, "Wrong alignment on FClientAILODMovementCompOptimizationConfiguration");
static_assert(sizeof(FClientAILODMovementCompOptimizationConfiguration) == 0x0001E0, "Wrong size on FClientAILODMovementCompOptimizationConfiguration");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, bEnable) == 0x000000, "Member 'FClientAILODMovementCompOptimizationConfiguration::bEnable' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, bEnableSimulationDataOptimizations) == 0x000028, "Member 'FClientAILODMovementCompOptimizationConfiguration::bEnableSimulationDataOptimizations' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, MinDistanceToApplyFrameSkippingWhenVisible) == 0x000050, "Member 'FClientAILODMovementCompOptimizationConfiguration::MinDistanceToApplyFrameSkippingWhenVisible' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, FrameSkippingOnLOD1) == 0x000078, "Member 'FClientAILODMovementCompOptimizationConfiguration::FrameSkippingOnLOD1' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, bRequireHittingPawnThresholdForLOD1) == 0x0000A0, "Member 'FClientAILODMovementCompOptimizationConfiguration::bRequireHittingPawnThresholdForLOD1' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, FrameSkippingOnLOD2) == 0x0000C8, "Member 'FClientAILODMovementCompOptimizationConfiguration::FrameSkippingOnLOD2' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, bRequireHittingPawnThresholdForLOD2) == 0x0000F0, "Member 'FClientAILODMovementCompOptimizationConfiguration::bRequireHittingPawnThresholdForLOD2' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, FrameSkippingOnLowestLOD) == 0x000118, "Member 'FClientAILODMovementCompOptimizationConfiguration::FrameSkippingOnLowestLOD' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, FrameSkippingOnLowestLODWithSmallViewAngleRendered) == 0x000140, "Member 'FClientAILODMovementCompOptimizationConfiguration::FrameSkippingOnLowestLODWithSmallViewAngleRendered' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, FrameSkippingOnLowestLODWithSmallViewAngleNotRendered) == 0x000168, "Member 'FClientAILODMovementCompOptimizationConfiguration::FrameSkippingOnLowestLODWithSmallViewAngleNotRendered' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, FrameSkippingInvisible) == 0x000190, "Member 'FClientAILODMovementCompOptimizationConfiguration::FrameSkippingInvisible' has a wrong offset!");
static_assert(offsetof(FClientAILODMovementCompOptimizationConfiguration, bForceInvisibleValueWhenNotRenderedForThreshold) == 0x0001B8, "Member 'FClientAILODMovementCompOptimizationConfiguration::bForceInvisibleValueWhenNotRenderedForThreshold' has a wrong offset!");

// ScriptStruct FortniteAI.ClientAILODSettings
// 0x02F0 (0x02F0 - 0x0000)
struct FClientAILODSettings final
{
public:
	struct FScalableFloat                         ScoreMultiplier;                                   // 0x0000(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         PreloadingPriorityOverride;                        // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bSupportCharacterMovementOptimization;             // 0x0050(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FClientAILODMovementCompOptimizationConfiguration MovementCompOptimizationConfiguration;             // 0x0078(0x01E0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bAIPawnOnlyTickMeshWhenRendered;                   // 0x0258(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bAIPawnApplyEffectOptimizations;                   // 0x0280(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x48];                                     // 0x02A8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FClientAILODSettings) == 0x000008, "Wrong alignment on FClientAILODSettings");
static_assert(sizeof(FClientAILODSettings) == 0x0002F0, "Wrong size on FClientAILODSettings");
static_assert(offsetof(FClientAILODSettings, ScoreMultiplier) == 0x000000, "Member 'FClientAILODSettings::ScoreMultiplier' has a wrong offset!");
static_assert(offsetof(FClientAILODSettings, PreloadingPriorityOverride) == 0x000028, "Member 'FClientAILODSettings::PreloadingPriorityOverride' has a wrong offset!");
static_assert(offsetof(FClientAILODSettings, bSupportCharacterMovementOptimization) == 0x000050, "Member 'FClientAILODSettings::bSupportCharacterMovementOptimization' has a wrong offset!");
static_assert(offsetof(FClientAILODSettings, MovementCompOptimizationConfiguration) == 0x000078, "Member 'FClientAILODSettings::MovementCompOptimizationConfiguration' has a wrong offset!");
