#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortBroadcastCameraSettingsTab

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__FortBroadcastCameraSettingsTab_FirstPlaceHighlight_K2Node_ComponentBoundEvent_10_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__FortBroadcastCameraSettingsTab_FirstPlaceHighlight_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__FortBroadcastCameraSettingsTab_FirstPlaceHighlight_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__FortBroadcastCameraSettingsTab_FirstPlaceHighlight_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__FortBroadcastCameraSettingsTab_FirstPlaceHighlight_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__FortBroadcastCameraSettingsTab_FirstPlaceHighlight_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__FortBroadcastCameraSettingsTab_FirstPlaceHighlight_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__FortBroadcastCameraSettingsTab_FirstPlaceHighlight_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastCameraSettingsTab_C_BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastCameraSettingsTab_C_BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.ExecuteUbergraph_FortBroadcastCameraSettingsTab
// 0x0380 (0x0380 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_8;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_10;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_14;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_16;                              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_18;                              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_20;                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_21;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_22;                              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_23;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x00C8(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_2;                          // 0x00E0(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_3;                          // 0x00F0(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_4;                          // 0x0100(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_14;                             // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_5;                          // 0x0120(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_6;                          // 0x0130(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_7;                          // 0x0140(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_8;                          // 0x0158(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_9;                          // 0x0168(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_10;                         // 0x0178(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_11;                         // 0x0190(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_12;                         // 0x01A0(0x0010)(ReferenceParm)
	class AFortPlayerControllerSpectating*        K2Node_Event_FortPlayerControllerSpectating;       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorCameraType                          K2Node_Event_CameraType;                           // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_15;      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasBroadcasterToken_ReturnValue;          // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C6[0x2];                                      // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_14;      // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_13;      // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_12;      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value_1;         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EE[0x2];                                      // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_11;      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_10;      // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_13;                         // 0x0200(0x0010)(ReferenceParm)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_9;       // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_8;       // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21E[0x2];                                      // 0x021E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Slider_Value;           // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_7;       // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_6;             // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings_1; // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_24;                              // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_6;       // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_7;             // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_25;                              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_15;                             // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings_2; // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_26;                              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_27;                              // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_16;                             // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue_1;                 // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_14;                         // 0x0278(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_15;                         // 0x0290(0x0010)(ReferenceParm)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x02A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_5;       // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_8;             // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_4;       // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_9;             // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_17;                             // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_3;       // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_10;            // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_2;       // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_11;            // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlayerOutlinesEnabled;               // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStormEffectsEnabled;                 // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
