#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortBroadcastNameplateSettingsTab

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__ArrowColorEnabled_K2Node_ComponentBoundEvent_11_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowColorEnabled_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowColorEnabled_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowColorEnabled_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowColorEnabled_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowColorEnabled_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowColorEnabled_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowColorEnabled_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__ArrowDistance_K2Node_ComponentBoundEvent_7_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowDistance_K2Node_ComponentBoundEvent_7_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowDistance_K2Node_ComponentBoundEvent_7_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowDistance_K2Node_ComponentBoundEvent_7_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowDistance_K2Node_ComponentBoundEvent_7_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowDistance_K2Node_ComponentBoundEvent_7_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowDistance_K2Node_ComponentBoundEvent_7_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowDistance_K2Node_ComponentBoundEvent_7_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__ArrowScaleMax_K2Node_ComponentBoundEvent_13_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMax_K2Node_ComponentBoundEvent_13_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMax_K2Node_ComponentBoundEvent_13_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMax_K2Node_ComponentBoundEvent_13_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMax_K2Node_ComponentBoundEvent_13_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMax_K2Node_ComponentBoundEvent_13_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMax_K2Node_ComponentBoundEvent_13_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMax_K2Node_ComponentBoundEvent_13_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__ArrowScaleMin_K2Node_ComponentBoundEvent_9_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMin_K2Node_ComponentBoundEvent_9_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMin_K2Node_ComponentBoundEvent_9_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMin_K2Node_ComponentBoundEvent_9_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMin_K2Node_ComponentBoundEvent_9_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMin_K2Node_ComponentBoundEvent_9_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMin_K2Node_ComponentBoundEvent_9_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__ArrowScaleMin_K2Node_ComponentBoundEvent_9_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__HighScaleMax_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMax_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMax_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMax_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMax_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMax_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMax_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMax_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__HighScaleMin_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMin_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMin_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMin_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMin_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMin_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMin_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__HighScaleMin_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__LowDetailDistance_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__LowDetailDistance_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__LowDetailDistance_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__LowDetailDistance_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__LowDetailDistance_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__LowDetailDistance_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__LowDetailDistance_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__LowDetailDistance_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__LowScaleMax_K2Node_ComponentBoundEvent_12_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMax_K2Node_ComponentBoundEvent_12_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMax_K2Node_ComponentBoundEvent_12_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMax_K2Node_ComponentBoundEvent_12_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMax_K2Node_ComponentBoundEvent_12_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMax_K2Node_ComponentBoundEvent_12_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMax_K2Node_ComponentBoundEvent_12_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMax_K2Node_ComponentBoundEvent_12_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__LowScaleMin_K2Node_ComponentBoundEvent_8_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMin_K2Node_ComponentBoundEvent_8_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMin_K2Node_ComponentBoundEvent_8_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMin_K2Node_ComponentBoundEvent_8_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMin_K2Node_ComponentBoundEvent_8_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMin_K2Node_ComponentBoundEvent_8_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMin_K2Node_ComponentBoundEvent_8_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__LowScaleMin_K2Node_ComponentBoundEvent_8_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__NamePlates_K2Node_ComponentBoundEvent_1_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__NamePlates_K2Node_ComponentBoundEvent_1_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__NamePlates_K2Node_ComponentBoundEvent_1_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__NamePlates_K2Node_ComponentBoundEvent_1_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__NamePlates_K2Node_ComponentBoundEvent_1_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__NamePlates_K2Node_ComponentBoundEvent_1_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__NamePlates_K2Node_ComponentBoundEvent_1_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__NamePlates_K2Node_ComponentBoundEvent_1_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__NameViewDistance_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__NameViewDistance_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__NameViewDistance_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__NameViewDistance_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__NameViewDistance_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__NameViewDistance_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__NameViewDistance_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__NameViewDistance_K2Node_ComponentBoundEvent_3_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__Rotator_DisplaySessionRanks_K2Node_ComponentBoundEvent_14_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__Rotator_DisplaySessionRanks_K2Node_ComponentBoundEvent_14_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__Rotator_DisplaySessionRanks_K2Node_ComponentBoundEvent_14_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__Rotator_DisplaySessionRanks_K2Node_ComponentBoundEvent_14_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__Rotator_DisplaySessionRanks_K2Node_ComponentBoundEvent_14_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__Rotator_DisplaySessionRanks_K2Node_ComponentBoundEvent_14_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__Rotator_DisplaySessionRanks_K2Node_ComponentBoundEvent_14_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__Rotator_DisplaySessionRanks_K2Node_ComponentBoundEvent_14_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__ScalingAdjustment_K2Node_ComponentBoundEvent_5_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__ScalingAdjustment_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__ScalingAdjustment_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__ScalingAdjustment_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__ScalingAdjustment_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__ScalingAdjustment_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__ScalingAdjustment_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__ScalingAdjustment_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__TeamColor_K2Node_ComponentBoundEvent_10_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__TeamColor_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__TeamColor_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__TeamColor_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__TeamColor_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__TeamColor_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__TeamColor_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__TeamColor_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.BndEvt__TeamInfo_K2Node_ComponentBoundEvent_0_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_BndEvt__TeamInfo_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_BndEvt__TeamInfo_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_BndEvt__TeamInfo_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_BndEvt__TeamInfo_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on FortBroadcastNameplateSettingsTab_C_BndEvt__TeamInfo_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_BndEvt__TeamInfo_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_BndEvt__TeamInfo_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function FortBroadcastNameplateSettingsTab.FortBroadcastNameplateSettingsTab_C.ExecuteUbergraph_FortBroadcastNameplateSettingsTab
// 0x01E0 (0x01E0 - 0x0000)
struct FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MinScale;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MaxScale;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MinScale_1;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MaxScale_1;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MinScale_2;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MaxScale_2;       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MinScale_3;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MaxScale_3;       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MinScale_4;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MaxScale_4;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MinScale_5;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateScale_MaxScale_5;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_5;       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_4;       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_3;       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value_8;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Slider_Value_7;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateDistance_MinDistance;   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateDistance_MaxDistance;   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value_6;         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_2;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Slider_Value_5;         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value_4;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value_3;         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value_2;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_3;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_4;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value_1;         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value;           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_5;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_6;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateDistance_MinDistance_1; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateDistance_MaxDistance_1; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_7;            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateDistance_MinDistance_2; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinMaxNameplateDistance_MaxDistance_2; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_8;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings_1; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_7;                               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_8;                               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUserWidget*>                    K2Node_MakeArray_Array_1;                          // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_9;                               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_1;       // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNameplatesEnabled;                   // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ViewDistance;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LowDetailDistance;                    // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ArrowDistance;                        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bScalingOptionsEnabled;               // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HighDetailScaleMin;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HighDetailScaleMax;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LowDetailScaleMin;                    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LowDetailScaleMax;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ArrowScaleMin;                        // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ArrowScaleMax;                        // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bArrowColorEnabled;                   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowTeamColor;                       // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorSquadIdMode                         K2Node_Event_SquadIdMode;                          // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNameplatesEnabled_ReturnValue;         // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index;         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisplaySessionRanks;                 // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_4;                           // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab) == 0x000008, "Wrong alignment on FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab");
static_assert(sizeof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab) == 0x0001E0, "Wrong size on FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, EntryPoint) == 0x000000, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_bool_Variable) == 0x000004, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_int_Variable) == 0x000008, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_int_Variable_1) == 0x00000C, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_bool_Variable_1) == 0x000010, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_int_Variable_2) == 0x000014, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_int_Variable_3) == 0x000018, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MinScale) == 0x00001C, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MinScale' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MaxScale) == 0x000020, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MaxScale' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_int_Variable_4) == 0x000024, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MinScale_1) == 0x000028, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MinScale_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MaxScale_1) == 0x00002C, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MaxScale_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MinScale_2) == 0x000030, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MinScale_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MaxScale_2) == 0x000034, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MaxScale_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MinScale_3) == 0x000038, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MinScale_3' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MaxScale_3) == 0x00003C, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MaxScale_3' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_int_Variable_5) == 0x000040, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MinScale_4) == 0x000044, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MinScale_4' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MaxScale_4) == 0x000048, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MaxScale_4' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MinScale_5) == 0x00004C, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MinScale_5' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateScale_MaxScale_5) == 0x000050, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateScale_MaxScale_5' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_bool_Variable_2) == 0x000060, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_Event_IsDesignTime) == 0x000061, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_DynamicCast_AsRotator_Selector_Replay_Settings) == 0x000068, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_DynamicCast_AsRotator_Selector_Replay_Settings' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_ComponentBoundEvent_Selected_Index_5) == 0x000074, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_ComponentBoundEvent_Selected_Index_5' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_Conv_IntToByte_ReturnValue) == 0x000078, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, Temp_int_Variable_6) == 0x00007C, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetValidValue_ReturnValue) == 0x000080, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_ComponentBoundEvent_Selected_Index_4) == 0x000084, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_ComponentBoundEvent_Selected_Index_4' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_MakeArray_Array) == 0x000088, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_Greater_IntInt_ReturnValue) == 0x000098, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_ComponentBoundEvent_Selected_Index_3) == 0x00009C, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_ComponentBoundEvent_Selected_Index_3' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_ComponentBoundEvent_Slider_Value_8) == 0x0000A0, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_ComponentBoundEvent_Slider_Value_8' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000A4, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_ComponentBoundEvent_Slider_Value_7) == 0x0000A8, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_ComponentBoundEvent_Slider_Value_7' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateDistance_MinDistance) == 0x0000AC, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateDistance_MinDistance' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, CallFunc_GetMinMaxNameplateDistance_MaxDistance) == 0x0000B0, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::CallFunc_GetMinMaxNameplateDistance_MaxDistance' has a wrong offset!");
static_assert(offsetof(FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab, K2Node_ComponentBoundEvent_Slider_Value_6) == 0x0000B4, "Member 'FortBroadcastNameplateSettingsTab_C_ExecuteUbergraph_FortBroadcastNameplateSettingsTab::K2Node_ComponentBoundEvent_Slider_Value_6' has a wrong offset!");
