#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_M_Avg_Player_ZipLine_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x029F (0x02A0 - 0x0001)
struct Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_555;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_556;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_557;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_558;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_559;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_560;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_561;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_562;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_563;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_564;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_565;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_566;                            // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_567;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_568;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_569;                               // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_570;                            // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_571;                            // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_572;                               // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_573;                               // 0x0078(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_574;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_575;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_576;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_577;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_578;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_579;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_580;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_581;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_582;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_583;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_584;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_585;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_586;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_587;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_588;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_589;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_590;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_591;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_592;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_593;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_594;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_595;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_596;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_597;                                // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_598;                               // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_599;                            // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_600;                            // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_601;                            // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_602;                            // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_603;                            // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_604;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_605;                            // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_606;                                // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_607;                            // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_608;                                // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_609;                            // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_610;                                // 0x0150(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_611;                                // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_612;                                // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_613;                                  // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_614;                                // 0x0168(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_615;                                // 0x0169(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_616;                               // 0x0170(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_617;                                // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_618;                                 // 0x0184(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_619;                              // 0x0188(0x002C)(BlueprintVisible, NoDestructor)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_620;                            // 0x01B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_621;                                // 0x01C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_622;                                // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_623;                                 // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_624;                                  // 0x01D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_625;                               // 0x01D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_626;                               // 0x01DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_627;                                // 0x01E0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_628;                                // 0x01E1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_629;                                // 0x01E2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x1];                                      // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_630;                                // 0x01E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_631;                                // 0x01E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_632;                                 // 0x01EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_633;                              // 0x01F0(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0208(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0288(0x0018)()
};
static_assert(alignof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x0002A0, "Wrong size on Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_555) == 0x000004, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_555' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_556) == 0x000008, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_556' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_557) == 0x00000C, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_557' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_558) == 0x000010, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_558' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_559) == 0x000014, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_559' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_560) == 0x000018, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_560' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_561) == 0x00001C, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_561' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_562) == 0x000020, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_562' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_563) == 0x000024, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_563' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_564) == 0x000028, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_564' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_565) == 0x00002C, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_565' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_566) == 0x000030, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_566' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_567) == 0x000038, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_567' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_568) == 0x000040, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_568' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_569) == 0x000048, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_569' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_570) == 0x000058, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_570' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_571) == 0x000060, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_571' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_572) == 0x000068, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_572' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_573) == 0x000078, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_573' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_574) == 0x000088, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_574' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_575) == 0x00008C, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_575' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_576) == 0x000090, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_576' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_577) == 0x000094, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_577' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_578) == 0x000098, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_578' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_579) == 0x00009C, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_579' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_580) == 0x0000A0, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_580' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_581) == 0x0000A4, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_581' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_582) == 0x0000A8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_582' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_583) == 0x0000AC, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_583' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_584) == 0x0000B0, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_584' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_585) == 0x0000B4, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_585' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_586) == 0x0000B8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_586' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_587) == 0x0000BC, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_587' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_588) == 0x0000C0, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_588' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_589) == 0x0000C4, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_589' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_590) == 0x0000C8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_590' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_591) == 0x0000CC, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_591' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_592) == 0x0000D0, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_592' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_593) == 0x0000D4, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_593' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_594) == 0x0000D8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_594' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_595) == 0x0000DC, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_595' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_596) == 0x0000E0, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_596' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_597) == 0x0000E4, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_597' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_598) == 0x0000E8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_598' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_599) == 0x0000F8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_599' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_600) == 0x000100, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_600' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_601) == 0x000108, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_601' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_602) == 0x000110, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_602' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_603) == 0x000118, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_603' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_604) == 0x000120, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_604' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_605) == 0x000128, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_605' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_606) == 0x000130, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_606' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_607) == 0x000138, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_607' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_608) == 0x000140, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_608' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_609) == 0x000148, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_609' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_610) == 0x000150, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_610' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_611) == 0x000154, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_611' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendProfile_612) == 0x000158, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendProfile_612' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __CurveFloat_613) == 0x000160, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__CurveFloat_613' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_614) == 0x000168, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_614' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_615) == 0x000169, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_615' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_616) == 0x000170, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_616' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_617) == 0x000180, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_617' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_618) == 0x000184, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_618' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_619) == 0x000188, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_619' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_620) == 0x0001B8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_620' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_621) == 0x0001C0, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_621' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_622) == 0x0001C4, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_622' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_623) == 0x0001C8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_623' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendSpace_624) == 0x0001D0, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendSpace_624' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_625) == 0x0001D8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_625' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_626) == 0x0001DC, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_626' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_627) == 0x0001E0, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_627' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_628) == 0x0001E1, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_628' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_629) == 0x0001E2, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_629' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_630) == 0x0001E4, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_630' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_631) == 0x0001E8, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_631' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_632) == 0x0001EC, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_632' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_633) == 0x0001F0, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_633' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000208, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000288, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x008F (0x0090 - 0x0001)
struct Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_0;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_2;                              // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_5;                                 // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_6;                                  // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_7;                              // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         __ByteProperty_8;                                  // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_10;                                // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	uint8                                         __ByteProperty_11;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_12;                                // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	uint8                                         __ByteProperty_13;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_14;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000090, "Wrong size on Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Fortnite_M_Avg_Player_ZipLine_AnimBlueprint::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
