#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Player_FullBody_LinkedGraph_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Fortnite_Player_FullBody_LinkedGraph_Template.Fortnite_Player_FullBody_LinkedGraph_Template_C.AnimGraph
// 0x0030 (0x0030 - 0x0000)
struct Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph final
{
public:
	struct FPoseLink                              UpperAndLowerBodyInPose;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              UpperBodyInPose;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph) == 0x000008, "Wrong alignment on Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph");
static_assert(sizeof(Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph) == 0x000030, "Wrong size on Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph");
static_assert(offsetof(Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph, UpperAndLowerBodyInPose) == 0x000000, "Member 'Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph::UpperAndLowerBodyInPose' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph, UpperBodyInPose) == 0x000010, "Member 'Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph::UpperBodyInPose' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph, AnimGraph_0) == 0x000020, "Member 'Fortnite_Player_FullBody_LinkedGraph_Template_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Fortnite_Player_FullBody_LinkedGraph_Template.Fortnite_Player_FullBody_LinkedGraph_Template_C.ExecuteUbergraph_Fortnite_Player_FullBody_LinkedGraph_Template
// 0x0004 (0x0004 - 0x0000)
struct Fortnite_Player_FullBody_LinkedGraph_Template_C_ExecuteUbergraph_Fortnite_Player_FullBody_LinkedGraph_Template final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_Player_FullBody_LinkedGraph_Template_C_ExecuteUbergraph_Fortnite_Player_FullBody_LinkedGraph_Template) == 0x000004, "Wrong alignment on Fortnite_Player_FullBody_LinkedGraph_Template_C_ExecuteUbergraph_Fortnite_Player_FullBody_LinkedGraph_Template");
static_assert(sizeof(Fortnite_Player_FullBody_LinkedGraph_Template_C_ExecuteUbergraph_Fortnite_Player_FullBody_LinkedGraph_Template) == 0x000004, "Wrong size on Fortnite_Player_FullBody_LinkedGraph_Template_C_ExecuteUbergraph_Fortnite_Player_FullBody_LinkedGraph_Template");
static_assert(offsetof(Fortnite_Player_FullBody_LinkedGraph_Template_C_ExecuteUbergraph_Fortnite_Player_FullBody_LinkedGraph_Template, EntryPoint) == 0x000000, "Member 'Fortnite_Player_FullBody_LinkedGraph_Template_C_ExecuteUbergraph_Fortnite_Player_FullBody_LinkedGraph_Template::EntryPoint' has a wrong offset!");

}

