#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortReplayLensSettingsTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortReplayLensSettingsTab.FortReplayLensSettingsTab_C
// 0x0070 (0x05D0 - 0x0560)
class UFortReplayLensSettingsTab_C final : public UFortSpectatorLensSettingsTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatorSelectorReplaySettings_C*       ApertureSelector;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       AutoFocusSelector;                                 // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             ExposureSlider;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       FocalLengthSelector;                               // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             FocusDistanceSlider;                               // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_DOFSettings;                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OnText;                                            // 0x05A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   OffText;                                           // 0x05B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__ApertureSelector_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__AutoExposureSelector_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__AutoFocusSelector_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__ExposureSlider_K2Node_ComponentBoundEvent_4_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__FocalLengthSelector_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__FocusDistanceSlider_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature(float Slider_Value);
	void BP_OnActivated();
	void CenterOnTab();
	void ExecuteUbergraph_FortReplayLensSettingsTab(int32 EntryPoint);
	void InitializeWidgets();
	void OnApertureChanged(int32 PresetApertureIdx);
	void OnAutoExposureEnabledChanged(bool bAutoExposureEnabled);
	void OnAutoFocusEnabledChanged(bool bAutoFocusEnabled);
	void OnFocalLengthChanged(const TArray<class FText>& FocalLengthTexts, int32 PresetFocalLengthIdx);
	void OnManualExposureBiasChanged(float ManualExposureBias);
	void OnManualFocusDistanceChanged(float ManualFocusDistance);
	void PreConstruct(bool IsDesignTime);
	void RefreshDOFSettings();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortReplayLensSettingsTab_C">();
	}
	static class UFortReplayLensSettingsTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortReplayLensSettingsTab_C>();
	}
};
static_assert(alignof(UFortReplayLensSettingsTab_C) == 0x000008, "Wrong alignment on UFortReplayLensSettingsTab_C");
static_assert(sizeof(UFortReplayLensSettingsTab_C) == 0x0005D0, "Wrong size on UFortReplayLensSettingsTab_C");
static_assert(offsetof(UFortReplayLensSettingsTab_C, UberGraphFrame) == 0x000560, "Member 'UFortReplayLensSettingsTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortReplayLensSettingsTab_C, ApertureSelector) == 0x000568, "Member 'UFortReplayLensSettingsTab_C::ApertureSelector' has a wrong offset!");
static_assert(offsetof(UFortReplayLensSettingsTab_C, AutoFocusSelector) == 0x000570, "Member 'UFortReplayLensSettingsTab_C::AutoFocusSelector' has a wrong offset!");
static_assert(offsetof(UFortReplayLensSettingsTab_C, ExposureSlider) == 0x000578, "Member 'UFortReplayLensSettingsTab_C::ExposureSlider' has a wrong offset!");
static_assert(offsetof(UFortReplayLensSettingsTab_C, FocalLengthSelector) == 0x000580, "Member 'UFortReplayLensSettingsTab_C::FocalLengthSelector' has a wrong offset!");
static_assert(offsetof(UFortReplayLensSettingsTab_C, FocusDistanceSlider) == 0x000588, "Member 'UFortReplayLensSettingsTab_C::FocusDistanceSlider' has a wrong offset!");
static_assert(offsetof(UFortReplayLensSettingsTab_C, VerticalBox) == 0x000590, "Member 'UFortReplayLensSettingsTab_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UFortReplayLensSettingsTab_C, VerticalBox_DOFSettings) == 0x000598, "Member 'UFortReplayLensSettingsTab_C::VerticalBox_DOFSettings' has a wrong offset!");
static_assert(offsetof(UFortReplayLensSettingsTab_C, OnText) == 0x0005A0, "Member 'UFortReplayLensSettingsTab_C::OnText' has a wrong offset!");
static_assert(offsetof(UFortReplayLensSettingsTab_C, OffText) == 0x0005B8, "Member 'UFortReplayLensSettingsTab_C::OffText' has a wrong offset!");

}

