#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortQuestMenuAutoRunWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortQuestMenuAutoRunWidget.FortQuestMenuAutoRunWidget_C.ExecuteUbergraph_FortQuestMenuAutoRunWidget
// 0x0018 (0x0018 - 0x0000)
struct FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAutoRunEnabled;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget) == 0x000008, "Wrong alignment on FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget");
static_assert(sizeof(FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget) == 0x000018, "Wrong size on FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget");
static_assert(offsetof(FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget, EntryPoint) == 0x000000, "Member 'FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget, K2Node_Event_bAutoRunEnabled) == 0x000004, "Member 'FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget::K2Node_Event_bAutoRunEnabled' has a wrong offset!");
static_assert(offsetof(FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'FortQuestMenuAutoRunWidget_C_ExecuteUbergraph_FortQuestMenuAutoRunWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function FortQuestMenuAutoRunWidget.FortQuestMenuAutoRunWidget_C.OnAutoRunEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortQuestMenuAutoRunWidget_C_OnAutoRunEnabled final
{
public:
	bool                                          bAutoRunEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortQuestMenuAutoRunWidget_C_OnAutoRunEnabled) == 0x000001, "Wrong alignment on FortQuestMenuAutoRunWidget_C_OnAutoRunEnabled");
static_assert(sizeof(FortQuestMenuAutoRunWidget_C_OnAutoRunEnabled) == 0x000001, "Wrong size on FortQuestMenuAutoRunWidget_C_OnAutoRunEnabled");
static_assert(offsetof(FortQuestMenuAutoRunWidget_C_OnAutoRunEnabled, bAutoRunEnabled) == 0x000000, "Member 'FortQuestMenuAutoRunWidget_C_OnAutoRunEnabled::bAutoRunEnabled' has a wrong offset!");

}

