#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortPostGameScreenRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortPostGameScreenRoot.FortPostGameScreenRoot_C
// 0x0058 (0x04D8 - 0x0480)
class UFortPostGameScreenRoot_C final : public UFortPostGameScreenRoot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortPostGameMobileOverlay_C*           FortPostGameMobileOverlay;                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlacementOverlay_C*                    PlacementOverlay;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPostGameSpectatingPlayerName_C*        PostGameSpectatingPlayerName;                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_PostMatchContent;                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_UserSpecified;                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnToggleBlurRequested;                             // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AnimateCinematicBars();
	void ExecuteUbergraph_FortPostGameScreenRoot(int32 EntryPoint);
	void ToggleBlur();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortPostGameScreenRoot_C">();
	}
	static class UFortPostGameScreenRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPostGameScreenRoot_C>();
	}
};
static_assert(alignof(UFortPostGameScreenRoot_C) == 0x000008, "Wrong alignment on UFortPostGameScreenRoot_C");
static_assert(sizeof(UFortPostGameScreenRoot_C) == 0x0004D8, "Wrong size on UFortPostGameScreenRoot_C");
static_assert(offsetof(UFortPostGameScreenRoot_C, UberGraphFrame) == 0x000480, "Member 'UFortPostGameScreenRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortPostGameScreenRoot_C, FortPostGameMobileOverlay) == 0x000488, "Member 'UFortPostGameScreenRoot_C::FortPostGameMobileOverlay' has a wrong offset!");
static_assert(offsetof(UFortPostGameScreenRoot_C, PlacementOverlay) == 0x000490, "Member 'UFortPostGameScreenRoot_C::PlacementOverlay' has a wrong offset!");
static_assert(offsetof(UFortPostGameScreenRoot_C, PostGameSpectatingPlayerName) == 0x000498, "Member 'UFortPostGameScreenRoot_C::PostGameSpectatingPlayerName' has a wrong offset!");
static_assert(offsetof(UFortPostGameScreenRoot_C, SafeZone_0) == 0x0004A0, "Member 'UFortPostGameScreenRoot_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UFortPostGameScreenRoot_C, SafeZone_1) == 0x0004A8, "Member 'UFortPostGameScreenRoot_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UFortPostGameScreenRoot_C, SafeZone_2) == 0x0004B0, "Member 'UFortPostGameScreenRoot_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UFortPostGameScreenRoot_C, SafeZone_PostMatchContent) == 0x0004B8, "Member 'UFortPostGameScreenRoot_C::SafeZone_PostMatchContent' has a wrong offset!");
static_assert(offsetof(UFortPostGameScreenRoot_C, ScaleBox_UserSpecified) == 0x0004C0, "Member 'UFortPostGameScreenRoot_C::ScaleBox_UserSpecified' has a wrong offset!");
static_assert(offsetof(UFortPostGameScreenRoot_C, OnToggleBlurRequested) == 0x0004C8, "Member 'UFortPostGameScreenRoot_C::OnToggleBlurRequested' has a wrong offset!");

}

