#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortSocialEventRSVPWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortSocialEventRSVPWidget.FortSocialEventRSVPWidget_C
// 0x0030 (0x02E8 - 0x02B8)
class UFortSocialEventRSVPWidget_C final : public UFortSocialEventRSVPWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Overlay_AdditionalEvents;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_AdditionalEvents;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EventName;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MonthDay;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              In_Visibility;                                     // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_FortSocialEventRSVPWidget(int32 EntryPoint);
	void OnRefreshDisplay(const class FText& EventName, const class FText& Date, const class FText& AdditionalEvents);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortSocialEventRSVPWidget_C">();
	}
	static class UFortSocialEventRSVPWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSocialEventRSVPWidget_C>();
	}
};
static_assert(alignof(UFortSocialEventRSVPWidget_C) == 0x000008, "Wrong alignment on UFortSocialEventRSVPWidget_C");
static_assert(sizeof(UFortSocialEventRSVPWidget_C) == 0x0002E8, "Wrong size on UFortSocialEventRSVPWidget_C");
static_assert(offsetof(UFortSocialEventRSVPWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UFortSocialEventRSVPWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortSocialEventRSVPWidget_C, Overlay_AdditionalEvents) == 0x0002C0, "Member 'UFortSocialEventRSVPWidget_C::Overlay_AdditionalEvents' has a wrong offset!");
static_assert(offsetof(UFortSocialEventRSVPWidget_C, Text_AdditionalEvents) == 0x0002C8, "Member 'UFortSocialEventRSVPWidget_C::Text_AdditionalEvents' has a wrong offset!");
static_assert(offsetof(UFortSocialEventRSVPWidget_C, Text_EventName) == 0x0002D0, "Member 'UFortSocialEventRSVPWidget_C::Text_EventName' has a wrong offset!");
static_assert(offsetof(UFortSocialEventRSVPWidget_C, Text_MonthDay) == 0x0002D8, "Member 'UFortSocialEventRSVPWidget_C::Text_MonthDay' has a wrong offset!");
static_assert(offsetof(UFortSocialEventRSVPWidget_C, In_Visibility) == 0x0002E0, "Member 'UFortSocialEventRSVPWidget_C::In_Visibility' has a wrong offset!");

}

