#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortBroadcastViewSettings

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FortBroadcastViewSettings.FortBroadcastViewSettings_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortBroadcastViewSettings_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastViewSettings_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FortBroadcastViewSettings_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FortBroadcastViewSettings_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FortBroadcastViewSettings_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FortBroadcastViewSettings_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FortBroadcastViewSettings_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FortBroadcastViewSettings.FortBroadcastViewSettings_C.BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortBroadcastViewSettings_C_BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastViewSettings_C_BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FortBroadcastViewSettings_C_BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FortBroadcastViewSettings_C_BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FortBroadcastViewSettings_C_BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FortBroadcastViewSettings_C_BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FortBroadcastViewSettings_C_BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FortBroadcastViewSettings.FortBroadcastViewSettings_C.CameraTypeToText
// 0x0118 (0x0118 - 0x0000)
struct FortBroadcastViewSettings_C_CameraTypeToText final
{
public:
	ESpectatorCameraType                          CameraType_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(Parm, OutParm)
	ESpectatorCameraType                          Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0088(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A0(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00B8(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00D0(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00E8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0100(0x0018)()
};
static_assert(alignof(FortBroadcastViewSettings_C_CameraTypeToText) == 0x000008, "Wrong alignment on FortBroadcastViewSettings_C_CameraTypeToText");
static_assert(sizeof(FortBroadcastViewSettings_C_CameraTypeToText) == 0x000118, "Wrong size on FortBroadcastViewSettings_C_CameraTypeToText");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, CameraType_0) == 0x000000, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::CameraType_0' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Text) == 0x000008, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Text' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_byte_Variable) == 0x000020, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_text_Variable) == 0x000028, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_text_Variable_1) == 0x000040, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_text_Variable_2) == 0x000058, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_text_Variable_3) == 0x000070, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_text_Variable_4) == 0x000088, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_text_Variable_5) == 0x0000A0, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_text_Variable_6) == 0x0000B8, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_text_Variable_7) == 0x0000D0, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, Temp_text_Variable_8) == 0x0000E8, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_CameraTypeToText, K2Node_Select_Default) == 0x000100, "Member 'FortBroadcastViewSettings_C_CameraTypeToText::K2Node_Select_Default' has a wrong offset!");

// Function FortBroadcastViewSettings.FortBroadcastViewSettings_C.ExecuteUbergraph_FortBroadcastViewSettings
// 0x0070 (0x0070 - 0x0000)
struct FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortReplayViewSettingsTabBase*         K2Node_DynamicCast_AsFort_Replay_View_Settings_Tab_Base; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortPlayerControllerSpectating* SpectatorPC, ESpectatorCameraType NewCameraType)> K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortReplaySpectatorAthena*             K2Node_DynamicCast_AsFort_Replay_Spectator_Athena; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings) == 0x000008, "Wrong alignment on FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings");
static_assert(sizeof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings) == 0x000070, "Wrong size on FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, EntryPoint) == 0x000000, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000004, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, CallFunc_GetActiveWidget_ReturnValue) == 0x000018, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, K2Node_DynamicCast_AsFort_Replay_View_Settings_Tab_Base) == 0x000020, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::K2Node_DynamicCast_AsFort_Replay_View_Settings_Tab_Base' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, K2Node_DynamicCast_AsFort_Player_Controller_Spectating) == 0x000040, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::K2Node_DynamicCast_AsFort_Player_Controller_Spectating' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, K2Node_DynamicCast_AsFort_Replay_Spectator_Athena) == 0x000060, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::K2Node_DynamicCast_AsFort_Replay_Spectator_Athena' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'FortBroadcastViewSettings_C_ExecuteUbergraph_FortBroadcastViewSettings::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FortBroadcastViewSettings.FortBroadcastViewSettings_C.OnCameraTypeChanged
// 0x0058 (0x0058 - 0x0000)
struct FortBroadcastViewSettings_C_OnCameraTypeChanged final
{
public:
	class AFortPlayerControllerSpectating*        PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorCameraType                          CameraType_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatablePanelLegacy*          K2Node_DynamicCast_AsCommon_Activatable_Panel_Legacy; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByID_ReturnValue;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTab_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCameraNameFromType_ReturnValue;        // 0x0038(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastViewSettings_C_OnCameraTypeChanged) == 0x000008, "Wrong alignment on FortBroadcastViewSettings_C_OnCameraTypeChanged");
static_assert(sizeof(FortBroadcastViewSettings_C_OnCameraTypeChanged) == 0x000058, "Wrong size on FortBroadcastViewSettings_C_OnCameraTypeChanged");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, PlayerController) == 0x000000, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::PlayerController' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CameraType_0) == 0x000008, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CameraType_0' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000009, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CallFunc_GetActiveWidget_ReturnValue) == 0x000010, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, K2Node_DynamicCast_AsCommon_Activatable_Panel_Legacy) == 0x000018, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::K2Node_DynamicCast_AsCommon_Activatable_Panel_Legacy' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CallFunc_IsActivated_ReturnValue) == 0x000021, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CallFunc_SelectTabByID_ReturnValue) == 0x000022, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CallFunc_SelectTabByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CallFunc_GetActiveTab_ReturnValue) == 0x000030, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CallFunc_GetActiveTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CallFunc_GetCameraNameFromType_ReturnValue) == 0x000038, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CallFunc_GetCameraNameFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000050, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_OnCameraTypeChanged, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'FortBroadcastViewSettings_C_OnCameraTypeChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FortBroadcastViewSettings.FortBroadcastViewSettings_C.SwitchToValidTab
// 0x000C (0x000C - 0x0000)
struct FortBroadcastViewSettings_C_SwitchToValidTab final
{
public:
	bool                                          CallFunc_SelectTabByID_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActiveTab_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastViewSettings_C_SwitchToValidTab) == 0x000004, "Wrong alignment on FortBroadcastViewSettings_C_SwitchToValidTab");
static_assert(sizeof(FortBroadcastViewSettings_C_SwitchToValidTab) == 0x00000C, "Wrong size on FortBroadcastViewSettings_C_SwitchToValidTab");
static_assert(offsetof(FortBroadcastViewSettings_C_SwitchToValidTab, CallFunc_SelectTabByID_ReturnValue) == 0x000000, "Member 'FortBroadcastViewSettings_C_SwitchToValidTab::CallFunc_SelectTabByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_SwitchToValidTab, CallFunc_GetActiveTab_ReturnValue) == 0x000004, "Member 'FortBroadcastViewSettings_C_SwitchToValidTab::CallFunc_GetActiveTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_SwitchToValidTab, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'FortBroadcastViewSettings_C_SwitchToValidTab::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_SwitchToValidTab, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'FortBroadcastViewSettings_C_SwitchToValidTab::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastViewSettings_C_SwitchToValidTab, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'FortBroadcastViewSettings_C_SwitchToValidTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

