#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortReplayTimeline

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortReplayTimeline.FortReplayTimeline_C.ExecuteUbergraph_FortReplayTimeline
// 0x0010 (0x0010 - 0x0000)
struct FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline) == 0x000008, "Wrong alignment on FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline");
static_assert(sizeof(FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline) == 0x000010, "Wrong size on FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline");
static_assert(offsetof(FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline, EntryPoint) == 0x000000, "Member 'FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline, K2Node_Event_IsDesignTime) == 0x000004, "Member 'FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'FortReplayTimeline_C_ExecuteUbergraph_FortReplayTimeline::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function FortReplayTimeline.FortReplayTimeline_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FortReplayTimeline_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortReplayTimeline_C_PreConstruct) == 0x000001, "Wrong alignment on FortReplayTimeline_C_PreConstruct");
static_assert(sizeof(FortReplayTimeline_C_PreConstruct) == 0x000001, "Wrong size on FortReplayTimeline_C_PreConstruct");
static_assert(offsetof(FortReplayTimeline_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FortReplayTimeline_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

