#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortReplayCameraOption

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortReplayCameraOption.FortReplayCameraOption_C.ExecuteUbergraph_FortReplayCameraOption
// 0x0040 (0x0040 - 0x0000)
struct FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCameraNameFromType_ReturnValue;        // 0x0028(0x0018)()
};
static_assert(alignof(FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption) == 0x000008, "Wrong alignment on FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption");
static_assert(sizeof(FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption) == 0x000040, "Wrong size on FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption");
static_assert(offsetof(FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption, EntryPoint) == 0x000000, "Member 'FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption, CallFunc_GetPlayerControllerFromID_ReturnValue) == 0x000008, "Member 'FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption::CallFunc_GetPlayerControllerFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption, K2Node_DynamicCast_AsFort_Player_Controller_Spectating) == 0x000010, "Member 'FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption::K2Node_DynamicCast_AsFort_Player_Controller_Spectating' has a wrong offset!");
static_assert(offsetof(FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption, CallFunc_GetCameraNameFromType_ReturnValue) == 0x000028, "Member 'FortReplayCameraOption_C_ExecuteUbergraph_FortReplayCameraOption::CallFunc_GetCameraNameFromType_ReturnValue' has a wrong offset!");

}

