#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortPostGameNewQuestsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortPostGameNewQuestsWidget.FortPostGameNewQuestsWidget_C
// 0x0028 (0x03D0 - 0x03A8)
class UFortPostGameNewQuestsWidget_C final : public UFortPostGameNewQuestsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EntryBoxOutro;                                     // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EntryBoxIntro;                                     // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void Destruct();
	void ExecuteUbergraph_FortPostGameNewQuestsWidget(int32 EntryPoint);
	void HandleEntryBoxIntroFinished();
	void HandleEntryBoxOutroFinished();
	void HandleIntroFinished();
	void OnInitialized();
	void OnPlayIntro();
	void OnPlayNewQuestsEntryBoxIntro();
	void OnPlayNewQuestsEntryBoxOutro();
	void OnPlayOutro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortPostGameNewQuestsWidget_C">();
	}
	static class UFortPostGameNewQuestsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPostGameNewQuestsWidget_C>();
	}
};
static_assert(alignof(UFortPostGameNewQuestsWidget_C) == 0x000008, "Wrong alignment on UFortPostGameNewQuestsWidget_C");
static_assert(sizeof(UFortPostGameNewQuestsWidget_C) == 0x0003D0, "Wrong size on UFortPostGameNewQuestsWidget_C");
static_assert(offsetof(UFortPostGameNewQuestsWidget_C, UberGraphFrame) == 0x0003A8, "Member 'UFortPostGameNewQuestsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortPostGameNewQuestsWidget_C, Outro) == 0x0003B0, "Member 'UFortPostGameNewQuestsWidget_C::Outro' has a wrong offset!");
static_assert(offsetof(UFortPostGameNewQuestsWidget_C, Intro) == 0x0003B8, "Member 'UFortPostGameNewQuestsWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UFortPostGameNewQuestsWidget_C, EntryBoxOutro) == 0x0003C0, "Member 'UFortPostGameNewQuestsWidget_C::EntryBoxOutro' has a wrong offset!");
static_assert(offsetof(UFortPostGameNewQuestsWidget_C, EntryBoxIntro) == 0x0003C8, "Member 'UFortPostGameNewQuestsWidget_C::EntryBoxIntro' has a wrong offset!");

}

