#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortPostGameDisabledMenuEntryOverlay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortPostGameDisabledMenuEntryOverlay.FortPostGameDisabledMenuEntryOverlay_C
// 0x0058 (0x0320 - 0x02C8)
class UFortPostGameDisabledMenuEntryOverlay_C final : public UFortPostGameMenuEntryOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          BorderSkew;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           HoverBGColor;                                      // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalBGColor;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            HoverTextColor;                                    // 0x02F8(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            NormalTextColor;                                   // 0x030C(0x0014)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_FortPostGameDisabledMenuEntryOverlay(int32 EntryPoint);
	void OnHovered();
	void OnUnhovered();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortPostGameDisabledMenuEntryOverlay_C">();
	}
	static class UFortPostGameDisabledMenuEntryOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPostGameDisabledMenuEntryOverlay_C>();
	}
};
static_assert(alignof(UFortPostGameDisabledMenuEntryOverlay_C) == 0x000008, "Wrong alignment on UFortPostGameDisabledMenuEntryOverlay_C");
static_assert(sizeof(UFortPostGameDisabledMenuEntryOverlay_C) == 0x000320, "Wrong size on UFortPostGameDisabledMenuEntryOverlay_C");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, UberGraphFrame) == 0x0002C8, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, BorderSkew) == 0x0002D0, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::BorderSkew' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, HoverBGColor) == 0x0002D8, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::HoverBGColor' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, NormalBGColor) == 0x0002E8, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::NormalBGColor' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, HoverTextColor) == 0x0002F8, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::HoverTextColor' has a wrong offset!");
static_assert(offsetof(UFortPostGameDisabledMenuEntryOverlay_C, NormalTextColor) == 0x00030C, "Member 'UFortPostGameDisabledMenuEntryOverlay_C::NormalTextColor' has a wrong offset!");

}

