#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_SkyDiveAndGlide_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x02BF (0x02C0 - 0x0001)
struct Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2527;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2528;                              // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2529;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2530;                              // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2531;                               // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_2532;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_2533;                                 // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_2534;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_2535;                                 // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_2536;                                 // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_2537;                           // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_2538;                           // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_2539;                           // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_2540;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_2541;                               // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_2542;                           // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_2543;                           // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_2544;                           // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_2545;                               // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2546;                               // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2547;                               // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2548;                               // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2549;                               // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2550;                              // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2551;                              // 0x00C0(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_2552;                               // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2553;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2554;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2555;                               // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2556;                               // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2557;                               // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2558;                              // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2559;                              // 0x00F8(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_2560;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2561;                               // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2562;                               // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2563;                               // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_2564;                               // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_2565;                               // 0x0119(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2566;                               // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2567;                               // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2568;                               // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2569;                              // 0x0128(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2570;                              // 0x0138(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_2571;                              // 0x0148(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2572;                               // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2573;                               // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2574;                               // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2575;                               // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2576;                                // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_2577;                               // 0x016C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2578;                               // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2579;                                // 0x0174(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_2580;                             // 0x0178(0x002C)(BlueprintVisible, NoDestructor)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_2581;                               // 0x01A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_2582;                                 // 0x01B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_2583;                               // 0x01B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_2584;                               // 0x01B9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2585;                              // 0x01C0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2586;                              // 0x01D0(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_2587;                               // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2588;                                // 0x01E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2589;                              // 0x01E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2590;                               // 0x01EC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2591;                              // 0x01F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2592;                               // 0x01F4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_2593;                               // 0x01F5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_2594;                               // 0x01F6(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F7[0x1];                                      // 0x01F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2595;                               // 0x01F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2596;                               // 0x01FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2597;                                // 0x0200(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2598;                               // 0x0204(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2599;                               // 0x0208(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2600;                                // 0x020C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_2601;                             // 0x0210(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0228(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02A8(0x0018)()
};
static_assert(alignof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x0002C0, "Wrong size on Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2527) == 0x000004, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2527' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2528) == 0x000008, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2528' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2529) == 0x000018, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2529' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2530) == 0x000020, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2530' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2531) == 0x000030, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2531' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendSpace_2532) == 0x000038, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendSpace_2532' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendSpace_2533) == 0x000040, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendSpace_2533' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendSpace_2534) == 0x000048, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendSpace_2534' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendSpace_2535) == 0x000050, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendSpace_2535' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendSpace_2536) == 0x000058, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendSpace_2536' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_2537) == 0x000060, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_2537' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_2538) == 0x000068, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_2538' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_2539) == 0x000070, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_2539' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2540) == 0x000078, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2540' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2541) == 0x00007C, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2541' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_2542) == 0x000080, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_2542' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_2543) == 0x000088, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_2543' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_2544) == 0x000090, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_2544' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2545) == 0x000098, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2545' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2546) == 0x00009C, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2546' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2547) == 0x0000A0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2547' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2548) == 0x0000A4, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2548' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2549) == 0x0000A8, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2549' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2550) == 0x0000B0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2550' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2551) == 0x0000C0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2551' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2552) == 0x0000D0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2552' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2553) == 0x0000D4, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2553' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2554) == 0x0000D8, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2554' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2555) == 0x0000DC, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2555' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2556) == 0x0000E0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2556' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2557) == 0x0000E4, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2557' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2558) == 0x0000E8, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2558' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2559) == 0x0000F8, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2559' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2560) == 0x000108, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2560' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2561) == 0x00010C, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2561' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2562) == 0x000110, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2562' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2563) == 0x000114, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2563' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_2564) == 0x000118, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_2564' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_2565) == 0x000119, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_2565' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2566) == 0x00011C, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2566' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2567) == 0x000120, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2567' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2568) == 0x000124, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2568' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2569) == 0x000128, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2569' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2570) == 0x000138, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2570' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2571) == 0x000148, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2571' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2572) == 0x000158, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2572' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2573) == 0x00015C, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2573' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2574) == 0x000160, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2574' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2575) == 0x000164, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2575' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2576) == 0x000168, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2576' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2577) == 0x00016C, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2577' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2578) == 0x000170, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2578' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2579) == 0x000174, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2579' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_2580) == 0x000178, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_2580' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendProfile_2581) == 0x0001A8, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendProfile_2581' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __CurveFloat_2582) == 0x0001B0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__CurveFloat_2582' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2583) == 0x0001B8, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2583' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2584) == 0x0001B9, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2584' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2585) == 0x0001C0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2585' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2586) == 0x0001D0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2586' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2587) == 0x0001E0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2587' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2588) == 0x0001E4, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2588' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_2589) == 0x0001E8, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_2589' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_2590) == 0x0001EC, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_2590' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_2591) == 0x0001F0, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_2591' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_2592) == 0x0001F4, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_2592' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2593) == 0x0001F5, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2593' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_2594) == 0x0001F6, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_2594' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2595) == 0x0001F8, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2595' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2596) == 0x0001FC, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2596' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2597) == 0x000200, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2597' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2598) == 0x000204, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2598' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2599) == 0x000208, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2599' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2600) == 0x00020C, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2600' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_2601) == 0x000210, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_2601' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000228, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002A8, "Member 'Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Fortnite_SkyDiveAndGlide_AnimBlueprint.Fortnite_SkyDiveAndGlide_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x085F (0x0860 - 0x0001)
struct Fortnite_SkyDiveAndGlide_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase;                                // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_0;                                    // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_3;                                    // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_6;                              // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_7;                              // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_8;                              // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_9;                              // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         __IntProperty_10;                                  // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_11;                                 // 0x0054(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_12;                                   // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_15;                                   // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_18;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_19;                                   // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_22;                                   // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_25;                                   // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_28;                                   // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_32;                                   // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_36;                                   // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_38;                                // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_39;                                // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_40;                                   // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_41;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_42;                                // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_43;                                // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_44;                                   // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_45;                                // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_46;                                // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_47;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_48;                                   // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_49;                                // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_50;                                // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_51;                                // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_52;                                  // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_53;                                // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_54;                                // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_55;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_56;                                // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_57;                                // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_58;                                // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_59;                                // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_60;                                // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_61;                                 // 0x0160(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_62;                                  // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_63;                                // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_64;                                // 0x016C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_65;                                // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_66;                                // 0x0174(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_67;                                // 0x0178(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_68;                                // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_69;                                  // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_70;                                  // 0x0184(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_71;                                   // 0x0188(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_72;                                // 0x0190(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_73;                                // 0x0194(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_74;                                   // 0x0198(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_75;                                // 0x01A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_76;                                // 0x01A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_77;                                   // 0x01A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_78;                                // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_79;                                // 0x01B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_80;                                   // 0x01B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_81;                                // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_82;                                // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_83;                                   // 0x01C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_84;                                // 0x01D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_85;                                // 0x01D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_86;                                   // 0x01D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_87;                                // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_88;                                // 0x01E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_89;                                 // 0x01E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_90;                                   // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_91;                                // 0x01F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_92;                                // 0x01FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_93;                                 // 0x0200(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_94;                                   // 0x0208(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
