#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Player_DBNOCarried_AnimBP

#include "Basic.hpp"

#include "Fortnite_Player_DBNOCarried_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fortnite_Player_DBNOCarried_AnimBP.Fortnite_Player_DBNOCarried_AnimBP_C
// 0x1E20 (0x2310 - 0x04F0)
class UFortnite_Player_DBNOCarried_AnimBP_C final : public UFortPlayerDBNOCarriedAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Fortnite_Player_DBNOCarried_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x04F8(0x004C)(HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0548(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0550(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0558(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0578(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0598(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x06C0(0x0128)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8;                 // 0x07E8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x0828(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x0868(0x00C8)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x0930(0x0250)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0B80(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0BA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0BC8(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x0BF0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0C30(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0C50(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x0CB8(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x0D80(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0E48(0x0068)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0EB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0ED8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0F00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0F28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0F50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0F78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0FA0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0FC8(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x1008(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x10D0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1110(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x1130(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x1170(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x11B8(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1220(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x12E8(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1328(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x13F0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1430(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x1450(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1490(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x14D0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x1518(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x1560(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x15A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x15E8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1628(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x1648(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1688(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x16C8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x1710(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x1750(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1798(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x17D8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x1820(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x1868(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x18A8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x18F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1938(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1978(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x19C0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1A00(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1A40(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1A60(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1AA0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1B68(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1BA8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1BC8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1C80(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x1CA0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1CE0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1D00(0x00B8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1DB8(0x0020)()
	uint8                                         Pad_1DD8[0x8];                                     // 0x1DD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x1DE0(0x02A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2080(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x20C8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x2110(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2158(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x21A0(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x22A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x22C8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x22F0(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Fortnite_Player_DBNOCarried_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fortnite_Player_DBNOCarried_AnimBP_C">();
	}
	static class UFortnite_Player_DBNOCarried_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortnite_Player_DBNOCarried_AnimBP_C>();
	}
};
static_assert(alignof(UFortnite_Player_DBNOCarried_AnimBP_C) == 0x000010, "Wrong alignment on UFortnite_Player_DBNOCarried_AnimBP_C");
static_assert(sizeof(UFortnite_Player_DBNOCarried_AnimBP_C) == 0x002310, "Wrong size on UFortnite_Player_DBNOCarried_AnimBP_C");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, UberGraphFrame) == 0x0004F0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, __AnimBlueprintMutables) == 0x0004F8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000548, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimBlueprintExtension_Base) == 0x000550, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_Root) == 0x000558, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000578, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000598, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0006C0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_8) == 0x0007E8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_8' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_13) == 0x000828, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_6) == 0x000868, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_6' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TwoBoneIK) == 0x000930, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000B80, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x000BA0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x000BC8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_7) == 0x000BF0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_7' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_7) == 0x000C30, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendSpacePlayer_2) == 0x000C50, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_5) == 0x000CB8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_5' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_4) == 0x000D80, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000E48, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000EB0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x000ED8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x000F00, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x000F28, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000F50, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000F78, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000FA0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_12) == 0x000FC8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_3) == 0x001008, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_11) == 0x0010D0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_6) == 0x001110, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_10) == 0x001130, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_12) == 0x001170, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_12' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0011B8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_2) == 0x001220, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x0012E8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive_1) == 0x001328, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x0013F0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_5) == 0x001430, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_6) == 0x001450, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_6' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x001490, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_11) == 0x0014D0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_11' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_10) == 0x001518, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_10' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_5) == 0x001560, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_5' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_9) == 0x0015A0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_9' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x0015E8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_4) == 0x001628, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_4) == 0x001648, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_4' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001688, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_8) == 0x0016C8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_8' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_3) == 0x001710, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_3' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_7) == 0x001750, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x001798, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_6) == 0x0017D8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_5) == 0x001820, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_2) == 0x001868, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_2' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x0018A8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x0018F0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x001938, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x001978, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator_1) == 0x0019C0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x001A00, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_3) == 0x001A40, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001A60, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x001AA0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001B68, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_2) == 0x001BA8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x001BC8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult_1) == 0x001C80, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SequenceEvaluator) == 0x001CA0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateResult) == 0x001CE0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_StateMachine) == 0x001D00, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001DB8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_Trail) == 0x001DE0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_Trail' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_Slot_1) == 0x002080, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_Slot) == 0x0020C8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x002110, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x002158, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0021A0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0022A0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0022C8, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_DBNOCarried_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0022F0, "Member 'UFortnite_Player_DBNOCarried_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");

}

