#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteAI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function FortniteAI.FortAIComponent_Telemetry.OnDidDamage
// 0x0060 (0x0060 - 0x0000)
struct FortAIComponent_Telemetry_OnDidDamage final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAIComponent_Telemetry_OnDidDamage) == 0x000008, "Wrong alignment on FortAIComponent_Telemetry_OnDidDamage");
static_assert(sizeof(FortAIComponent_Telemetry_OnDidDamage) == 0x000060, "Wrong size on FortAIComponent_Telemetry_OnDidDamage");
static_assert(offsetof(FortAIComponent_Telemetry_OnDidDamage, DamagedActor) == 0x000000, "Member 'FortAIComponent_Telemetry_OnDidDamage::DamagedActor' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnDidDamage, Damage) == 0x000008, "Member 'FortAIComponent_Telemetry_OnDidDamage::Damage' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnDidDamage, InstigatedBy) == 0x000010, "Member 'FortAIComponent_Telemetry_OnDidDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnDidDamage, DamageCauser) == 0x000018, "Member 'FortAIComponent_Telemetry_OnDidDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnDidDamage, HitLocation) == 0x000020, "Member 'FortAIComponent_Telemetry_OnDidDamage::HitLocation' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnDidDamage, FHitComponent) == 0x000038, "Member 'FortAIComponent_Telemetry_OnDidDamage::FHitComponent' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnDidDamage, BoneName) == 0x000040, "Member 'FortAIComponent_Telemetry_OnDidDamage::BoneName' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnDidDamage, Momentum) == 0x000048, "Member 'FortAIComponent_Telemetry_OnDidDamage::Momentum' has a wrong offset!");

// Function FortniteAI.FortAIComponent_Telemetry.OnPawnDied
// 0x0060 (0x0060 - 0x0000)
struct FortAIComponent_Telemetry_OnPawnDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAIComponent_Telemetry_OnPawnDied) == 0x000008, "Wrong alignment on FortAIComponent_Telemetry_OnPawnDied");
static_assert(sizeof(FortAIComponent_Telemetry_OnPawnDied) == 0x000060, "Wrong size on FortAIComponent_Telemetry_OnPawnDied");
static_assert(offsetof(FortAIComponent_Telemetry_OnPawnDied, DamagedActor) == 0x000000, "Member 'FortAIComponent_Telemetry_OnPawnDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnPawnDied, Damage) == 0x000008, "Member 'FortAIComponent_Telemetry_OnPawnDied::Damage' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnPawnDied, InstigatedBy) == 0x000010, "Member 'FortAIComponent_Telemetry_OnPawnDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnPawnDied, DamageCauser) == 0x000018, "Member 'FortAIComponent_Telemetry_OnPawnDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnPawnDied, HitLocation) == 0x000020, "Member 'FortAIComponent_Telemetry_OnPawnDied::HitLocation' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnPawnDied, FHitComponent) == 0x000038, "Member 'FortAIComponent_Telemetry_OnPawnDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnPawnDied, BoneName) == 0x000040, "Member 'FortAIComponent_Telemetry_OnPawnDied::BoneName' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnPawnDied, Momentum) == 0x000048, "Member 'FortAIComponent_Telemetry_OnPawnDied::Momentum' has a wrong offset!");

// Function FortniteAI.FortAIComponent_Telemetry.OnTetheredFollowerChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAIComponent_Telemetry_OnTetheredFollowerChanged final
{
public:
	class AFortPawn*                              NewFollower;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              OldFollower;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAIComponent_Telemetry_OnTetheredFollowerChanged) == 0x000008, "Wrong alignment on FortAIComponent_Telemetry_OnTetheredFollowerChanged");
static_assert(sizeof(FortAIComponent_Telemetry_OnTetheredFollowerChanged) == 0x000010, "Wrong size on FortAIComponent_Telemetry_OnTetheredFollowerChanged");
static_assert(offsetof(FortAIComponent_Telemetry_OnTetheredFollowerChanged, NewFollower) == 0x000000, "Member 'FortAIComponent_Telemetry_OnTetheredFollowerChanged::NewFollower' has a wrong offset!");
static_assert(offsetof(FortAIComponent_Telemetry_OnTetheredFollowerChanged, OldFollower) == 0x000008, "Member 'FortAIComponent_Telemetry_OnTetheredFollowerChanged::OldFollower' has a wrong offset!");

// Function FortniteAI.AthenaAIPopulationTracker.OnAgentGameOver
// 0x0018 (0x0018 - 0x0000)
struct AthenaAIPopulationTracker_OnAgentGameOver final
{
public:
	class AFortAthenaAIBotController*             AIBotController;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              Pawn;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            Instigator;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIPopulationTracker_OnAgentGameOver) == 0x000008, "Wrong alignment on AthenaAIPopulationTracker_OnAgentGameOver");
static_assert(sizeof(AthenaAIPopulationTracker_OnAgentGameOver) == 0x000018, "Wrong size on AthenaAIPopulationTracker_OnAgentGameOver");
static_assert(offsetof(AthenaAIPopulationTracker_OnAgentGameOver, AIBotController) == 0x000000, "Member 'AthenaAIPopulationTracker_OnAgentGameOver::AIBotController' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnAgentGameOver, Pawn) == 0x000008, "Member 'AthenaAIPopulationTracker_OnAgentGameOver::Pawn' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnAgentGameOver, Instigator) == 0x000010, "Member 'AthenaAIPopulationTracker_OnAgentGameOver::Instigator' has a wrong offset!");

// Function FortniteAI.AthenaAIPopulationTracker.OnAISpawned
// 0x0010 (0x0010 - 0x0000)
struct AthenaAIPopulationTracker_OnAISpawned final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequestId;                                         // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AthenaAIPopulationTracker_OnAISpawned) == 0x000008, "Wrong alignment on AthenaAIPopulationTracker_OnAISpawned");
static_assert(sizeof(AthenaAIPopulationTracker_OnAISpawned) == 0x000010, "Wrong size on AthenaAIPopulationTracker_OnAISpawned");
static_assert(offsetof(AthenaAIPopulationTracker_OnAISpawned, Pawn) == 0x000000, "Member 'AthenaAIPopulationTracker_OnAISpawned::Pawn' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnAISpawned, RequestId) == 0x000008, "Member 'AthenaAIPopulationTracker_OnAISpawned::RequestId' has a wrong offset!");

// Function FortniteAI.AthenaAIPopulationTracker.OnFortPawnDied
// 0x0060 (0x0060 - 0x0000)
struct AthenaAIPopulationTracker_OnFortPawnDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIPopulationTracker_OnFortPawnDied) == 0x000008, "Wrong alignment on AthenaAIPopulationTracker_OnFortPawnDied");
static_assert(sizeof(AthenaAIPopulationTracker_OnFortPawnDied) == 0x000060, "Wrong size on AthenaAIPopulationTracker_OnFortPawnDied");
static_assert(offsetof(AthenaAIPopulationTracker_OnFortPawnDied, DamagedActor) == 0x000000, "Member 'AthenaAIPopulationTracker_OnFortPawnDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnFortPawnDied, Damage) == 0x000008, "Member 'AthenaAIPopulationTracker_OnFortPawnDied::Damage' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnFortPawnDied, InstigatedBy) == 0x000010, "Member 'AthenaAIPopulationTracker_OnFortPawnDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnFortPawnDied, DamageCauser) == 0x000018, "Member 'AthenaAIPopulationTracker_OnFortPawnDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnFortPawnDied, HitLocation) == 0x000020, "Member 'AthenaAIPopulationTracker_OnFortPawnDied::HitLocation' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnFortPawnDied, FHitComponent) == 0x000038, "Member 'AthenaAIPopulationTracker_OnFortPawnDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnFortPawnDied, BoneName) == 0x000040, "Member 'AthenaAIPopulationTracker_OnFortPawnDied::BoneName' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_OnFortPawnDied, Momentum) == 0x000048, "Member 'AthenaAIPopulationTracker_OnFortPawnDied::Momentum' has a wrong offset!");

// Function FortniteAI.AthenaAIPopulationTracker.GetAIMatchingQuery
// 0x0058 (0x0058 - 0x0000)
struct AthenaAIPopulationTracker_GetAIMatchingQuery final
{
public:
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AController*>                    ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIPopulationTracker_GetAIMatchingQuery) == 0x000008, "Wrong alignment on AthenaAIPopulationTracker_GetAIMatchingQuery");
static_assert(sizeof(AthenaAIPopulationTracker_GetAIMatchingQuery) == 0x000058, "Wrong size on AthenaAIPopulationTracker_GetAIMatchingQuery");
static_assert(offsetof(AthenaAIPopulationTracker_GetAIMatchingQuery, TagQuery) == 0x000000, "Member 'AthenaAIPopulationTracker_GetAIMatchingQuery::TagQuery' has a wrong offset!");
static_assert(offsetof(AthenaAIPopulationTracker_GetAIMatchingQuery, ReturnValue) == 0x000048, "Member 'AthenaAIPopulationTracker_GetAIMatchingQuery::ReturnValue' has a wrong offset!");

// Function FortniteAI.AthenaAIPopulationTracker.GetAIPopulationTrackerCount
// 0x0014 (0x0014 - 0x0000)
struct AthenaAIPopulationTracker_GetAIPopulationTrackerCount final
{
public:
	struct FAIPopulationCountSnapshot             ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIPopulationTracker_GetAIPopulationTrackerCount) == 0x000004, "Wrong alignment on AthenaAIPopulationTracker_GetAIPopulationTrackerCount");
static_assert(sizeof(AthenaAIPopulationTracker_GetAIPopulationTrackerCount) == 0x000014, "Wrong size on AthenaAIPopulationTracker_GetAIPopulationTrackerCount");
static_assert(offsetof(AthenaAIPopulationTracker_GetAIPopulationTrackerCount, ReturnValue) == 0x000000, "Member 'AthenaAIPopulationTracker_GetAIPopulationTrackerCount::ReturnValue' has a wrong offset!");

// Function FortniteAI.AthenaAIPopulationTracker.GetNumAIPawn
// 0x0004 (0x0004 - 0x0000)
struct AthenaAIPopulationTracker_GetNumAIPawn final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIPopulationTracker_GetNumAIPawn) == 0x000004, "Wrong alignment on AthenaAIPopulationTracker_GetNumAIPawn");
static_assert(sizeof(AthenaAIPopulationTracker_GetNumAIPawn) == 0x000004, "Wrong size on AthenaAIPopulationTracker_GetNumAIPawn");
static_assert(offsetof(AthenaAIPopulationTracker_GetNumAIPawn, ReturnValue) == 0x000000, "Member 'AthenaAIPopulationTracker_GetNumAIPawn::ReturnValue' has a wrong offset!");

// Function FortniteAI.AthenaAIPopulationTracker.GetNumNonAthenaParticipantBots
// 0x0004 (0x0004 - 0x0000)
struct AthenaAIPopulationTracker_GetNumNonAthenaParticipantBots final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIPopulationTracker_GetNumNonAthenaParticipantBots) == 0x000004, "Wrong alignment on AthenaAIPopulationTracker_GetNumNonAthenaParticipantBots");
static_assert(sizeof(AthenaAIPopulationTracker_GetNumNonAthenaParticipantBots) == 0x000004, "Wrong size on AthenaAIPopulationTracker_GetNumNonAthenaParticipantBots");
static_assert(offsetof(AthenaAIPopulationTracker_GetNumNonAthenaParticipantBots, ReturnValue) == 0x000000, "Member 'AthenaAIPopulationTracker_GetNumNonAthenaParticipantBots::ReturnValue' has a wrong offset!");

// Function FortniteAI.AthenaAIPopulationTracker.GetNumPlayerBots
// 0x0004 (0x0004 - 0x0000)
struct AthenaAIPopulationTracker_GetNumPlayerBots final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIPopulationTracker_GetNumPlayerBots) == 0x000004, "Wrong alignment on AthenaAIPopulationTracker_GetNumPlayerBots");
static_assert(sizeof(AthenaAIPopulationTracker_GetNumPlayerBots) == 0x000004, "Wrong size on AthenaAIPopulationTracker_GetNumPlayerBots");
static_assert(offsetof(AthenaAIPopulationTracker_GetNumPlayerBots, ReturnValue) == 0x000000, "Member 'AthenaAIPopulationTracker_GetNumPlayerBots::ReturnValue' has a wrong offset!");

// Function FortniteAI.AthenaAIPopulationTracker.GetNumTotalBots
// 0x0004 (0x0004 - 0x0000)
struct AthenaAIPopulationTracker_GetNumTotalBots final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIPopulationTracker_GetNumTotalBots) == 0x000004, "Wrong alignment on AthenaAIPopulationTracker_GetNumTotalBots");
static_assert(sizeof(AthenaAIPopulationTracker_GetNumTotalBots) == 0x000004, "Wrong size on AthenaAIPopulationTracker_GetNumTotalBots");
static_assert(offsetof(AthenaAIPopulationTracker_GetNumTotalBots, ReturnValue) == 0x000000, "Member 'AthenaAIPopulationTracker_GetNumTotalBots::ReturnValue' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.AddTargetInfo
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaAIBotController_AddTargetInfo final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceTarget;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerceptionState                              PerceptionState;                                   // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForgetTime;                                        // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForgetDistance;                                    // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaAIBotController_AddTargetInfo) == 0x000008, "Wrong alignment on FortAthenaAIBotController_AddTargetInfo");
static_assert(sizeof(FortAthenaAIBotController_AddTargetInfo) == 0x000018, "Wrong size on FortAthenaAIBotController_AddTargetInfo");
static_assert(offsetof(FortAthenaAIBotController_AddTargetInfo, Target) == 0x000000, "Member 'FortAthenaAIBotController_AddTargetInfo::Target' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_AddTargetInfo, bForceTarget) == 0x000008, "Member 'FortAthenaAIBotController_AddTargetInfo::bForceTarget' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_AddTargetInfo, PerceptionState) == 0x000009, "Member 'FortAthenaAIBotController_AddTargetInfo::PerceptionState' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_AddTargetInfo, ForgetTime) == 0x00000C, "Member 'FortAthenaAIBotController_AddTargetInfo::ForgetTime' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_AddTargetInfo, ForgetDistance) == 0x000010, "Member 'FortAthenaAIBotController_AddTargetInfo::ForgetDistance' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.AddTargetInfos
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaAIBotController_AddTargetInfos final
{
public:
	TArray<class AActor*>                         Targets;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EPerceptionState                              PerceptionState;                                   // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForgetTime;                                        // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForgetDistance;                                    // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaAIBotController_AddTargetInfos) == 0x000008, "Wrong alignment on FortAthenaAIBotController_AddTargetInfos");
static_assert(sizeof(FortAthenaAIBotController_AddTargetInfos) == 0x000020, "Wrong size on FortAthenaAIBotController_AddTargetInfos");
static_assert(offsetof(FortAthenaAIBotController_AddTargetInfos, Targets) == 0x000000, "Member 'FortAthenaAIBotController_AddTargetInfos::Targets' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_AddTargetInfos, PerceptionState) == 0x000010, "Member 'FortAthenaAIBotController_AddTargetInfos::PerceptionState' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_AddTargetInfos, ForgetTime) == 0x000014, "Member 'FortAthenaAIBotController_AddTargetInfos::ForgetTime' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_AddTargetInfos, ForgetDistance) == 0x000018, "Member 'FortAthenaAIBotController_AddTargetInfos::ForgetDistance' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.ChangeActiveVariantForCosmeticItem
// 0x000C (0x000C - 0x0000)
struct FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem final
{
public:
	class FName                                   ItemTemplateToChange;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VariantChannelToChange;                            // 0x0004(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DesiredActiveVariant;                              // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem) == 0x000004, "Wrong alignment on FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem");
static_assert(sizeof(FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem) == 0x00000C, "Wrong size on FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem");
static_assert(offsetof(FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem, ItemTemplateToChange) == 0x000000, "Member 'FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem::ItemTemplateToChange' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem, VariantChannelToChange) == 0x000004, "Member 'FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem::VariantChannelToChange' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem, DesiredActiveVariant) == 0x000008, "Member 'FortAthenaAIBotController_ChangeActiveVariantForCosmeticItem::DesiredActiveVariant' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.EquipBestWeapon
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIBotController_EquipBestWeapon final
{
public:
	class AFortWeapon*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_EquipBestWeapon) == 0x000008, "Wrong alignment on FortAthenaAIBotController_EquipBestWeapon");
static_assert(sizeof(FortAthenaAIBotController_EquipBestWeapon) == 0x000008, "Wrong size on FortAthenaAIBotController_EquipBestWeapon");
static_assert(offsetof(FortAthenaAIBotController_EquipBestWeapon, ReturnValue) == 0x000000, "Member 'FortAthenaAIBotController_EquipBestWeapon::ReturnValue' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.EquipMeleeWeapon
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIBotController_EquipMeleeWeapon final
{
public:
	class AFortWeapon*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_EquipMeleeWeapon) == 0x000008, "Wrong alignment on FortAthenaAIBotController_EquipMeleeWeapon");
static_assert(sizeof(FortAthenaAIBotController_EquipMeleeWeapon) == 0x000008, "Wrong size on FortAthenaAIBotController_EquipMeleeWeapon");
static_assert(offsetof(FortAthenaAIBotController_EquipMeleeWeapon, ReturnValue) == 0x000000, "Member 'FortAthenaAIBotController_EquipMeleeWeapon::ReturnValue' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.EquipWeapon
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotController_EquipWeapon final
{
public:
	const class UFortWorldItem*                   Weapon;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_EquipWeapon) == 0x000008, "Wrong alignment on FortAthenaAIBotController_EquipWeapon");
static_assert(sizeof(FortAthenaAIBotController_EquipWeapon) == 0x000010, "Wrong size on FortAthenaAIBotController_EquipWeapon");
static_assert(offsetof(FortAthenaAIBotController_EquipWeapon, Weapon) == 0x000000, "Member 'FortAthenaAIBotController_EquipWeapon::Weapon' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_EquipWeapon, ReturnValue) == 0x000008, "Member 'FortAthenaAIBotController_EquipWeapon::ReturnValue' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.EquipWeaponByTag
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotController_EquipWeaponByTag final
{
public:
	struct FGameplayTag                           WeaponTag;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_EquipWeaponByTag) == 0x000008, "Wrong alignment on FortAthenaAIBotController_EquipWeaponByTag");
static_assert(sizeof(FortAthenaAIBotController_EquipWeaponByTag) == 0x000010, "Wrong size on FortAthenaAIBotController_EquipWeaponByTag");
static_assert(offsetof(FortAthenaAIBotController_EquipWeaponByTag, WeaponTag) == 0x000000, "Member 'FortAthenaAIBotController_EquipWeaponByTag::WeaponTag' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_EquipWeaponByTag, ReturnValue) == 0x000008, "Member 'FortAthenaAIBotController_EquipWeaponByTag::ReturnValue' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.NotifyPickupsSpawnedOnDeath
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotController_NotifyPickupsSpawnedOnDeath final
{
public:
	TArray<class AFortPickup*>                    SpawnedPickups;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_NotifyPickupsSpawnedOnDeath) == 0x000008, "Wrong alignment on FortAthenaAIBotController_NotifyPickupsSpawnedOnDeath");
static_assert(sizeof(FortAthenaAIBotController_NotifyPickupsSpawnedOnDeath) == 0x000010, "Wrong size on FortAthenaAIBotController_NotifyPickupsSpawnedOnDeath");
static_assert(offsetof(FortAthenaAIBotController_NotifyPickupsSpawnedOnDeath, SpawnedPickups) == 0x000000, "Member 'FortAthenaAIBotController_NotifyPickupsSpawnedOnDeath::SpawnedPickups' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnAgentDBNO
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotController_OnAgentDBNO final
{
public:
	class AFortPawn*                              InPlayer;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsDBNO;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaAIBotController_OnAgentDBNO) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnAgentDBNO");
static_assert(sizeof(FortAthenaAIBotController_OnAgentDBNO) == 0x000010, "Wrong size on FortAthenaAIBotController_OnAgentDBNO");
static_assert(offsetof(FortAthenaAIBotController_OnAgentDBNO, InPlayer) == 0x000000, "Member 'FortAthenaAIBotController_OnAgentDBNO::InPlayer' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnAgentDBNO, bInIsDBNO) == 0x000008, "Member 'FortAthenaAIBotController_OnAgentDBNO::bInIsDBNO' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnAlertLevelChanged
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaAIBotController_OnAlertLevelChanged final
{
public:
	EAlertLevel                                   OldAlertLevel;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlertLevel                                   NewAlertLevel;                                     // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnAlertLevelChanged) == 0x000001, "Wrong alignment on FortAthenaAIBotController_OnAlertLevelChanged");
static_assert(sizeof(FortAthenaAIBotController_OnAlertLevelChanged) == 0x000002, "Wrong size on FortAthenaAIBotController_OnAlertLevelChanged");
static_assert(offsetof(FortAthenaAIBotController_OnAlertLevelChanged, OldAlertLevel) == 0x000000, "Member 'FortAthenaAIBotController_OnAlertLevelChanged::OldAlertLevel' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnAlertLevelChanged, NewAlertLevel) == 0x000001, "Member 'FortAthenaAIBotController_OnAlertLevelChanged::NewAlertLevel' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnBeginSpectating
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIBotController_OnBeginSpectating final
{
public:
	class AFortPlayerStateZone*                   Spectator;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnBeginSpectating) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnBeginSpectating");
static_assert(sizeof(FortAthenaAIBotController_OnBeginSpectating) == 0x000008, "Wrong size on FortAthenaAIBotController_OnBeginSpectating");
static_assert(offsetof(FortAthenaAIBotController_OnBeginSpectating, Spectator) == 0x000000, "Member 'FortAthenaAIBotController_OnBeginSpectating::Spectator' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnCurrentHarvestableDestroyed
// 0x0060 (0x0060 - 0x0000)
struct FortAthenaAIBotController_OnCurrentHarvestableDestroyed final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnCurrentHarvestableDestroyed");
static_assert(sizeof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed) == 0x000060, "Wrong size on FortAthenaAIBotController_OnCurrentHarvestableDestroyed");
static_assert(offsetof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed, DamagedActor) == 0x000000, "Member 'FortAthenaAIBotController_OnCurrentHarvestableDestroyed::DamagedActor' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed, Damage) == 0x000008, "Member 'FortAthenaAIBotController_OnCurrentHarvestableDestroyed::Damage' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed, InstigatedBy) == 0x000010, "Member 'FortAthenaAIBotController_OnCurrentHarvestableDestroyed::InstigatedBy' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed, DamageCauser) == 0x000018, "Member 'FortAthenaAIBotController_OnCurrentHarvestableDestroyed::DamageCauser' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed, HitLocation) == 0x000020, "Member 'FortAthenaAIBotController_OnCurrentHarvestableDestroyed::HitLocation' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed, FHitComponent) == 0x000038, "Member 'FortAthenaAIBotController_OnCurrentHarvestableDestroyed::FHitComponent' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed, BoneName) == 0x000040, "Member 'FortAthenaAIBotController_OnCurrentHarvestableDestroyed::BoneName' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnCurrentHarvestableDestroyed, Momentum) == 0x000048, "Member 'FortAthenaAIBotController_OnCurrentHarvestableDestroyed::Momentum' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnEndSpectating
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAIBotController_OnEndSpectating final
{
public:
	class AFortPlayerStateZone*                   Spectator;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnEndSpectating) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnEndSpectating");
static_assert(sizeof(FortAthenaAIBotController_OnEndSpectating) == 0x000008, "Wrong size on FortAthenaAIBotController_OnEndSpectating");
static_assert(offsetof(FortAthenaAIBotController_OnEndSpectating, Spectator) == 0x000000, "Member 'FortAthenaAIBotController_OnEndSpectating::Spectator' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnGamePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaAIBotController_OnGamePhaseChanged final
{
public:
	EAthenaGamePhase                              GamePhase;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnGamePhaseChanged) == 0x000001, "Wrong alignment on FortAthenaAIBotController_OnGamePhaseChanged");
static_assert(sizeof(FortAthenaAIBotController_OnGamePhaseChanged) == 0x000001, "Wrong size on FortAthenaAIBotController_OnGamePhaseChanged");
static_assert(offsetof(FortAthenaAIBotController_OnGamePhaseChanged, GamePhase) == 0x000000, "Member 'FortAthenaAIBotController_OnGamePhaseChanged::GamePhase' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnGamePhaseStepChanged
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaAIBotController_OnGamePhaseStepChanged final
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaAIBotController_OnGamePhaseStepChanged) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnGamePhaseStepChanged");
static_assert(sizeof(FortAthenaAIBotController_OnGamePhaseStepChanged) == 0x000018, "Wrong size on FortAthenaAIBotController_OnGamePhaseStepChanged");
static_assert(offsetof(FortAthenaAIBotController_OnGamePhaseStepChanged, SafeZoneInterface) == 0x000000, "Member 'FortAthenaAIBotController_OnGamePhaseStepChanged::SafeZoneInterface' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnGamePhaseStepChanged, GamePhaseStep) == 0x000010, "Member 'FortAthenaAIBotController_OnGamePhaseStepChanged::GamePhaseStep' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnKnockbacked
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaAIBotController_OnKnockbacked final
{
public:
	struct FGameplayTag                           KnockbackTypeTag;                                  // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnKnockbacked) == 0x000004, "Wrong alignment on FortAthenaAIBotController_OnKnockbacked");
static_assert(sizeof(FortAthenaAIBotController_OnKnockbacked) == 0x000004, "Wrong size on FortAthenaAIBotController_OnKnockbacked");
static_assert(offsetof(FortAthenaAIBotController_OnKnockbacked, KnockbackTypeTag) == 0x000000, "Member 'FortAthenaAIBotController_OnKnockbacked::KnockbackTypeTag' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnLaunched
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaAIBotController_OnLaunched final
{
public:
	struct FVector                                LaunchVelocity;                                    // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bXYOverride;                                       // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bZOverride;                                        // 0x0019(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaAIBotController_OnLaunched) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnLaunched");
static_assert(sizeof(FortAthenaAIBotController_OnLaunched) == 0x000020, "Wrong size on FortAthenaAIBotController_OnLaunched");
static_assert(offsetof(FortAthenaAIBotController_OnLaunched, LaunchVelocity) == 0x000000, "Member 'FortAthenaAIBotController_OnLaunched::LaunchVelocity' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnLaunched, bXYOverride) == 0x000018, "Member 'FortAthenaAIBotController_OnLaunched::bXYOverride' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnLaunched, bZOverride) == 0x000019, "Member 'FortAthenaAIBotController_OnLaunched::bZOverride' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnMovementModeChange
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotController_OnMovementModeChange final
{
public:
	class ACharacter*                             InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaAIBotController_OnMovementModeChange) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnMovementModeChange");
static_assert(sizeof(FortAthenaAIBotController_OnMovementModeChange) == 0x000010, "Wrong size on FortAthenaAIBotController_OnMovementModeChange");
static_assert(offsetof(FortAthenaAIBotController_OnMovementModeChange, InCharacter) == 0x000000, "Member 'FortAthenaAIBotController_OnMovementModeChange::InCharacter' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnMovementModeChange, PrevMovementMode) == 0x000008, "Member 'FortAthenaAIBotController_OnMovementModeChange::PrevMovementMode' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnMovementModeChange, PreviousCustomMode) == 0x000009, "Member 'FortAthenaAIBotController_OnMovementModeChange::PreviousCustomMode' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnPawnDidDamage
// 0x0060 (0x0060 - 0x0000)
struct FortAthenaAIBotController_OnPawnDidDamage final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnPawnDidDamage) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnPawnDidDamage");
static_assert(sizeof(FortAthenaAIBotController_OnPawnDidDamage) == 0x000060, "Wrong size on FortAthenaAIBotController_OnPawnDidDamage");
static_assert(offsetof(FortAthenaAIBotController_OnPawnDidDamage, DamagedActor) == 0x000000, "Member 'FortAthenaAIBotController_OnPawnDidDamage::DamagedActor' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPawnDidDamage, Damage) == 0x000008, "Member 'FortAthenaAIBotController_OnPawnDidDamage::Damage' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPawnDidDamage, InstigatedBy) == 0x000010, "Member 'FortAthenaAIBotController_OnPawnDidDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPawnDidDamage, DamageCauser) == 0x000018, "Member 'FortAthenaAIBotController_OnPawnDidDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPawnDidDamage, HitLocation) == 0x000020, "Member 'FortAthenaAIBotController_OnPawnDidDamage::HitLocation' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPawnDidDamage, HitComponent) == 0x000038, "Member 'FortAthenaAIBotController_OnPawnDidDamage::HitComponent' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPawnDidDamage, BoneName) == 0x000040, "Member 'FortAthenaAIBotController_OnPawnDidDamage::BoneName' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPawnDidDamage, Momentum) == 0x000048, "Member 'FortAthenaAIBotController_OnPawnDidDamage::Momentum' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnPawnWeaponChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaAIBotController_OnPawnWeaponChanged final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            OldWeapon;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnPawnWeaponChanged) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnPawnWeaponChanged");
static_assert(sizeof(FortAthenaAIBotController_OnPawnWeaponChanged) == 0x000010, "Wrong size on FortAthenaAIBotController_OnPawnWeaponChanged");
static_assert(offsetof(FortAthenaAIBotController_OnPawnWeaponChanged, NewWeapon) == 0x000000, "Member 'FortAthenaAIBotController_OnPawnWeaponChanged::NewWeapon' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPawnWeaponChanged, OldWeapon) == 0x000008, "Member 'FortAthenaAIBotController_OnPawnWeaponChanged::OldWeapon' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnPerceptionSensed
// 0x0058 (0x0058 - 0x0000)
struct FortAthenaAIBotController_OnPerceptionSensed final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIStimulus                            Stim;                                              // 0x0008(0x0050)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnPerceptionSensed) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnPerceptionSensed");
static_assert(sizeof(FortAthenaAIBotController_OnPerceptionSensed) == 0x000058, "Wrong size on FortAthenaAIBotController_OnPerceptionSensed");
static_assert(offsetof(FortAthenaAIBotController_OnPerceptionSensed, SourceActor) == 0x000000, "Member 'FortAthenaAIBotController_OnPerceptionSensed::SourceActor' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPerceptionSensed, Stim) == 0x000008, "Member 'FortAthenaAIBotController_OnPerceptionSensed::Stim' has a wrong offset!");

// Function FortniteAI.FortAthenaAIBotController.OnPossesedPawnDied
// 0x0060 (0x0060 - 0x0000)
struct FortAthenaAIBotController_OnPossesedPawnDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaAIBotController_OnPossesedPawnDied) == 0x000008, "Wrong alignment on FortAthenaAIBotController_OnPossesedPawnDied");
static_assert(sizeof(FortAthenaAIBotController_OnPossesedPawnDied) == 0x000060, "Wrong size on FortAthenaAIBotController_OnPossesedPawnDied");
static_assert(offsetof(FortAthenaAIBotController_OnPossesedPawnDied, DamagedActor) == 0x000000, "Member 'FortAthenaAIBotController_OnPossesedPawnDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPossesedPawnDied, Damage) == 0x000008, "Member 'FortAthenaAIBotController_OnPossesedPawnDied::Damage' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPossesedPawnDied, InstigatedBy) == 0x000010, "Member 'FortAthenaAIBotController_OnPossesedPawnDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPossesedPawnDied, DamageCauser) == 0x000018, "Member 'FortAthenaAIBotController_OnPossesedPawnDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(FortAthenaAIBotController_OnPossesedPawnDied, HitLocation) == 0x000020, "Member 'FortAthenaAIBotController_OnPossesedPawnDied::HitLocation' has a wrong offset!");
