#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Player_PostProcessProceduralFixUp_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Fortnite_Player_PostProcessProceduralFixUp_AnimBP.Fortnite_Player_PostProcessProceduralFixUp_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01DF (0x01E0 - 0x0001)
struct Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_708;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_709;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_710;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_711;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_712;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_713;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_714;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_715;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_716;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_717;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_718;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_719;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_720;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_721;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_722;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_723;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_724;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_725;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_726;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_727;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_728;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_729;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_730;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_731;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_732;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_733;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_734;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_735;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_736;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_737;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_738;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_739;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_740;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_741;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_742;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_743;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_744;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_745;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_746;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_747;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_748;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_749;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_750;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_751;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_752;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_753;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_754;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_755;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_756;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_757;                               // 0x00E8(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_758;                               // 0x00F8(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_759;                                // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_760;                                  // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_761;                                // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_762;                                // 0x0119(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_763;                                // 0x011A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_764;                               // 0x0120(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_765;                              // 0x0130(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C8(0x0018)()
};
static_assert(alignof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001E0, "Wrong size on Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_708) == 0x000004, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_708' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_709) == 0x000008, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_709' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_710) == 0x00000C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_710' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_711) == 0x000010, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_711' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_712) == 0x000014, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_712' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_713) == 0x000018, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_713' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_714) == 0x00001C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_714' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_715) == 0x000020, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_715' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_716) == 0x000024, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_716' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_717) == 0x000028, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_717' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_718) == 0x00002C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_718' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_719) == 0x000030, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_719' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_720) == 0x000034, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_720' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_721) == 0x000038, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_721' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_722) == 0x00003C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_722' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_723) == 0x000040, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_723' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_724) == 0x000044, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_724' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_725) == 0x000048, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_725' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_726) == 0x00004C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_726' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_727) == 0x000050, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_727' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_728) == 0x000054, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_728' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_729) == 0x000058, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_729' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_730) == 0x00005C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_730' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_731) == 0x000060, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_731' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_732) == 0x000064, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_732' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_733) == 0x000068, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_733' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_734) == 0x00006C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_734' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_735) == 0x000070, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_735' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_736) == 0x000074, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_736' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_737) == 0x000078, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_737' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_738) == 0x00007C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_738' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_739) == 0x000080, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_739' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_740) == 0x000084, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_740' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_741) == 0x000088, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_741' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_742) == 0x00008C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_742' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_743) == 0x000090, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_743' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_744) == 0x000094, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_744' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_745) == 0x000098, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_745' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_746) == 0x00009C, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_746' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_747) == 0x0000A0, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_747' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_748) == 0x0000A4, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_748' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_749) == 0x0000A8, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_749' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_750) == 0x0000B8, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_750' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_751) == 0x0000BC, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_751' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_752) == 0x0000C0, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_752' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_753) == 0x0000C8, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_753' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_754) == 0x0000D8, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_754' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_755) == 0x0000DC, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_755' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_756) == 0x0000E0, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_756' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_757) == 0x0000E8, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_757' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_758) == 0x0000F8, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_758' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_759) == 0x000108, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_759' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_760) == 0x000110, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_760' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_761) == 0x000118, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_761' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_762) == 0x000119, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_762' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_763) == 0x00011A, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_763' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_764) == 0x000120, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_764' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_765) == 0x000130, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_765' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000148, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C8, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Fortnite_Player_PostProcessProceduralFixUp_AnimBP.Fortnite_Player_PostProcessProceduralFixUp_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0009 (0x000A - 0x0001)
struct Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0006(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_5;                                  // 0x0007(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00000A, "Wrong size on Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Fortnite_Player_PostProcessProceduralFixUp_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
