#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteGameFramework

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// Class FortniteGameFramework.FGF_GameMode
// 0x0058 (0x03B0 - 0x0358)
class AFGF_GameMode : public AGameMode
{
public:
	uint8                                         Pad_358[0x58];                                     // 0x0358(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_GameMode">();
	}
	static class AFGF_GameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_GameMode>();
	}
};
static_assert(alignof(AFGF_GameMode) == 0x000008, "Wrong alignment on AFGF_GameMode");
static_assert(sizeof(AFGF_GameMode) == 0x0003B0, "Wrong size on AFGF_GameMode");

// Class FortniteGameFramework.FGF_PlayerController
// 0x0058 (0x0818 - 0x07C0)
class AFGF_PlayerController : public APlayerController
{
public:
	uint8                                         Pad_7C0[0x58];                                     // 0x07C0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_PlayerController">();
	}
	static class AFGF_PlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_PlayerController>();
	}
};
static_assert(alignof(AFGF_PlayerController) == 0x000008, "Wrong alignment on AFGF_PlayerController");
static_assert(sizeof(AFGF_PlayerController) == 0x000818, "Wrong size on AFGF_PlayerController");

// Class FortniteGameFramework.StateTreeTaskObject
// 0x0008 (0x0040 - 0x0038)
class UStateTreeTaskObject final : public UStateTreeTaskBlueprintBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeTaskObject">();
	}
	static class UStateTreeTaskObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeTaskObject>();
	}
};
static_assert(alignof(UStateTreeTaskObject) == 0x000008, "Wrong alignment on UStateTreeTaskObject");
static_assert(sizeof(UStateTreeTaskObject) == 0x000040, "Wrong size on UStateTreeTaskObject");

// Class FortniteGameFramework.FGF_GameState
// 0x0058 (0x0330 - 0x02D8)
class AFGF_GameState : public AGameState
{
public:
	uint8                                         Pad_2D8[0x58];                                     // 0x02D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_GameState">();
	}
	static class AFGF_GameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_GameState>();
	}
};
static_assert(alignof(AFGF_GameState) == 0x000008, "Wrong alignment on AFGF_GameState");
static_assert(sizeof(AFGF_GameState) == 0x000330, "Wrong size on AFGF_GameState");

// Class FortniteGameFramework.FGF_Pawn
// 0x0060 (0x0650 - 0x05F0)
class AFGF_Pawn : public ACharacter
{
public:
	uint8                                         Pad_5F0[0x60];                                     // 0x05F0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_Pawn">();
	}
	static class AFGF_Pawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_Pawn>();
	}
};
static_assert(alignof(AFGF_Pawn) == 0x000010, "Wrong alignment on AFGF_Pawn");
static_assert(sizeof(AFGF_Pawn) == 0x000650, "Wrong size on AFGF_Pawn");

// Class FortniteGameFramework.FGF_PlayerState
// 0x0058 (0x03D8 - 0x0380)
class AFGF_PlayerState : public APlayerState
{
public:
	uint8                                         Pad_380[0x58];                                     // 0x0380(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_PlayerState">();
	}
	static class AFGF_PlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_PlayerState>();
	}
};
static_assert(alignof(AFGF_PlayerState) == 0x000008, "Wrong alignment on AFGF_PlayerState");
static_assert(sizeof(AFGF_PlayerState) == 0x0003D8, "Wrong size on AFGF_PlayerState");

// Class FortniteGameFramework.ObjectBasedStateTreeSchema
// 0x0000 (0x0028 - 0x0028)
class UObjectBasedStateTreeSchema final : public UStateTreeSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectBasedStateTreeSchema">();
	}
	static class UObjectBasedStateTreeSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectBasedStateTreeSchema>();
	}
};
static_assert(alignof(UObjectBasedStateTreeSchema) == 0x000008, "Wrong alignment on UObjectBasedStateTreeSchema");
static_assert(sizeof(UObjectBasedStateTreeSchema) == 0x000028, "Wrong size on UObjectBasedStateTreeSchema");

}

