#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Player_FullBody_LinkedGraph_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Fortnite_Player_FullBody_LinkedGraph_Template.Fortnite_Player_FullBody_LinkedGraph_Template_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_7;                                  // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_8;                                  // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_9;                                // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_7) == 0x000004, "Member 'Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_7' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_8) == 0x000008, "Member 'Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_8' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData, __StructProperty_9) == 0x000010, "Member 'Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData::__StructProperty_9' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'Fortnite_Player_FullBody_LinkedGraph_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

