#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortRadioButtonGroup

#include "Basic.hpp"

#include "FortRadioButtonItemStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortRadioButtonGroup.FortRadioButtonGroup_C
// 0x0068 (0x0320 - 0x02B8)
class UFortRadioButtonGroup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_Buttons;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Buttons;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FFortRadioButtonItemStruct>     Buttons;                                           // 0x02D0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UIconTextButton_C*>              CreatedButtons;                                    // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void(int32 SelectedIndex)> RadioButtonClicked_Event;                          // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         WidthOverride;                                     // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonGroupLegacy*               CreatedButtonsGroup;                               // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CommonButtonGroup;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeightOverride;                                    // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CenterOnWidget();
	void Destruct();
	void ExecuteUbergraph_FortRadioButtonGroup(int32 EntryPoint);
	void OnButtonClicked_Bind(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex);
	void UpdateButtons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortRadioButtonGroup_C">();
	}
	static class UFortRadioButtonGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRadioButtonGroup_C>();
	}
};
static_assert(alignof(UFortRadioButtonGroup_C) == 0x000008, "Wrong alignment on UFortRadioButtonGroup_C");
static_assert(sizeof(UFortRadioButtonGroup_C) == 0x000320, "Wrong size on UFortRadioButtonGroup_C");
static_assert(offsetof(UFortRadioButtonGroup_C, UberGraphFrame) == 0x0002B8, "Member 'UFortRadioButtonGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, SizeBox_Buttons) == 0x0002C0, "Member 'UFortRadioButtonGroup_C::SizeBox_Buttons' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, VerticalBox_Buttons) == 0x0002C8, "Member 'UFortRadioButtonGroup_C::VerticalBox_Buttons' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, Buttons) == 0x0002D0, "Member 'UFortRadioButtonGroup_C::Buttons' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, CreatedButtons) == 0x0002E0, "Member 'UFortRadioButtonGroup_C::CreatedButtons' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, RadioButtonClicked_Event) == 0x0002F0, "Member 'UFortRadioButtonGroup_C::RadioButtonClicked_Event' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, WidthOverride) == 0x000300, "Member 'UFortRadioButtonGroup_C::WidthOverride' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, CreatedButtonsGroup) == 0x000308, "Member 'UFortRadioButtonGroup_C::CreatedButtonsGroup' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, CommonButtonGroup) == 0x000310, "Member 'UFortRadioButtonGroup_C::CommonButtonGroup' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, HeightOverride) == 0x000318, "Member 'UFortRadioButtonGroup_C::HeightOverride' has a wrong offset!");

}

