#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Player_FullBody_LinkedGraph_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fortnite_Player_FullBody_LinkedGraph_Template.Fortnite_Player_FullBody_LinkedGraph_Template_C
// 0x01C0 (0x0510 - 0x0350)
class UFortnite_Player_FullBody_LinkedGraph_Template_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0388(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0448(0x00C0)()

public:
	void AnimGraph(const struct FPoseLink& UpperAndLowerBodyInPose, const struct FPoseLink& UpperBodyInPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Fortnite_Player_FullBody_LinkedGraph_Template(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fortnite_Player_FullBody_LinkedGraph_Template_C">();
	}
	static class UFortnite_Player_FullBody_LinkedGraph_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortnite_Player_FullBody_LinkedGraph_Template_C>();
	}
};
static_assert(alignof(UFortnite_Player_FullBody_LinkedGraph_Template_C) == 0x000010, "Wrong alignment on UFortnite_Player_FullBody_LinkedGraph_Template_C");
static_assert(sizeof(UFortnite_Player_FullBody_LinkedGraph_Template_C) == 0x000510, "Wrong size on UFortnite_Player_FullBody_LinkedGraph_Template_C");
static_assert(offsetof(UFortnite_Player_FullBody_LinkedGraph_Template_C, UberGraphFrame) == 0x000350, "Member 'UFortnite_Player_FullBody_LinkedGraph_Template_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_FullBody_LinkedGraph_Template_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UFortnite_Player_FullBody_LinkedGraph_Template_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_FullBody_LinkedGraph_Template_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UFortnite_Player_FullBody_LinkedGraph_Template_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_FullBody_LinkedGraph_Template_C, AnimGraphNode_Root) == 0x000368, "Member 'UFortnite_Player_FullBody_LinkedGraph_Template_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_FullBody_LinkedGraph_Template_C, AnimGraphNode_LinkedInputPose_1) == 0x000388, "Member 'UFortnite_Player_FullBody_LinkedGraph_Template_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UFortnite_Player_FullBody_LinkedGraph_Template_C, AnimGraphNode_LinkedInputPose) == 0x000448, "Member 'UFortnite_Player_FullBody_LinkedGraph_Template_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

