#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendCamera_Inspect

#include "Basic.hpp"


namespace SDK::Params
{

// Function FrontendCamera_Inspect.FrontendCamera_Inspect_C.ExecuteUbergraph_FrontendCamera_Inspect
// 0x0090 (0x0090 - 0x0000)
struct FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_Event_PlayerController_1;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	TArray<class AVaultCharacterLightingBP_C*>    CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0038(0x0010)(ReferenceParm)
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVaultCharacterLightingBP_C*            CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_Event_PlayerController;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AVaultCharacterLightingBP_C*>    CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0068(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVaultCharacterLightingBP_C*            CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect) == 0x000008, "Wrong alignment on FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect");
static_assert(sizeof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect) == 0x000090, "Wrong size on FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, EntryPoint) == 0x000000, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, Temp_int_Array_Index_Variable) == 0x000004, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, K2Node_Event_PlayerController_1) == 0x000008, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::K2Node_Event_PlayerController_1' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue) == 0x000010, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000018, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_IsInZone_ReturnValue) == 0x000020, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000038, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_Array_Get_Item) == 0x000048, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, K2Node_Event_PlayerController) == 0x000060, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::K2Node_Event_PlayerController' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000068, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'FrontendCamera_Inspect_C_ExecuteUbergraph_FrontendCamera_Inspect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function FrontendCamera_Inspect.FrontendCamera_Inspect_C.BP_OnDeactivated
// 0x0008 (0x0008 - 0x0000)
struct FrontendCamera_Inspect_C_BP_OnDeactivated final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendCamera_Inspect_C_BP_OnDeactivated) == 0x000008, "Wrong alignment on FrontendCamera_Inspect_C_BP_OnDeactivated");
static_assert(sizeof(FrontendCamera_Inspect_C_BP_OnDeactivated) == 0x000008, "Wrong size on FrontendCamera_Inspect_C_BP_OnDeactivated");
static_assert(offsetof(FrontendCamera_Inspect_C_BP_OnDeactivated, PlayerController) == 0x000000, "Member 'FrontendCamera_Inspect_C_BP_OnDeactivated::PlayerController' has a wrong offset!");

// Function FrontendCamera_Inspect.FrontendCamera_Inspect_C.BP_OnActivated
// 0x0008 (0x0008 - 0x0000)
struct FrontendCamera_Inspect_C_BP_OnActivated final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendCamera_Inspect_C_BP_OnActivated) == 0x000008, "Wrong alignment on FrontendCamera_Inspect_C_BP_OnActivated");
static_assert(sizeof(FrontendCamera_Inspect_C_BP_OnActivated) == 0x000008, "Wrong size on FrontendCamera_Inspect_C_BP_OnActivated");
static_assert(offsetof(FrontendCamera_Inspect_C_BP_OnActivated, PlayerController) == 0x000000, "Member 'FrontendCamera_Inspect_C_BP_OnActivated::PlayerController' has a wrong offset!");

}

