#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendItemViewSettingsManager

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C.GetItemViewSettings
// 0x02B0 (0x02B0 - 0x0000)
struct FrontendItemViewSettingsManager_C_GetItemViewSettings final
{
public:
	EFrontEndCamera                               Camera;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      GameMode;                                          // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemDefinition*              ItemDefinition;                                    // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubslotIndex;                                      // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemViewSettings                  ReturnValue;                                       // 0x0018(0x0050)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FFortItemViewSettings                  Return_Value;                                      // 0x0068(0x0050)(Edit, BlueprintVisible, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue;  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue_1; // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaToyItemDefinition*               K2Node_DynamicCast_AsAthena_Toy_Item_Definition;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue_1;                // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue;              // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue_1;            // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue_2;                // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue_2;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSprayItemDefinition*             K2Node_DynamicCast_AsAthena_Spray_Item_Definition; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSkyDiveContrailItemDefinition*   K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPetCarrierItemDefinition*        K2Node_DynamicCast_AsAthena_Pet_Carrier_Item_Definition; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue_3;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaGliderItemDefinition*            K2Node_DynamicCast_AsAthena_Glider_Item_Definition; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetTemplateType_ReturnValue_3;            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPickaxeItemDefinition*           K2Node_DynamicCast_AsAthena_Pickaxe_Item_Definition; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsZero_ReturnValue;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsZero_ReturnValue_1;              // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue; // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array_1;                          // 0x0148(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array_2;                          // 0x0160(0x0010)(ConstParm, ReferenceParm)
	TArray<EFortItemType>                         K2Node_MakeArray_Array_3;                          // 0x0170(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_4;                          // 0x0188(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_4;             // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_5;                          // 0x01A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_5;             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound;                 // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_1;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            K2Node_MakeStruct_FloatRange;                      // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_2;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_6;                          // 0x01E8(0x0010)(ConstParm, ReferenceParm)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_3;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_6;             // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            K2Node_MakeStruct_FloatRange_1;                    // 0x0204(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_4;               // 0x0214(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_2;           // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortItemType>                         K2Node_MakeArray_Array_7;                          // 0x0220(0x0010)(ConstParm, ReferenceParm)
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_5;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_7;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            K2Node_MakeStruct_FloatRange_2;                    // 0x023C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_8;                          // 0x0250(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_8;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_9;                          // 0x0268(0x0010)(ConstParm, ReferenceParm)
	float                                         Temp_float_Variable;                               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_9;             // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_10;                         // 0x0280(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_10;            // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_293[0x1];                                      // 0x0293(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortItemType>                         K2Node_MakeArray_Array_11;                         // 0x0298(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue_11;            // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendItemViewSettingsManager_C_GetItemViewSettings) == 0x000008, "Wrong alignment on FrontendItemViewSettingsManager_C_GetItemViewSettings");
static_assert(sizeof(FrontendItemViewSettingsManager_C_GetItemViewSettings) == 0x0002B0, "Wrong size on FrontendItemViewSettingsManager_C_GetItemViewSettings");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Camera) == 0x000000, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Camera' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, GameMode) == 0x000001, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::GameMode' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, ItemDefinition) == 0x000008, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::ItemDefinition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, SubslotIndex) == 0x000010, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::SubslotIndex' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, ReturnValue) == 0x000018, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Return_Value) == 0x000068, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Return_Value' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue) == 0x0000B9, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue_1) == 0x0000BA, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Is_Hero_or_Previews_on_Hero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Toy_Item_Definition) == 0x0000C0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Toy_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue) == 0x0000C9, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue_1) == 0x0000CA, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue) == 0x0000CB, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue_1) == 0x0000CC, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000CD, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue_2) == 0x0000CE, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanAND_ReturnValue) == 0x0000CF, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue_2) == 0x0000D0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Spray_Item_Definition) == 0x0000D8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Spray_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition) == 0x0000E8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Not_PreBool_ReturnValue) == 0x0000F1, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Pet_Carrier_Item_Definition) == 0x0000F8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Pet_Carrier_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_3) == 0x000100, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanAND_ReturnValue_1) == 0x000101, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_SelectFloat_ReturnValue) == 0x000104, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetItemType_ReturnValue_3) == 0x000108, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetItemType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Glider_Item_Definition) == 0x000110, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Glider_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_4) == 0x000118, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_GetTemplateType_ReturnValue_3) == 0x000119, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_GetTemplateType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_AsAthena_Pickaxe_Item_Definition) == 0x000120, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_AsAthena_Pickaxe_Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_DynamicCast_bSuccess_5) == 0x000128, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Vector_IsZero_ReturnValue) == 0x000129, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Vector_IsZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Vector_IsZero_ReturnValue_1) == 0x00012A, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Vector_IsZero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue) == 0x00012B, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00012C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00012D, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array) == 0x000130, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue) == 0x000140, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_1) == 0x000148, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_1) == 0x000158, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_2) == 0x000160, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_3) == 0x000170, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_2) == 0x000180, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_3) == 0x000181, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanAND_ReturnValue_2) == 0x000182, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_4) == 0x000188, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_4) == 0x000198, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_5) == 0x0001A0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_5) == 0x0001B0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0001B4, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound) == 0x0001B8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_1) == 0x0001C0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange) == 0x0001C8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_2) == 0x0001D8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x0001E0, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_6) == 0x0001E8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_3) == 0x0001F8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_3' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_6) == 0x000200, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange_1) == 0x000204, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange_1' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_4) == 0x000214, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_4' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_MakeLiteralFloat_ReturnValue_2) == 0x00021C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_MakeLiteralFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_7) == 0x000220, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRangeBound_5) == 0x000230, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRangeBound_5' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_7) == 0x000238, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeStruct_FloatRange_2) == 0x00023C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeStruct_FloatRange_2' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_8) == 0x000250, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_8) == 0x000260, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_9) == 0x000268, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_9' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Temp_float_Variable) == 0x000278, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_9) == 0x00027C, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_10) == 0x000280, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_10' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_10) == 0x000290, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, Temp_bool_Variable) == 0x000291, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanOR_ReturnValue) == 0x000292, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_Select_Default) == 0x000294, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, K2Node_MakeArray_Array_11) == 0x000298, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::K2Node_MakeArray_Array_11' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_Array_Contains_ReturnValue_11) == 0x0002A8, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_Array_Contains_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_GetItemViewSettings, CallFunc_BooleanOR_ReturnValue_1) == 0x0002A9, "Member 'FrontendItemViewSettingsManager_C_GetItemViewSettings::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C.Is Hero or Previews on Hero
// 0x0028 (0x0028 - 0x0000)
struct FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero final
{
public:
	class UFortItemDefinition*                    Item_Definition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubslotIndex;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_ShouldShowPreviewOnCurrentHero_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero) == 0x000008, "Wrong alignment on FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero");
static_assert(sizeof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero) == 0x000028, "Wrong size on FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, Item_Definition) == 0x000000, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::Item_Definition' has a wrong offset!");
static_assert(offsetof(FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero, SubslotIndex) == 0x000008, "Member 'FrontendItemViewSettingsManager_C_Is_Hero_or_Previews_on_Hero::SubslotIndex' has a wrong offset!");
