#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ZipLine_ReachedEnd

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_ZipLine_ReachedEnd.GA_Athena_ZipLine_ReachedEnd_C.ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd
// 0x0158 (0x0158 - 0x0000)
struct GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd) == 0x000008, "Wrong alignment on GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd");
static_assert(sizeof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd) == 0x000158, "Wrong size on GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, EntryPoint) == 0x000000, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_GetVelocity_ReturnValue) == 0x000010, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_GetVelocity_ReturnValue_1) == 0x000028, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_VSize_ReturnValue) == 0x000040, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_BreakVector_X) == 0x000044, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_BreakVector_Y) == 0x000048, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_BreakVector_Z) == 0x00004C, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Less_FloatFloat_ReturnValue) == 0x000050, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_BreakVector_X_1) == 0x000054, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_BreakVector_Y_1) == 0x000058, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_BreakVector_Z_1) == 0x00005C, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000078, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00007C, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000080, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000088, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A0, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Normal_ReturnValue) == 0x0000A8, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_FClamp_ReturnValue) == 0x0000C0, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000C8, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000E0, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_BreakVector_X_2) == 0x0000E4, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_BreakVector_Y_2) == 0x0000E8, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_BreakVector_Z_2) == 0x0000EC, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000F0, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000F4, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_VSizeSquared_ReturnValue) == 0x0000F8, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000FC, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000100, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, K2Node_Event_bWasCancelled) == 0x000108, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000110, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x00011C, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_FMax_ReturnValue) == 0x000120, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_MakeVector_ReturnValue_1) == 0x000128, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd, CallFunc_MakeVector_ReturnValue_2) == 0x000140, "Member 'GA_Athena_ZipLine_ReachedEnd_C_ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");

// Function GA_Athena_ZipLine_ReachedEnd.GA_Athena_ZipLine_ReachedEnd_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_ZipLine_ReachedEnd_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ZipLine_ReachedEnd_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_ZipLine_ReachedEnd_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_ZipLine_ReachedEnd_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_ZipLine_ReachedEnd_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_ZipLine_ReachedEnd_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_ZipLine_ReachedEnd_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

