#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Lockout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Lockout.GA_Athena_Lockout_C
// 0x0018 (0x0B28 - 0x0B10)
class UGA_Athena_Lockout_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           Timer_LockoutFailsafe;                             // 0x0B18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LockoutFailsafeTime;                               // 0x0B20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Lockout(int32 EntryPoint);
	void FailedToActivatePassiveAbility();
	void Failsafe();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Lockout_C">();
	}
	static class UGA_Athena_Lockout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Lockout_C>();
	}
};
static_assert(alignof(UGA_Athena_Lockout_C) == 0x000008, "Wrong alignment on UGA_Athena_Lockout_C");
static_assert(sizeof(UGA_Athena_Lockout_C) == 0x000B28, "Wrong size on UGA_Athena_Lockout_C");
static_assert(offsetof(UGA_Athena_Lockout_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Athena_Lockout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Lockout_C, Timer_LockoutFailsafe) == 0x000B18, "Member 'UGA_Athena_Lockout_C::Timer_LockoutFailsafe' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Lockout_C, LockoutFailsafeTime) == 0x000B20, "Member 'UGA_Athena_Lockout_C::LockoutFailsafeTime' has a wrong offset!");

}

