#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HappyGhost_Passive

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_HappyGhost_Passive.GA_Athena_HappyGhost_Passive_C
// 0x0050 (0x0B60 - 0x0B10)
class UGA_Athena_HappyGhost_Passive_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 GE_Active;                                         // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_Active;                                          // 0x0B20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AB_HappyGhost_Athena_C*                 Weapon;                                            // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        FortPawn;                                          // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FailsafeDelay;                                     // 0x0B50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B54[0x4];                                      // 0x0B54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             OutOfChargesSound;                                 // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_HappyGhost_Passive(int32 EntryPoint);
	void ForceEnd();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_7857FA3D409C8FB0381EC7B9126A8525(class FName NotifyName);
	void OnCompleted_7857FA3D409C8FB0381EC7B9126A8525(class FName NotifyName);
	void OnInterrupted_7857FA3D409C8FB0381EC7B9126A8525(class FName NotifyName);
	void OnNotifyBegin_7857FA3D409C8FB0381EC7B9126A8525(class FName NotifyName);
	void OnNotifyEnd_7857FA3D409C8FB0381EC7B9126A8525(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_HappyGhost_Passive_C">();
	}
	static class UGA_Athena_HappyGhost_Passive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_HappyGhost_Passive_C>();
	}
};
static_assert(alignof(UGA_Athena_HappyGhost_Passive_C) == 0x000008, "Wrong alignment on UGA_Athena_HappyGhost_Passive_C");
static_assert(sizeof(UGA_Athena_HappyGhost_Passive_C) == 0x000B60, "Wrong size on UGA_Athena_HappyGhost_Passive_C");
static_assert(offsetof(UGA_Athena_HappyGhost_Passive_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Athena_HappyGhost_Passive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HappyGhost_Passive_C, GE_Active) == 0x000B18, "Member 'UGA_Athena_HappyGhost_Passive_C::GE_Active' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HappyGhost_Passive_C, T_Active) == 0x000B20, "Member 'UGA_Athena_HappyGhost_Passive_C::T_Active' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HappyGhost_Passive_C, Weapon) == 0x000B40, "Member 'UGA_Athena_HappyGhost_Passive_C::Weapon' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HappyGhost_Passive_C, FortPawn) == 0x000B48, "Member 'UGA_Athena_HappyGhost_Passive_C::FortPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HappyGhost_Passive_C, FailsafeDelay) == 0x000B50, "Member 'UGA_Athena_HappyGhost_Passive_C::FailsafeDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HappyGhost_Passive_C, OutOfChargesSound) == 0x000B58, "Member 'UGA_Athena_HappyGhost_Passive_C::OutOfChargesSound' has a wrong offset!");

}

