#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Skytube_BreakBuildings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Skytube_BreakBuildings.GA_Athena_Skytube_BreakBuildings_C
// 0x0040 (0x0B50 - 0x0B10)
class UGA_Athena_Skytube_BreakBuildings_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0B20(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0B38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayerCapsuleHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void ExecuteUbergraph_GA_Athena_Skytube_BreakBuildings(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Skytube_BreakBuildings_C">();
	}
	static class UGA_Athena_Skytube_BreakBuildings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Skytube_BreakBuildings_C>();
	}
};
static_assert(alignof(UGA_Athena_Skytube_BreakBuildings_C) == 0x000008, "Wrong alignment on UGA_Athena_Skytube_BreakBuildings_C");
static_assert(sizeof(UGA_Athena_Skytube_BreakBuildings_C) == 0x000B50, "Wrong size on UGA_Athena_Skytube_BreakBuildings_C");
static_assert(offsetof(UGA_Athena_Skytube_BreakBuildings_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Athena_Skytube_BreakBuildings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Skytube_BreakBuildings_C, PlayerPawn) == 0x000B18, "Member 'UGA_Athena_Skytube_BreakBuildings_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Skytube_BreakBuildings_C, HitLocation) == 0x000B20, "Member 'UGA_Athena_Skytube_BreakBuildings_C::HitLocation' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Skytube_BreakBuildings_C, HitNormal) == 0x000B38, "Member 'UGA_Athena_Skytube_BreakBuildings_C::HitNormal' has a wrong offset!");

}

