#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent.GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C
// 0x01B0 (0x0CC0 - 0x0B10)
class UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    ProjectileReference;                               // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceFromInstigatorCheck;                       // 0x0B28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileSpeedMin;                                // 0x0B2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileSpeedMax;                                // 0x0B30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TrajectoryProjectileGravityScaleCorrection;        // 0x0B34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProjectileTargetingOriginOffset;                   // 0x0B38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DummyShouldBounce;                                 // 0x0B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B51[0x3];                                      // 0x0B51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DummyBounciness;                                   // 0x0B54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyFriction;                                     // 0x0B58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyMaxSpeed;                                     // 0x0B5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyGravity;                                      // 0x0B60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyTimeStep;                                     // 0x0B64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyExtent;                                       // 0x0B68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6C[0x4];                                      // 0x0B6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ProjectileTargetingOriginOffset_Crouched;          // 0x0B70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InThrowWindup;                                     // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B89[0x7];                                      // 0x0B89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAbilityMontageInfo        ThrowWindupMontage;                                // 0x0B90(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_ProjectileTrajectory_Athena_C*      TrajectoryIndicator;                               // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TrajectoryIndicatorClass;                          // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbilityKeyPressed;                                 // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF9[0x3];                                      // 0x0BF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdditionalThrowAngle;                              // 0x0BFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeedPitch;                                     // 0x0C00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinSpeedPitch;                                     // 0x0C04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxThrowPitch;                                     // 0x0C08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxTrajectoryBounces;                              // 0x0C0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsThrowing;                                        // 0x0C10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C11[0x3];                                      // 0x0C11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PostThrowDelay;                                    // 0x0C14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Spawned_On_Equip;                                  // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             DummyCollisionChannel;                             // 0x0C19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1A[0x6];                                      // 0x0C1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ThrowConsumablesEnabled;                           // 0x0C20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  T_ItemThrown;                                      // 0x0C48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_Quest;                                           // 0x0C68(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6C[0x4];                                      // 0x0C6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 BGA_ToSpawn;                                       // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_HeldObject_Parent_C*               DummyProjectile;                                   // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_HeldObject_Parent_C*               SpawnedBGAHeldObject;                              // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemCountToRemoveWhenThrown;                       // 0x0C88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8C[0x4];                                      // 0x0C8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_Windup;                                         // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tag_InWindup;                                      // 0x0C98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         DummyMaxSteps;                                     // 0x0CB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanBeDropped(bool* Yes);
	void Cancelled_11EB7D0B4C52CC25C785B3A1EA90B008(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cleanup_Trajectory_Display_On_End();
	void CleanupTrajectoryDisplay();
	void CleanupTrajectoryIndicatorOnUnequip();
	void Completed_11EB7D0B4C52CC25C785B3A1EA90B008(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void EventReceived_37ED270D4E5065DF6944ECB72BFD05A2(const struct FGameplayEventData& Payload);
	void EventReceived_526561A640EC49D3EEBA449BC71450EF(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent(int32 EntryPoint);
	void GetProjectileTrajectoryPoints(TArray<struct FVector>* OutSplinePoints, TArray<struct FVector>* OutSplineTangents, struct FHitResult* OutHitResult);
	void InitTrajectoryVariables();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAbilityInputReleased();
	void OnBlendOut_D12FE2DE4501EC495B89AAA1271D8CC2();
	void OnCancelled_D12FE2DE4501EC495B89AAA1271D8CC2();
	void OnCompleted_D12FE2DE4501EC495B89AAA1271D8CC2();
	void OnFinish_4303A6684F8456517B7D258D8BA1CE9B();
	void OnInterrupted_D12FE2DE4501EC495B89AAA1271D8CC2();
	void OnSync_9DBAE13E407ED891AB4EECA2ADF75C8D();
	void RemoveItemFromQuickBar();
	void SendGameplayEventsAndQuestUpdate();
	void SetupDummyProjectile();
	void SpawnBGA_ServerOnly_();
	class AFortProjectileTrajectory* SpawnTrajectoryIndicator(bool bSpawnOnEquip);
	void ThrowConsumable();
	void Triggered_11EB7D0B4C52CC25C785B3A1EA90B008(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void UpdateSpawnedBGA_ServerOnly_();
	void UpdateTrajectory();
	void UpdateTrajectorySpline();

	void CalcProjectileSpeedFromPitch(float AimPitch, float* GrenadeSpeed) const;
	void GetOwningPlayer(class AFortPlayerPawn** Player_Pawn) const;
	TSubclassOf<class AFortProjectileTrajectory> GetProjectileTrajectoryActor() const;
	bool ShouldOnlyShowTrajectoryOnUse() const;
	void SpawnLocationAndRotation(struct FVector* OutLoc, struct FRotator* OutRot) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C">();
	}
	static class UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C>();
	}
};
static_assert(alignof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C) == 0x000008, "Wrong alignment on UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C");
static_assert(sizeof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C) == 0x000CC0, "Wrong size on UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, PlayerPawn) == 0x000B18, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileReference) == 0x000B20, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileReference' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DistanceFromInstigatorCheck) == 0x000B28, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DistanceFromInstigatorCheck' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileSpeedMin) == 0x000B2C, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileSpeedMin' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileSpeedMax) == 0x000B30, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileSpeedMax' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, TrajectoryProjectileGravityScaleCorrection) == 0x000B34, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::TrajectoryProjectileGravityScaleCorrection' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileTargetingOriginOffset) == 0x000B38, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileTargetingOriginOffset' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyShouldBounce) == 0x000B50, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyShouldBounce' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyBounciness) == 0x000B54, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyBounciness' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyFriction) == 0x000B58, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyFriction' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyMaxSpeed) == 0x000B5C, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyMaxSpeed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyGravity) == 0x000B60, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyGravity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyTimeStep) == 0x000B64, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyTimeStep' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyExtent) == 0x000B68, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyExtent' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileTargetingOriginOffset_Crouched) == 0x000B70, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileTargetingOriginOffset_Crouched' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, InThrowWindup) == 0x000B88, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::InThrowWindup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ThrowWindupMontage) == 0x000B90, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ThrowWindupMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, TrajectoryIndicator) == 0x000BE8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::TrajectoryIndicator' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, TrajectoryIndicatorClass) == 0x000BF0, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::TrajectoryIndicatorClass' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, AbilityKeyPressed) == 0x000BF8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::AbilityKeyPressed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, AdditionalThrowAngle) == 0x000BFC, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::AdditionalThrowAngle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, MaxSpeedPitch) == 0x000C00, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::MaxSpeedPitch' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, MinSpeedPitch) == 0x000C04, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::MinSpeedPitch' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, MaxThrowPitch) == 0x000C08, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::MaxThrowPitch' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, MaxTrajectoryBounces) == 0x000C0C, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::MaxTrajectoryBounces' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, IsThrowing) == 0x000C10, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::IsThrowing' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, PostThrowDelay) == 0x000C14, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::PostThrowDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, Spawned_On_Equip) == 0x000C18, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::Spawned_On_Equip' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyCollisionChannel) == 0x000C19, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyCollisionChannel' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ThrowConsumablesEnabled) == 0x000C20, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ThrowConsumablesEnabled' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, T_ItemThrown) == 0x000C48, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::T_ItemThrown' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, T_Quest) == 0x000C68, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::T_Quest' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, BGA_ToSpawn) == 0x000C70, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::BGA_ToSpawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyProjectile) == 0x000C78, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyProjectile' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, SpawnedBGAHeldObject) == 0x000C80, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::SpawnedBGAHeldObject' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ItemCountToRemoveWhenThrown) == 0x000C88, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ItemCountToRemoveWhenThrown' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, GE_Windup) == 0x000C90, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::GE_Windup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, Tag_InWindup) == 0x000C98, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::Tag_InWindup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyMaxSteps) == 0x000CB8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyMaxSteps' has a wrong offset!");

}

