#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HealSpray_Primary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_HealSpray_Primary.GA_Athena_HealSpray_Primary_C.ExecuteUbergraph_GA_Athena_HealSpray_Primary
// 0x0180 (0x0180 - 0x0000)
struct GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle;     // 0x0050(0x0018)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x00A0(0x00D0)(ContainsInstancedReference)
	bool                                          CallFunc_CheckHealthThreshold_ValidCheck;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHealthThreshold_IsUnderHealthThreshold; // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0174(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary) == 0x000008, "Wrong alignment on GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary");
static_assert(sizeof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary) == 0x000180, "Wrong size on GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, EntryPoint) == 0x000000, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, K2Node_DynamicCast_AsFort_Pawn) == 0x000010, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, Temp_bool_B_Execution_Happened_Variable) == 0x000019, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_GetCurrentMontage_ReturnValue) == 0x000020, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, Temp_bool_A_Execution_Happened_Variable) == 0x000028, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000029, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, K2Node_Event_bWasCancelled) == 0x00002B, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_GetValueAtLevel_ReturnValue) == 0x000038, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, Temp_bool_Has_Been_Initd_Variable) == 0x000048, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00004C, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, K2Node_MakeStruct_GameplayEffectContextHandle) == 0x000050, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::K2Node_MakeStruct_GameplayEffectContextHandle' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000068, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, K2Node_DynamicCast_AsFort_Pawn_1) == 0x000070, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000080, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0000A0, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_CheckHealthThreshold_ValidCheck) == 0x000170, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_CheckHealthThreshold_ValidCheck' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, CallFunc_CheckHealthThreshold_IsUnderHealthThreshold) == 0x000171, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::CallFunc_CheckHealthThreshold_IsUnderHealthThreshold' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, Temp_bool_IsClosed_Variable) == 0x000172, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary, K2Node_CreateDelegate_OutputDelegate_1) == 0x000174, "Member 'GA_Athena_HealSpray_Primary_C_ExecuteUbergraph_GA_Athena_HealSpray_Primary::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function GA_Athena_HealSpray_Primary.GA_Athena_HealSpray_Primary_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_HealSpray_Primary_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HealSpray_Primary_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_HealSpray_Primary_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_HealSpray_Primary_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_HealSpray_Primary_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_HealSpray_Primary_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_HealSpray_Primary.GA_Athena_HealSpray_Primary_C.K2_OverrideFailedReason
// 0x0048 (0x0048 - 0x0000)
struct GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason final
{
public:
	struct FGameplayTagContainer                  FailedReason;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  OverridenFailedReason;                             // 0x0020(0x0020)(Parm, OutParm)
	bool                                          CallFunc_NotEqual_GameplayTagContainer_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason) == 0x000008, "Wrong alignment on GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason");
static_assert(sizeof(GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason) == 0x000048, "Wrong size on GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason, FailedReason) == 0x000000, "Member 'GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason::FailedReason' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason, OverridenFailedReason) == 0x000020, "Member 'GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason::OverridenFailedReason' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason, CallFunc_NotEqual_GameplayTagContainer_ReturnValue) == 0x000040, "Member 'GA_Athena_HealSpray_Primary_C_K2_OverrideFailedReason::CallFunc_NotEqual_GameplayTagContainer_ReturnValue' has a wrong offset!");

// Function GA_Athena_HealSpray_Primary.GA_Athena_HealSpray_Primary_C.OnMontageTriggeredPostCommitSuccess
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_HealSpray_Primary_C_OnMontageTriggeredPostCommitSuccess final
{
public:
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HealSpray_Primary_C_OnMontageTriggeredPostCommitSuccess) == 0x000001, "Wrong alignment on GA_Athena_HealSpray_Primary_C_OnMontageTriggeredPostCommitSuccess");
static_assert(sizeof(GA_Athena_HealSpray_Primary_C_OnMontageTriggeredPostCommitSuccess) == 0x000001, "Wrong size on GA_Athena_HealSpray_Primary_C_OnMontageTriggeredPostCommitSuccess");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_OnMontageTriggeredPostCommitSuccess, CallFunc_K2_HasAuthority_ReturnValue) == 0x000000, "Member 'GA_Athena_HealSpray_Primary_C_OnMontageTriggeredPostCommitSuccess::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");

// Function GA_Athena_HealSpray_Primary.GA_Athena_HealSpray_Primary_C.CheckHealthThreshold
// 0x0048 (0x0048 - 0x0000)
struct GA_Athena_HealSpray_Primary_C_CheckHealthThreshold final
{
public:
	bool                                          ValidCheck;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnderHealthThreshold;                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold) == 0x000008, "Wrong alignment on GA_Athena_HealSpray_Primary_C_CheckHealthThreshold");
static_assert(sizeof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold) == 0x000048, "Wrong size on GA_Athena_HealSpray_Primary_C_CheckHealthThreshold");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, ValidCheck) == 0x000000, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::ValidCheck' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, IsUnderHealthThreshold) == 0x000001, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::IsUnderHealthThreshold' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_GetValueAtLevel_ReturnValue) == 0x000010, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, K2Node_DynamicCast_AsFort_Pawn) == 0x000018, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_GetHealth_ReturnValue) == 0x000024, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_GetMaxHealth_ReturnValue) == 0x000028, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000030, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_Round_ReturnValue) == 0x000034, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000038, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_CheckHealthThreshold, CallFunc_Less_FloatFloat_ReturnValue) == 0x000040, "Member 'GA_Athena_HealSpray_Primary_C_CheckHealthThreshold::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Athena_HealSpray_Primary.GA_Athena_HealSpray_Primary_C.K2_CanActivateAbility
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_K2_CanActivateAbility_RelevantTags;       // 0x0078(0x0020)()
	bool                                          CallFunc_K2_CanActivateAbility_ReturnValue;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHealthThreshold_ValidCheck;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHealthThreshold_IsUnderHealthThreshold; // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility) == 0x0000C0, "Wrong size on GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_Athena_HealSpray_Primary_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
