#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Tethered

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Tethered.GA_Athena_Tethered_C.BreakNearbyStructures
// 0x0180 (0x0180 - 0x0000)
struct GA_Athena_Tethered_C_BreakNearbyStructures final
{
public:
	struct FVector                                ForwardVector;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetForward;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          wasAnyStructureBroken;                             // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x00F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0118(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0140(0x0010)(ReferenceParm)
	class AFortAthenaSupplyDropBalloon*           K2Node_DynamicCast_AsFort_Athena_Supply_Drop_Balloon; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingProp*                          K2Node_DynamicCast_AsBuilding_Prop;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeldObjectComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Tethered_C_BreakNearbyStructures) == 0x000008, "Wrong alignment on GA_Athena_Tethered_C_BreakNearbyStructures");
static_assert(sizeof(GA_Athena_Tethered_C_BreakNearbyStructures) == 0x000180, "Wrong size on GA_Athena_Tethered_C_BreakNearbyStructures");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, ForwardVector) == 0x000000, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::ForwardVector' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, OffsetForward) == 0x000018, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::OffsetForward' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, wasAnyStructureBroken) == 0x00001C, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::wasAnyStructureBroken' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000028, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_GetValueAtLevel_ReturnValue) == 0x000044, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, K2Node_MakeArray_Array) == 0x000048, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_BreakVector_X) == 0x000090, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_BreakVector_Y) == 0x000094, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_BreakVector_Z) == 0x000098, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_Add_FloatFloat_ReturnValue) == 0x00009C, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_MakeVector_ReturnValue_1) == 0x0000A0, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, Temp_int_Array_Index_Variable) == 0x0000D0, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0000D4, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_FTrunc_ReturnValue) == 0x0000D8, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000DC, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, K2Node_MakeArray_Array_1) == 0x0000E0, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_BoxOverlapActors_OutActors) == 0x0000F0, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_BoxOverlapActors_ReturnValue) == 0x000100, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_Array_Length_ReturnValue) == 0x000104, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_Array_Get_Item) == 0x000108, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000118, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000140, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, K2Node_DynamicCast_AsFort_Athena_Supply_Drop_Balloon) == 0x000150, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::K2Node_DynamicCast_AsFort_Athena_Supply_Drop_Balloon' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, K2Node_DynamicCast_AsBuilding_Prop) == 0x000160, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::K2Node_DynamicCast_AsBuilding_Prop' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_GetComponentByClass_ReturnValue) == 0x000170, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_BreakNearbyStructures, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'GA_Athena_Tethered_C_BreakNearbyStructures::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Tethered.GA_Athena_Tethered_C.ExecuteUbergraph_GA_Athena_Tethered
// 0x0220 (0x0220 - 0x0000)
struct GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetTetherPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_PrevMovementMode;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_PreviousCustomMode;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0040(0x00D0)(ContainsInstancedReference)
	TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0110(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPreviousVelocity_ReturnValue;          // 0x0120(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetTetherPawn_ReturnValue_1;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetDirectionActorToActor_ReturnValue;     // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0190(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue_1;           // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x01E8(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0210(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered) == 0x000008, "Wrong alignment on GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered");
static_assert(sizeof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered) == 0x000220, "Wrong size on GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, EntryPoint) == 0x000000, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_GetTetherPawn_ReturnValue) == 0x000008, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_GetTetherPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000010, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, K2Node_CustomEvent_Character) == 0x000020, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, K2Node_CustomEvent_PrevMovementMode) == 0x000028, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::K2Node_CustomEvent_PrevMovementMode' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, K2Node_CustomEvent_PreviousCustomMode) == 0x000029, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::K2Node_CustomEvent_PreviousCustomMode' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002A, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000038, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000039, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_SelectFloat_ReturnValue) == 0x00003C, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000040, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, K2Node_CreateDelegate_OutputDelegate_1) == 0x000110, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_GetPreviousVelocity_ReturnValue) == 0x000120, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_GetPreviousVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, K2Node_Event_bWasCancelled) == 0x000138, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_BreakVector_X) == 0x00013C, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_BreakVector_Y) == 0x000140, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_BreakVector_Z) == 0x000144, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_Less_FloatFloat_ReturnValue) == 0x000148, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_IsValid_ReturnValue_2) == 0x000149, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_GetValueAtLevel_ReturnValue) == 0x00014C, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000150, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_GetTetherPawn_ReturnValue_1) == 0x000158, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_GetTetherPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_GetDirectionActorToActor_ReturnValue) == 0x000160, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_GetDirectionActorToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_GetForwardVector_ReturnValue) == 0x000178, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_GetActorInfo_ReturnValue) == 0x000190, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001D8, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_K2_CommitAbility_ReturnValue_1) == 0x0001E1, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_K2_CommitAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0001E8, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000210, "Member 'GA_Athena_Tethered_C_ExecuteUbergraph_GA_Athena_Tethered::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Athena_Tethered.GA_Athena_Tethered_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Tethered_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Tethered_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Tethered_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Tethered_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Tethered_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Tethered_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Tethered_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Tethered.GA_Athena_Tethered_C.MovementModeChangedDelegate_Event_0
// 0x0010 (0x0010 - 0x0000)
struct GA_Athena_Tethered_C_MovementModeChangedDelegate_Event_0 final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Tethered_C_MovementModeChangedDelegate_Event_0) == 0x000008, "Wrong alignment on GA_Athena_Tethered_C_MovementModeChangedDelegate_Event_0");
static_assert(sizeof(GA_Athena_Tethered_C_MovementModeChangedDelegate_Event_0) == 0x000010, "Wrong size on GA_Athena_Tethered_C_MovementModeChangedDelegate_Event_0");
static_assert(offsetof(GA_Athena_Tethered_C_MovementModeChangedDelegate_Event_0, Character) == 0x000000, "Member 'GA_Athena_Tethered_C_MovementModeChangedDelegate_Event_0::Character' has a wrong offset!");
static_assert(offsetof(GA_Athena_Tethered_C_MovementModeChangedDelegate_Event_0, PrevMovementMode) == 0x000008, "Member 'GA_Athena_Tethered_C_MovementModeChangedDelegate_Event_0::PrevMovementMode' has a wrong offset!");
