#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_LowGravity_FallDamageImmunity

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_LowGravity_FallDamageImmunity.GA_Athena_LowGravity_FallDamageImmunity_C.ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity
// 0x0160 (0x0160 - 0x0000)
struct GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x00C0(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0128(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0150(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity) == 0x000008, "Wrong alignment on GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity");
static_assert(sizeof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity) == 0x000160, "Wrong size on GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, EntryPoint) == 0x000000, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, K2Node_Event_EventData) == 0x000008, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000B8, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, CallFunc_GetActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000108, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000118, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000128, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000150, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_ExecuteUbergraph_GA_Athena_LowGravity_FallDamageImmunity::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Athena_LowGravity_FallDamageImmunity.GA_Athena_LowGravity_FallDamageImmunity_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_LowGravity_FallDamageImmunity_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_LowGravity_FallDamageImmunity_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Athena_LowGravity_FallDamageImmunity_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Athena_LowGravity_FallDamageImmunity_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Athena_LowGravity_FallDamageImmunity_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Athena_LowGravity_FallDamageImmunity_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Athena_LowGravity_FallDamageImmunity_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

