#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FloppingRabbit_Pull

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_FloppingRabbit_Pull.GA_Athena_FloppingRabbit_Pull_C.CalcLaunchValue
// 0x00F0 (0x00F0 - 0x0000)
struct GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutLaunchVelocity;                                 // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity; // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue) == 0x000008, "Wrong alignment on GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue");
static_assert(sizeof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue) == 0x0000F0, "Wrong size on GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, Target_0) == 0x000000, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::Target_0' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, OutLaunchVelocity) == 0x000008, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::OutLaunchVelocity' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, Temp_bool_Variable) == 0x000020, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_GetValueAtLevel_ReturnValue) == 0x000040, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_Normal_ReturnValue) == 0x000078, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_VSize_ReturnValue) == 0x000090, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000094, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, K2Node_Select_Default) == 0x000098, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00009C, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A0, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity) == 0x0000D0, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue, CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue) == 0x0000E8, "Member 'GA_Athena_FloppingRabbit_Pull_C_CalcLaunchValue::CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue' has a wrong offset!");

// Function GA_Athena_FloppingRabbit_Pull.GA_Athena_FloppingRabbit_Pull_C.ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull
// 0x00F8 (0x00F8 - 0x0000)
struct GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0010(0x0018)()
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue_1;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkydiving_ReturnValue;                  // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue_1;                // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue_2;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalcLaunchValue_OutLaunchVelocity;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalcLaunchValue_OutLaunchVelocity_1;      // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull) == 0x000008, "Wrong alignment on GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull");
static_assert(sizeof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull) == 0x0000F8, "Wrong size on GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, EntryPoint) == 0x000000, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000010, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, K2Node_DynamicCast_AsFort_AIPawn) == 0x000028, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_EffectContextGetEffectCauser_ReturnValue) == 0x000038, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_EffectContextGetEffectCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000040, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000050, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_GetController_ReturnValue) == 0x000060, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000068, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000078, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_IsValid_ReturnValue_1) == 0x000079, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000080, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_OnSameTeam_ReturnValue) == 0x000089, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_IsInVehicle_ReturnValue) == 0x00008A, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_IsValid_ReturnValue_2) == 0x00008B, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_Not_PreBool_ReturnValue) == 0x00008C, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_IsValid_ReturnValue_3) == 0x00008D, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_GetValueAtLevel_ReturnValue) == 0x000090, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_FFloor_ReturnValue) == 0x000094, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_Conv_IntToBool_ReturnValue) == 0x000098, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00009C, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_FFloor_ReturnValue_1) == 0x0000A0, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_OnSameTeam_ReturnValue_1) == 0x0000A4, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_OnSameTeam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x0000A5, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_IsSkydiving_ReturnValue) == 0x0000A6, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_IsSkydiving_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_IsInVehicle_ReturnValue_1) == 0x0000A7, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_IsInVehicle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_OnSameTeam_ReturnValue_2) == 0x0000A8, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_OnSameTeam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_BooleanOR_ReturnValue) == 0x0000A9, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_IsValid_ReturnValue_4) == 0x0000AA, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_IsValid_ReturnValue_5) == 0x0000AB, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_CalcLaunchValue_OutLaunchVelocity) == 0x0000B0, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_CalcLaunchValue_OutLaunchVelocity' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0000C8, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000D8, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull, CallFunc_CalcLaunchValue_OutLaunchVelocity_1) == 0x0000E0, "Member 'GA_Athena_FloppingRabbit_Pull_C_ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull::CallFunc_CalcLaunchValue_OutLaunchVelocity_1' has a wrong offset!");

}

