#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ApplyCoolCarpet_Passive

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Athena_ApplyCoolCarpet_Passive.GA_Athena_ApplyCoolCarpet_Passive_C.ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive
// 0x0020 (0x0020 - 0x0000)
struct GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive) == 0x000008, "Wrong alignment on GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive");
static_assert(sizeof(GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive) == 0x000020, "Wrong size on GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive");
static_assert(offsetof(GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive, EntryPoint) == 0x000000, "Member 'GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000010, "Member 'GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000018, "Member 'GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000019, "Member 'GA_Athena_ApplyCoolCarpet_Passive_C_ExecuteUbergraph_GA_Athena_ApplyCoolCarpet_Passive::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");

// Function GA_Athena_ApplyCoolCarpet_Passive.GA_Athena_ApplyCoolCarpet_Passive_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_ApplyCoolCarpet_Passive_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ApplyCoolCarpet_Passive_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_ApplyCoolCarpet_Passive_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_ApplyCoolCarpet_Passive_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_ApplyCoolCarpet_Passive_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_ApplyCoolCarpet_Passive_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_ApplyCoolCarpet_Passive_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

