#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Ascender_Smash

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C
// 0x00E8 (0x0C10 - 0x0B28)
class UGA_Athena_Ascender_Smash_C final : public UFortGameplayAbility_ZiplineSmashBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UpdateIntervalForSmashVolume;                      // 0x0B38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3C[0x4];                                      // 0x0B3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 StructureDamageGE;                                 // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    ZiplineInteractComponent;                          // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomMovement                           DrivingCustomMovementMode;                         // 0x0B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B51[0x3];                                      // 0x0B51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            FallImmunityGEFX;                                  // 0x0B54(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AttachVFXCue;                                      // 0x0B5C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SmashCue;                                          // 0x0B60(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Swimming;                                        // 0x0B64(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Falling;                                         // 0x0B68(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6C[0x4];                                      // 0x0B6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TagsThatBlockFallImmunityRemoval;                  // 0x0B70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           TH_DelayFallDamageRemoval;                         // 0x0B90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SurroundingsCheckTimerHandle;                      // 0x0B98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AB_Athena_Zipline_Ascender_C*           Ascender;                                          // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DescendingTag;                                     // 0x0BA8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAC[0x4];                                      // 0x0BAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           M_AscendingAnim;                                   // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           M_DescendingAnim;                                  // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            DescendingGE_Handle;                               // 0x0BC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            AscendingGE_Handle;                                // 0x0BC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           F_AscendingAnim;                                   // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           F_DescendingAnim;                                  // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BlockedAbilityTags;                                // 0x0BE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            ZiplinePassiveGE;                                  // 0x0C00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bHolsterApplied;                                   // 0x0C08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAbilitiesBlocked;                                 // 0x0C09(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ZipliningComplete();
	void UnBlockAbilities(class UObject* AbilitySystemComp);
	void SwimmingStarted();
	void SurroundingsCheck();
	void SplineZiplineMovementModeDelayOver();
	void RemoveFallDamageImmunity();
	void Removed_CCA852EC49448231D32ACE98FA537303();
	void Remove_Fall_Damage_Immunity_Delayed();
	void OnPawnLanded_Bind(const struct FHitResult& Hit);
	void OnPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnInterrupted_899182BF4C098785CCBCFD85AA84455F();
	void OnEnterVehicle_Bind();
	void OnEnteredAircraft_Bind();
	void OnCompleted_899182BF4C098785CCBCFD85AA84455F();
	void OnCancelled_899182BF4C098785CCBCFD85AA84455F();
	void OnBlendOut_899182BF4C098785CCBCFD85AA84455F();
	void OnBeginSkydiving_Bind();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	bool IsPlayerUsingHandle();
	void HandleZiplineStateChanged(bool bIsZiplining);
	void HandleClientSplineZiplineStateChanged(bool bIsZiplining);
	void ExecuteUbergraph_GA_Athena_Ascender_Smash(int32 EntryPoint);
	void EnterWaterExit(class AFortPlayerPawn* FortPlayerPawn);
	void EndAsyncBreakNearbyStructuresOverlap(const TArray<class AActor*>& OverlapActors);
	void DoUnholster();
	void DoHolster();
	void DoFailSafeUnholster();
	void DelaySpawnMotor();
	void CheckMotor();
	void CheckForQuestProgress();
	void BreakNearbyStructures(class AFortPlayerPawn* PlayerPawn_0);
	void BlockAbilities(class UObject* AbilitySystemComp);
	void BindEvent();
	void Added_AEF3A0AB4B5DCC7B9460E8B997B6A3F0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Ascender_Smash_C">();
	}
	static class UGA_Athena_Ascender_Smash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Ascender_Smash_C>();
	}
};
static_assert(alignof(UGA_Athena_Ascender_Smash_C) == 0x000008, "Wrong alignment on UGA_Athena_Ascender_Smash_C");
static_assert(sizeof(UGA_Athena_Ascender_Smash_C) == 0x000C10, "Wrong size on UGA_Athena_Ascender_Smash_C");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, UberGraphFrame) == 0x000B28, "Member 'UGA_Athena_Ascender_Smash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, PlayerPawn) == 0x000B30, "Member 'UGA_Athena_Ascender_Smash_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, UpdateIntervalForSmashVolume) == 0x000B38, "Member 'UGA_Athena_Ascender_Smash_C::UpdateIntervalForSmashVolume' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, StructureDamageGE) == 0x000B40, "Member 'UGA_Athena_Ascender_Smash_C::StructureDamageGE' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, ZiplineInteractComponent) == 0x000B48, "Member 'UGA_Athena_Ascender_Smash_C::ZiplineInteractComponent' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, DrivingCustomMovementMode) == 0x000B50, "Member 'UGA_Athena_Ascender_Smash_C::DrivingCustomMovementMode' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, FallImmunityGEFX) == 0x000B54, "Member 'UGA_Athena_Ascender_Smash_C::FallImmunityGEFX' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, AttachVFXCue) == 0x000B5C, "Member 'UGA_Athena_Ascender_Smash_C::AttachVFXCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, SmashCue) == 0x000B60, "Member 'UGA_Athena_Ascender_Smash_C::SmashCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, T_Swimming) == 0x000B64, "Member 'UGA_Athena_Ascender_Smash_C::T_Swimming' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, T_Falling) == 0x000B68, "Member 'UGA_Athena_Ascender_Smash_C::T_Falling' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, TagsThatBlockFallImmunityRemoval) == 0x000B70, "Member 'UGA_Athena_Ascender_Smash_C::TagsThatBlockFallImmunityRemoval' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, TH_DelayFallDamageRemoval) == 0x000B90, "Member 'UGA_Athena_Ascender_Smash_C::TH_DelayFallDamageRemoval' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, SurroundingsCheckTimerHandle) == 0x000B98, "Member 'UGA_Athena_Ascender_Smash_C::SurroundingsCheckTimerHandle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, Ascender) == 0x000BA0, "Member 'UGA_Athena_Ascender_Smash_C::Ascender' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, DescendingTag) == 0x000BA8, "Member 'UGA_Athena_Ascender_Smash_C::DescendingTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, M_AscendingAnim) == 0x000BB0, "Member 'UGA_Athena_Ascender_Smash_C::M_AscendingAnim' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, M_DescendingAnim) == 0x000BB8, "Member 'UGA_Athena_Ascender_Smash_C::M_DescendingAnim' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, DescendingGE_Handle) == 0x000BC0, "Member 'UGA_Athena_Ascender_Smash_C::DescendingGE_Handle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, AscendingGE_Handle) == 0x000BC8, "Member 'UGA_Athena_Ascender_Smash_C::AscendingGE_Handle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, F_AscendingAnim) == 0x000BD0, "Member 'UGA_Athena_Ascender_Smash_C::F_AscendingAnim' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, F_DescendingAnim) == 0x000BD8, "Member 'UGA_Athena_Ascender_Smash_C::F_DescendingAnim' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, BlockedAbilityTags) == 0x000BE0, "Member 'UGA_Athena_Ascender_Smash_C::BlockedAbilityTags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, ZiplinePassiveGE) == 0x000C00, "Member 'UGA_Athena_Ascender_Smash_C::ZiplinePassiveGE' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, bHolsterApplied) == 0x000C08, "Member 'UGA_Athena_Ascender_Smash_C::bHolsterApplied' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Ascender_Smash_C, bAbilitiesBlocked) == 0x000C09, "Member 'UGA_Athena_Ascender_Smash_C::bAbilitiesBlocked' has a wrong offset!");

}

