#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AthenaExitVehicle

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_AthenaExitVehicle.GA_AthenaExitVehicle_C.ExecuteUbergraph_GA_AthenaExitVehicle
// 0x00D0 (0x00D0 - 0x0000)
struct GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActor_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     CallFunc_ServerOnExitVehicle_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0090(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00B8(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle) == 0x000008, "Wrong alignment on GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle");
static_assert(sizeof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle) == 0x0000D0, "Wrong size on GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, EntryPoint) == 0x000000, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000050, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_K2_CommitAbility_ReturnValue) == 0x000059, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_GetHealth_ReturnValue) == 0x00005C, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_GetVehicleActor_ReturnValue) == 0x000068, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_GetVehicleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_ServerOnExitVehicle_ReturnValue) == 0x000070, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_ServerOnExitVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000078, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00008A, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_HasAuthority_ReturnValue) == 0x00008B, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000090, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000B8, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, Temp_bool_Variable) == 0x0000C8, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle, CallFunc_BooleanAND_ReturnValue) == 0x0000C9, "Member 'GA_AthenaExitVehicle_C_ExecuteUbergraph_GA_AthenaExitVehicle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

