#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FlopperSmall

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Athena_FlopperSmall.GA_Athena_FlopperSmall_C.ExecuteUbergraph_GA_Athena_FlopperSmall
// 0x0038 (0x0038 - 0x0000)
struct GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1; // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1; // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall) == 0x000008, "Wrong alignment on GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall");
static_assert(sizeof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall) == 0x000038, "Wrong size on GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, EntryPoint) == 0x000000, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_GetActivatingPawn_ReturnValue) == 0x000008, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000010, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000018, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000019, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x00001A, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1) == 0x00001B, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1) == 0x00001C, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1) == 0x00001D, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_Not_PreBool_ReturnValue) == 0x00001E, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001F, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_BooleanAND_ReturnValue_1) == 0x000021, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_GetQuestManager_ReturnValue) == 0x000028, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall, CallFunc_BooleanOR_ReturnValue) == 0x000030, "Member 'GA_Athena_FlopperSmall_C_ExecuteUbergraph_GA_Athena_FlopperSmall::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

