#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Action_Fire_WestSausage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Action_Fire_WestSausage.GA_Action_Fire_WestSausage_C.ExecuteUbergraph_GA_Action_Fire_WestSausage
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeWaited;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputPress*            CallFunc_WaitInputPress_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0040(0x0048)(ContainsInstancedReference)
	TDelegate<void(float TimeWaited)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Ranged_WestSausage_Parallel_Athena_C* K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage) == 0x000008, "Wrong alignment on GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage");
static_assert(sizeof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage) == 0x0000B8, "Wrong size on GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, EntryPoint) == 0x000000, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, K2Node_CustomEvent_TimeWaited) == 0x000004, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::K2Node_CustomEvent_TimeWaited' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, Temp_float_Variable) == 0x000008, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, CallFunc_WaitInputPress_ReturnValue) == 0x000010, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::CallFunc_WaitInputPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, K2Node_CustomEvent_TimeHeld) == 0x000028, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, Temp_float_Variable_1) == 0x00002C, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, CallFunc_WaitInputRelease_ReturnValue) == 0x000030, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, CallFunc_GetActorInfo_ReturnValue) == 0x000040, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000098, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, K2Node_Event_bWasCancelled) == 0x0000A1, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena) == 0x0000A8, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena' has a wrong offset!");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'GA_Action_Fire_WestSausage_C_ExecuteUbergraph_GA_Action_Fire_WestSausage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GA_Action_Fire_WestSausage.GA_Action_Fire_WestSausage_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Action_Fire_WestSausage_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Fire_WestSausage_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Action_Fire_WestSausage_C_K2_OnEndAbility");
static_assert(sizeof(GA_Action_Fire_WestSausage_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Action_Fire_WestSausage_C_K2_OnEndAbility");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Action_Fire_WestSausage_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Action_Fire_WestSausage.GA_Action_Fire_WestSausage_C.OnPress_E2EC233649C128DF20EFB4896E2D93BE
// 0x0004 (0x0004 - 0x0000)
struct GA_Action_Fire_WestSausage_C_OnPress_E2EC233649C128DF20EFB4896E2D93BE final
{
public:
	float                                         TimeWaited;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Fire_WestSausage_C_OnPress_E2EC233649C128DF20EFB4896E2D93BE) == 0x000004, "Wrong alignment on GA_Action_Fire_WestSausage_C_OnPress_E2EC233649C128DF20EFB4896E2D93BE");
static_assert(sizeof(GA_Action_Fire_WestSausage_C_OnPress_E2EC233649C128DF20EFB4896E2D93BE) == 0x000004, "Wrong size on GA_Action_Fire_WestSausage_C_OnPress_E2EC233649C128DF20EFB4896E2D93BE");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_OnPress_E2EC233649C128DF20EFB4896E2D93BE, TimeWaited) == 0x000000, "Member 'GA_Action_Fire_WestSausage_C_OnPress_E2EC233649C128DF20EFB4896E2D93BE::TimeWaited' has a wrong offset!");

// Function GA_Action_Fire_WestSausage.GA_Action_Fire_WestSausage_C.OnRelease_69A7F3C142C51AF74C6878A42B8EE673
// 0x0004 (0x0004 - 0x0000)
struct GA_Action_Fire_WestSausage_C_OnRelease_69A7F3C142C51AF74C6878A42B8EE673 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Fire_WestSausage_C_OnRelease_69A7F3C142C51AF74C6878A42B8EE673) == 0x000004, "Wrong alignment on GA_Action_Fire_WestSausage_C_OnRelease_69A7F3C142C51AF74C6878A42B8EE673");
static_assert(sizeof(GA_Action_Fire_WestSausage_C_OnRelease_69A7F3C142C51AF74C6878A42B8EE673) == 0x000004, "Wrong size on GA_Action_Fire_WestSausage_C_OnRelease_69A7F3C142C51AF74C6878A42B8EE673");
static_assert(offsetof(GA_Action_Fire_WestSausage_C_OnRelease_69A7F3C142C51AF74C6878A42B8EE673, TimeHeld) == 0x000000, "Member 'GA_Action_Fire_WestSausage_C_OnRelease_69A7F3C142C51AF74C6878A42B8EE673::TimeHeld' has a wrong offset!");

}

