#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_SCMachine_Passive

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C.Check Resurrection Active
// 0x0038 (0x0038 - 0x0000)
struct GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   GameStateAthena;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlaylistValid;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TestPlaylist;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResurrectionEnabled_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active) == 0x000008, "Wrong alignment on GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active");
static_assert(sizeof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active) == 0x000038, "Wrong size on GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active, bEnabled) == 0x000000, "Member 'GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active::bEnabled' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active, GameStateAthena) == 0x000008, "Member 'GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active::GameStateAthena' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active, PlaylistValid) == 0x000010, "Member 'GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active::PlaylistValid' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active, TestPlaylist) == 0x000014, "Member 'GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active::TestPlaylist' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active, CallFunc_IsResurrectionEnabled_ReturnValue) == 0x000020, "Member 'GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active::CallFunc_IsResurrectionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000028, "Member 'GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Athena_SCMachine_Passive_C_Check_Resurrection_Active::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C.CheckPlayerChipSpawnEnabled
// 0x0020 (0x0020 - 0x0000)
struct GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled final
{
public:
	bool                                          IsChipSpawnEnabled;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled) == 0x000008, "Wrong alignment on GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled");
static_assert(sizeof(GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled) == 0x000020, "Wrong size on GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled, IsChipSpawnEnabled) == 0x000000, "Member 'GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled::IsChipSpawnEnabled' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000008, "Member 'GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000018, "Member 'GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'GA_Athena_SCMachine_Passive_C_CheckPlayerChipSpawnEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C.ExecuteUbergraph_GA_Athena_SCMachine_Passive
// 0x01B0 (0x01B0 - 0x0000)
struct GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPlayerChipSpawnEnabled_IsChipSpawnEnabled; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0xA];                                        // 0x0006(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_Resurrection_Active_bEnabled;       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_SCMachine_Pickup_C*         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_CustomEvent_FortPlayerPawnAthena;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateZone*                     K2Node_DynamicCast_AsFort_Game_State_Zone;         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       K2Node_DynamicCast_AsFort_Player_State;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBattleLabModePlaylist_ReturnValue;      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRespawningAllowed_ReturnValue;          // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeLTMPlaylist_ReturnValue;        // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive) == 0x000010, "Wrong alignment on GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive");
static_assert(sizeof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive) == 0x0001B0, "Wrong size on GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, EntryPoint) == 0x000000, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_CheckPlayerChipSpawnEnabled_IsChipSpawnEnabled) == 0x000004, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_CheckPlayerChipSpawnEnabled_IsChipSpawnEnabled' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_GetActorTeam_ReturnValue) == 0x000005, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000070, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_BreakTransform_Location) == 0x000078, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_BreakTransform_Rotation) == 0x000090, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_BreakTransform_Scale) == 0x0000A8, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_Check_Resurrection_Active_bEnabled) == 0x000140, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_Check_Resurrection_Active_bEnabled' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000148, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_BooleanAND_ReturnValue) == 0x000150, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_FinishSpawningActor_ReturnValue) == 0x000158, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, K2Node_CustomEvent_FortPlayerPawnAthena) == 0x000160, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::K2Node_CustomEvent_FortPlayerPawnAthena' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_GetGameState_ReturnValue) == 0x000168, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, K2Node_DynamicCast_AsFort_Game_State_Zone) == 0x000170, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::K2Node_DynamicCast_AsFort_Game_State_Zone' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_GetGameState_ReturnValue_1) == 0x000180, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000188, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, K2Node_DynamicCast_AsFort_Player_State) == 0x000198, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::K2Node_DynamicCast_AsFort_Player_State' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, K2Node_DynamicCast_bSuccess_2) == 0x0001A0, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_IsBattleLabModePlaylist_ReturnValue) == 0x0001A1, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_IsBattleLabModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_IsRespawningAllowed_ReturnValue) == 0x0001A2, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_IsRespawningAllowed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_IsCreativeLTMPlaylist_ReturnValue) == 0x0001A3, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_IsCreativeLTMPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x0001A4, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_BooleanOR_ReturnValue) == 0x0001A5, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_BooleanOR_ReturnValue_1) == 0x0001A6, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive, CallFunc_Not_PreBool_ReturnValue) == 0x0001A7, "Member 'GA_Athena_SCMachine_Passive_C_ExecuteUbergraph_GA_Athena_SCMachine_Passive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C.HandleOnFortPlayerDied
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_SCMachine_Passive_C_HandleOnFortPlayerDied final
{
public:
	class AFortPlayerPawnAthena*                  FortPlayerPawnAthena;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_SCMachine_Passive_C_HandleOnFortPlayerDied) == 0x000008, "Wrong alignment on GA_Athena_SCMachine_Passive_C_HandleOnFortPlayerDied");
static_assert(sizeof(GA_Athena_SCMachine_Passive_C_HandleOnFortPlayerDied) == 0x000008, "Wrong size on GA_Athena_SCMachine_Passive_C_HandleOnFortPlayerDied");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_HandleOnFortPlayerDied, FortPlayerPawnAthena) == 0x000000, "Member 'GA_Athena_SCMachine_Passive_C_HandleOnFortPlayerDied::FortPlayerPawnAthena' has a wrong offset!");

// Function GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C.SaveOutPlayer
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_SCMachine_Passive_C_SaveOutPlayer final
{
public:
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_SCMachine_Passive_C_SaveOutPlayer) == 0x000008, "Wrong alignment on GA_Athena_SCMachine_Passive_C_SaveOutPlayer");
static_assert(sizeof(GA_Athena_SCMachine_Passive_C_SaveOutPlayer) == 0x000018, "Wrong size on GA_Athena_SCMachine_Passive_C_SaveOutPlayer");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_SaveOutPlayer, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Athena_SCMachine_Passive_C_SaveOutPlayer::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_SaveOutPlayer, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000008, "Member 'GA_Athena_SCMachine_Passive_C_SaveOutPlayer::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_SCMachine_Passive_C_SaveOutPlayer, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_Athena_SCMachine_Passive_C_SaveOutPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

