#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Consumable_Throw_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.AddCookGC
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_AddCookGC final
{
public:
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_AddCookGC) == 0x000001, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_AddCookGC");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_AddCookGC) == 0x000001, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_AddCookGC");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_AddCookGC, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_AddCookGC::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27) == 0x000030, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27, TargetData) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27, ApplicationTag) == 0x000028, "Member 'GA_Athena_Consumable_Throw_Parent_C_Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.Completed_01C5B37D48E3DC6F82DDC58640CE2A27
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_Completed_01C5B37D48E3DC6F82DDC58640CE2A27 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_Completed_01C5B37D48E3DC6F82DDC58640CE2A27) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_Completed_01C5B37D48E3DC6F82DDC58640CE2A27");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_Completed_01C5B37D48E3DC6F82DDC58640CE2A27) == 0x000030, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_Completed_01C5B37D48E3DC6F82DDC58640CE2A27");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_Completed_01C5B37D48E3DC6F82DDC58640CE2A27, TargetData) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_Completed_01C5B37D48E3DC6F82DDC58640CE2A27::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_Completed_01C5B37D48E3DC6F82DDC58640CE2A27, ApplicationTag) == 0x000028, "Member 'GA_Athena_Consumable_Throw_Parent_C_Completed_01C5B37D48E3DC6F82DDC58640CE2A27::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.ExecuteThrowGC
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_ExecuteThrowGC final
{
public:
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_ExecuteThrowGC) == 0x000001, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_ExecuteThrowGC");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_ExecuteThrowGC) == 0x000001, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_ExecuteThrowGC");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteThrowGC, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteThrowGC::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent
// 0x0448 (0x0448 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0030(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0040(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0048(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate_6;            // 0x00C0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00EC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSpawnLocationAndRotation_Location;     // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSpawnLocationAndRotation_Rotation;     // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileTrajectory*              CallFunc_SpawnTrajectoryIndicator_ReturnValue;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0150(0x00B8)()
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_1; // 0x0208(0x00B8)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x02C0(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x02E8(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_2; // 0x02F0(0x00B8)()
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x03A8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProjectileInitialSpeedToUse_ProjectileSpeedToUse; // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProjectileInitialGravityScaleToUse_GravityScaleToUse; // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    CallFunc_SpawnThrownProjectile_SpawnedProjectile;  // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue;                // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x03F8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0420(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FFortProjectileTrajectoryData          CallFunc_GetProjectileTrajectoryData_TrajectoryData; // 0x0424(0x0020)(NoDestructor)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent) == 0x000448, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, EntryPoint) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CustomEvent_TargetData) == 0x000008, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CustomEvent_ApplicationTag) == 0x000030, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, Temp_struct_Variable) == 0x000040, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, Temp_struct_Variable_1) == 0x000048, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_WaitDelay_ReturnValue) == 0x000080, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A4, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CustomEvent_TimeHeld) == 0x0000BC, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000C0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, Temp_float_Variable) == 0x0000CC, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_WaitInputRelease_ReturnValue) == 0x0000D0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x0000E0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_IsValid_ReturnValue_2) == 0x0000E8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000E9, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_IsServer_ReturnValue) == 0x0000EA, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000EC, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_Event_bWasCancelled) == 0x0000F8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetSpawnLocationAndRotation_Location) == 0x000100, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetSpawnLocationAndRotation_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetSpawnLocationAndRotation_Rotation) == 0x000118, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetSpawnLocationAndRotation_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000130, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetOwningPlayer_Player_Pawn) == 0x000138, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetOwningPlayer_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000140, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_SpawnTrajectoryIndicator_ReturnValue) == 0x000148, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_SpawnTrajectoryIndicator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000150, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_1) == 0x000208, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CustomEvent_TargetData_1) == 0x0002C0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CustomEvent_ApplicationTag_1) == 0x0002E8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_2) == 0x0002F0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CreateDelegate_OutputDelegate_8) == 0x0003A8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0003B8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetProjectileInitialSpeedToUse_ProjectileSpeedToUse) == 0x0003C0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetProjectileInitialSpeedToUse_ProjectileSpeedToUse' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_IsValid_ReturnValue_4) == 0x0003C4, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetQuestManager_ReturnValue) == 0x0003C8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetProjectileInitialGravityScaleToUse_GravityScaleToUse) == 0x0003D0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetProjectileInitialGravityScaleToUse_GravityScaleToUse' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_SpawnThrownProjectile_SpawnedProjectile) == 0x0003D8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_SpawnThrownProjectile_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetWeaponData_ReturnValue) == 0x0003E0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetWeaponData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_IsValid_ReturnValue_5) == 0x0003E8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x0003EC, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0003F0, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CustomEvent_TargetData_2) == 0x0003F8, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, K2Node_CustomEvent_ApplicationTag_2) == 0x000420, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_GetProjectileTrajectoryData_TrajectoryData) == 0x000424, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_GetProjectileTrajectoryData_TrajectoryData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent, CallFunc_FMax_ReturnValue) == 0x000444, "Member 'GA_Athena_Consumable_Throw_Parent_C_ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.GetProjectileInitialGravityScaleToUse
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse final
{
public:
	float                                         GravityScaleToUse;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GetProjectileInitialGravityScaleContext;           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurveTableRowValid_ReturnValue;         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse) == 0x000028, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse, GravityScaleToUse) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse::GravityScaleToUse' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse, GetProjectileInitialGravityScaleContext) == 0x000008, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse::GetProjectileInitialGravityScaleContext' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_GetValueAtLevel_ReturnValue) == 0x000018, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_IsValidClass_ReturnValue) == 0x00001C, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000020, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000024, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse, CallFunc_IsCurveTableRowValid_ReturnValue) == 0x000025, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialGravityScaleToUse::CallFunc_IsCurveTableRowValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.GetProjectileInitialSpeedToUse
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse final
{
public:
	float                                         ProjectileSpeedToUse;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GetProjectileInitialSpeedToUseContext;             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurveTableRowValid_ReturnValue;         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse) == 0x000028, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse, ProjectileSpeedToUse) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse::ProjectileSpeedToUse' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse, GetProjectileInitialSpeedToUseContext) == 0x000008, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse::GetProjectileInitialSpeedToUseContext' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_GetValueAtLevel_ReturnValue) == 0x000018, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_IsValidClass_ReturnValue) == 0x00001C, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000020, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000024, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse, CallFunc_IsCurveTableRowValid_ReturnValue) == 0x000025, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileInitialSpeedToUse::CallFunc_IsCurveTableRowValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.GetProjectileTrajectoryPoints
// 0x03B8 (0x03B8 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints final
{
public:
	TArray<struct FVector>                        OutSplinePoints;                                   // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FVector>                        OutSplineTangents;                                 // 0x0010(0x0010)(Parm, OutParm)
	struct FHitResult                             OutHitResult;                                      // 0x0020(0x00E0)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                LocalVelocity;                                     // 0x0100(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalLocation;                                     // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        LocalPawn;                                         // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetProjectileIgnoredActors_ReturnValue;   // 0x0148(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_CalculateProjectileTrajectorySplineWithHit_OutHitResult; // 0x0158(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplinePoints; // 0x0238(0x0010)(ReferenceParm)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplineTangents; // 0x0248(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutHitResult; // 0x0258(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutSplinePoints; // 0x0338(0x0010)(ReferenceParm)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutSplineTangents; // 0x0348(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetSpawnLocationAndRotation_Location;     // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSpawnLocationAndRotation_Rotation;     // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints) == 0x0003B8, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, OutSplinePoints) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, OutSplineTangents) == 0x000010, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::OutSplineTangents' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, OutHitResult) == 0x000020, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::OutHitResult' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, LocalVelocity) == 0x000100, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::LocalVelocity' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, LocalLocation) == 0x000118, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::LocalLocation' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, LocalPawn) == 0x000130, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::LocalPawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_NotEqual_NameName_ReturnValue) == 0x000138, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_GetOwningPlayer_Player_Pawn) == 0x000140, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_GetOwningPlayer_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_GetProjectileIgnoredActors_ReturnValue) == 0x000148, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_GetProjectileIgnoredActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_CalculateProjectileTrajectorySplineWithHit_OutHitResult) == 0x000158, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_CalculateProjectileTrajectorySplineWithHit_OutHitResult' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplinePoints) == 0x000238, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplineTangents) == 0x000248, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplineTangents' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutHitResult) == 0x000258, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutHitResult' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutSplinePoints) == 0x000338, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutSplineTangents) == 0x000348, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_CalculateProjectileTrajectorySplineWithHitProfile_OutSplineTangents' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_GetSpawnLocationAndRotation_Location) == 0x000358, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_GetSpawnLocationAndRotation_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_GetSpawnLocationAndRotation_Rotation) == 0x000370, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_GetSpawnLocationAndRotation_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000388, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003A0, "Member 'GA_Athena_Consumable_Throw_Parent_C_GetProjectileTrajectoryPoints::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.K2_OverrideFailedReason
// 0x0090 (0x0090 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason final
{
public:
	struct FGameplayTagContainer                  FailedReason;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  OverridenFailedReason;                             // 0x0020(0x0020)(Parm, OutParm)
	struct FGameplayTagContainer                  CallFunc_K2_OverrideFailedReason_OverridenFailedReason; // 0x0040(0x0020)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason) == 0x000090, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason, FailedReason) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason::FailedReason' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason, OverridenFailedReason) == 0x000020, "Member 'GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason::OverridenFailedReason' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason, CallFunc_K2_OverrideFailedReason_OverridenFailedReason) == 0x000040, "Member 'GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason::CallFunc_K2_OverrideFailedReason_OverridenFailedReason' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000060, "Member 'GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason, K2Node_DynamicCast_AsFort_Pawn) == 0x000068, "Member 'GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000078, "Member 'GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000088, "Member 'GA_Athena_Consumable_Throw_Parent_C_K2_OverrideFailedReason::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.OnProjectileSpawned
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_OnProjectileSpawned final
{
public:
	class AFortProjectileBase*                    SpawnedProjectile_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_OnProjectileSpawned) == 0x000008, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_OnProjectileSpawned");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_OnProjectileSpawned) == 0x000008, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_OnProjectileSpawned");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_OnProjectileSpawned, SpawnedProjectile_0) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_OnProjectileSpawned::SpawnedProjectile_0' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0) == 0x000004, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0) == 0x000004, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0, TimeHeld) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0::TimeHeld' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.PostThrowCleanup
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_PostThrowCleanup final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Consumable_Throw_Parent_C_PostThrowCleanup) == 0x000001, "Wrong alignment on GA_Athena_Consumable_Throw_Parent_C_PostThrowCleanup");
static_assert(sizeof(GA_Athena_Consumable_Throw_Parent_C_PostThrowCleanup) == 0x000001, "Wrong size on GA_Athena_Consumable_Throw_Parent_C_PostThrowCleanup");
static_assert(offsetof(GA_Athena_Consumable_Throw_Parent_C_PostThrowCleanup, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'GA_Athena_Consumable_Throw_Parent_C_PostThrowCleanup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C.PrethrowSetup
// 0x0060 (0x0060 - 0x0000)
struct GA_Athena_Consumable_Throw_Parent_C_PrethrowSetup final
{
public:
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
