#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_RealityFlower_SeedPod_Explode

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GA_HeldObject_Explode_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_RealityFlower_SeedPod_Explode.GA_Athena_RealityFlower_SeedPod_Explode_C
// 0x0058 (0x0C30 - 0x0BD8)
class UGA_Athena_RealityFlower_SeedPod_Explode_C final : public UGA_HeldObject_Explode_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_RealityFlower_SeedPod_Explode_C; // 0x0BD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_PlayerKnockback_MinZComponentNormalized;       // 0x0BE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  Tag_GE_GrantedTagToRemove;                         // 0x0C08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 SourceActor;                                       // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyDamage(class AActor* Actor);
	void ExecuteUbergraph_GA_Athena_RealityFlower_SeedPod_Explode(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

	void CalculateLaunchVelocity(const struct FVector& PlayerPosition, const struct FVector& MyPosition, struct FVector* Velocity) const;
	struct FTransform GetCustomAbilitySourceTransform() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_RealityFlower_SeedPod_Explode_C">();
	}
	static class UGA_Athena_RealityFlower_SeedPod_Explode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_RealityFlower_SeedPod_Explode_C>();
	}
};
static_assert(alignof(UGA_Athena_RealityFlower_SeedPod_Explode_C) == 0x000008, "Wrong alignment on UGA_Athena_RealityFlower_SeedPod_Explode_C");
static_assert(sizeof(UGA_Athena_RealityFlower_SeedPod_Explode_C) == 0x000C30, "Wrong size on UGA_Athena_RealityFlower_SeedPod_Explode_C");
static_assert(offsetof(UGA_Athena_RealityFlower_SeedPod_Explode_C, UberGraphFrame_GA_Athena_RealityFlower_SeedPod_Explode_C) == 0x000BD8, "Member 'UGA_Athena_RealityFlower_SeedPod_Explode_C::UberGraphFrame_GA_Athena_RealityFlower_SeedPod_Explode_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_RealityFlower_SeedPod_Explode_C, Row_PlayerKnockback_MinZComponentNormalized) == 0x000BE0, "Member 'UGA_Athena_RealityFlower_SeedPod_Explode_C::Row_PlayerKnockback_MinZComponentNormalized' has a wrong offset!");
static_assert(offsetof(UGA_Athena_RealityFlower_SeedPod_Explode_C, Tag_GE_GrantedTagToRemove) == 0x000C08, "Member 'UGA_Athena_RealityFlower_SeedPod_Explode_C::Tag_GE_GrantedTagToRemove' has a wrong offset!");
static_assert(offsetof(UGA_Athena_RealityFlower_SeedPod_Explode_C, SourceActor) == 0x000C28, "Member 'UGA_Athena_RealityFlower_SeedPod_Explode_C::SourceActor' has a wrong offset!");

}

