#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent

#include "Basic.hpp"

#include "GA_Athena_CampsiteImprovement_Thrown_Trajectory_Parent_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent.GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C
// 0x0060 (0x11B8 - 0x1158)
class UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C : public UGA_Athena_CampsiteImprovement_Thrown_Trajectory_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C; // 0x1158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  Tag_Block_Ability_Activation;                      // 0x1160(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 CameraMode;                                        // 0x1180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ThrowConsumablesEnabled;                           // 0x1188(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsThrowing;                                        // 0x11B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ThrowInstantly;                                    // 0x11B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddValidCamera();
	void EventReceived_C5FC589A4C31C6C8A60619A6F55907E1(const struct FGameplayEventData& Payload);
	void EventReceived_CA623334497AFEB4BDEC4F9779D87971(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnAbilityInputReleased();
	void OnBlendOut_79F4515348DF72ED42F690A84ED57C5A();
	void OnCancelled_79F4515348DF72ED42F690A84ED57C5A();
	void OnCompleted_79F4515348DF72ED42F690A84ED57C5A();
	void OnInterrupted_79F4515348DF72ED42F690A84ED57C5A();
	void OnSync_23623B5B48A84925988E58BDBA0FE7BB();
	void PrethrowSetup();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C">();
	}
	static class UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C>();
	}
};
static_assert(alignof(UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C) == 0x000008, "Wrong alignment on UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C");
static_assert(sizeof(UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C) == 0x0011B8, "Wrong size on UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C");
static_assert(offsetof(UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C, UberGraphFrame_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C) == 0x001158, "Member 'UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C::UberGraphFrame_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C, Tag_Block_Ability_Activation) == 0x001160, "Member 'UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C::Tag_Block_Ability_Activation' has a wrong offset!");
static_assert(offsetof(UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C, CameraMode) == 0x001180, "Member 'UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C::CameraMode' has a wrong offset!");
static_assert(offsetof(UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C, ThrowConsumablesEnabled) == 0x001188, "Member 'UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C::ThrowConsumablesEnabled' has a wrong offset!");
static_assert(offsetof(UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C, IsThrowing) == 0x0011B0, "Member 'UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C::IsThrowing' has a wrong offset!");
static_assert(offsetof(UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C, ThrowInstantly) == 0x0011B1, "Member 'UGA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C::ThrowInstantly' has a wrong offset!");

}

