#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Grenade_WithTrajectory_Deprecated

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.AddCookGC
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_Deprecated_C_AddCookGC final
{
public:
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_AddCookGC) == 0x000001, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_Deprecated_C_AddCookGC");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_AddCookGC) == 0x000001, "Wrong size on GA_Athena_Grenade_WithTrajectory_Deprecated_C_AddCookGC");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_AddCookGC, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_AddCookGC::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.AthenaProjectileSpawned
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_Deprecated_C_AthenaProjectileSpawned final
{
public:
	class AFortProjectileBase*                    ProjectileReference_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_AthenaProjectileSpawned) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_Deprecated_C_AthenaProjectileSpawned");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_AthenaProjectileSpawned) == 0x000008, "Wrong size on GA_Athena_Grenade_WithTrajectory_Deprecated_C_AthenaProjectileSpawned");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_AthenaProjectileSpawned, ProjectileReference_0) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_AthenaProjectileSpawned::ProjectileReference_0' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.Cancelled_323490334D0637A64B5A0B8A74BD8BBA
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_323490334D0637A64B5A0B8A74BD8BBA final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_323490334D0637A64B5A0B8A74BD8BBA) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_323490334D0637A64B5A0B8A74BD8BBA");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_323490334D0637A64B5A0B8A74BD8BBA) == 0x000030, "Wrong size on GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_323490334D0637A64B5A0B8A74BD8BBA");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_323490334D0637A64B5A0B8A74BD8BBA, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_323490334D0637A64B5A0B8A74BD8BBA::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_323490334D0637A64B5A0B8A74BD8BBA, ApplicationTag) == 0x000028, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_323490334D0637A64B5A0B8A74BD8BBA::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.Cancelled_B08560984B3818F6EECB3C9A92E61ADC
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC) == 0x000030, "Wrong size on GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC, ApplicationTag) == 0x000028, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.Completed_323490334D0637A64B5A0B8A74BD8BBA
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_323490334D0637A64B5A0B8A74BD8BBA final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_323490334D0637A64B5A0B8A74BD8BBA) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_323490334D0637A64B5A0B8A74BD8BBA");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_323490334D0637A64B5A0B8A74BD8BBA) == 0x000030, "Wrong size on GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_323490334D0637A64B5A0B8A74BD8BBA");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_323490334D0637A64B5A0B8A74BD8BBA, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_323490334D0637A64B5A0B8A74BD8BBA::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_323490334D0637A64B5A0B8A74BD8BBA, ApplicationTag) == 0x000028, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_323490334D0637A64B5A0B8A74BD8BBA::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.Completed_B08560984B3818F6EECB3C9A92E61ADC
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_B08560984B3818F6EECB3C9A92E61ADC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_B08560984B3818F6EECB3C9A92E61ADC) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_B08560984B3818F6EECB3C9A92E61ADC) == 0x000030, "Wrong size on GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_B08560984B3818F6EECB3C9A92E61ADC, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_B08560984B3818F6EECB3C9A92E61ADC::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_B08560984B3818F6EECB3C9A92E61ADC, ApplicationTag) == 0x000028, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_Completed_B08560984B3818F6EECB3C9A92E61ADC::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.ExecuteThrowGC
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteThrowGC final
{
public:
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteThrowGC) == 0x000001, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteThrowGC");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteThrowGC) == 0x000001, "Wrong size on GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteThrowGC");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteThrowGC, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteThrowGC::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory_Deprecated.GA_Athena_Grenade_WithTrajectory_Deprecated_C.ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated
// 0x0690 (0x0690 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0050(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0060(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0088(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x008C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0098(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x00A8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x00D0(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x00D8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0100(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0104(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0110(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0118(0x0028)()
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0140(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0198(0x00B0)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0248(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0270(0x0010)(ReferenceParm)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue_1; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Direction;                      // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SpawnLocationAndRotation_OutLoc;          // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SpawnLocationAndRotation_OutRot;          // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_SetupGrenade_Base_Grenade;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetupGrenade_Projectile_Speed;            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       CallFunc_SetupGrenade_Explosion_Gameplay_Spec;     // 0x0310(0x00B8)()
	float                                         CallFunc_SetupGrenade_Projectile_Gravity_Scale;    // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       CallFunc_SetupGrenade_Additional_Explosion_Gameplay_Spec; // 0x03D0(0x00B8)()
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed;   // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_5;                   // 0x04A0(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_5;               // 0x04C8(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_2;                            // 0x04D0(0x0028)()
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x04F8(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FD[0x3];                                      // 0x04FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0500(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0510(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x0538(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x054C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn_1;            // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582[0x6];                                      // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn_2;            // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn_3;            // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn_4;            // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    K2Node_CustomEvent_ProjectileReference;            // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue_1;                  // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_4;                   // 0x05F8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_4;               // 0x0620(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_625[0x3];                                      // 0x0625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileTrajectory*              CallFunc_SpawnTrajectoryIndicator_ReturnValue;     // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641[0x3];                                      // 0x0641(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0644(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn_5;            // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue;              // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue_1;           // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0662(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_663[0x1];                                      // 0x0663(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortProjectileTrajectoryData          CallFunc_GetProjectileTrajectoryData_TrajectoryData; // 0x0664(0x0020)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0684(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685[0x3];                                      // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated) == 0x000690, "Wrong size on GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, EntryPoint) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000008, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_5) == 0x000050, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_TargetData_2) == 0x000060, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_ApplicationTag_2) == 0x000088, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_6) == 0x00008C, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_7) == 0x000098, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_TargetData_1) == 0x0000A8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_ApplicationTag_1) == 0x0000D0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_TargetData) == 0x0000D8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_ApplicationTag) == 0x000100, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_8) == 0x000104, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, Temp_struct_Variable) == 0x000110, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, Temp_struct_Variable_1) == 0x000118, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_GetActorInfo_ReturnValue) == 0x000140, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000188, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_MakeStruct_GameplayEventData) == 0x000198, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000248, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000270, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue_1) == 0x000280, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_IsValid_ReturnValue_1) == 0x000288, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_Location) == 0x000290, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_Direction) == 0x0002A8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_SpawnLocationAndRotation_OutLoc) == 0x0002C0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_SpawnLocationAndRotation_OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_SpawnLocationAndRotation_OutRot) == 0x0002D8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_SpawnLocationAndRotation_OutRot' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_BreakRotator_Roll) == 0x0002F0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_BreakRotator_Pitch) == 0x0002F4, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_BreakRotator_Yaw) == 0x0002F8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_SetupGrenade_Base_Grenade) == 0x000300, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_SetupGrenade_Base_Grenade' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_SetupGrenade_Projectile_Speed) == 0x000308, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_SetupGrenade_Projectile_Speed' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_SetupGrenade_Explosion_Gameplay_Spec) == 0x000310, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_SetupGrenade_Explosion_Gameplay_Spec' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_SetupGrenade_Projectile_Gravity_Scale) == 0x0003C8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_SetupGrenade_Projectile_Gravity_Scale' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_SetupGrenade_Additional_Explosion_Gameplay_Spec) == 0x0003D0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_SetupGrenade_Additional_Explosion_Gameplay_Spec' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_BreakRotator_Roll_1) == 0x000488, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_BreakRotator_Pitch_1) == 0x00048C, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_BreakRotator_Yaw_1) == 0x000490, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed) == 0x000494, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_IsStandalone_ReturnValue) == 0x000498, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_TargetData_5) == 0x0004A0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_TargetData_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_ApplicationTag_5) == 0x0004C8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_ApplicationTag_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_Event_bWasCancelled) == 0x0004CC, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, Temp_struct_Variable_2) == 0x0004D0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, Temp_struct_Variable_3) == 0x0004F8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_K2_CommitAbility_ReturnValue) == 0x0004FC, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_9) == 0x000500, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_TargetData_3) == 0x000510, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_ApplicationTag_3) == 0x000538, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000540, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_IsValid_ReturnValue_2) == 0x000548, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CreateDelegate_OutputDelegate_10) == 0x00054C, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_WaitDelay_ReturnValue) == 0x000558, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_IsValid_ReturnValue_3) == 0x000560, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_GetOwningPlayer_Player_Pawn) == 0x000568, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_GetOwningPlayer_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_HasAuthority_ReturnValue) == 0x000570, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_GetOwningPlayer_Player_Pawn_1) == 0x000578, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_GetOwningPlayer_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_Not_PreBool_ReturnValue) == 0x000580, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_BooleanOR_ReturnValue) == 0x000581, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_GetOwningPlayer_Player_Pawn_2) == 0x000588, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_GetOwningPlayer_Player_Pawn_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_GetOwningPlayer_Player_Pawn_3) == 0x000590, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_GetOwningPlayer_Player_Pawn_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_SpawnProjectile_ReturnValue) == 0x000598, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0005A0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0005B8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_VSize_ReturnValue) == 0x0005D0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_GetOwningPlayer_Player_Pawn_4) == 0x0005D8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_GetOwningPlayer_Player_Pawn_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_ProjectileReference) == 0x0005E0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_ProjectileReference' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_WaitDelay_ReturnValue_1) == 0x0005E8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_WaitDelay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_IsValid_ReturnValue_4) == 0x0005F0, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_TargetData_4) == 0x0005F8, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_TargetData_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, K2Node_CustomEvent_ApplicationTag_4) == 0x000620, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::K2Node_CustomEvent_ApplicationTag_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000624, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_SpawnTrajectoryIndicator_ReturnValue) == 0x000628, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_SpawnTrajectoryIndicator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_Not_PreBool_ReturnValue_1) == 0x000630, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000638, "Member 'GA_Athena_Grenade_WithTrajectory_Deprecated_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory_Deprecated::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
