#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Knockback_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Knockback_Parent.GA_Athena_Knockback_Parent_C.LaunchBuldingActors
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Knockback_Parent_C_LaunchBuldingActors final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Knockback_Parent_C_LaunchBuldingActors) == 0x000008, "Wrong alignment on GA_Athena_Knockback_Parent_C_LaunchBuldingActors");
static_assert(sizeof(GA_Athena_Knockback_Parent_C_LaunchBuldingActors) == 0x000008, "Wrong size on GA_Athena_Knockback_Parent_C_LaunchBuldingActors");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_LaunchBuldingActors, Actor) == 0x000000, "Member 'GA_Athena_Knockback_Parent_C_LaunchBuldingActors::Actor' has a wrong offset!");

// Function GA_Athena_Knockback_Parent.GA_Athena_Knockback_Parent_C.GetTargetLocation
// 0x0118 (0x0118 - 0x0000)
struct GA_Athena_Knockback_Parent_C_GetTargetLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Knockback_Parent_C_GetTargetLocation) == 0x000008, "Wrong alignment on GA_Athena_Knockback_Parent_C_GetTargetLocation");
static_assert(sizeof(GA_Athena_Knockback_Parent_C_GetTargetLocation) == 0x000118, "Wrong size on GA_Athena_Knockback_Parent_C_GetTargetLocation");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, ReturnValue) == 0x000000, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_GetValueAtLevel_ReturnValue) == 0x000018, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00001C, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000038, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_MakeVector_ReturnValue_1) == 0x000058, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_Normal_ReturnValue) == 0x0000A0, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000E8, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetTargetLocation, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000100, "Member 'GA_Athena_Knockback_Parent_C_GetTargetLocation::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");

// Function GA_Athena_Knockback_Parent.GA_Athena_Knockback_Parent_C.GetKnockbackOrigin
// 0x0038 (0x0038 - 0x0000)
struct GA_Athena_Knockback_Parent_C_GetKnockbackOrigin final
{
public:
	class AActor*                                 OriginActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Knockback_Parent_C_GetKnockbackOrigin) == 0x000008, "Wrong alignment on GA_Athena_Knockback_Parent_C_GetKnockbackOrigin");
static_assert(sizeof(GA_Athena_Knockback_Parent_C_GetKnockbackOrigin) == 0x000038, "Wrong size on GA_Athena_Knockback_Parent_C_GetKnockbackOrigin");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetKnockbackOrigin, OriginActor) == 0x000000, "Member 'GA_Athena_Knockback_Parent_C_GetKnockbackOrigin::OriginActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetKnockbackOrigin, ReturnValue) == 0x000008, "Member 'GA_Athena_Knockback_Parent_C_GetKnockbackOrigin::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_GetKnockbackOrigin, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'GA_Athena_Knockback_Parent_C_GetKnockbackOrigin::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function GA_Athena_Knockback_Parent.GA_Athena_Knockback_Parent_C.Get Initial Knock Mag
// 0x00C8 (0x00C8 - 0x0000)
struct GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchMag;                                         // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag) == 0x000008, "Wrong alignment on GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag");
static_assert(sizeof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag) == 0x0000C8, "Wrong size on GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, Direction) == 0x000000, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::Direction' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, LaunchMag) == 0x000018, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::LaunchMag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_Normal_ReturnValue) == 0x000030, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_GetValueAtLevel_ReturnValue) == 0x000048, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_BreakVector_X) == 0x00004C, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_BreakVector_Y) == 0x000050, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_BreakVector_Z) == 0x000054, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_FClamp_ReturnValue) == 0x000058, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_SelectFloat_ReturnValue) == 0x00005C, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000060, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000064, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_SelectFloat_ReturnValue_1) == 0x000068, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00006C, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000070, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000074, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_SelectFloat_ReturnValue_2) == 0x000078, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00007C, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000080, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_BreakVector_X_1) == 0x0000A0, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_BreakVector_Y_1) == 0x0000A4, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_BreakVector_Z_1) == 0x0000A8, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000AC, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag, CallFunc_MakeVector_ReturnValue_1) == 0x0000B0, "Member 'GA_Athena_Knockback_Parent_C_Get_Initial_Knock_Mag::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function GA_Athena_Knockback_Parent.GA_Athena_Knockback_Parent_C.Find Launcher
// 0x0010 (0x0010 - 0x0000)
struct GA_Athena_Knockback_Parent_C_Find_Launcher final
{
public:
	class AActor*                                 DefaultLauncher;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LauncherOut;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Knockback_Parent_C_Find_Launcher) == 0x000008, "Wrong alignment on GA_Athena_Knockback_Parent_C_Find_Launcher");
static_assert(sizeof(GA_Athena_Knockback_Parent_C_Find_Launcher) == 0x000010, "Wrong size on GA_Athena_Knockback_Parent_C_Find_Launcher");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Find_Launcher, DefaultLauncher) == 0x000000, "Member 'GA_Athena_Knockback_Parent_C_Find_Launcher::DefaultLauncher' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_Find_Launcher, LauncherOut) == 0x000008, "Member 'GA_Athena_Knockback_Parent_C_Find_Launcher::LauncherOut' has a wrong offset!");

// Function GA_Athena_Knockback_Parent.GA_Athena_Knockback_Parent_C.ExecuteUbergraph_GA_Athena_Knockback_Parent
// 0x0420 (0x0420 - 0x0000)
struct GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0008(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Find_Launcher_LauncherOut;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetKnockbackOrigin_ReturnValue;           // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Select_Default;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaAIBotController*             K2Node_DynamicCast_AsFort_Athena_AIBot_Controller; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateDistanceMod_ModAmount;           // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateDistanceMod_AboveMax;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Initial_Knock_Mag_LaunchMag;          // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculateVelocityMaintained_ModifiedLaunchSpeed; // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Vel;                            // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTargetLocation_ReturnValue;            // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyRootMotionMoveToForce* CallFunc_ApplyRootMotionMoveToForce_ReturnValue;   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CheckGravityScale_ReturnValue;            // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CheckGravityScale_ReturnValue_1;          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyRootMotionConstantForce* CallFunc_ApplyRootMotionConstantForce_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0250(0x0010)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_SetDuration_ReturnValue;                  // 0x0280(0x0010)()
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x02A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActorEnableCollision_ReturnValue;      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPhysicsObjectComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02F4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0300(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x030C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x037C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x03A8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x6];                                      // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalcVehicleMult_ReturnValue;              // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent) == 0x000008, "Wrong alignment on GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent");
static_assert(sizeof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent) == 0x000420, "Wrong size on GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, EntryPoint) == 0x000000, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000008, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_EffectContextGetEffectCauser_ReturnValue) == 0x000020, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_EffectContextGetEffectCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000028, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_Find_Launcher_LauncherOut) == 0x000030, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_Find_Launcher_LauncherOut' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000050, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, Temp_bool_Variable) == 0x000058, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000060, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_BooleanOR_ReturnValue) == 0x000068, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_IsValid_ReturnValue_2) == 0x000069, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, Temp_bool_Variable_1) == 0x00006A, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_GetKnockbackOrigin_ReturnValue) == 0x000070, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_GetKnockbackOrigin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_Select_Default) == 0x000088, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000090, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, Temp_bool_Variable_2) == 0x000091, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_AsFort_Pawn) == 0x000098, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_GetController_ReturnValue) == 0x0000A8, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_IsBotControlled_ReturnValue) == 0x0000B0, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_IsBotControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_AsFort_Athena_AIBot_Controller) == 0x0000B8, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_AsFort_Athena_AIBot_Controller' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000C8, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x0000D8, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_bSuccess_3) == 0x0000E8, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_GetVehicleActorPtr_ReturnValue) == 0x0000F0, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_GetVehicleActorPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_AsFort_Vehicle_Interface_1) == 0x0000F8, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_AsFort_Vehicle_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_bSuccess_4) == 0x000108, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, Temp_bool_Variable_3) == 0x000109, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000110, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_DynamicCast_bSuccess_5) == 0x000120, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000128, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000140, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_CalculateDistanceMod_ModAmount) == 0x000144, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_CalculateDistanceMod_ModAmount' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_CalculateDistanceMod_AboveMax) == 0x000148, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_CalculateDistanceMod_AboveMax' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000150, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000168, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_Select_Default_1) == 0x000180, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_Get_Initial_Knock_Mag_LaunchMag) == 0x000198, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_Get_Initial_Knock_Mag_LaunchMag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_CalculateVelocityMaintained_ModifiedLaunchSpeed) == 0x0001B0, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_CalculateVelocityMaintained_ModifiedLaunchSpeed' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, K2Node_CustomEvent_Vel) == 0x0001C8, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::K2Node_CustomEvent_Vel' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_Normal_ReturnValue) == 0x0001E0, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent, CallFunc_VSize_ReturnValue) == 0x0001F8, "Member 'GA_Athena_Knockback_Parent_C_ExecuteUbergraph_GA_Athena_Knockback_Parent::CallFunc_VSize_ReturnValue' has a wrong offset!");
