#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_AppleSun_RemoveFallImmunity

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_AppleSun_RemoveFallImmunity.GA_Athena_AppleSun_RemoveFallImmunity_C.ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity
// 0x00F8 (0x00F8 - 0x0000)
struct GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitMovementModeChange*    CallFunc_CreateWaitMovementModeChange_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_NewMovementMode_1;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_NewMovementMode;                // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMovementMode NewMovementMode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMovementMode NewMovementMode)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitMovementModeChange*    CallFunc_CreateWaitMovementModeChange_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 Temp_byte_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0088(0x0020)()
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsTouchingGround_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity) == 0x000008, "Wrong alignment on GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity");
static_assert(sizeof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity) == 0x0000F8, "Wrong size on GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, EntryPoint) == 0x000000, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000008, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, Temp_byte_Variable) == 0x000011, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_CreateWaitMovementModeChange_ReturnValue) == 0x000018, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_CreateWaitMovementModeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_IsValid_ReturnValue_1) == 0x00002C, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_CustomEvent_NewMovementMode_1) == 0x00002D, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_CustomEvent_NewMovementMode_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_CustomEvent_NewMovementMode) == 0x00002E, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_CustomEvent_NewMovementMode' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000040, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_DynamicCast_AsFort_Pawn) == 0x000048, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_CreateDelegate_OutputDelegate_2) == 0x000054, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_CreateWaitMovementModeChange_ReturnValue_1) == 0x000078, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_CreateWaitMovementModeChange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, Temp_byte_Variable_1) == 0x000080, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_IsValid_ReturnValue_2) == 0x000081, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000088, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000A8, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_IsValid_ReturnValue_3) == 0x0000B1, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_GetVehicleUInterface_ReturnValue) == 0x0000B8, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_IsTouchingGround_ReturnValue) == 0x0000C8, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_IsTouchingGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x0000D0, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_IsValid_ReturnValue_4) == 0x0000D8, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_IsInVehicle_ReturnValue) == 0x0000D9, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0000E0, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000F0, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFallImmunity::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function GA_Athena_AppleSun_RemoveFallImmunity.GA_Athena_AppleSun_RemoveFallImmunity_C.OnChange_3DD8539A4FF5097BAD1292AD341357CA
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA final
{
public:
	EMovementMode                                 NewMovementMode;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA) == 0x000001, "Wrong alignment on GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA");
static_assert(sizeof(GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA) == 0x000001, "Wrong size on GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA, NewMovementMode) == 0x000000, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA::NewMovementMode' has a wrong offset!");

// Function GA_Athena_AppleSun_RemoveFallImmunity.GA_Athena_AppleSun_RemoveFallImmunity_C.OnChange_E50882E9463BCB5DDE04EE8407D66091
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_E50882E9463BCB5DDE04EE8407D66091 final
{
public:
	EMovementMode                                 NewMovementMode;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_E50882E9463BCB5DDE04EE8407D66091) == 0x000001, "Wrong alignment on GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_E50882E9463BCB5DDE04EE8407D66091");
static_assert(sizeof(GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_E50882E9463BCB5DDE04EE8407D66091) == 0x000001, "Wrong size on GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_E50882E9463BCB5DDE04EE8407D66091");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_E50882E9463BCB5DDE04EE8407D66091, NewMovementMode) == 0x000000, "Member 'GA_Athena_AppleSun_RemoveFallImmunity_C_OnChange_E50882E9463BCB5DDE04EE8407D66091::NewMovementMode' has a wrong offset!");

}

