#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_TacticalSprint_UI

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Athena_TacticalSprint_UI.GA_Athena_TacticalSprint_UI_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_TacticalSprint_UI_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_UI_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_TacticalSprint_UI_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_TacticalSprint_UI_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_TacticalSprint_UI_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_TacticalSprint_UI_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_TacticalSprint_UI_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_TacticalSprint_UI.GA_Athena_TacticalSprint_UI_C.ExecuteUbergraph_GA_Athena_TacticalSprint_UI
// 0x0040 (0x0040 - 0x0000)
struct GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicUIManager*                      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDynamicUIManager*                      CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI");
static_assert(sizeof(GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI) == 0x000040, "Wrong size on GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI");
static_assert(offsetof(GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI, EntryPoint) == 0x000000, "Member 'GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI, K2Node_Event_bWasCancelled) == 0x000010, "Member 'GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000018, "Member 'GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000020, "Member 'GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'GA_Athena_TacticalSprint_UI_C_ExecuteUbergraph_GA_Athena_TacticalSprint_UI::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

}

