#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HidingProp_Teleport

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_HidingProp_Teleport.GA_Athena_HidingProp_Teleport_C
// 0x0088 (0x0B98 - 0x0B10)
class UGA_Athena_HidingProp_Teleport_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void()>              NewEventDispatcher_0;                              // 0x0B18(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AB_HidingProp_C*                        HidingProp;                                        // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_HidingProp_C*                        TargetTeleporter;                                  // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x0B38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           TargetPropTeleportingCue;                          // 0x0B58(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5C[0x4];                                      // 0x0B5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WobbleHandle;                                      // 0x0B60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           WobbleCue;                                         // 0x0B68(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ServerWorldTime;                                   // 0x0B6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EnterCue;                                          // 0x0B70(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HidingInPropTag;                                   // 0x0B74(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ChangeEquipmentTag;                                // 0x0B78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Added_67FE14EA4DF2D8C2DB494AA89443681B();
	void Added_CB8220A04B74338E758C11B7371D4630();
	void Added_F96D6DD549939CA425D2D1BE1AD32090();
	void Added_FD079A2341CDD832DF47CD975DFC3BB3();
	void ExecuteUbergraph_GA_Athena_HidingProp_Teleport(int32 EntryPoint);
	void FailedToActivatePassiveAbility();
	void GrapplerFailSafe(class AFortPawn* FortPawn);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnComplete_EE0FA6804073079396C44591432259C0();
	void OnPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void QuestUpdate(class AFortPawn* Pawn);
	void Wobble();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_HidingProp_Teleport_C">();
	}
	static class UGA_Athena_HidingProp_Teleport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_HidingProp_Teleport_C>();
	}
};
static_assert(alignof(UGA_Athena_HidingProp_Teleport_C) == 0x000008, "Wrong alignment on UGA_Athena_HidingProp_Teleport_C");
static_assert(sizeof(UGA_Athena_HidingProp_Teleport_C) == 0x000B98, "Wrong size on UGA_Athena_HidingProp_Teleport_C");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Athena_HidingProp_Teleport_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, NewEventDispatcher_0) == 0x000B18, "Member 'UGA_Athena_HidingProp_Teleport_C::NewEventDispatcher_0' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, HidingProp) == 0x000B28, "Member 'UGA_Athena_HidingProp_Teleport_C::HidingProp' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, TargetTeleporter) == 0x000B30, "Member 'UGA_Athena_HidingProp_Teleport_C::TargetTeleporter' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, T_HudElementToHide) == 0x000B38, "Member 'UGA_Athena_HidingProp_Teleport_C::T_HudElementToHide' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, TargetPropTeleportingCue) == 0x000B58, "Member 'UGA_Athena_HidingProp_Teleport_C::TargetPropTeleportingCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, WobbleHandle) == 0x000B60, "Member 'UGA_Athena_HidingProp_Teleport_C::WobbleHandle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, WobbleCue) == 0x000B68, "Member 'UGA_Athena_HidingProp_Teleport_C::WobbleCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, ServerWorldTime) == 0x000B6C, "Member 'UGA_Athena_HidingProp_Teleport_C::ServerWorldTime' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, EnterCue) == 0x000B70, "Member 'UGA_Athena_HidingProp_Teleport_C::EnterCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, HidingInPropTag) == 0x000B74, "Member 'UGA_Athena_HidingProp_Teleport_C::HidingInPropTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, ChangeEquipmentTag) == 0x000B78, "Member 'UGA_Athena_HidingProp_Teleport_C::ChangeEquipmentTag' has a wrong offset!");

}

