#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Sentry_Targeting

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Sentry_Targeting.GA_Athena_Sentry_Targeting_C
// 0x0048 (0x0B58 - 0x0B10)
class UGA_Athena_Sentry_Targeting_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABGA_Athena_Sentry_Parent_C*            SelfSentryRef;                                     // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LostTarget;                                        // 0x0B20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B21[0x7];                                      // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_DefaultIgnoreTags;                              // 0x0B28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ConeRadius;                                        // 0x0B48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConeDistance;                                      // 0x0B4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLos;                                            // 0x0B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CanTarget(class AFortPawn* Target);
	void ExecuteUbergraph_GA_Athena_Sentry_Targeting(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Sentry_Targeting_C">();
	}
	static class UGA_Athena_Sentry_Targeting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Sentry_Targeting_C>();
	}
};
static_assert(alignof(UGA_Athena_Sentry_Targeting_C) == 0x000008, "Wrong alignment on UGA_Athena_Sentry_Targeting_C");
static_assert(sizeof(UGA_Athena_Sentry_Targeting_C) == 0x000B58, "Wrong size on UGA_Athena_Sentry_Targeting_C");
static_assert(offsetof(UGA_Athena_Sentry_Targeting_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Athena_Sentry_Targeting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Sentry_Targeting_C, SelfSentryRef) == 0x000B18, "Member 'UGA_Athena_Sentry_Targeting_C::SelfSentryRef' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Sentry_Targeting_C, LostTarget) == 0x000B20, "Member 'UGA_Athena_Sentry_Targeting_C::LostTarget' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Sentry_Targeting_C, TC_DefaultIgnoreTags) == 0x000B28, "Member 'UGA_Athena_Sentry_Targeting_C::TC_DefaultIgnoreTags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Sentry_Targeting_C, ConeRadius) == 0x000B48, "Member 'UGA_Athena_Sentry_Targeting_C::ConeRadius' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Sentry_Targeting_C, ConeDistance) == 0x000B4C, "Member 'UGA_Athena_Sentry_Targeting_C::ConeDistance' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Sentry_Targeting_C, UseLos) == 0x000B50, "Member 'UGA_Athena_Sentry_Targeting_C::UseLos' has a wrong offset!");

}

