#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AthenaExitVehicle

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AthenaExitVehicle.GA_AthenaExitVehicle_C
// 0x0030 (0x0B40 - 0x0B10)
class UGA_AthenaExitVehicle_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Keep_DBNO_players_in_Vehicles;                     // 0x0B18(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1C[0x4];                                      // 0x0B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Event_Damage_Died_Tags;                            // 0x0B20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_AthenaExitVehicle(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AthenaExitVehicle_C">();
	}
	static class UGA_AthenaExitVehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AthenaExitVehicle_C>();
	}
};
static_assert(alignof(UGA_AthenaExitVehicle_C) == 0x000008, "Wrong alignment on UGA_AthenaExitVehicle_C");
static_assert(sizeof(UGA_AthenaExitVehicle_C) == 0x000B40, "Wrong size on UGA_AthenaExitVehicle_C");
static_assert(offsetof(UGA_AthenaExitVehicle_C, UberGraphFrame) == 0x000B10, "Member 'UGA_AthenaExitVehicle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_AthenaExitVehicle_C, Keep_DBNO_players_in_Vehicles) == 0x000B18, "Member 'UGA_AthenaExitVehicle_C::Keep_DBNO_players_in_Vehicles' has a wrong offset!");
static_assert(offsetof(UGA_AthenaExitVehicle_C, Event_Damage_Died_Tags) == 0x000B20, "Member 'UGA_AthenaExitVehicle_C::Event_Damage_Died_Tags' has a wrong offset!");

}

