#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent.GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C.AddValidCamera
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_AddValidCamera final
{
public:
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_AddValidCamera) == 0x000001, "Wrong alignment on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_AddValidCamera");
static_assert(sizeof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_AddValidCamera) == 0x000001, "Wrong size on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_AddValidCamera");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_AddValidCamera, CallFunc_IsValidClass_ReturnValue) == 0x000000, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_AddValidCamera::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent.GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C.EventReceived_C5FC589A4C31C6C8A60619A6F55907E1
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_C5FC589A4C31C6C8A60619A6F55907E1 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_C5FC589A4C31C6C8A60619A6F55907E1) == 0x000008, "Wrong alignment on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_C5FC589A4C31C6C8A60619A6F55907E1");
static_assert(sizeof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_C5FC589A4C31C6C8A60619A6F55907E1) == 0x0000B0, "Wrong size on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_C5FC589A4C31C6C8A60619A6F55907E1");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_C5FC589A4C31C6C8A60619A6F55907E1, Payload) == 0x000000, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_C5FC589A4C31C6C8A60619A6F55907E1::Payload' has a wrong offset!");

// Function GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent.GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C.EventReceived_CA623334497AFEB4BDEC4F9779D87971
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_CA623334497AFEB4BDEC4F9779D87971 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_CA623334497AFEB4BDEC4F9779D87971) == 0x000008, "Wrong alignment on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_CA623334497AFEB4BDEC4F9779D87971");
static_assert(sizeof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_CA623334497AFEB4BDEC4F9779D87971) == 0x0000B0, "Wrong size on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_CA623334497AFEB4BDEC4F9779D87971");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_CA623334497AFEB4BDEC4F9779D87971, Payload) == 0x000000, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_EventReceived_CA623334497AFEB4BDEC4F9779D87971::Payload' has a wrong offset!");

// Function GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent.GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C.ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent
// 0x0360 (0x0360 - 0x0000)
struct GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0028(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00E8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x01B8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x01C8(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0278(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileTrajectory*              CallFunc_SpawnTrajectoryIndicator_ReturnValue;     // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0348(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent) == 0x000008, "Wrong alignment on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent");
static_assert(sizeof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent) == 0x000360, "Wrong size on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, EntryPoint) == 0x000000, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x00001C, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, K2Node_CustomEvent_Payload_1) == 0x000028, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, Temp_struct_Variable) == 0x0000E8, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000198, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_IsValid_ReturnValue) == 0x0001A0, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001A4, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_WaitNetSync_ReturnValue) == 0x0001B0, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001B8, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_IsValid_ReturnValue_1) == 0x0001C4, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, K2Node_CustomEvent_Payload) == 0x0001C8, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, Temp_struct_Variable_1) == 0x000278, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000328, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_IsValid_ReturnValue_2) == 0x000330, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000331, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_SpawnTrajectoryIndicator_ReturnValue) == 0x000338, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_SpawnTrajectoryIndicator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000340, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, K2Node_CreateDelegate_OutputDelegate_6) == 0x000348, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000354, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000358, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00035C, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent, CallFunc_IsUsingTouch_ReturnValue) == 0x00035D, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_ExecuteUbergraph_GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");

// Function GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent.GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C.K2_CanActivateAbility
// 0x0090 (0x0090 - 0x0000)
struct GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility) == 0x000090, "Wrong size on GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility, Temp_bool_Variable) == 0x000071, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000078, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility, CallFunc_Not_PreBool_ReturnValue) == 0x000089, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x00008A, "Member 'GA_Athena_CampsiteImprovement_Thrown_2nd_Trajectory_Parent_C_K2_CanActivateAbility::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

}

