#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Player_DoorBash

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.StartEndTrace
// 0x0098 (0x0098 - 0x0000)
struct GA_Athena_Player_DoorBash_C_StartEndTrace final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_StartEndTrace) == 0x000008, "Wrong alignment on GA_Athena_Player_DoorBash_C_StartEndTrace");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_StartEndTrace) == 0x000098, "Wrong size on GA_Athena_Player_DoorBash_C_StartEndTrace");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_StartEndTrace, Start) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_StartEndTrace::Start' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_StartEndTrace, End) == 0x000018, "Member 'GA_Athena_Player_DoorBash_C_StartEndTrace::End' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_StartEndTrace, CallFunc_GetActorForwardVector_ReturnValue) == 0x000030, "Member 'GA_Athena_Player_DoorBash_C_StartEndTrace::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_StartEndTrace, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'GA_Athena_Player_DoorBash_C_StartEndTrace::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_StartEndTrace, CallFunc_GetValueAtLevel_ReturnValue) == 0x000060, "Member 'GA_Athena_Player_DoorBash_C_StartEndTrace::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_StartEndTrace, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000068, "Member 'GA_Athena_Player_DoorBash_C_StartEndTrace::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_StartEndTrace, CallFunc_Add_VectorVector_ReturnValue) == 0x000080, "Member 'GA_Athena_Player_DoorBash_C_StartEndTrace::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.SetAutoOpenSwingingDoors
// 0x0020 (0x0020 - 0x0000)
struct GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors final
{
public:
	bool                                          Open_Swinging_Doors_Automatically;                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortControllerComponent_Interaction*   CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors) == 0x000008, "Wrong alignment on GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors) == 0x000020, "Wrong size on GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors, Open_Swinging_Doors_Automatically) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors::Open_Swinging_Doors_Automatically' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors, CallFunc_IsValid_ReturnValue_2) == 0x000019, "Member 'GA_Athena_Player_DoorBash_C_SetAutoOpenSwingingDoors::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.RestartTimer
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Athena_Player_DoorBash_C_RestartTimer final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_RestartTimer) == 0x000008, "Wrong alignment on GA_Athena_Player_DoorBash_C_RestartTimer");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_RestartTimer) == 0x0000E0, "Wrong size on GA_Athena_Player_DoorBash_C_RestartTimer");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_RestartTimer, Hit) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_RestartTimer::Hit' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.OnNotifyEnd_155AF8ED474BC0B05C504AA683044E19
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_DoorBash_C_OnNotifyEnd_155AF8ED474BC0B05C504AA683044E19 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_OnNotifyEnd_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong alignment on GA_Athena_Player_DoorBash_C_OnNotifyEnd_155AF8ED474BC0B05C504AA683044E19");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_OnNotifyEnd_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong size on GA_Athena_Player_DoorBash_C_OnNotifyEnd_155AF8ED474BC0B05C504AA683044E19");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_OnNotifyEnd_155AF8ED474BC0B05C504AA683044E19, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_OnNotifyEnd_155AF8ED474BC0B05C504AA683044E19::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.OnNotifyBegin_155AF8ED474BC0B05C504AA683044E19
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_DoorBash_C_OnNotifyBegin_155AF8ED474BC0B05C504AA683044E19 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_OnNotifyBegin_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong alignment on GA_Athena_Player_DoorBash_C_OnNotifyBegin_155AF8ED474BC0B05C504AA683044E19");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_OnNotifyBegin_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong size on GA_Athena_Player_DoorBash_C_OnNotifyBegin_155AF8ED474BC0B05C504AA683044E19");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_OnNotifyBegin_155AF8ED474BC0B05C504AA683044E19, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_OnNotifyBegin_155AF8ED474BC0B05C504AA683044E19::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.OnInterrupted_155AF8ED474BC0B05C504AA683044E19
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_DoorBash_C_OnInterrupted_155AF8ED474BC0B05C504AA683044E19 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_OnInterrupted_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong alignment on GA_Athena_Player_DoorBash_C_OnInterrupted_155AF8ED474BC0B05C504AA683044E19");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_OnInterrupted_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong size on GA_Athena_Player_DoorBash_C_OnInterrupted_155AF8ED474BC0B05C504AA683044E19");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_OnInterrupted_155AF8ED474BC0B05C504AA683044E19, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_OnInterrupted_155AF8ED474BC0B05C504AA683044E19::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.OnCompleted_155AF8ED474BC0B05C504AA683044E19
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_DoorBash_C_OnCompleted_155AF8ED474BC0B05C504AA683044E19 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_OnCompleted_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong alignment on GA_Athena_Player_DoorBash_C_OnCompleted_155AF8ED474BC0B05C504AA683044E19");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_OnCompleted_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong size on GA_Athena_Player_DoorBash_C_OnCompleted_155AF8ED474BC0B05C504AA683044E19");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_OnCompleted_155AF8ED474BC0B05C504AA683044E19, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_OnCompleted_155AF8ED474BC0B05C504AA683044E19::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.OnCancelled_155AF8ED474BC0B05C504AA683044E19
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_DoorBash_C_OnCancelled_155AF8ED474BC0B05C504AA683044E19 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_OnCancelled_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong alignment on GA_Athena_Player_DoorBash_C_OnCancelled_155AF8ED474BC0B05C504AA683044E19");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_OnCancelled_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong size on GA_Athena_Player_DoorBash_C_OnCancelled_155AF8ED474BC0B05C504AA683044E19");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_OnCancelled_155AF8ED474BC0B05C504AA683044E19, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_OnCancelled_155AF8ED474BC0B05C504AA683044E19::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.OnBlendOut_155AF8ED474BC0B05C504AA683044E19
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_DoorBash_C_OnBlendOut_155AF8ED474BC0B05C504AA683044E19 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_OnBlendOut_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong alignment on GA_Athena_Player_DoorBash_C_OnBlendOut_155AF8ED474BC0B05C504AA683044E19");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_OnBlendOut_155AF8ED474BC0B05C504AA683044E19) == 0x000004, "Wrong size on GA_Athena_Player_DoorBash_C_OnBlendOut_155AF8ED474BC0B05C504AA683044E19");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_OnBlendOut_155AF8ED474BC0B05C504AA683044E19, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_OnBlendOut_155AF8ED474BC0B05C504AA683044E19::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Player_DoorBash_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Player_DoorBash_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Player_DoorBash_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.IsStillSprintingOrSlidingAsAbilityBegan
// 0x0048 (0x0048 - 0x0000)
struct GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> NewLocalVar_1;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan) == 0x000008, "Wrong alignment on GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan) == 0x000048, "Wrong size on GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan, ReturnValue) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan, NewLocalVar_1) == 0x000008, "Member 'GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000030, "Member 'GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000040, "Member 'GA_Athena_Player_DoorBash_C_IsStillSprintingOrSlidingAsAbilityBegan::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.IsSprintingOrSliding
// 0x0050 (0x0050 - 0x0000)
struct GA_Athena_Player_DoorBash_C_IsSprintingOrSliding final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> NewLocalVar_1;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0018(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_IsSprintingOrSliding) == 0x000008, "Wrong alignment on GA_Athena_Player_DoorBash_C_IsSprintingOrSliding");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_IsSprintingOrSliding) == 0x000050, "Wrong size on GA_Athena_Player_DoorBash_C_IsSprintingOrSliding");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsSprintingOrSliding, ReturnValue) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_IsSprintingOrSliding::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsSprintingOrSliding, NewLocalVar_1) == 0x000008, "Member 'GA_Athena_Player_DoorBash_C_IsSprintingOrSliding::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsSprintingOrSliding, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000018, "Member 'GA_Athena_Player_DoorBash_C_IsSprintingOrSliding::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsSprintingOrSliding, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000038, "Member 'GA_Athena_Player_DoorBash_C_IsSprintingOrSliding::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_IsSprintingOrSliding, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000048, "Member 'GA_Athena_Player_DoorBash_C_IsSprintingOrSliding::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.HasSwitchedToDifferentDoorBashingState
// 0x0048 (0x0048 - 0x0000)
struct GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> NewLocalVar_1;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState) == 0x000008, "Wrong alignment on GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState) == 0x000048, "Wrong size on GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState, ReturnValue) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState, NewLocalVar_1) == 0x000008, "Member 'GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000030, "Member 'GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000040, "Member 'GA_Athena_Player_DoorBash_C_HasSwitchedToDifferentDoorBashingState::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.HasActiveDoorBashAbility
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveAbilityWithAnyMatchingTag_ReturnValue; // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility) == 0x000008, "Wrong alignment on GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility) == 0x000018, "Wrong size on GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility, ReturnValue) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility, CallFunc_HasActiveAbilityWithAnyMatchingTag_ReturnValue) == 0x000012, "Member 'GA_Athena_Player_DoorBash_C_HasActiveDoorBashAbility::CallFunc_HasActiveAbilityWithAnyMatchingTag_ReturnValue' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.ExecuteUbergraph_GA_Athena_Player_DoorBash
// 0x02A8 (0x02A8 - 0x0000)
struct GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             CallFunc_GetCharacterGender_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag;                      // 0x0038(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_5;                    // 0x003C(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_StartEndTrace_Start;                      // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_StartEndTrace_End;                        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_1;                    // 0x00B8(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForDoor_HitDoor;                     // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CheckForDoor_HitLocation;                 // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00E4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x00F8(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_2;                    // 0x01E4(0x0004)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckVelocityThreshold_ReturnValue;       // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x01FC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBoolWithContext_ReturnValue;    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenActor_ReturnValue;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_3;                    // 0x0234(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x023C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0248(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0258(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             Temp_byte_Variable;                                // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0268(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue;     // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSprintingOrSliding_ReturnValue;         // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSprintingOrSliding_ReturnValue_1;       // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_293[0x1];                                      // 0x0293(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_4;                    // 0x0294(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0298(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash) == 0x000008, "Wrong alignment on GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash");
static_assert(sizeof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash) == 0x0002A8, "Wrong size on GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, EntryPoint) == 0x000000, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, Temp_struct_Variable) == 0x000004, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000008, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000018, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_GetCharacterGender_ReturnValue) == 0x000034, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_GetCharacterGender_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CustomEvent_NotifyTag) == 0x000038, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CustomEvent_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CustomEvent_NotifyTag_5) == 0x00003C, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CustomEvent_NotifyTag_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_Event_bWasCancelled) == 0x000058, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000060, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, Temp_bool_Has_Been_Initd_Variable) == 0x000069, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000070, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue_1) == 0x000078, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_IsValid_ReturnValue_2) == 0x000081, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_StartEndTrace_Start) == 0x000088, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_StartEndTrace_Start' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_StartEndTrace_End) == 0x0000A0, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_StartEndTrace_End' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CustomEvent_NotifyTag_1) == 0x0000B8, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CustomEvent_NotifyTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_CheckForDoor_HitDoor) == 0x0000BC, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_CheckForDoor_HitDoor' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_CheckForDoor_HitLocation) == 0x0000C0, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_CheckForDoor_HitLocation' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000D8, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000E4, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_IsValid_ReturnValue_3) == 0x0000F0, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CustomEvent_Hit) == 0x0000F8, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001D8, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CustomEvent_NotifyTag_2) == 0x0001E4, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CustomEvent_NotifyTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0001E8, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x0001F8, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_CheckVelocityThreshold_ReturnValue) == 0x0001F9, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_CheckVelocityThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001FC, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_GetValueAsBoolWithContext_ReturnValue) == 0x000208, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_GetValueAsBoolWithContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000210, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000220, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_GetController_ReturnValue) == 0x000228, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_OpenActor_ReturnValue) == 0x000230, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_OpenActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CustomEvent_NotifyTag_3) == 0x000234, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CustomEvent_NotifyTag_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_IsValid_ReturnValue_4) == 0x000238, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_8) == 0x00023C, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_9) == 0x000248, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, Temp_bool_IsClosed_Variable) == 0x000254, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_10) == 0x000258, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, Temp_byte_Variable) == 0x000264, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_11) == 0x000268, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_Select_Default) == 0x000278, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000280, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_PlayMontageAndWaitNotify_ReturnValue) == 0x000288, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_PlayMontageAndWaitNotify_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_IsValid_ReturnValue_5) == 0x000290, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_IsSprintingOrSliding_ReturnValue) == 0x000291, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_IsSprintingOrSliding_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, CallFunc_IsSprintingOrSliding_ReturnValue_1) == 0x000292, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::CallFunc_IsSprintingOrSliding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CustomEvent_NotifyTag_4) == 0x000294, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CustomEvent_NotifyTag_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash, K2Node_CreateDelegate_OutputDelegate_12) == 0x000298, "Member 'GA_Athena_Player_DoorBash_C_ExecuteUbergraph_GA_Athena_Player_DoorBash::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");

// Function GA_Athena_Player_DoorBash.GA_Athena_Player_DoorBash_C.CheckVelocityThreshold
// 0x0038 (0x0038 - 0x0000)
struct GA_Athena_Player_DoorBash_C_CheckVelocityThreshold final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortGetPlayerPawnExecutions                  CallFunc_GetAvatarAsValidFortPlayerPawn_OutExec;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsValidFortPlayerPawn_OutFortPlayerPawn; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
