#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_TacticalSprint

#include "Basic.hpp"

#include "TacticalSprintRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.UnbindToFortPlayerPawnDied
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied final
{
public:
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class AFortPlayerPawnAthena* FortPlayerPawnAthena)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied");
static_assert(sizeof(GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied) == 0x000030, "Wrong size on GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied, CallFunc_MakeLiteralString_ReturnValue) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000020, "Member 'GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Athena_TacticalSprint_C_UnbindToFortPlayerPawnDied::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.SetUseHighLocationToleranceForAcceleration
// 0x0048 (0x0048 - 0x0000)
struct GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration final
{
public:
	bool                                          bShouldUseHighTolerance;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration");
static_assert(sizeof(GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration) == 0x000048, "Wrong size on GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration");
static_assert(offsetof(GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration, bShouldUseHighTolerance) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration::bShouldUseHighTolerance' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration, CallFunc_MakeLiteralString_ReturnValue) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration, CallFunc_K2_HasAuthority_ReturnValue) == 0x000018, "Member 'GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000020, "Member 'GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration, K2Node_DynamicCast_AsFort_Movement_Comp_Character) == 0x000038, "Member 'GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration::K2Node_DynamicCast_AsFort_Movement_Comp_Character' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'GA_Athena_TacticalSprint_C_SetUseHighLocationToleranceForAcceleration::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.UnbindOnReloadCancelingSprint
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint final
{
public:
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint");
static_assert(sizeof(GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint) == 0x000030, "Wrong size on GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint, CallFunc_MakeLiteralString_ReturnValue) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000020, "Member 'GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_Athena_TacticalSprint_C_UnbindOnReloadCancelingSprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.UnbindOnEnteredEditMode
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode final
{
public:
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode");
static_assert(sizeof(GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode) == 0x000030, "Wrong size on GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode, CallFunc_MakeLiteralString_ReturnValue) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000020, "Member 'GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_Athena_TacticalSprint_C_UnbindOnEnteredEditMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.StopDrainingEnergy
// 0x0038 (0x0038 - 0x0000)
struct GA_Athena_TacticalSprint_C_StopDrainingEnergy final
{
public:
	class UTacticalSprintEnergyComponent_C*       Temp_wildcard_Variable;                            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTacticalSprintEnergyComponent_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopUsingEnergy_ReturnValue;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_StopDrainingEnergy) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_StopDrainingEnergy");
static_assert(sizeof(GA_Athena_TacticalSprint_C_StopDrainingEnergy) == 0x000038, "Wrong size on GA_Athena_TacticalSprint_C_StopDrainingEnergy");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StopDrainingEnergy, Temp_wildcard_Variable) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_StopDrainingEnergy::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StopDrainingEnergy, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_StopDrainingEnergy::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StopDrainingEnergy, CallFunc_MakeLiteralString_ReturnValue) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_StopDrainingEnergy::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StopDrainingEnergy, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Athena_TacticalSprint_C_StopDrainingEnergy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StopDrainingEnergy, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'GA_Athena_TacticalSprint_C_StopDrainingEnergy::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StopDrainingEnergy, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'GA_Athena_TacticalSprint_C_StopDrainingEnergy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StopDrainingEnergy, CallFunc_StopUsingEnergy_ReturnValue) == 0x000031, "Member 'GA_Athena_TacticalSprint_C_StopDrainingEnergy::CallFunc_StopUsingEnergy_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.StartDrainingEnergy
// 0x0040 (0x0040 - 0x0000)
struct GA_Athena_TacticalSprint_C_StartDrainingEnergy final
{
public:
	class UTacticalSprintEnergyComponent_C*       Temp_wildcard_Variable;                            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevelWithContext_ReturnValue;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTacticalSprintEnergyComponent_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevelWithContext_ReturnValue_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartUsingEnergy_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_StartDrainingEnergy) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_StartDrainingEnergy");
static_assert(sizeof(GA_Athena_TacticalSprint_C_StartDrainingEnergy) == 0x000040, "Wrong size on GA_Athena_TacticalSprint_C_StartDrainingEnergy");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StartDrainingEnergy, Temp_wildcard_Variable) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_StartDrainingEnergy::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StartDrainingEnergy, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_StartDrainingEnergy::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StartDrainingEnergy, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_StartDrainingEnergy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StartDrainingEnergy, CallFunc_GetValueAtLevelWithContext_ReturnValue) == 0x000014, "Member 'GA_Athena_TacticalSprint_C_StartDrainingEnergy::CallFunc_GetValueAtLevelWithContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StartDrainingEnergy, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'GA_Athena_TacticalSprint_C_StartDrainingEnergy::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StartDrainingEnergy, CallFunc_MakeLiteralString_ReturnValue) == 0x000020, "Member 'GA_Athena_TacticalSprint_C_StartDrainingEnergy::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StartDrainingEnergy, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'GA_Athena_TacticalSprint_C_StartDrainingEnergy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StartDrainingEnergy, CallFunc_GetValueAtLevelWithContext_ReturnValue_1) == 0x000034, "Member 'GA_Athena_TacticalSprint_C_StartDrainingEnergy::CallFunc_GetValueAtLevelWithContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_StartDrainingEnergy, CallFunc_StartUsingEnergy_ReturnValue) == 0x000038, "Member 'GA_Athena_TacticalSprint_C_StartDrainingEnergy::CallFunc_StartUsingEnergy_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.SetInfiniteSprint
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_TacticalSprint_C_SetInfiniteSprint final
{
public:
	bool                                          NewInfiniteSprint;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_SetInfiniteSprint) == 0x000001, "Wrong alignment on GA_Athena_TacticalSprint_C_SetInfiniteSprint");
static_assert(sizeof(GA_Athena_TacticalSprint_C_SetInfiniteSprint) == 0x000001, "Wrong size on GA_Athena_TacticalSprint_C_SetInfiniteSprint");
static_assert(offsetof(GA_Athena_TacticalSprint_C_SetInfiniteSprint, NewInfiniteSprint) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_SetInfiniteSprint::NewInfiniteSprint' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.Register For Safety Kill
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_TacticalSprint_C_Register_For_Safety_Kill final
{
public:
	float                                         CallFunc_GetValueAtLevelWithContext_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevelWithContext_ReturnValue_1; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_Register_For_Safety_Kill");
static_assert(sizeof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill) == 0x000030, "Wrong size on GA_Athena_TacticalSprint_C_Register_For_Safety_Kill");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, CallFunc_GetValueAtLevelWithContext_ReturnValue) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::CallFunc_GetValueAtLevelWithContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, CallFunc_GetValueAtLevelWithContext_ReturnValue_1) == 0x000004, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::CallFunc_GetValueAtLevelWithContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000D, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, CallFunc_GetValueAtLevel_ReturnValue) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, CallFunc_FMax_ReturnValue) == 0x000014, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_Register_For_Safety_Kill, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'GA_Athena_TacticalSprint_C_Register_For_Safety_Kill::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.PayEnergyCostOnSlide
// 0x0040 (0x0040 - 0x0000)
struct GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide final
{
public:
	class UTacticalSprintEnergyComponent_C*       Temp_wildcard_Variable;                            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTacticalSprintEnergyComponent_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevelWithContext_ReturnValue;   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_UseEnergy_OutAmountOfEnergyUsed;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseEnergy_ReturnValue;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide");
static_assert(sizeof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide) == 0x000040, "Wrong size on GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide");
static_assert(offsetof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide, Temp_wildcard_Variable) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide, CallFunc_MakeLiteralString_ReturnValue) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide, CallFunc_GetValueAtLevelWithContext_ReturnValue) == 0x000030, "Member 'GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide::CallFunc_GetValueAtLevelWithContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide, CallFunc_IsValid_ReturnValue_1) == 0x000034, "Member 'GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide, CallFunc_UseEnergy_OutAmountOfEnergyUsed) == 0x000038, "Member 'GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide::CallFunc_UseEnergy_OutAmountOfEnergyUsed' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide, CallFunc_UseEnergy_ReturnValue) == 0x00003C, "Member 'GA_Athena_TacticalSprint_C_PayEnergyCostOnSlide::CallFunc_UseEnergy_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.OnFortPlayerPawnDied
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_TacticalSprint_C_OnFortPlayerPawnDied final
{
public:
	class AFortPlayerPawnAthena*                  FortPlayerPawnAthena;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_OnFortPlayerPawnDied) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_OnFortPlayerPawnDied");
static_assert(sizeof(GA_Athena_TacticalSprint_C_OnFortPlayerPawnDied) == 0x000008, "Wrong size on GA_Athena_TacticalSprint_C_OnFortPlayerPawnDied");
static_assert(offsetof(GA_Athena_TacticalSprint_C_OnFortPlayerPawnDied, FortPlayerPawnAthena) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_OnFortPlayerPawnDied::FortPlayerPawnAthena' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.OnEnergyDrained
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_TacticalSprint_C_OnEnergyDrained final
{
public:
	class UFortComponent_Energy*                  EnergyComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_OnEnergyDrained) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_OnEnergyDrained");
static_assert(sizeof(GA_Athena_TacticalSprint_C_OnEnergyDrained) == 0x000008, "Wrong size on GA_Athena_TacticalSprint_C_OnEnergyDrained");
static_assert(offsetof(GA_Athena_TacticalSprint_C_OnEnergyDrained, EnergyComponent) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_OnEnergyDrained::EnergyComponent' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.NotifySprintStarted
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_TacticalSprint_C_NotifySprintStarted final
{
public:
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_NotifySprintStarted) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_NotifySprintStarted");
static_assert(sizeof(GA_Athena_TacticalSprint_C_NotifySprintStarted) == 0x000018, "Wrong size on GA_Athena_TacticalSprint_C_NotifySprintStarted");
static_assert(offsetof(GA_Athena_TacticalSprint_C_NotifySprintStarted, CallFunc_K2_HasAuthority_ReturnValue) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_NotifySprintStarted::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_NotifySprintStarted, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_NotifySprintStarted::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_NotifySprintStarted, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_NotifySprintStarted::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.NotifySprintEnded
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_TacticalSprint_C_NotifySprintEnded final
{
public:
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_NotifySprintEnded) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_NotifySprintEnded");
static_assert(sizeof(GA_Athena_TacticalSprint_C_NotifySprintEnded) == 0x000018, "Wrong size on GA_Athena_TacticalSprint_C_NotifySprintEnded");
static_assert(offsetof(GA_Athena_TacticalSprint_C_NotifySprintEnded, CallFunc_K2_HasAuthority_ReturnValue) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_NotifySprintEnded::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_NotifySprintEnded, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_NotifySprintEnded::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_NotifySprintEnded, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_NotifySprintEnded::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.LogAndVisualLog
// 0x0038 (0x0038 - 0x0000)
struct GA_Athena_TacticalSprint_C_LogAndVisualLog final
{
public:
	ESprintLoggingVerbosityLevel                  Verbosity;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogString;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTacticalSprintControllerComponent_C*   CallFunc_GetTacticalSprintComponent_TacticalSprintComponent; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_LogAndVisualLog) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_LogAndVisualLog");
static_assert(sizeof(GA_Athena_TacticalSprint_C_LogAndVisualLog) == 0x000038, "Wrong size on GA_Athena_TacticalSprint_C_LogAndVisualLog");
static_assert(offsetof(GA_Athena_TacticalSprint_C_LogAndVisualLog, Verbosity) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_LogAndVisualLog::Verbosity' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_LogAndVisualLog, LogString) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_LogAndVisualLog::LogString' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_LogAndVisualLog, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'GA_Athena_TacticalSprint_C_LogAndVisualLog::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_LogAndVisualLog, CallFunc_GetTacticalSprintComponent_TacticalSprintComponent) == 0x000028, "Member 'GA_Athena_TacticalSprint_C_LogAndVisualLog::CallFunc_GetTacticalSprintComponent_TacticalSprintComponent' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_LogAndVisualLog, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Athena_TacticalSprint_C_LogAndVisualLog::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_TacticalSprint_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_TacticalSprint_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_TacticalSprint_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_TacticalSprint_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_TacticalSprint_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.IsSprintJumping
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_TacticalSprint_C_IsSprintJumping final
{
public:
	bool                                          IsJumping_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_FindFortPlayerPawnCached_FortPlayerPawn;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_IsSprintJumping) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_IsSprintJumping");
static_assert(sizeof(GA_Athena_TacticalSprint_C_IsSprintJumping) == 0x000018, "Wrong size on GA_Athena_TacticalSprint_C_IsSprintJumping");
static_assert(offsetof(GA_Athena_TacticalSprint_C_IsSprintJumping, IsJumping_0) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_IsSprintJumping::IsJumping_0' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_IsSprintJumping, CallFunc_FindFortPlayerPawnCached_FortPlayerPawn) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_IsSprintJumping::CallFunc_FindFortPlayerPawnCached_FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_IsSprintJumping, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_IsSprintJumping::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.HasZeroEnergy
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_TacticalSprint_C_HasZeroEnergy final
{
public:
	bool                                          Has_Zero_Energy;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortComponent_Energy*                  CallFunc_GetTacticalSprintEnergyComponent_TacticalSprintEnergyComponent; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentEnergyPercentage_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_HasZeroEnergy) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_HasZeroEnergy");
static_assert(sizeof(GA_Athena_TacticalSprint_C_HasZeroEnergy) == 0x000018, "Wrong size on GA_Athena_TacticalSprint_C_HasZeroEnergy");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HasZeroEnergy, Has_Zero_Energy) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_HasZeroEnergy::Has_Zero_Energy' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HasZeroEnergy, CallFunc_GetTacticalSprintEnergyComponent_TacticalSprintEnergyComponent) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_HasZeroEnergy::CallFunc_GetTacticalSprintEnergyComponent_TacticalSprintEnergyComponent' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HasZeroEnergy, CallFunc_GetCurrentEnergyPercentage_ReturnValue) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_HasZeroEnergy::CallFunc_GetCurrentEnergyPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HasZeroEnergy, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'GA_Athena_TacticalSprint_C_HasZeroEnergy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HasZeroEnergy, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000015, "Member 'GA_Athena_TacticalSprint_C_HasZeroEnergy::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.HandleTutorialQuestUpdate
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate final
{
public:
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate");
static_assert(sizeof(GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate) == 0x000030, "Wrong size on GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000020, "Member 'GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate, CallFunc_GetQuestManager_ReturnValue) == 0x000028, "Member 'GA_Athena_TacticalSprint_C_HandleTutorialQuestUpdate::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.HandleSlidingStarted
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_TacticalSprint_C_HandleSlidingStarted final
{
public:
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_HandleSlidingStarted) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_HandleSlidingStarted");
static_assert(sizeof(GA_Athena_TacticalSprint_C_HandleSlidingStarted) == 0x000018, "Wrong size on GA_Athena_TacticalSprint_C_HandleSlidingStarted");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleSlidingStarted, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_HandleSlidingStarted::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleSlidingStarted, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_HandleSlidingStarted::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.HandleMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct GA_Athena_TacticalSprint_C_HandleMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_HandleMovementModeChanged) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_HandleMovementModeChanged");
static_assert(sizeof(GA_Athena_TacticalSprint_C_HandleMovementModeChanged) == 0x000010, "Wrong size on GA_Athena_TacticalSprint_C_HandleMovementModeChanged");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleMovementModeChanged, Character) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_HandleMovementModeChanged::Character' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleMovementModeChanged, PrevMovementMode) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_HandleMovementModeChanged::PrevMovementMode' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleMovementModeChanged, PreviousCustomMode) == 0x000009, "Member 'GA_Athena_TacticalSprint_C_HandleMovementModeChanged::PreviousCustomMode' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.HandleFailedToSprint
// 0x0050 (0x0050 - 0x0000)
struct GA_Athena_TacticalSprint_C_HandleFailedToSprint final
{
public:
	class UTacticalSprintEnergyComponent_C*       Temp_wildcard_Variable;                            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTacticalSprintEnergyComponent_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSufficientEnergy_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Select_Default;                             // 0x0030(0x0020)(ConstParm)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_HandleFailedToSprint) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_HandleFailedToSprint");
static_assert(sizeof(GA_Athena_TacticalSprint_C_HandleFailedToSprint) == 0x000050, "Wrong size on GA_Athena_TacticalSprint_C_HandleFailedToSprint");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleFailedToSprint, Temp_wildcard_Variable) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_HandleFailedToSprint::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleFailedToSprint, Temp_bool_Variable) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_HandleFailedToSprint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleFailedToSprint, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_HandleFailedToSprint::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleFailedToSprint, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_Athena_TacticalSprint_C_HandleFailedToSprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleFailedToSprint, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'GA_Athena_TacticalSprint_C_HandleFailedToSprint::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleFailedToSprint, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'GA_Athena_TacticalSprint_C_HandleFailedToSprint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleFailedToSprint, CallFunc_HasSufficientEnergy_ReturnValue) == 0x000029, "Member 'GA_Athena_TacticalSprint_C_HandleFailedToSprint::CallFunc_HasSufficientEnergy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_HandleFailedToSprint, K2Node_Select_Default) == 0x000030, "Member 'GA_Athena_TacticalSprint_C_HandleFailedToSprint::K2Node_Select_Default' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.GetTacticalSprintEnergyComponent
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent final
{
public:
	class UFortComponent_Energy*                  TacticalSprintEnergyComponent;                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTacticalSprintEnergyComponent_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent");
static_assert(sizeof(GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent) == 0x000018, "Wrong size on GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent");
static_assert(offsetof(GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent, TacticalSprintEnergyComponent) == 0x000000, "Member 'GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent::TacticalSprintEnergyComponent' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'GA_Athena_TacticalSprint_C_GetTacticalSprintEnergyComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_Athena_TacticalSprint.GA_Athena_TacticalSprint_C.GetTacticalSprintComponent
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_TacticalSprint_C_GetTacticalSprintComponent final
{
public:
	class UTacticalSprintControllerComponent_C*   TacticalSprintComponent;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTacticalSprintControllerComponent_C*   CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TacticalSprint_C_GetTacticalSprintComponent) == 0x000008, "Wrong alignment on GA_Athena_TacticalSprint_C_GetTacticalSprintComponent");
static_assert(sizeof(GA_Athena_TacticalSprint_C_GetTacticalSprintComponent) == 0x000030, "Wrong size on GA_Athena_TacticalSprint_C_GetTacticalSprintComponent");
