#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BoostJumpPack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Enum_BoostJumpStates_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.Consider Starting Regen Effect
// 0x0014 (0x0014 - 0x0000)
struct GA_BoostJumpPack_C_Consider_Starting_Regen_Effect final
{
public:
	float                                         CallFunc_GetMaxFuel_MaxFuel;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFuel_Fuel;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect) == 0x000004, "Wrong alignment on GA_BoostJumpPack_C_Consider_Starting_Regen_Effect");
static_assert(sizeof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect) == 0x000014, "Wrong size on GA_BoostJumpPack_C_Consider_Starting_Regen_Effect");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect, CallFunc_GetMaxFuel_MaxFuel) == 0x000000, "Member 'GA_BoostJumpPack_C_Consider_Starting_Regen_Effect::CallFunc_GetMaxFuel_MaxFuel' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect, CallFunc_GetFuel_Fuel) == 0x000004, "Member 'GA_BoostJumpPack_C_Consider_Starting_Regen_Effect::CallFunc_GetFuel_Fuel' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_BoostJumpPack_C_Consider_Starting_Regen_Effect::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'GA_BoostJumpPack_C_Consider_Starting_Regen_Effect::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000D, "Member 'GA_BoostJumpPack_C_Consider_Starting_Regen_Effect::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00000E, "Member 'GA_BoostJumpPack_C_Consider_Starting_Regen_Effect::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'GA_BoostJumpPack_C_Consider_Starting_Regen_Effect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Starting_Regen_Effect, CallFunc_BooleanAND_ReturnValue_1) == 0x000010, "Member 'GA_BoostJumpPack_C_Consider_Starting_Regen_Effect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.Consider Stopping Regen Effect
// 0x0018 (0x0018 - 0x0000)
struct GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect final
{
public:
	float                                         CallFunc_GetReserveFuel_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxFuel_MaxFuel;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFuel_Fuel;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect) == 0x000004, "Wrong alignment on GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect");
static_assert(sizeof(GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect) == 0x000018, "Wrong size on GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect, CallFunc_GetReserveFuel_ReturnValue) == 0x000000, "Member 'GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect::CallFunc_GetReserveFuel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect, CallFunc_GetMaxFuel_MaxFuel) == 0x000004, "Member 'GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect::CallFunc_GetMaxFuel_MaxFuel' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect, CallFunc_GetFuel_Fuel) == 0x00000C, "Member 'GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect::CallFunc_GetFuel_Fuel' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect, CallFunc_BooleanOR_ReturnValue) == 0x000015, "Member 'GA_BoostJumpPack_C_Consider_Stopping_Regen_Effect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.DetermineStateToTransitionTo
// 0x0006 (0x0006 - 0x0000)
struct GA_BoostJumpPack_C_DetermineStateToTransitionTo final
{
public:
	Enum_BoostJumpStates                          BoostState;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_BoostJumpStates                          CallFunc_TransitionFromFalling_TargetBoostState;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_BoostJumpStates                          CallFunc_TransitionFromHovering_TargetBoostState;  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_BoostJumpStates                          CallFunc_TransitionFromBoost_TargetBoostState;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_BoostJumpStates                          CallFunc_TransitionFromIdle_TargetBoostState;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_DetermineStateToTransitionTo) == 0x000001, "Wrong alignment on GA_BoostJumpPack_C_DetermineStateToTransitionTo");
static_assert(sizeof(GA_BoostJumpPack_C_DetermineStateToTransitionTo) == 0x000006, "Wrong size on GA_BoostJumpPack_C_DetermineStateToTransitionTo");
static_assert(offsetof(GA_BoostJumpPack_C_DetermineStateToTransitionTo, BoostState) == 0x000000, "Member 'GA_BoostJumpPack_C_DetermineStateToTransitionTo::BoostState' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_DetermineStateToTransitionTo, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'GA_BoostJumpPack_C_DetermineStateToTransitionTo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_DetermineStateToTransitionTo, CallFunc_TransitionFromFalling_TargetBoostState) == 0x000002, "Member 'GA_BoostJumpPack_C_DetermineStateToTransitionTo::CallFunc_TransitionFromFalling_TargetBoostState' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_DetermineStateToTransitionTo, CallFunc_TransitionFromHovering_TargetBoostState) == 0x000003, "Member 'GA_BoostJumpPack_C_DetermineStateToTransitionTo::CallFunc_TransitionFromHovering_TargetBoostState' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_DetermineStateToTransitionTo, CallFunc_TransitionFromBoost_TargetBoostState) == 0x000004, "Member 'GA_BoostJumpPack_C_DetermineStateToTransitionTo::CallFunc_TransitionFromBoost_TargetBoostState' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_DetermineStateToTransitionTo, CallFunc_TransitionFromIdle_TargetBoostState) == 0x000005, "Member 'GA_BoostJumpPack_C_DetermineStateToTransitionTo::CallFunc_TransitionFromIdle_TargetBoostState' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.ExecuteUbergraph_GA_BoostJumpPack
// 0x02D0 (0x02D0 - 0x0000)
struct GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0018(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_2;     // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_3;     // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0110(0x00B0)(ConstParm)
	EJumpBoostPackState                           K2Node_Event_InPreviousState;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJumpBoostPackState                           K2Node_Event_InCurrentState;                       // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01C4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_PreviousPawn;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_CustomEvent_NewPawn;                        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller_1;     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0224(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0230(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x023C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0248(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0254(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0264(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetAbilityTags_ReturnValue;               // 0x0270(0x0020)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0290(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_4;     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_2;         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_3;         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack) == 0x000008, "Wrong alignment on GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack");
static_assert(sizeof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack) == 0x0002D0, "Wrong size on GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, EntryPoint) == 0x000000, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000008, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CustomEvent_Hit) == 0x000018, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000F8, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x0000F9, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_EqualEqual_GameplayTag_ReturnValue_2) == 0x0000FA, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_EqualEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_BooleanOR_ReturnValue) == 0x0000FB, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_EqualEqual_GameplayTag_ReturnValue_3) == 0x0000FC, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_EqualEqual_GameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_Event_EventData) == 0x000110, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_Event_InPreviousState) == 0x0001C0, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_Event_InPreviousState' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_Event_InCurrentState) == 0x0001C1, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_Event_InCurrentState' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001C4, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001D0, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CustomEvent_PreviousPawn) == 0x0001D8, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CustomEvent_PreviousPawn' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CustomEvent_NewPawn) == 0x0001E0, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_GetController_ReturnValue) == 0x0001E8, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_IsValid_ReturnValue_1) == 0x0001F0, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0001F8, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_GetController_ReturnValue_1) == 0x000208, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_IsValid_ReturnValue_2) == 0x000210, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_DynamicCast_AsFort_Player_Controller_1) == 0x000218, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_DynamicCast_AsFort_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CreateDelegate_OutputDelegate_2) == 0x000224, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CreateDelegate_OutputDelegate_3) == 0x000230, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CreateDelegate_OutputDelegate_4) == 0x00023C, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CreateDelegate_OutputDelegate_5) == 0x000248, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CreateDelegate_OutputDelegate_6) == 0x000254, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_BooleanAND_ReturnValue) == 0x000260, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CreateDelegate_OutputDelegate_7) == 0x000264, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_GetAbilityTags_ReturnValue) == 0x000270, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_GetAbilityTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, K2Node_CreateDelegate_OutputDelegate_8) == 0x000290, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_HasTag_ReturnValue) == 0x00029C, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x0002A0, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_EqualEqual_GameplayTag_ReturnValue_4) == 0x0002A8, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_EqualEqual_GameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_IsValid_ReturnValue_3) == 0x0002A9, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_WaitGameplayTagAdd_ReturnValue_2) == 0x0002B0, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_WaitGameplayTagAdd_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_IsValid_ReturnValue_4) == 0x0002B8, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_WaitGameplayTagAdd_ReturnValue_3) == 0x0002C0, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_WaitGameplayTagAdd_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack, CallFunc_IsValid_ReturnValue_5) == 0x0002C8, "Member 'GA_BoostJumpPack_C_ExecuteUbergraph_GA_BoostJumpPack::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.Handle Jetpack Equipped
// 0x00E0 (0x00E0 - 0x0000)
struct GA_BoostJumpPack_C_Handle_Jetpack_Equipped final
{
public:
	float                                         CallFunc_GetMaxFuel_MaxFuel;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFuel_Fuel;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0010(0x00D0)(ContainsInstancedReference)
};
static_assert(alignof(GA_BoostJumpPack_C_Handle_Jetpack_Equipped) == 0x000008, "Wrong alignment on GA_BoostJumpPack_C_Handle_Jetpack_Equipped");
static_assert(sizeof(GA_BoostJumpPack_C_Handle_Jetpack_Equipped) == 0x0000E0, "Wrong size on GA_BoostJumpPack_C_Handle_Jetpack_Equipped");
static_assert(offsetof(GA_BoostJumpPack_C_Handle_Jetpack_Equipped, CallFunc_GetMaxFuel_MaxFuel) == 0x000000, "Member 'GA_BoostJumpPack_C_Handle_Jetpack_Equipped::CallFunc_GetMaxFuel_MaxFuel' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Handle_Jetpack_Equipped, CallFunc_GetFuel_Fuel) == 0x000004, "Member 'GA_BoostJumpPack_C_Handle_Jetpack_Equipped::CallFunc_GetFuel_Fuel' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Handle_Jetpack_Equipped, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_BoostJumpPack_C_Handle_Jetpack_Equipped::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Handle_Jetpack_Equipped, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000C, "Member 'GA_BoostJumpPack_C_Handle_Jetpack_Equipped::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Handle_Jetpack_Equipped, CallFunc_MatchesTag_ReturnValue) == 0x00000D, "Member 'GA_BoostJumpPack_C_Handle_Jetpack_Equipped::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_Handle_Jetpack_Equipped, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000010, "Member 'GA_BoostJumpPack_C_Handle_Jetpack_Equipped::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.HandleBoostEnded
// 0x00E8 (0x00E8 - 0x0000)
struct GA_BoostJumpPack_C_HandleBoostEnded final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFuel_Fuel;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0010(0x00D0)(ContainsInstancedReference)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x00E0(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_HandleBoostEnded) == 0x000008, "Wrong alignment on GA_BoostJumpPack_C_HandleBoostEnded");
static_assert(sizeof(GA_BoostJumpPack_C_HandleBoostEnded) == 0x0000E8, "Wrong size on GA_BoostJumpPack_C_HandleBoostEnded");
static_assert(offsetof(GA_BoostJumpPack_C_HandleBoostEnded, Temp_bool_Variable) == 0x000000, "Member 'GA_BoostJumpPack_C_HandleBoostEnded::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleBoostEnded, CallFunc_GetFuel_Fuel) == 0x000004, "Member 'GA_BoostJumpPack_C_HandleBoostEnded::CallFunc_GetFuel_Fuel' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleBoostEnded, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_BoostJumpPack_C_HandleBoostEnded::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleBoostEnded, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000010, "Member 'GA_BoostJumpPack_C_HandleBoostEnded::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleBoostEnded, K2Node_Select_Default) == 0x0000E0, "Member 'GA_BoostJumpPack_C_HandleBoostEnded::K2Node_Select_Default' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.HandleBoostJump
// 0x0100 (0x0100 - 0x0000)
struct GA_BoostJumpPack_C_HandleBoostJump final
{
public:
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0000(0x00D0)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_SetJumpHeight_Pawn_Out;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetJumpHeight_Jump_Height;                // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_HandleBoostJump) == 0x000008, "Wrong alignment on GA_BoostJumpPack_C_HandleBoostJump");
static_assert(sizeof(GA_BoostJumpPack_C_HandleBoostJump) == 0x000100, "Wrong size on GA_BoostJumpPack_C_HandleBoostJump");
static_assert(offsetof(GA_BoostJumpPack_C_HandleBoostJump, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000000, "Member 'GA_BoostJumpPack_C_HandleBoostJump::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleBoostJump, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'GA_BoostJumpPack_C_HandleBoostJump::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleBoostJump, CallFunc_SetJumpHeight_Pawn_Out) == 0x0000E0, "Member 'GA_BoostJumpPack_C_HandleBoostJump::CallFunc_SetJumpHeight_Pawn_Out' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleBoostJump, CallFunc_SetJumpHeight_Jump_Height) == 0x0000E8, "Member 'GA_BoostJumpPack_C_HandleBoostJump::CallFunc_SetJumpHeight_Jump_Height' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.HandleCurrentBoostStateChanged
// 0x0010 (0x0010 - 0x0000)
struct GA_BoostJumpPack_C_HandleCurrentBoostStateChanged final
{
public:
	EJumpBoostPackState                           PreviousState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJumpBoostPackState                           CurrentState_0;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingJetpackEffectActive_ReturnValue;   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingJetpackEffectActive_ReturnValue_1; // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_HandleCurrentBoostStateChanged) == 0x000004, "Wrong alignment on GA_BoostJumpPack_C_HandleCurrentBoostStateChanged");
static_assert(sizeof(GA_BoostJumpPack_C_HandleCurrentBoostStateChanged) == 0x000010, "Wrong size on GA_BoostJumpPack_C_HandleCurrentBoostStateChanged");
static_assert(offsetof(GA_BoostJumpPack_C_HandleCurrentBoostStateChanged, PreviousState) == 0x000000, "Member 'GA_BoostJumpPack_C_HandleCurrentBoostStateChanged::PreviousState' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleCurrentBoostStateChanged, CurrentState_0) == 0x000001, "Member 'GA_BoostJumpPack_C_HandleCurrentBoostStateChanged::CurrentState_0' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleCurrentBoostStateChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'GA_BoostJumpPack_C_HandleCurrentBoostStateChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleCurrentBoostStateChanged, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_BoostJumpPack_C_HandleCurrentBoostStateChanged::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleCurrentBoostStateChanged, CallFunc_IsUsingJetpackEffectActive_ReturnValue) == 0x00000C, "Member 'GA_BoostJumpPack_C_HandleCurrentBoostStateChanged::CallFunc_IsUsingJetpackEffectActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleCurrentBoostStateChanged, CallFunc_IsUsingJetpackEffectActive_ReturnValue_1) == 0x00000D, "Member 'GA_BoostJumpPack_C_HandleCurrentBoostStateChanged::CallFunc_IsUsingJetpackEffectActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleCurrentBoostStateChanged, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'GA_BoostJumpPack_C_HandleCurrentBoostStateChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.HandleFalling
// 0x0038 (0x0038 - 0x0000)
struct GA_BoostJumpPack_C_HandleFalling final
{
public:
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_HandleFalling) == 0x000008, "Wrong alignment on GA_BoostJumpPack_C_HandleFalling");
static_assert(sizeof(GA_BoostJumpPack_C_HandleFalling) == 0x000038, "Wrong size on GA_BoostJumpPack_C_HandleFalling");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, CallFunc_GetTimeSeconds_ReturnValue) == 0x000000, "Member 'GA_BoostJumpPack_C_HandleFalling::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000004, "Member 'GA_BoostJumpPack_C_HandleFalling::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_BoostJumpPack_C_HandleFalling::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_BoostJumpPack_C_HandleFalling::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000018, "Member 'GA_BoostJumpPack_C_HandleFalling::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, CallFunc_FMax_ReturnValue) == 0x00001C, "Member 'GA_BoostJumpPack_C_HandleFalling::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, CallFunc_GetTimeSeconds_ReturnValue_2) == 0x000020, "Member 'GA_BoostJumpPack_C_HandleFalling::CallFunc_GetTimeSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'GA_BoostJumpPack_C_HandleFalling::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000030, "Member 'GA_BoostJumpPack_C_HandleFalling::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleFalling, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'GA_BoostJumpPack_C_HandleFalling::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.HandleHovering
// 0x0038 (0x0038 - 0x0000)
struct GA_BoostJumpPack_C_HandleHovering final
{
public:
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_HandleHovering) == 0x000008, "Wrong alignment on GA_BoostJumpPack_C_HandleHovering");
static_assert(sizeof(GA_BoostJumpPack_C_HandleHovering) == 0x000038, "Wrong size on GA_BoostJumpPack_C_HandleHovering");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, CallFunc_GetTimeSeconds_ReturnValue) == 0x000000, "Member 'GA_BoostJumpPack_C_HandleHovering::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_BoostJumpPack_C_HandleHovering::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'GA_BoostJumpPack_C_HandleHovering::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000014, "Member 'GA_BoostJumpPack_C_HandleHovering::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000018, "Member 'GA_BoostJumpPack_C_HandleHovering::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x00001C, "Member 'GA_BoostJumpPack_C_HandleHovering::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, CallFunc_FMax_ReturnValue) == 0x000020, "Member 'GA_BoostJumpPack_C_HandleHovering::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'GA_BoostJumpPack_C_HandleHovering::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'GA_BoostJumpPack_C_HandleHovering::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_HandleHovering, CallFunc_GetTimeSeconds_ReturnValue_2) == 0x000030, "Member 'GA_BoostJumpPack_C_HandleHovering::CallFunc_GetTimeSeconds_ReturnValue_2' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.HandleIdle
// 0x0001 (0x0001 - 0x0000)
struct GA_BoostJumpPack_C_HandleIdle final
{
public:
	bool                                          bForceEndHovering;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_HandleIdle) == 0x000001, "Wrong alignment on GA_BoostJumpPack_C_HandleIdle");
static_assert(sizeof(GA_BoostJumpPack_C_HandleIdle) == 0x000001, "Wrong size on GA_BoostJumpPack_C_HandleIdle");
static_assert(offsetof(GA_BoostJumpPack_C_HandleIdle, bForceEndHovering) == 0x000000, "Member 'GA_BoostJumpPack_C_HandleIdle::bForceEndHovering' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.HandleJetpackInitialBoost
// 0x00D0 (0x00D0 - 0x0000)
struct GA_BoostJumpPack_C_HandleJetpackInitialBoost final
{
public:
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0000(0x00D0)(ContainsInstancedReference)
};
static_assert(alignof(GA_BoostJumpPack_C_HandleJetpackInitialBoost) == 0x000008, "Wrong alignment on GA_BoostJumpPack_C_HandleJetpackInitialBoost");
static_assert(sizeof(GA_BoostJumpPack_C_HandleJetpackInitialBoost) == 0x0000D0, "Wrong size on GA_BoostJumpPack_C_HandleJetpackInitialBoost");
static_assert(offsetof(GA_BoostJumpPack_C_HandleJetpackInitialBoost, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000000, "Member 'GA_BoostJumpPack_C_HandleJetpackInitialBoost::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.IsUsingJetpackEffectActive
// 0x000C (0x000C - 0x0000)
struct GA_BoostJumpPack_C_IsUsingJetpackEffectActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveGameplayEffectStackCount_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_IsUsingJetpackEffectActive) == 0x000004, "Wrong alignment on GA_BoostJumpPack_C_IsUsingJetpackEffectActive");
static_assert(sizeof(GA_BoostJumpPack_C_IsUsingJetpackEffectActive) == 0x00000C, "Wrong size on GA_BoostJumpPack_C_IsUsingJetpackEffectActive");
static_assert(offsetof(GA_BoostJumpPack_C_IsUsingJetpackEffectActive, ReturnValue) == 0x000000, "Member 'GA_BoostJumpPack_C_IsUsingJetpackEffectActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_IsUsingJetpackEffectActive, CallFunc_GetActiveGameplayEffectStackCount_ReturnValue) == 0x000004, "Member 'GA_BoostJumpPack_C_IsUsingJetpackEffectActive::CallFunc_GetActiveGameplayEffectStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_IsUsingJetpackEffectActive, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'GA_BoostJumpPack_C_IsUsingJetpackEffectActive::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_BoostJumpPack_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_BoostJumpPack_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_BoostJumpPack_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_BoostJumpPack_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_BoostJumpPack_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_BoostJumpPack_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_BoostJumpPack_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_BoostJumpPack_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_BoostJumpPack_C_K2_OnEndAbility");
static_assert(sizeof(GA_BoostJumpPack_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_BoostJumpPack_C_K2_OnEndAbility");
static_assert(offsetof(GA_BoostJumpPack_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_BoostJumpPack_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.OnCurrentStateChanged
// 0x0002 (0x0002 - 0x0000)
struct GA_BoostJumpPack_C_OnCurrentStateChanged final
{
public:
	EJumpBoostPackState                           InPreviousState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJumpBoostPackState                           InCurrentState;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BoostJumpPack_C_OnCurrentStateChanged) == 0x000001, "Wrong alignment on GA_BoostJumpPack_C_OnCurrentStateChanged");
static_assert(sizeof(GA_BoostJumpPack_C_OnCurrentStateChanged) == 0x000002, "Wrong size on GA_BoostJumpPack_C_OnCurrentStateChanged");
static_assert(offsetof(GA_BoostJumpPack_C_OnCurrentStateChanged, InPreviousState) == 0x000000, "Member 'GA_BoostJumpPack_C_OnCurrentStateChanged::InPreviousState' has a wrong offset!");
static_assert(offsetof(GA_BoostJumpPack_C_OnCurrentStateChanged, InCurrentState) == 0x000001, "Member 'GA_BoostJumpPack_C_OnCurrentStateChanged::InCurrentState' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.OnPawnLanded
// 0x00E0 (0x00E0 - 0x0000)
struct GA_BoostJumpPack_C_OnPawnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_BoostJumpPack_C_OnPawnLanded) == 0x000008, "Wrong alignment on GA_BoostJumpPack_C_OnPawnLanded");
static_assert(sizeof(GA_BoostJumpPack_C_OnPawnLanded) == 0x0000E0, "Wrong size on GA_BoostJumpPack_C_OnPawnLanded");
static_assert(offsetof(GA_BoostJumpPack_C_OnPawnLanded, Hit) == 0x000000, "Member 'GA_BoostJumpPack_C_OnPawnLanded::Hit' has a wrong offset!");

// Function GA_BoostJumpPack.GA_BoostJumpPack_C.OnSavedPawnChanged 
// 0x0010 (0x0010 - 0x0000)
struct GA_BoostJumpPack_C_OnSavedPawnChanged_ final
{
public:
	class AFortPlayerPawn*                        PreviousPawn;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
