#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Coconut_ShieldHealth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Coconut_ShieldHealth.GA_Coconut_ShieldHealth_C.ExecuteUbergraph_GA_Coconut_ShieldHealth
// 0x0088 (0x0088 - 0x0000)
struct GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxShield_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetShield_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController; // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth) == 0x000008, "Wrong alignment on GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth");
static_assert(sizeof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth) == 0x000088, "Wrong size on GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, EntryPoint) == 0x000000, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_GetValueAtLevel_ReturnValue) == 0x000008, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_GetMaxShield_ReturnValue) == 0x000028, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_GetMaxShield_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_GetShield_ReturnValue) == 0x00002C, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_GetShield_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_GetMaxHealth_ReturnValue) == 0x000030, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_GetHealth_ReturnValue) == 0x000038, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000040, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000048, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000050, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000058, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000068, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags) == 0x000070, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective) == 0x000071, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController) == 0x000072, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_BooleanAND_ReturnValue) == 0x000073, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_GetQuestManager_ReturnValue) == 0x000078, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000080, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000081, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x000082, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_Not_PreBool_ReturnValue) == 0x000083, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_Not_PreBool_ReturnValue_1) == 0x000084, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_BooleanAND_ReturnValue_1) == 0x000085, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_BooleanAND_ReturnValue_2) == 0x000086, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth, CallFunc_BooleanOR_ReturnValue) == 0x000087, "Member 'GA_Coconut_ShieldHealth_C_ExecuteUbergraph_GA_Coconut_ShieldHealth::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Coconut_ShieldHealth.GA_Coconut_ShieldHealth_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Coconut_ShieldHealth_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Coconut_ShieldHealth_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Coconut_ShieldHealth_C_K2_OnEndAbility");
static_assert(sizeof(GA_Coconut_ShieldHealth_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Coconut_ShieldHealth_C_K2_OnEndAbility");
static_assert(offsetof(GA_Coconut_ShieldHealth_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Coconut_ShieldHealth_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

