#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_FragGrenade_WithTrajectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"


namespace SDK::Params
{

// Function GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.ActiveAbilitySetup
// 0x0078 (0x0078 - 0x0000)
struct GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup final
{
public:
	class UAbilitySystemComponent*                AbilitySystemIn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemOut;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_ActiveAbilitySetup_AbilitySystemOut;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_1; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_1; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_2; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_2; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_3; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_3; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup) == 0x000008, "Wrong alignment on GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup");
static_assert(sizeof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup) == 0x000078, "Wrong size on GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, AbilitySystemIn) == 0x000000, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::AbilitySystemIn' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, AbilitySystemOut) == 0x000008, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::AbilitySystemOut' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, CallFunc_ActiveAbilitySetup_AbilitySystemOut) == 0x000010, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::CallFunc_ActiveAbilitySetup_AbilitySystemOut' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput) == 0x000018, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue) == 0x000028, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_1) == 0x000030, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_1) == 0x000040, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_2) == 0x000048, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_2) == 0x000058, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_3) == 0x000060, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup, CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_3) == 0x000070, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ActiveAbilitySetup::CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_3' has a wrong offset!");

// Function GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.Cancelled_BF65CDBE4F9E98E9174850B85775A15B
// 0x0030 (0x0030 - 0x0000)
struct GA_Commando_FragGrenade_WithTrajectory_C_Cancelled_BF65CDBE4F9E98E9174850B85775A15B final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Commando_FragGrenade_WithTrajectory_C_Cancelled_BF65CDBE4F9E98E9174850B85775A15B) == 0x000008, "Wrong alignment on GA_Commando_FragGrenade_WithTrajectory_C_Cancelled_BF65CDBE4F9E98E9174850B85775A15B");
static_assert(sizeof(GA_Commando_FragGrenade_WithTrajectory_C_Cancelled_BF65CDBE4F9E98E9174850B85775A15B) == 0x000030, "Wrong size on GA_Commando_FragGrenade_WithTrajectory_C_Cancelled_BF65CDBE4F9E98E9174850B85775A15B");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_Cancelled_BF65CDBE4F9E98E9174850B85775A15B, TargetData) == 0x000000, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_Cancelled_BF65CDBE4F9E98E9174850B85775A15B::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_Cancelled_BF65CDBE4F9E98E9174850B85775A15B, ApplicationTag) == 0x000028, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_Cancelled_BF65CDBE4F9E98E9174850B85775A15B::ApplicationTag' has a wrong offset!");

// Function GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.Completed_BF65CDBE4F9E98E9174850B85775A15B
// 0x0030 (0x0030 - 0x0000)
struct GA_Commando_FragGrenade_WithTrajectory_C_Completed_BF65CDBE4F9E98E9174850B85775A15B final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Commando_FragGrenade_WithTrajectory_C_Completed_BF65CDBE4F9E98E9174850B85775A15B) == 0x000008, "Wrong alignment on GA_Commando_FragGrenade_WithTrajectory_C_Completed_BF65CDBE4F9E98E9174850B85775A15B");
static_assert(sizeof(GA_Commando_FragGrenade_WithTrajectory_C_Completed_BF65CDBE4F9E98E9174850B85775A15B) == 0x000030, "Wrong size on GA_Commando_FragGrenade_WithTrajectory_C_Completed_BF65CDBE4F9E98E9174850B85775A15B");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_Completed_BF65CDBE4F9E98E9174850B85775A15B, TargetData) == 0x000000, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_Completed_BF65CDBE4F9E98E9174850B85775A15B::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_Completed_BF65CDBE4F9E98E9174850B85775A15B, ApplicationTag) == 0x000028, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_Completed_BF65CDBE4F9E98E9174850B85775A15B::ApplicationTag' has a wrong offset!");

// Function GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory
// 0x0290 (0x0290 - 0x0000)
struct GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0050(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0078(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0080(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x00A8(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00AC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x00B8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x00E0(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00E4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00F0(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x00F8(0x0028)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_ActiveAbilitySetup_AbilitySystemOut;      // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SpawnLocationAndRotation_OutLoc;          // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SpawnLocationAndRotation_OutRot;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_SetupGrenade_Base_Grenade;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetupGrenade_Projectile_Speed;            // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       CallFunc_SetupGrenade_Explosion_Gameplay_Spec;     // 0x0180(0x00B8)()
	float                                         CallFunc_SetupGrenade_Projectile_Gravity_Scale;    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x1];                                      // 0x025B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x025C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue_1;                  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0270(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHolsterWeaponWithName_IsWeaponHolstered; // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHolsterWeaponWithName_OperationSuccessful; // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27F[0x1];                                      // 0x027F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CommitAbilityWithEvent_Passed;            // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHolsterWeaponWithName_IsWeaponHolstered_1; // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHolsterWeaponWithName_OperationSuccessful_1; // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory) == 0x000008, "Wrong alignment on GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory");
static_assert(sizeof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory) == 0x000290, "Wrong size on GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, EntryPoint) == 0x000000, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate_2) == 0x00001C, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate_3) == 0x000028, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_WaitDelay_ReturnValue) == 0x000038, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CustomEvent_TargetData_2) == 0x000050, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CustomEvent_ApplicationTag_2) == 0x000078, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CustomEvent_TargetData_1) == 0x000080, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CustomEvent_ApplicationTag_1) == 0x0000A8, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000AC, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CustomEvent_TargetData) == 0x0000B8, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CustomEvent_ApplicationTag) == 0x0000E0, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000E4, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, Temp_struct_Variable) == 0x0000F0, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, Temp_struct_Variable_1) == 0x0000F8, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000120, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_ActiveAbilitySetup_AbilitySystemOut) == 0x000128, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_ActiveAbilitySetup_AbilitySystemOut' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SpawnLocationAndRotation_OutLoc) == 0x000130, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SpawnLocationAndRotation_OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SpawnLocationAndRotation_OutRot) == 0x000148, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SpawnLocationAndRotation_OutRot' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_BreakRotator_Roll) == 0x000160, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_BreakRotator_Pitch) == 0x000164, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_BreakRotator_Yaw) == 0x000168, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SetupGrenade_Base_Grenade) == 0x000170, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SetupGrenade_Base_Grenade' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SetupGrenade_Projectile_Speed) == 0x000178, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SetupGrenade_Projectile_Speed' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SetupGrenade_Explosion_Gameplay_Spec) == 0x000180, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SetupGrenade_Explosion_Gameplay_Spec' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SetupGrenade_Projectile_Gravity_Scale) == 0x000238, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SetupGrenade_Projectile_Gravity_Scale' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_K2_SetTimer_ReturnValue) == 0x000240, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_Event_bWasCancelled) == 0x000248, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000250, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_IsValid_ReturnValue_1) == 0x000258, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_IsLocallyControlled_ReturnValue) == 0x000259, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_BooleanAND_ReturnValue) == 0x00025A, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate_7) == 0x00025C, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_WaitDelay_ReturnValue_1) == 0x000268, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_WaitDelay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate_8) == 0x000270, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_IsValid_ReturnValue_2) == 0x00027C, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SetHolsterWeaponWithName_IsWeaponHolstered) == 0x00027D, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SetHolsterWeaponWithName_IsWeaponHolstered' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SetHolsterWeaponWithName_OperationSuccessful) == 0x00027E, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SetHolsterWeaponWithName_OperationSuccessful' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x000280, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_IsValid_ReturnValue_3) == 0x000288, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_IsServer_ReturnValue) == 0x000289, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_CommitAbilityWithEvent_Passed) == 0x00028A, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_CommitAbilityWithEvent_Passed' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SetHolsterWeaponWithName_IsWeaponHolstered_1) == 0x00028B, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SetHolsterWeaponWithName_IsWeaponHolstered_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory, CallFunc_SetHolsterWeaponWithName_OperationSuccessful_1) == 0x00028C, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory::CallFunc_SetHolsterWeaponWithName_OperationSuccessful_1' has a wrong offset!");

// Function GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Commando_FragGrenade_WithTrajectory_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Commando_FragGrenade_WithTrajectory_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Commando_FragGrenade_WithTrajectory_C_K2_OnEndAbility");
static_assert(sizeof(GA_Commando_FragGrenade_WithTrajectory_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Commando_FragGrenade_WithTrajectory_C_K2_OnEndAbility");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.SetupAbility
// 0x00E8 (0x00E8 - 0x0000)
struct GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility final
{
public:
	class UAbilitySystemComponent*                AbilitySystemComponentRef;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_1; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue_1; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_2; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue_2; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_3; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue_3; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_4; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue_4; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_5; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue_5; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_6; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue_6; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_7; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue_7; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_8; // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue_8; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility) == 0x000008, "Wrong alignment on GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility");
static_assert(sizeof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility) == 0x0000E8, "Wrong size on GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, AbilitySystemComponentRef) == 0x000000, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::AbilitySystemComponentRef' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000008, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000018, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_SelectInt_ReturnValue) == 0x00001C, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_SelectInt_ReturnValue_1) == 0x000020, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_1) == 0x000028, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue_1) == 0x000038, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_2) == 0x000040, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue_2) == 0x000050, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_3) == 0x000058, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue_3) == 0x000068, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_4) == 0x000070, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_4' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue_4) == 0x000080, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_5) == 0x000088, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_5' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue_5) == 0x000098, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_6) == 0x0000A0, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_6' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue_6) == 0x0000B0, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_7) == 0x0000B8, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_7' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue_7) == 0x0000C8, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_8) == 0x0000D0, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_8' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue_8) == 0x0000E0, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue_8' has a wrong offset!");

// Function GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.SetupDummyProjectile
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortProjectileTrajectoryData          CallFunc_GetProjectileTrajectoryData_TrajectoryData; // 0x0068(0x0020)(NoDestructor)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             K2Node_DynamicCast_AsBP_Projectile_Trajectory;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile) == 0x000010, "Wrong alignment on GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile");
static_assert(sizeof(GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile) == 0x0000A0, "Wrong size on GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_GetProjectileTrajectoryData_TrajectoryData) == 0x000068, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_GetProjectileTrajectoryData_TrajectoryData' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile, K2Node_DynamicCast_AsBP_Projectile_Trajectory) == 0x000090, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile::K2Node_DynamicCast_AsBP_Projectile_Trajectory' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_FMax_ReturnValue) == 0x00009C, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.SetupGrenade
// 0x0360 (0x0360 - 0x0000)
struct GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade final
{
public:
	float                                         AimPitch;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Base_Grenade;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Projectile_Speed;                                  // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       Explosion_Gameplay_Spec;                           // 0x0018(0x00B8)(Parm, OutParm)
	float                                         Projectile_Gravity_Scale;                          // 0x00D0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed;   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x00D8(0x00B8)()
	struct FScalableFloat                         CallFunc_EvaluatePerkTierBalanceValue_Balance_Value; // 0x0190(0x0028)()
	float                                         CallFunc_GetRangeFromGameplayEffectContainerSpec_Range; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainer           CallFunc_BP_GetGameplayEffectContainer_ReturnValue; // 0x01C0(0x00B8)()
	float                                         CallFunc_GetRangeFromGameplayEffectContainer_Range; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         K2Node_MakeStruct_ScalableFloat;                   // 0x0280(0x0028)()
	struct FFortGameplayEffectContainer           CallFunc_ReplaceRangeInGameplayEffectContainer_ReturnValue; // 0x02A8(0x00B8)()
};
static_assert(alignof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade) == 0x000008, "Wrong alignment on GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade");
static_assert(sizeof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade) == 0x000360, "Wrong size on GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade, AimPitch) == 0x000000, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade::AimPitch' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade, Base_Grenade) == 0x000008, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade::Base_Grenade' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade, Projectile_Speed) == 0x000010, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade::Projectile_Speed' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade, Explosion_Gameplay_Spec) == 0x000018, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade::Explosion_Gameplay_Spec' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade, Projectile_Gravity_Scale) == 0x0000D0, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade::Projectile_Gravity_Scale' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade, CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed) == 0x0000D4, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade::CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x0000D8, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade, CallFunc_EvaluatePerkTierBalanceValue_Balance_Value) == 0x000190, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade::CallFunc_EvaluatePerkTierBalanceValue_Balance_Value' has a wrong offset!");
static_assert(offsetof(GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade, CallFunc_GetRangeFromGameplayEffectContainerSpec_Range) == 0x0001B8, "Member 'GA_Commando_FragGrenade_WithTrajectory_C_SetupGrenade::CallFunc_GetRangeFromGameplayEffectContainerSpec_Range' has a wrong offset!");
