#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Creative_OnKillSiphon

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.AddShields
// 0x0078 (0x0078 - 0x0000)
struct GA_Creative_OnKillSiphon_C_AddShields final
{
public:
	bool                                          bShouldConvertExcessHealthToShields_0;             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShieldToAdd;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddedShields;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShieldAdded;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0050(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0060(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_AddShields) == 0x000008, "Wrong alignment on GA_Creative_OnKillSiphon_C_AddShields");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_AddShields) == 0x000078, "Wrong size on GA_Creative_OnKillSiphon_C_AddShields");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, bShouldConvertExcessHealthToShields_0) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_AddShields::bShouldConvertExcessHealthToShields_0' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, ShieldToAdd) == 0x000004, "Member 'GA_Creative_OnKillSiphon_C_AddShields::ShieldToAdd' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, bAddedShields) == 0x000008, "Member 'GA_Creative_OnKillSiphon_C_AddShields::bAddedShields' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, ShieldAdded) == 0x00000C, "Member 'GA_Creative_OnKillSiphon_C_AddShields::ShieldAdded' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, Temp_bool_Variable) == 0x000010, "Member 'GA_Creative_OnKillSiphon_C_AddShields::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, Temp_string_Variable) == 0x000018, "Member 'GA_Creative_OnKillSiphon_C_AddShields::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, Temp_string_Variable_1) == 0x000028, "Member 'GA_Creative_OnKillSiphon_C_AddShields::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, K2Node_Select_Default) == 0x000038, "Member 'GA_Creative_OnKillSiphon_C_AddShields::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000048, "Member 'GA_Creative_OnKillSiphon_C_AddShields::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'GA_Creative_OnKillSiphon_C_AddShields::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000050, "Member 'GA_Creative_OnKillSiphon_C_AddShields::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000060, "Member 'GA_Creative_OnKillSiphon_C_AddShields::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AddShields, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000070, "Member 'GA_Creative_OnKillSiphon_C_AddShields::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.AttemptHeal
// 0x001C (0x001C - 0x0000)
struct GA_Creative_OnKillSiphon_C_AttemptHeal final
{
public:
	bool                                          CallFunc_RestoreHealth_Success;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RestoreHealth_InitialHealAmount;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RestoreHealth_ActualAppliedHeal;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RestoreHealth_ExcessHealing;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddShields_bAddedShields;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AddShields_ShieldAdded;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_AttemptHeal) == 0x000004, "Wrong alignment on GA_Creative_OnKillSiphon_C_AttemptHeal");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_AttemptHeal) == 0x00001C, "Wrong size on GA_Creative_OnKillSiphon_C_AttemptHeal");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptHeal, CallFunc_RestoreHealth_Success) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_AttemptHeal::CallFunc_RestoreHealth_Success' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptHeal, CallFunc_RestoreHealth_InitialHealAmount) == 0x000004, "Member 'GA_Creative_OnKillSiphon_C_AttemptHeal::CallFunc_RestoreHealth_InitialHealAmount' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptHeal, CallFunc_RestoreHealth_ActualAppliedHeal) == 0x000008, "Member 'GA_Creative_OnKillSiphon_C_AttemptHeal::CallFunc_RestoreHealth_ActualAppliedHeal' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptHeal, CallFunc_RestoreHealth_ExcessHealing) == 0x00000C, "Member 'GA_Creative_OnKillSiphon_C_AttemptHeal::CallFunc_RestoreHealth_ExcessHealing' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptHeal, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'GA_Creative_OnKillSiphon_C_AttemptHeal::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptHeal, CallFunc_AddShields_bAddedShields) == 0x000011, "Member 'GA_Creative_OnKillSiphon_C_AttemptHeal::CallFunc_AddShields_bAddedShields' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptHeal, CallFunc_AddShields_ShieldAdded) == 0x000014, "Member 'GA_Creative_OnKillSiphon_C_AttemptHeal::CallFunc_AddShields_ShieldAdded' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptHeal, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'GA_Creative_OnKillSiphon_C_AttemptHeal::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.AttemptMats
// 0x0024 (0x0024 - 0x0000)
struct GA_Creative_OnKillSiphon_C_AttemptMats final
{
public:
	bool                                          CallFunc_CalculateResources_bSuccess;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalculateResources_ResourceToGive;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             CallFunc_CalculateResources_ResourceType;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateResources_bSuccess_1;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalculateResources_ResourceToGive_1;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             CallFunc_CalculateResources_ResourceType_1;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GiveResourcesToPlayer_Success;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GiveResourcesToPlayer_Success_1;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateResources_bSuccess_2;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateResources_ResourceToGive_2;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             CallFunc_CalculateResources_ResourceType_2;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateResources_bSuccess_3;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalculateResources_ResourceToGive_3;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             CallFunc_CalculateResources_ResourceType_3;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GiveResourcesToPlayer_Success_2;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GiveResourcesToPlayer_Success_3;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_AttemptMats) == 0x000004, "Wrong alignment on GA_Creative_OnKillSiphon_C_AttemptMats");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_AttemptMats) == 0x000024, "Wrong size on GA_Creative_OnKillSiphon_C_AttemptMats");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_bSuccess) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_ResourceToGive) == 0x000004, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_ResourceToGive' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_ResourceType) == 0x000008, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_ResourceType' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_bSuccess_1) == 0x000009, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_ResourceToGive_1) == 0x00000C, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_ResourceToGive_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_ResourceType_1) == 0x000010, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_ResourceType_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_GiveResourcesToPlayer_Success) == 0x000011, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_GiveResourcesToPlayer_Success' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_GiveResourcesToPlayer_Success_1) == 0x000012, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_GiveResourcesToPlayer_Success_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_bSuccess_2) == 0x000013, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_ResourceToGive_2) == 0x000014, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_ResourceToGive_2' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_ResourceType_2) == 0x000018, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_ResourceType_2' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_bSuccess_3) == 0x000019, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_ResourceToGive_3) == 0x00001C, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_ResourceToGive_3' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_CalculateResources_ResourceType_3) == 0x000020, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_CalculateResources_ResourceType_3' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_GiveResourcesToPlayer_Success_2) == 0x000021, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_GiveResourcesToPlayer_Success_2' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_AttemptMats, CallFunc_GiveResourcesToPlayer_Success_3) == 0x000022, "Member 'GA_Creative_OnKillSiphon_C_AttemptMats::CallFunc_GiveResourcesToPlayer_Success_3' has a wrong offset!");

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.CalculateResources
// 0x0050 (0x0050 - 0x0000)
struct GA_Creative_OnKillSiphon_C_CalculateResources final
{
public:
	EFortResourceType                             ResourceGrantType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ResourceToGive;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             ResourceType;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LocalDataTableRowName;                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         iLocalResourceToGive;                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOverridenSiphonGoldValue_ReturnValue;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOverridenSiphonMetalValue_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOverridenSiphonWoodValue_ReturnValue;  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOverridenSiphonStoneValue_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_4;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_CalculateResources) == 0x000004, "Wrong alignment on GA_Creative_OnKillSiphon_C_CalculateResources");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_CalculateResources) == 0x000050, "Wrong size on GA_Creative_OnKillSiphon_C_CalculateResources");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, ResourceGrantType) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::ResourceGrantType' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, bSuccess) == 0x000001, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, ResourceToGive) == 0x000004, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::ResourceToGive' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, ResourceType) == 0x000008, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::ResourceType' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, LocalDataTableRowName) == 0x00000C, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::LocalDataTableRowName' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, iLocalResourceToGive) == 0x000010, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::iLocalResourceToGive' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_GetOverridenSiphonGoldValue_ReturnValue) == 0x000014, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_GetOverridenSiphonGoldValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_FTrunc_ReturnValue) == 0x00001C, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000020, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_GetOverridenSiphonMetalValue_ReturnValue) == 0x000024, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_GetOverridenSiphonMetalValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_FTrunc_ReturnValue_1) == 0x000028, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_GetOverridenSiphonWoodValue_ReturnValue) == 0x00002C, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_GetOverridenSiphonWoodValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_FTrunc_ReturnValue_2) == 0x000030, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, K2Node_SwitchEnum_CmpSuccess) == 0x000034, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, K2Node_SwitchEnum_CmpSuccess_1) == 0x000035, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_GetOverridenSiphonStoneValue_ReturnValue) == 0x000038, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_GetOverridenSiphonStoneValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_FTrunc_ReturnValue_3) == 0x00003C, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000040, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000044, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, CallFunc_FTrunc_ReturnValue_4) == 0x000048, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::CallFunc_FTrunc_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_CalculateResources, K2Node_SwitchEnum_CmpSuccess_2) == 0x00004C, "Member 'GA_Creative_OnKillSiphon_C_CalculateResources::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.DetermineHealthDelta
// 0x0034 (0x0034 - 0x0000)
struct GA_Creative_OnKillSiphon_C_DetermineHealthDelta final
{
public:
	float                                         HealingAmount;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHealth;                                     // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthDelta;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExcessHealh;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta) == 0x000004, "Wrong alignment on GA_Creative_OnKillSiphon_C_DetermineHealthDelta");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta) == 0x000034, "Wrong size on GA_Creative_OnKillSiphon_C_DetermineHealthDelta");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, HealingAmount) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::HealingAmount' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, MaxHealth) == 0x000004, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::MaxHealth' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, CurrentHealth) == 0x000008, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::CurrentHealth' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, HealthDelta) == 0x00000C, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::HealthDelta' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, ExcessHealh) == 0x000010, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::ExcessHealh' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, Temp_float_Variable) == 0x000014, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, Temp_bool_Variable) == 0x000018, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, CallFunc_GetHealth_ReturnValue) == 0x00001C, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, CallFunc_GetMaxHealth_ReturnValue) == 0x000020, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000028, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_DetermineHealthDelta, K2Node_Select_Default) == 0x000030, "Member 'GA_Creative_OnKillSiphon_C_DetermineHealthDelta::K2Node_Select_Default' has a wrong offset!");

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.ExecuteUbergraph_GA_Creative_OnKillSiphon
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	bool                                          CallFunc_SetupRestoreModes_ShouldContinue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon) == 0x000008, "Wrong alignment on GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon) == 0x0000C0, "Wrong size on GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon, EntryPoint) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon, K2Node_Event_EventData) == 0x000008, "Member 'GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon, CallFunc_SetupRestoreModes_ShouldContinue) == 0x0000B8, "Member 'GA_Creative_OnKillSiphon_C_ExecuteUbergraph_GA_Creative_OnKillSiphon::CallFunc_SetupRestoreModes_ShouldContinue' has a wrong offset!");

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.GiveResourcesToPlayer
// 0x0040 (0x0040 - 0x0000)
struct GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer final
{
public:
	bool                                          bShouldGrant;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GiveAmount;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             GiveType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               LocalItemToGive;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	const class UFortWorldItem*                   CallFunc_GiveItemToInventoryOwner_ReturnValue;     // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer) == 0x000008, "Wrong alignment on GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer) == 0x000040, "Wrong size on GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer, bShouldGrant) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer::bShouldGrant' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer, GiveAmount) == 0x000004, "Member 'GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer::GiveAmount' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer, GiveType) == 0x000008, "Member 'GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer::GiveType' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer, Success) == 0x000009, "Member 'GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer::Success' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer, LocalItemToGive) == 0x000010, "Member 'GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer::LocalItemToGive' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000020, "Member 'GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer, CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput) == 0x000028, "Member 'GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer::CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer, CallFunc_GiveItemToInventoryOwner_ReturnValue) == 0x000038, "Member 'GA_Creative_OnKillSiphon_C_GiveResourcesToPlayer::CallFunc_GiveItemToInventoryOwner_ReturnValue' has a wrong offset!");

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Creative_OnKillSiphon_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Creative_OnKillSiphon_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Creative_OnKillSiphon_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.RestoreHealth
// 0x00D8 (0x00D8 - 0x0000)
struct GA_Creative_OnKillSiphon_C_RestoreHealth final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InitialHealAmount;                                 // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActualAppliedHeal;                                 // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExcessHealing;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         fShieldRestored;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         fActualAmountHealed;                               // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         fInitialAmountToHeal;                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_DetermineHealthDelta_MaxHealth;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DetermineHealthDelta_CurrentHealth;       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DetermineHealthDelta_HealthDelta;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DetermineHealthDelta_ExcessHealh;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0098(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x00A8(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOverridenSiphonHealthValue_ReturnValue; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_RestoreHealth) == 0x000008, "Wrong alignment on GA_Creative_OnKillSiphon_C_RestoreHealth");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_RestoreHealth) == 0x0000D8, "Wrong size on GA_Creative_OnKillSiphon_C_RestoreHealth");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, Success) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::Success' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, InitialHealAmount) == 0x000004, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::InitialHealAmount' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, ActualAppliedHeal) == 0x000008, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::ActualAppliedHeal' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, ExcessHealing) == 0x00000C, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::ExcessHealing' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, fShieldRestored) == 0x000010, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::fShieldRestored' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, fActualAmountHealed) == 0x000014, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::fActualAmountHealed' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, fInitialAmountToHeal) == 0x000018, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::fInitialAmountToHeal' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, Temp_bool_Variable) == 0x00001C, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001D, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_Conv_FloatToString_ReturnValue) == 0x000020, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000030, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_DetermineHealthDelta_MaxHealth) == 0x000080, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_DetermineHealthDelta_MaxHealth' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_DetermineHealthDelta_CurrentHealth) == 0x000084, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_DetermineHealthDelta_CurrentHealth' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_DetermineHealthDelta_HealthDelta) == 0x000088, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_DetermineHealthDelta_HealthDelta' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_DetermineHealthDelta_ExcessHealh) == 0x00008C, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_DetermineHealthDelta_ExcessHealh' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_FMin_ReturnValue) == 0x000090, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000098, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0000A8, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x0000B8, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_EvaluateCurveTableRow_OutResult) == 0x0000C1, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_EvaluateCurveTableRow_OutXY) == 0x0000C4, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, K2Node_SwitchEnum_CmpSuccess) == 0x0000C8, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, CallFunc_GetOverridenSiphonHealthValue_ReturnValue) == 0x0000CC, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::CallFunc_GetOverridenSiphonHealthValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_RestoreHealth, K2Node_Select_Default) == 0x0000D0, "Member 'GA_Creative_OnKillSiphon_C_RestoreHealth::K2Node_Select_Default' has a wrong offset!");

// Function GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C.SetupRestoreModes
// 0x0030 (0x0030 - 0x0000)
struct GA_Creative_OnKillSiphon_C_SetupRestoreModes final
{
public:
	bool                                          ShouldContinue;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_OnKillSiphon_C_SetupRestoreModes) == 0x000008, "Wrong alignment on GA_Creative_OnKillSiphon_C_SetupRestoreModes");
static_assert(sizeof(GA_Creative_OnKillSiphon_C_SetupRestoreModes) == 0x000030, "Wrong size on GA_Creative_OnKillSiphon_C_SetupRestoreModes");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_SetupRestoreModes, ShouldContinue) == 0x000000, "Member 'GA_Creative_OnKillSiphon_C_SetupRestoreModes::ShouldContinue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_SetupRestoreModes, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000001, "Member 'GA_Creative_OnKillSiphon_C_SetupRestoreModes::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_OnKillSiphon_C_SetupRestoreModes, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'GA_Creative_OnKillSiphon_C_SetupRestoreModes::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
