#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DefaultPlayer_InteractSearch

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C
// 0x0188 (0x0C98 - 0x0B10)
class UGA_DefaultPlayer_InteractSearch_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RefillGasTankTag;                                  // 0x0B20(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B24[0x4];                                      // 0x0B24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAbilityMontageInfo        RefillGasTankMontage;                              // 0x0B28(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           CatchFireflyTag;                                   // 0x0B80(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAbilityMontageInfo        FireflyCatchMontage;                               // 0x0B88(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortGameplayAbilityMontageInfo        RefillVehicleFuelMontage;                          // 0x0BE0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           GasCanRefillVehicleTag;                            // 0x0C38(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3C[0x4];                                      // 0x0C3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAbilityMontageInfo        DBNOMontageInfo;                                   // 0x0C40(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Cancelled_3E01853F4E8362C959E7B4B82217702E(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_5EB1B64344DD00ABFE41E2857DC3FB38(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_6A38D93A428260E68695388965BFA176(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_72217B3542CE776DEDDBB3A7B5D6D343(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_B697D9B445CA2BFDB1328D93C33FBCF3(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_3E01853F4E8362C959E7B4B82217702E(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_5EB1B64344DD00ABFE41E2857DC3FB38(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_6A38D93A428260E68695388965BFA176(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_72217B3542CE776DEDDBB3A7B5D6D343(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_B697D9B445CA2BFDB1328D93C33FBCF3(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void EndInteractSearch();
	void ExecuteUbergraph_GA_DefaultPlayer_InteractSearch(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void StartInteractSearch();
	void Triggered_3E01853F4E8362C959E7B4B82217702E(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Triggered_5EB1B64344DD00ABFE41E2857DC3FB38(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Triggered_6A38D93A428260E68695388965BFA176(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Triggered_72217B3542CE776DEDDBB3A7B5D6D343(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Triggered_B697D9B445CA2BFDB1328D93C33FBCF3(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DefaultPlayer_InteractSearch_C">();
	}
	static class UGA_DefaultPlayer_InteractSearch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DefaultPlayer_InteractSearch_C>();
	}
};
static_assert(alignof(UGA_DefaultPlayer_InteractSearch_C) == 0x000008, "Wrong alignment on UGA_DefaultPlayer_InteractSearch_C");
static_assert(sizeof(UGA_DefaultPlayer_InteractSearch_C) == 0x000C98, "Wrong size on UGA_DefaultPlayer_InteractSearch_C");
static_assert(offsetof(UGA_DefaultPlayer_InteractSearch_C, UberGraphFrame) == 0x000B10, "Member 'UGA_DefaultPlayer_InteractSearch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_InteractSearch_C, PlayerPawn) == 0x000B18, "Member 'UGA_DefaultPlayer_InteractSearch_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_InteractSearch_C, RefillGasTankTag) == 0x000B20, "Member 'UGA_DefaultPlayer_InteractSearch_C::RefillGasTankTag' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_InteractSearch_C, RefillGasTankMontage) == 0x000B28, "Member 'UGA_DefaultPlayer_InteractSearch_C::RefillGasTankMontage' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_InteractSearch_C, CatchFireflyTag) == 0x000B80, "Member 'UGA_DefaultPlayer_InteractSearch_C::CatchFireflyTag' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_InteractSearch_C, FireflyCatchMontage) == 0x000B88, "Member 'UGA_DefaultPlayer_InteractSearch_C::FireflyCatchMontage' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_InteractSearch_C, RefillVehicleFuelMontage) == 0x000BE0, "Member 'UGA_DefaultPlayer_InteractSearch_C::RefillVehicleFuelMontage' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_InteractSearch_C, GasCanRefillVehicleTag) == 0x000C38, "Member 'UGA_DefaultPlayer_InteractSearch_C::GasCanRefillVehicleTag' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_InteractSearch_C, DBNOMontageInfo) == 0x000C40, "Member 'UGA_DefaultPlayer_InteractSearch_C::DBNOMontageInfo' has a wrong offset!");

}

