#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Melee_BlockBreak_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Melee_BlockBreak_Parent.GA_Melee_BlockBreak_Parent_C
// 0x0020 (0x0B30 - 0x0B10)
class UGA_Melee_BlockBreak_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           GC_BlockBreak;                                     // 0x0B18(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1C[0x4];                                      // 0x0B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_FailSafeTimer;                                // 0x0B28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Cancelled_41F3CDFD476F32896B1318A02125652C(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_41F3CDFD476F32896B1318A02125652C(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void ExecuteUbergraph_GA_Melee_BlockBreak_Parent(int32 EntryPoint);
	void FailedToActivatePassiveAbility();
	void FailSafeTimer();
	void K2_ActivateAbility();
	void Triggered_41F3CDFD476F32896B1318A02125652C(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Melee_BlockBreak_Parent_C">();
	}
	static class UGA_Melee_BlockBreak_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Melee_BlockBreak_Parent_C>();
	}
};
static_assert(alignof(UGA_Melee_BlockBreak_Parent_C) == 0x000008, "Wrong alignment on UGA_Melee_BlockBreak_Parent_C");
static_assert(sizeof(UGA_Melee_BlockBreak_Parent_C) == 0x000B30, "Wrong size on UGA_Melee_BlockBreak_Parent_C");
static_assert(offsetof(UGA_Melee_BlockBreak_Parent_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Melee_BlockBreak_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Melee_BlockBreak_Parent_C, GC_BlockBreak) == 0x000B18, "Member 'UGA_Melee_BlockBreak_Parent_C::GC_BlockBreak' has a wrong offset!");
static_assert(offsetof(UGA_Melee_BlockBreak_Parent_C, PlayerPawn) == 0x000B20, "Member 'UGA_Melee_BlockBreak_Parent_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Melee_BlockBreak_Parent_C, Time_FailSafeTimer) == 0x000B28, "Member 'UGA_Melee_BlockBreak_Parent_C::Time_FailSafeTimer' has a wrong offset!");

}

