#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPC_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_NPC_AlertLevel_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "AIModule_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GA_NPC_Parent.GA_NPC_Parent_C.BeginDestroyBuildings
// 0x0008 (0x0008 - 0x0000)
struct GA_NPC_Parent_C_BeginDestroyBuildings final
{
public:
	struct FGameplayTag                           TargetSelectionApplicationTag;                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          DoContinuousTargetSelection;                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_C_BeginDestroyBuildings) == 0x000004, "Wrong alignment on GA_NPC_Parent_C_BeginDestroyBuildings");
static_assert(sizeof(GA_NPC_Parent_C_BeginDestroyBuildings) == 0x000008, "Wrong size on GA_NPC_Parent_C_BeginDestroyBuildings");
static_assert(offsetof(GA_NPC_Parent_C_BeginDestroyBuildings, TargetSelectionApplicationTag) == 0x000000, "Member 'GA_NPC_Parent_C_BeginDestroyBuildings::TargetSelectionApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_BeginDestroyBuildings, DoContinuousTargetSelection) == 0x000004, "Member 'GA_NPC_Parent_C_BeginDestroyBuildings::DoContinuousTargetSelection' has a wrong offset!");

// Function GA_NPC_Parent.GA_NPC_Parent_C.Cancelled_13B12ED64A3570FC1E117FAC4E3F7961
// 0x0030 (0x0030 - 0x0000)
struct GA_NPC_Parent_C_Cancelled_13B12ED64A3570FC1E117FAC4E3F7961 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_C_Cancelled_13B12ED64A3570FC1E117FAC4E3F7961) == 0x000008, "Wrong alignment on GA_NPC_Parent_C_Cancelled_13B12ED64A3570FC1E117FAC4E3F7961");
static_assert(sizeof(GA_NPC_Parent_C_Cancelled_13B12ED64A3570FC1E117FAC4E3F7961) == 0x000030, "Wrong size on GA_NPC_Parent_C_Cancelled_13B12ED64A3570FC1E117FAC4E3F7961");
static_assert(offsetof(GA_NPC_Parent_C_Cancelled_13B12ED64A3570FC1E117FAC4E3F7961, TargetData) == 0x000000, "Member 'GA_NPC_Parent_C_Cancelled_13B12ED64A3570FC1E117FAC4E3F7961::TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_Cancelled_13B12ED64A3570FC1E117FAC4E3F7961, ApplicationTag) == 0x000028, "Member 'GA_NPC_Parent_C_Cancelled_13B12ED64A3570FC1E117FAC4E3F7961::ApplicationTag' has a wrong offset!");

// Function GA_NPC_Parent.GA_NPC_Parent_C.Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368
// 0x0030 (0x0030 - 0x0000)
struct GA_NPC_Parent_C_Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_C_Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368) == 0x000008, "Wrong alignment on GA_NPC_Parent_C_Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368");
static_assert(sizeof(GA_NPC_Parent_C_Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368) == 0x000030, "Wrong size on GA_NPC_Parent_C_Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368");
static_assert(offsetof(GA_NPC_Parent_C_Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368, TargetData) == 0x000000, "Member 'GA_NPC_Parent_C_Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368::TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368, ApplicationTag) == 0x000028, "Member 'GA_NPC_Parent_C_Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368::ApplicationTag' has a wrong offset!");

// Function GA_NPC_Parent.GA_NPC_Parent_C.DestroyBuilding
// 0x00A0 (0x00A0 - 0x0000)
struct GA_NPC_Parent_C_DestroyBuilding final
{
public:
	class AActor*                                 BuildingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0030(0x0028)()
	bool                                          CallFunc_NPC_GetScalableFloatHotfixValue_AsBool;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_NPC_GetScalableFloatHotfixValue_AsIntRounded; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NPC_GetScalableFloatHotfixValue_AsFloat;  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaSupplyDropBalloon*           K2Node_DynamicCast_AsFort_Athena_Supply_Drop_Balloon; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeldObjectComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_C_DestroyBuilding) == 0x000008, "Wrong alignment on GA_NPC_Parent_C_DestroyBuilding");
static_assert(sizeof(GA_NPC_Parent_C_DestroyBuilding) == 0x0000A0, "Wrong size on GA_NPC_Parent_C_DestroyBuilding");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, BuildingActor) == 0x000000, "Member 'GA_NPC_Parent_C_DestroyBuilding::BuildingActor' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000008, "Member 'GA_NPC_Parent_C_DestroyBuilding::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_NPC_Parent_C_DestroyBuilding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000019, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, K2Node_DynamicCast_AsBuilding_Actor) == 0x000020, "Member 'GA_NPC_Parent_C_DestroyBuilding::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'GA_NPC_Parent_C_DestroyBuilding::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000030, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_NPC_GetScalableFloatHotfixValue_AsBool) == 0x000058, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_NPC_GetScalableFloatHotfixValue_AsBool' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_NPC_GetScalableFloatHotfixValue_AsIntRounded) == 0x00005C, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_NPC_GetScalableFloatHotfixValue_AsIntRounded' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_NPC_GetScalableFloatHotfixValue_AsFloat) == 0x000060, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_NPC_GetScalableFloatHotfixValue_AsFloat' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, K2Node_DynamicCast_AsFort_Athena_Supply_Drop_Balloon) == 0x000068, "Member 'GA_NPC_Parent_C_DestroyBuilding::K2Node_DynamicCast_AsFort_Athena_Supply_Drop_Balloon' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'GA_NPC_Parent_C_DestroyBuilding::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_Not_PreBool_ReturnValue) == 0x000071, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_GetComponentByClass_ReturnValue) == 0x000078, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_Not_PreBool_ReturnValue_1) == 0x000081, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_BooleanAND_ReturnValue) == 0x000082, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000083, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, Temp_bool_Variable) == 0x000084, "Member 'GA_NPC_Parent_C_DestroyBuilding::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000088, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_BooleanAND_ReturnValue_1) == 0x000098, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_BooleanOR_ReturnValue) == 0x000099, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_IsValid_ReturnValue_1) == 0x00009A, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_DestroyBuilding, CallFunc_K2_HasAuthority_ReturnValue) == 0x00009B, "Member 'GA_NPC_Parent_C_DestroyBuilding::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");

// Function GA_NPC_Parent.GA_NPC_Parent_C.ExecuteUbergraph_GA_NPC_Parent
// 0x01C0 (0x01C0 - 0x0000)
struct GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0010(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0038(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x003C(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0040(0x0028)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0068(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0090(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0094(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x00A0(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x00C8(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00CC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x00D8(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_3;                            // 0x00E0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0108(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x0130(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0140(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_TargetSelectionApplicationTag;  // 0x014C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_DoContinuousTargetSelection;    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_TargetSelectionContinuous* CallFunc_DoTargetSelectionContinuous_ReturnValue;  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataCountFromTargetData_ReturnValue;   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0190(0x0010)(ReferenceParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent) == 0x000008, "Wrong alignment on GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent");
static_assert(sizeof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent) == 0x0001C0, "Wrong size on GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, EntryPoint) == 0x000000, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_TargetData_2) == 0x000010, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_ApplicationTag_2) == 0x000038, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, Temp_struct_Variable) == 0x00003C, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, Temp_struct_Variable_1) == 0x000040, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_TargetData_1) == 0x000068, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_ApplicationTag_1) == 0x000090, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_TargetData) == 0x0000A0, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_ApplicationTag) == 0x0000C8, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000CC, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, Temp_struct_Variable_2) == 0x0000D8, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, Temp_struct_Variable_3) == 0x0000E0, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_TargetData_3) == 0x000108, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_ApplicationTag_3) == 0x000130, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, Temp_int_Loop_Counter_Variable) == 0x000134, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, Temp_int_Array_Index_Variable) == 0x00013C, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000140, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_TargetSelectionApplicationTag) == 0x00014C, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_TargetSelectionApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, K2Node_CustomEvent_DoContinuousTargetSelection) == 0x000150, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::K2Node_CustomEvent_DoContinuousTargetSelection' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, Temp_int_Variable) == 0x000154, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000158, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_DoTargetSelectionContinuous_ReturnValue) == 0x000160, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_DoTargetSelectionContinuous_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_WaitTargetSelection_ReturnValue) == 0x000168, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000171, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Array_Get_Item) == 0x000178, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Less_IntInt_ReturnValue) == 0x000184, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_GetDataCountFromTargetData_ReturnValue) == 0x000188, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_GetDataCountFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000190, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001A0, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Array_Get_Item_1) == 0x0001A8, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001B0, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_IsValid_ReturnValue_2) == 0x0001B1, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Array_Add_ReturnValue) == 0x0001B4, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Array_Length_ReturnValue_1) == 0x0001B8, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent, CallFunc_Greater_IntInt_ReturnValue) == 0x0001BC, "Member 'GA_NPC_Parent_C_ExecuteUbergraph_GA_NPC_Parent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function GA_NPC_Parent.GA_NPC_Parent_C.NPC AbilityDebugMessage
// 0x0098 (0x0098 - 0x0000)
struct GA_NPC_Parent_C_NPC_AbilityDebugMessage final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          OnlyWhenDebug;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Float_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_C_NPC_AbilityDebugMessage) == 0x000008, "Wrong alignment on GA_NPC_Parent_C_NPC_AbilityDebugMessage");
static_assert(sizeof(GA_NPC_Parent_C_NPC_AbilityDebugMessage) == 0x000098, "Wrong size on GA_NPC_Parent_C_NPC_AbilityDebugMessage");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, String) == 0x000000, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::String' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, OnlyWhenDebug) == 0x000010, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::OnlyWhenDebug' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000040, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000048, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_BuildString_Float_ReturnValue) == 0x000058, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_BuildString_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000068, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_BooleanAND_ReturnValue) == 0x000078, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000080, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityDebugMessage, CallFunc_BooleanOR_ReturnValue) == 0x000090, "Member 'GA_NPC_Parent_C_NPC_AbilityDebugMessage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_NPC_Parent.GA_NPC_Parent_C.NPC AbilityTargetIsBuildingWeAreDestroyingToNavigate
// 0x0050 (0x0050 - 0x0000)
struct GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate final
{
public:
	bool                                          IsNavigationBuildingWeAreDestroying;               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         BuildingWeAreDestroying;                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthOfBuildingWeAreDestroying;                   // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_NPC_GetGoalActor_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate) == 0x000008, "Wrong alignment on GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate");
static_assert(sizeof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate) == 0x000050, "Wrong size on GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, IsNavigationBuildingWeAreDestroying) == 0x000000, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::IsNavigationBuildingWeAreDestroying' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, BuildingWeAreDestroying) == 0x000008, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::BuildingWeAreDestroying' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, HealthOfBuildingWeAreDestroying) == 0x000010, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::HealthOfBuildingWeAreDestroying' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, CallFunc_NPC_GetGoalActor_ReturnValue) == 0x000018, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::CallFunc_NPC_GetGoalActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x000028, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, K2Node_DynamicCast_AsBuilding_Actor) == 0x000038, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, CallFunc_GetHealth_ReturnValue) == 0x000044, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function GA_NPC_Parent.GA_NPC_Parent_C.NPC AbilityTargetIsWithinAngleThreshold
// 0x00C0 (0x00C0 - 0x0000)
struct GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold final
{
public:
	float                                         AngleThreshold;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWithinAngle;                                     // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngleThresholdVar;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAngleBetweenTwoVectors_Angle__Degrees_; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Float_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Float_ReturnValue_1;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold) == 0x000008, "Wrong alignment on GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold");
static_assert(sizeof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold) == 0x0000C0, "Wrong size on GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, AngleThreshold) == 0x000000, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::AngleThreshold' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, IsWithinAngle) == 0x000004, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::IsWithinAngle' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, AngleThresholdVar) == 0x000008, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::AngleThresholdVar' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000028, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x000058, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_GetAngleBetweenTwoVectors_Angle__Degrees_) == 0x000098, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_GetAngleBetweenTwoVectors_Angle__Degrees_' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00009C, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_Less_FloatFloat_ReturnValue) == 0x00009D, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_BuildString_Float_ReturnValue) == 0x0000A0, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_BuildString_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold, CallFunc_BuildString_Float_ReturnValue_1) == 0x0000B0, "Member 'GA_NPC_Parent_C_NPC_AbilityTargetIsWithinAngleThreshold::CallFunc_BuildString_Float_ReturnValue_1' has a wrong offset!");

// Function GA_NPC_Parent.GA_NPC_Parent_C.NPC ApplyGameplayEffectContainerAndLaunchTargets
// 0x0640 (0x0640 - 0x0000)
struct GA_NPC_Parent_C_NPC_ApplyGameplayEffectContainerAndLaunchTargets final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         GameplayEffectLevel;                               // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbilityTargetCanBeHitMultipleTimesByThisSelection; // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceDebugFreezeFrameForThisSpecificTargeting;     // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitAbilityTargetRightNow;                          // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitAbilityTargetDuringThisAbilityActivation;       // 0x0033(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsWeHaveHitDuringThisAbilityActivation;        // 0x0038(0x0010)(Parm, OutParm)
	TArray<class AActor*>                         ActorsHitWithThisSpecificTargetSelection;          // 0x0048(0x0010)(Parm, OutParm)
	bool                                          HitWasVehicle;                                     // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceDebugFreezeFrame;                             // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CurrentHitActorWeAreTestingHitResultFromTargetData; // 0x0060(0x00E0)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CurrentHitActorWeAreTestingArrayIndex;             // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CurrentHitActorWeAreTesting;                       // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentAbilityTargetCanBeHitMultipleTimesByThisSelection; // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GetCurrentGameplayEffectLevel;                     // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CurrentApplicationTag;                             // 0x0158(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CurrentActorsGatheredThisTargetSelection;          // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	float                                         CurrentKnockbackVelocity;                          // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CurrentTargetData;                                 // 0x0178(0x0028)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_Pawn_Parent_C*                     K2Node_DynamicCast_AsNPC_Pawn_Parent;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
