#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPC_Irwin_Prey_Nug_Melee_Bump

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_0_structs.hpp"


namespace SDK::Params
{

// Function GA_NPC_Irwin_Prey_Nug_Melee_Bump.GA_NPC_Irwin_Prey_Nug_Melee_Bump_C.ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump
// 0x0058 (0x0058 - 0x0000)
struct GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_Pawn_Irwin_Prey_Nug_C*             K2Node_DynamicCast_AsNPC_Pawn_Irwin_Prey_Nug;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilitiesByTag_ReturnValue;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveAbilityWithAnyMatchingTag_ReturnValue; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActivateAbilityWithMatchingTag_ReturnValue; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetData;                           // 0x0028(0x0028)()
	struct FGameplayTag                           K2Node_Event_ApplicationTag;                       // 0x0050(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump) == 0x000008, "Wrong alignment on GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump");
static_assert(sizeof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump) == 0x000058, "Wrong size on GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, EntryPoint) == 0x000000, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, K2Node_DynamicCast_AsNPC_Pawn_Irwin_Prey_Nug) == 0x000008, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::K2Node_DynamicCast_AsNPC_Pawn_Irwin_Prey_Nug' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, CallFunc_TryActivateAbilitiesByTag_ReturnValue) == 0x000020, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::CallFunc_TryActivateAbilitiesByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, CallFunc_IsValid_ReturnValue_2) == 0x000021, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, CallFunc_HasActiveAbilityWithAnyMatchingTag_ReturnValue) == 0x000022, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::CallFunc_HasActiveAbilityWithAnyMatchingTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, CallFunc_CanActivateAbilityWithMatchingTag_ReturnValue) == 0x000024, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::CallFunc_CanActivateAbilityWithMatchingTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, K2Node_Event_TargetData) == 0x000028, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::K2Node_Event_TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump, K2Node_Event_ApplicationTag) == 0x000050, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_ExecuteUbergraph_GA_NPC_Irwin_Prey_Nug_Melee_Bump::K2Node_Event_ApplicationTag' has a wrong offset!");

// Function GA_NPC_Irwin_Prey_Nug_Melee_Bump.GA_NPC_Irwin_Prey_Nug_Melee_Bump_C.MontageAbilityTriggered
// 0x0030 (0x0030 - 0x0000)
struct GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_MontageAbilityTriggered final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_MontageAbilityTriggered) == 0x000008, "Wrong alignment on GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_MontageAbilityTriggered");
static_assert(sizeof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_MontageAbilityTriggered) == 0x000030, "Wrong size on GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_MontageAbilityTriggered");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_MontageAbilityTriggered, TargetData) == 0x000000, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_MontageAbilityTriggered::TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_MontageAbilityTriggered, ApplicationTag) == 0x000028, "Member 'GA_NPC_Irwin_Prey_Nug_Melee_Bump_C_MontageAbilityTriggered::ApplicationTag' has a wrong offset!");

}

