#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPC_Parent_Melee

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GA_NPC_Parent_Melee.GA_NPC_Parent_Melee_C.Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0
// 0x0030 (0x0030 - 0x0000)
struct GA_NPC_Parent_Melee_C_Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_Melee_C_Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0) == 0x000008, "Wrong alignment on GA_NPC_Parent_Melee_C_Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0");
static_assert(sizeof(GA_NPC_Parent_Melee_C_Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0) == 0x000030, "Wrong size on GA_NPC_Parent_Melee_C_Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0");
static_assert(offsetof(GA_NPC_Parent_Melee_C_Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0, TargetData) == 0x000000, "Member 'GA_NPC_Parent_Melee_C_Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0::TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0, ApplicationTag) == 0x000028, "Member 'GA_NPC_Parent_Melee_C_Cancelled_0C0CF9C14BFCBE77EA7D2CBD89151BA0::ApplicationTag' has a wrong offset!");

// Function GA_NPC_Parent_Melee.GA_NPC_Parent_Melee_C.Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0
// 0x0030 (0x0030 - 0x0000)
struct GA_NPC_Parent_Melee_C_Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_Melee_C_Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0) == 0x000008, "Wrong alignment on GA_NPC_Parent_Melee_C_Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0");
static_assert(sizeof(GA_NPC_Parent_Melee_C_Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0) == 0x000030, "Wrong size on GA_NPC_Parent_Melee_C_Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0");
static_assert(offsetof(GA_NPC_Parent_Melee_C_Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0, TargetData) == 0x000000, "Member 'GA_NPC_Parent_Melee_C_Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0::TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0, ApplicationTag) == 0x000028, "Member 'GA_NPC_Parent_Melee_C_Completed_0C0CF9C14BFCBE77EA7D2CBD89151BA0::ApplicationTag' has a wrong offset!");

// Function GA_NPC_Parent_Melee.GA_NPC_Parent_Melee_C.ExecuteUbergraph_GA_NPC_Parent_Melee
// 0x01B0 (0x01B0 - 0x0000)
struct GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NotifyTag;                            // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0018(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x0040(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0048(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0070(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0080(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x00A8(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00B8(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x00C0(0x0028)()
	EPathFollowingResult                          K2Node_CustomEvent_Result;                         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0104(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0110(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x011C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0128(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAIAbilityTarget_ReturnValue;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_MoveAI*                CallFunc_CreateMoveAITask_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0160(0x0028)()
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0188(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_HitAbilityTargetRightNow; // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_HitAbilityTargetDuringThisAbilityActivation; // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_ActorsWeHaveHitDuringThisAbilityActivation; // 0x0190(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_ActorsHitWithThisSpecificTargetSelection; // 0x01A0(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee) == 0x000008, "Wrong alignment on GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee");
static_assert(sizeof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee) == 0x0001B0, "Wrong size on GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, EntryPoint) == 0x000000, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_Event_NotifyTag) == 0x000004, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_MatchesTag_ReturnValue) == 0x000008, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_TargetData_3) == 0x000018, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_ApplicationTag_3) == 0x000040, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_TargetData_2) == 0x000048, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_ApplicationTag_2) == 0x000070, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_TargetData_1) == 0x000080, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_ApplicationTag_1) == 0x0000A8, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, Temp_struct_Variable) == 0x0000B8, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, Temp_struct_Variable_1) == 0x0000C0, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_Result) == 0x0000E8, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_AIController) == 0x0000F0, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F8, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CreateDelegate_OutputDelegate_4) == 0x000104, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CreateDelegate_OutputDelegate_5) == 0x000110, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CreateDelegate_OutputDelegate_6) == 0x00011C, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CreateDelegate_OutputDelegate_7) == 0x000128, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_K2_CommitAbility_ReturnValue) == 0x000134, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000138, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_Event_bWasCancelled) == 0x000141, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_GetAIAbilityTarget_ReturnValue) == 0x000148, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_GetAIAbilityTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_CreateMoveAITask_ReturnValue) == 0x000150, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_CreateMoveAITask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_IsValid_ReturnValue_1) == 0x000158, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_IsValid_ReturnValue_2) == 0x000159, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00015A, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_TargetData) == 0x000160, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, K2Node_CustomEvent_ApplicationTag) == 0x000188, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_HitAbilityTargetRightNow) == 0x00018C, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_HitAbilityTargetRightNow' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_HitAbilityTargetDuringThisAbilityActivation) == 0x00018D, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_HitAbilityTargetDuringThisAbilityActivation' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_ActorsWeHaveHitDuringThisAbilityActivation) == 0x000190, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_ActorsWeHaveHitDuringThisAbilityActivation' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee, CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_ActorsHitWithThisSpecificTargetSelection) == 0x0001A0, "Member 'GA_NPC_Parent_Melee_C_ExecuteUbergraph_GA_NPC_Parent_Melee::CallFunc_NPC_ApplyGameplayEffectContainerAndLaunchTargets_ActorsHitWithThisSpecificTargetSelection' has a wrong offset!");

// Function GA_NPC_Parent_Melee.GA_NPC_Parent_Melee_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_NPC_Parent_Melee_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_Melee_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_NPC_Parent_Melee_C_K2_OnEndAbility");
static_assert(sizeof(GA_NPC_Parent_Melee_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_NPC_Parent_Melee_C_K2_OnEndAbility");
static_assert(offsetof(GA_NPC_Parent_Melee_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_NPC_Parent_Melee_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_NPC_Parent_Melee.GA_NPC_Parent_Melee_C.MontageAbilityTriggered
// 0x0030 (0x0030 - 0x0000)
struct GA_NPC_Parent_Melee_C_MontageAbilityTriggered final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_Melee_C_MontageAbilityTriggered) == 0x000008, "Wrong alignment on GA_NPC_Parent_Melee_C_MontageAbilityTriggered");
static_assert(sizeof(GA_NPC_Parent_Melee_C_MontageAbilityTriggered) == 0x000030, "Wrong size on GA_NPC_Parent_Melee_C_MontageAbilityTriggered");
static_assert(offsetof(GA_NPC_Parent_Melee_C_MontageAbilityTriggered, TargetData) == 0x000000, "Member 'GA_NPC_Parent_Melee_C_MontageAbilityTriggered::TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_MontageAbilityTriggered, ApplicationTag) == 0x000028, "Member 'GA_NPC_Parent_Melee_C_MontageAbilityTriggered::ApplicationTag' has a wrong offset!");

// Function GA_NPC_Parent_Melee.GA_NPC_Parent_Melee_C.OnGenericNotifyFromAnimation
// 0x0004 (0x0004 - 0x0000)
struct GA_NPC_Parent_Melee_C_OnGenericNotifyFromAnimation final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_Melee_C_OnGenericNotifyFromAnimation) == 0x000004, "Wrong alignment on GA_NPC_Parent_Melee_C_OnGenericNotifyFromAnimation");
static_assert(sizeof(GA_NPC_Parent_Melee_C_OnGenericNotifyFromAnimation) == 0x000004, "Wrong size on GA_NPC_Parent_Melee_C_OnGenericNotifyFromAnimation");
static_assert(offsetof(GA_NPC_Parent_Melee_C_OnGenericNotifyFromAnimation, NotifyTag) == 0x000000, "Member 'GA_NPC_Parent_Melee_C_OnGenericNotifyFromAnimation::NotifyTag' has a wrong offset!");

// Function GA_NPC_Parent_Melee.GA_NPC_Parent_Melee_C.OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704
// 0x0010 (0x0010 - 0x0000)
struct GA_NPC_Parent_Melee_C_OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704 final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          AIController;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_Melee_C_OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704) == 0x000008, "Wrong alignment on GA_NPC_Parent_Melee_C_OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704");
static_assert(sizeof(GA_NPC_Parent_Melee_C_OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704) == 0x000010, "Wrong size on GA_NPC_Parent_Melee_C_OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704");
static_assert(offsetof(GA_NPC_Parent_Melee_C_OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704, Result) == 0x000000, "Member 'GA_NPC_Parent_Melee_C_OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704::Result' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704, AIController) == 0x000008, "Member 'GA_NPC_Parent_Melee_C_OnMoveFinished_F65CF1EE473B6A2F8069108CC24B1704::AIController' has a wrong offset!");

// Function GA_NPC_Parent_Melee.GA_NPC_Parent_Melee_C.Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0
// 0x0030 (0x0030 - 0x0000)
struct GA_NPC_Parent_Melee_C_Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Parent_Melee_C_Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0) == 0x000008, "Wrong alignment on GA_NPC_Parent_Melee_C_Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0");
static_assert(sizeof(GA_NPC_Parent_Melee_C_Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0) == 0x000030, "Wrong size on GA_NPC_Parent_Melee_C_Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0");
static_assert(offsetof(GA_NPC_Parent_Melee_C_Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0, TargetData) == 0x000000, "Member 'GA_NPC_Parent_Melee_C_Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0::TargetData' has a wrong offset!");
static_assert(offsetof(GA_NPC_Parent_Melee_C_Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0, ApplicationTag) == 0x000028, "Member 'GA_NPC_Parent_Melee_C_Triggered_0C0CF9C14BFCBE77EA7D2CBD89151BA0::ApplicationTag' has a wrong offset!");

}

