#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ostrich_MissileLauncher

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Ostrich_MissileLauncher.GA_Ostrich_MissileLauncher_C.ExecuteUbergraph_GA_Ostrich_MissileLauncher
// 0x0190 (0x0190 - 0x0000)
struct GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTargetDataOrigin_ReturnValue;          // 0x00D0(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeaponRanged_Ostrich*              K2Node_DynamicCast_AsFort_Weapon_Ranged_Ostrich;   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher) == 0x000010, "Wrong alignment on GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher");
static_assert(sizeof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher) == 0x000190, "Wrong size on GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, EntryPoint) == 0x000000, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, K2Node_Event_EventData) == 0x000008, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000B8, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0000C0, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, CallFunc_GetTargetDataOrigin_ReturnValue) == 0x0000D0, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::CallFunc_GetTargetDataOrigin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, CallFunc_BreakTransform_Location) == 0x000130, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, CallFunc_BreakTransform_Rotation) == 0x000148, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, CallFunc_BreakTransform_Scale) == 0x000160, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, K2Node_DynamicCast_AsFort_Weapon_Ranged_Ostrich) == 0x000178, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::K2Node_DynamicCast_AsFort_Weapon_Ranged_Ostrich' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher, CallFunc_HasAuthority_ReturnValue) == 0x000181, "Member 'GA_Ostrich_MissileLauncher_C_ExecuteUbergraph_GA_Ostrich_MissileLauncher::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function GA_Ostrich_MissileLauncher.GA_Ostrich_MissileLauncher_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Ostrich_MissileLauncher_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Ostrich_MissileLauncher_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Ostrich_MissileLauncher_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Ostrich_MissileLauncher_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Ostrich_MissileLauncher_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Ostrich_MissileLauncher_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Ostrich_MissileLauncher_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

