#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Player_Irwin_Nug_Float

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Player_Irwin_Nug_Float.GA_Player_Irwin_Nug_Float_C.ExecuteUbergraph_GA_Player_Irwin_Nug_Float
// 0x01C8 (0x01C8 - 0x0000)
struct GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMovementMode NewMovementMode)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_NewMovementMode;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitMovementModeChange*    CallFunc_CreateWaitMovementModeChange_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0074(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_1; // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0088(0x00B0)(ConstParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_4;  // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_2; // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_5;  // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float) == 0x000008, "Wrong alignment on GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float");
static_assert(sizeof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float) == 0x0001C8, "Wrong size on GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, EntryPoint) == 0x000000, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_WaitNetSync_ReturnValue) == 0x000008, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_GetValue_ReturnValue) == 0x000010, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000030, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, K2Node_CustomEvent_NewMovementMode) == 0x000038, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::K2Node_CustomEvent_NewMovementMode' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, Temp_byte_Variable) == 0x000039, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_CreateWaitMovementModeChange_ReturnValue) == 0x000040, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_CreateWaitMovementModeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_IsValid_ReturnValue_3) == 0x000048, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_IsValid_ReturnValue_4) == 0x000049, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000050, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x000068, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000070, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000074, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_IsValid_ReturnValue_5) == 0x00007C, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_RemoveActiveGameplayEffect_ReturnValue_1) == 0x00007D, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_RemoveActiveGameplayEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x000080, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, K2Node_Event_EventData) == 0x000088, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_GetAbilitySystemComponent_ReturnValue_4) == 0x000138, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_GetAbilitySystemComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2) == 0x000140, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_RemoveActiveGameplayEffect_ReturnValue_2) == 0x000148, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_RemoveActiveGameplayEffect_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, K2Node_Event_bWasCancelled) == 0x000149, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_GetActorForwardVector_ReturnValue) == 0x000150, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_GetAbilitySystemComponent_ReturnValue_5) == 0x000168, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_GetAbilitySystemComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000170, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000180, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_GetValue_ReturnValue_1) == 0x000184, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000188, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_BreakVector_X) == 0x0001A0, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_BreakVector_Y) == 0x0001A4, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_BreakVector_Z) == 0x0001A8, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float, CallFunc_MakeVector_ReturnValue) == 0x0001B0, "Member 'GA_Player_Irwin_Nug_Float_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Float::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function GA_Player_Irwin_Nug_Float.GA_Player_Irwin_Nug_Float_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Player_Irwin_Nug_Float_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Player_Irwin_Nug_Float_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Player_Irwin_Nug_Float_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Player_Irwin_Nug_Float_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Player_Irwin_Nug_Float_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Player_Irwin_Nug_Float_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Player_Irwin_Nug_Float.GA_Player_Irwin_Nug_Float_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Player_Irwin_Nug_Float_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Player_Irwin_Nug_Float_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Player_Irwin_Nug_Float_C_K2_OnEndAbility");
static_assert(sizeof(GA_Player_Irwin_Nug_Float_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Player_Irwin_Nug_Float_C_K2_OnEndAbility");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Player_Irwin_Nug_Float_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Player_Irwin_Nug_Float.GA_Player_Irwin_Nug_Float_C.OnChange_6109C9314D7ACBDCDB7F008F1748AF26
// 0x0001 (0x0001 - 0x0000)
struct GA_Player_Irwin_Nug_Float_C_OnChange_6109C9314D7ACBDCDB7F008F1748AF26 final
{
public:
	EMovementMode                                 NewMovementMode;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Player_Irwin_Nug_Float_C_OnChange_6109C9314D7ACBDCDB7F008F1748AF26) == 0x000001, "Wrong alignment on GA_Player_Irwin_Nug_Float_C_OnChange_6109C9314D7ACBDCDB7F008F1748AF26");
static_assert(sizeof(GA_Player_Irwin_Nug_Float_C_OnChange_6109C9314D7ACBDCDB7F008F1748AF26) == 0x000001, "Wrong size on GA_Player_Irwin_Nug_Float_C_OnChange_6109C9314D7ACBDCDB7F008F1748AF26");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_OnChange_6109C9314D7ACBDCDB7F008F1748AF26, NewMovementMode) == 0x000000, "Member 'GA_Player_Irwin_Nug_Float_C_OnChange_6109C9314D7ACBDCDB7F008F1748AF26::NewMovementMode' has a wrong offset!");

// Function GA_Player_Irwin_Nug_Float.GA_Player_Irwin_Nug_Float_C.Set Refs
// 0x0028 (0x0028 - 0x0000)
struct GA_Player_Irwin_Nug_Float_C_Set_Refs final
{
public:
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Player_Irwin_Nug_Float_C_Set_Refs) == 0x000008, "Wrong alignment on GA_Player_Irwin_Nug_Float_C_Set_Refs");
static_assert(sizeof(GA_Player_Irwin_Nug_Float_C_Set_Refs) == 0x000028, "Wrong size on GA_Player_Irwin_Nug_Float_C_Set_Refs");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_Set_Refs, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Player_Irwin_Nug_Float_C_Set_Refs::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_Set_Refs, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000008, "Member 'GA_Player_Irwin_Nug_Float_C_Set_Refs::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_Set_Refs, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_Player_Irwin_Nug_Float_C_Set_Refs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_Set_Refs, CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue) == 0x000018, "Member 'GA_Player_Irwin_Nug_Float_C_Set_Refs::CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Float_C_Set_Refs, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Player_Irwin_Nug_Float_C_Set_Refs::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

