#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Player_Irwin_Nug_Melee

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_0_structs.hpp"


namespace SDK::Params
{

// Function GA_Player_Irwin_Nug_Melee.GA_Player_Irwin_Nug_Melee_C.Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54
// 0x0030 (0x0030 - 0x0000)
struct GA_Player_Irwin_Nug_Melee_C_Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Player_Irwin_Nug_Melee_C_Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54) == 0x000008, "Wrong alignment on GA_Player_Irwin_Nug_Melee_C_Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54");
static_assert(sizeof(GA_Player_Irwin_Nug_Melee_C_Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54) == 0x000030, "Wrong size on GA_Player_Irwin_Nug_Melee_C_Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54, TargetData) == 0x000000, "Member 'GA_Player_Irwin_Nug_Melee_C_Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54, ApplicationTag) == 0x000028, "Member 'GA_Player_Irwin_Nug_Melee_C_Cancelled_6C78FB4B46DC49745E7AF1BD08E25B54::ApplicationTag' has a wrong offset!");

// Function GA_Player_Irwin_Nug_Melee.GA_Player_Irwin_Nug_Melee_C.ExecuteUbergraph_GA_Player_Irwin_Nug_Melee
// 0x00C8 (0x00C8 - 0x0000)
struct GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0030(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0040(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0068(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0078(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0080(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee) == 0x000008, "Wrong alignment on GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee");
static_assert(sizeof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee) == 0x0000C8, "Wrong size on GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, EntryPoint) == 0x000000, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, K2Node_CustomEvent_TargetData_1) == 0x000008, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, K2Node_CustomEvent_ApplicationTag_1) == 0x000030, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, K2Node_CustomEvent_TargetData) == 0x000040, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, K2Node_CustomEvent_ApplicationTag) == 0x000068, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, Temp_struct_Variable) == 0x000078, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, Temp_struct_Variable_1) == 0x000080, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0000A8, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, CallFunc_WaitTargetSelection_ReturnValue) == 0x0000B8, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GA_Player_Irwin_Nug_Melee_C_ExecuteUbergraph_GA_Player_Irwin_Nug_Melee::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Player_Irwin_Nug_Melee.GA_Player_Irwin_Nug_Melee_C.Targeted_6C78FB4B46DC49745E7AF1BD08E25B54
// 0x0030 (0x0030 - 0x0000)
struct GA_Player_Irwin_Nug_Melee_C_Targeted_6C78FB4B46DC49745E7AF1BD08E25B54 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Player_Irwin_Nug_Melee_C_Targeted_6C78FB4B46DC49745E7AF1BD08E25B54) == 0x000008, "Wrong alignment on GA_Player_Irwin_Nug_Melee_C_Targeted_6C78FB4B46DC49745E7AF1BD08E25B54");
static_assert(sizeof(GA_Player_Irwin_Nug_Melee_C_Targeted_6C78FB4B46DC49745E7AF1BD08E25B54) == 0x000030, "Wrong size on GA_Player_Irwin_Nug_Melee_C_Targeted_6C78FB4B46DC49745E7AF1BD08E25B54");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_Targeted_6C78FB4B46DC49745E7AF1BD08E25B54, TargetData) == 0x000000, "Member 'GA_Player_Irwin_Nug_Melee_C_Targeted_6C78FB4B46DC49745E7AF1BD08E25B54::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Player_Irwin_Nug_Melee_C_Targeted_6C78FB4B46DC49745E7AF1BD08E25B54, ApplicationTag) == 0x000028, "Member 'GA_Player_Irwin_Nug_Melee_C_Targeted_6C78FB4B46DC49745E7AF1BD08E25B54::ApplicationTag' has a wrong offset!");

}

