#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Quest_PlayerActionListener

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Quest_PlayerActionListener.GA_Quest_PlayerActionListener_C.ExecuteUbergraph_GA_Quest_PlayerActionListener
// 0x0108 (0x0108 - 0x0000)
struct GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0008(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Athena_PropQuestActor_Parent_C*     K2Node_DynamicCast_AsBP_Athena_Prop_Quest_Actor_Parent; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0050(0x00B0)(ConstParm)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener) == 0x000008, "Wrong alignment on GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener");
static_assert(sizeof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener) == 0x000108, "Wrong size on GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, EntryPoint) == 0x000000, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000008, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, CallFunc_EffectContextGetEffectCauser_ReturnValue) == 0x000020, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::CallFunc_EffectContextGetEffectCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, K2Node_DynamicCast_AsBP_Athena_Prop_Quest_Actor_Parent) == 0x000030, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::K2Node_DynamicCast_AsBP_Athena_Prop_Quest_Actor_Parent' has a wrong offset!");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000040, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, K2Node_Event_EventData) == 0x000050, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000100, "Member 'GA_Quest_PlayerActionListener_C_ExecuteUbergraph_GA_Quest_PlayerActionListener::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");

// Function GA_Quest_PlayerActionListener.GA_Quest_PlayerActionListener_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Quest_PlayerActionListener_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Quest_PlayerActionListener_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Quest_PlayerActionListener_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Quest_PlayerActionListener_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Quest_PlayerActionListener_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Quest_PlayerActionListener_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Quest_PlayerActionListener_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

