#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_RealitySeed_Thrown_Trajectory_Secondary

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_RealitySeed_Thrown_Trajectory_Secondary.GA_RealitySeed_Thrown_Trajectory_Secondary_C.EventReceived_8C41400E42B052463ECE09AC88FB1EA7
// 0x00B0 (0x00B0 - 0x0000)
struct GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_8C41400E42B052463ECE09AC88FB1EA7 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_8C41400E42B052463ECE09AC88FB1EA7) == 0x000008, "Wrong alignment on GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_8C41400E42B052463ECE09AC88FB1EA7");
static_assert(sizeof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_8C41400E42B052463ECE09AC88FB1EA7) == 0x0000B0, "Wrong size on GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_8C41400E42B052463ECE09AC88FB1EA7");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_8C41400E42B052463ECE09AC88FB1EA7, Payload) == 0x000000, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_8C41400E42B052463ECE09AC88FB1EA7::Payload' has a wrong offset!");

// Function GA_RealitySeed_Thrown_Trajectory_Secondary.GA_RealitySeed_Thrown_Trajectory_Secondary_C.EventReceived_D9150870476BFD6DD77CB0843DFFCF54
// 0x00B0 (0x00B0 - 0x0000)
struct GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_D9150870476BFD6DD77CB0843DFFCF54 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_D9150870476BFD6DD77CB0843DFFCF54) == 0x000008, "Wrong alignment on GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_D9150870476BFD6DD77CB0843DFFCF54");
static_assert(sizeof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_D9150870476BFD6DD77CB0843DFFCF54) == 0x0000B0, "Wrong size on GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_D9150870476BFD6DD77CB0843DFFCF54");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_D9150870476BFD6DD77CB0843DFFCF54, Payload) == 0x000000, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_EventReceived_D9150870476BFD6DD77CB0843DFFCF54::Payload' has a wrong offset!");

// Function GA_RealitySeed_Thrown_Trajectory_Secondary.GA_RealitySeed_Thrown_Trajectory_Secondary_C.ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary
// 0x0470 (0x0470 - 0x0000)
struct GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0008(0x00B0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x00D8(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0188(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0244(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0258(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0268(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0274(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0280(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Trajectory_Hidden_IsHidden;            // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortTrajectoryAbilityInterface> CallFunc_Trajectory_Placement_Preview_Sapling_Target_CastInput; // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingRealitySapling*                K2Node_CustomEvent_Sapling;                        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_valid;                          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x02BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0308(0x00B0)()
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03C0(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0428(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Decal_ChillBronco_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0443(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0445(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_446[0x2];                                      // 0x0446(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileTrajectory*              CallFunc_SpawnTrajectoryIndicator_ReturnValue;     // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0462(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary) == 0x000010, "Wrong alignment on GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary");
static_assert(sizeof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary) == 0x000470, "Wrong size on GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, EntryPoint) == 0x000000, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, Temp_struct_Variable) == 0x000008, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000B9, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0000C0, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_1) == 0x0000D4, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CustomEvent_Payload) == 0x0000D8, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, Temp_struct_Variable_1) == 0x000188, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000238, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_2) == 0x000240, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CreateDelegate_OutputDelegate_1) == 0x000244, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_WaitNetSync_ReturnValue) == 0x000250, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CreateDelegate_OutputDelegate_2) == 0x000258, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_3) == 0x000264, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CreateDelegate_OutputDelegate_3) == 0x000268, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CreateDelegate_OutputDelegate_4) == 0x000274, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CreateDelegate_OutputDelegate_5) == 0x000280, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_Is_Trajectory_Hidden_IsHidden) == 0x00028C, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_Is_Trajectory_Hidden_IsHidden' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_GetValueAtLevel_ReturnValue) == 0x000290, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_Trajectory_Placement_Preview_Sapling_Target_CastInput) == 0x000298, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_Trajectory_Placement_Preview_Sapling_Target_CastInput' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_4) == 0x0002A8, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CustomEvent_Sapling) == 0x0002B0, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CustomEvent_Sapling' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CustomEvent_valid) == 0x0002B8, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CustomEvent_valid' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_SelectColor_ReturnValue) == 0x0002BC, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_5) == 0x0002CC, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002D0, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_6) == 0x0002E8, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0002EC, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002F0, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CustomEvent_Payload_1) == 0x000308, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_MakeTransform_ReturnValue) == 0x0003C0, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000420, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, K2Node_CreateDelegate_OutputDelegate_6) == 0x000428, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_FinishSpawningActor_ReturnValue) == 0x000438, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000440, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_7) == 0x000441, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_8) == 0x000442, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_9) == 0x000443, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsDedicatedServer_ReturnValue) == 0x000444, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000445, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_SpawnTrajectoryIndicator_ReturnValue) == 0x000448, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_SpawnTrajectoryIndicator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000450, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_10) == 0x000458, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00045C, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsUsingTouch_ReturnValue) == 0x000460, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000461, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary, CallFunc_IsValid_ReturnValue_11) == 0x000462, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_ExecuteUbergraph_GA_RealitySeed_Thrown_Trajectory_Secondary::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");

// Function GA_RealitySeed_Thrown_Trajectory_Secondary.GA_RealitySeed_Thrown_Trajectory_Secondary_C.Is Trajectory Hidden
// 0x0002 (0x0002 - 0x0000)
struct GA_RealitySeed_Thrown_Trajectory_Secondary_C_Is_Trajectory_Hidden final
{
public:
	bool                                          IsHidden;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_Is_Trajectory_Hidden) == 0x000001, "Wrong alignment on GA_RealitySeed_Thrown_Trajectory_Secondary_C_Is_Trajectory_Hidden");
static_assert(sizeof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_Is_Trajectory_Hidden) == 0x000002, "Wrong size on GA_RealitySeed_Thrown_Trajectory_Secondary_C_Is_Trajectory_Hidden");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_Is_Trajectory_Hidden, IsHidden) == 0x000000, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_Is_Trajectory_Hidden::IsHidden' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_Is_Trajectory_Hidden, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_Is_Trajectory_Hidden::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_RealitySeed_Thrown_Trajectory_Secondary.GA_RealitySeed_Thrown_Trajectory_Secondary_C.SetupCustomPreviewMesh
// 0x0050 (0x0050 - 0x0000)
struct GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ProjectileTrajectory_C*>     K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class ABP_ProjectileTrajectory_C*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh) == 0x000008, "Wrong alignment on GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh");
static_assert(sizeof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh) == 0x000050, "Wrong size on GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, Temp_int_Variable) == 0x000008, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, K2Node_MakeArray_Array) == 0x000018, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_Array_Get_Item) == 0x000028, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_GetMaterial_ReturnValue) == 0x000040, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_GetNumMaterials_ReturnValue) == 0x000048, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_IsValid_ReturnValue_3) == 0x00004D, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x00004E, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupCustomPreviewMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function GA_RealitySeed_Thrown_Trajectory_Secondary.GA_RealitySeed_Thrown_Trajectory_Secondary_C.SetupDummyProjectileRed
// 0x0090 (0x0090 - 0x0000)
struct GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             K2Node_DynamicCast_AsBP_Projectile_Trajectory;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed) == 0x000010, "Wrong alignment on GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed");
static_assert(sizeof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed) == 0x000090, "Wrong size on GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed, K2Node_DynamicCast_AsBP_Projectile_Trajectory) == 0x000080, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed::K2Node_DynamicCast_AsBP_Projectile_Trajectory' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SetupDummyProjectileRed::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_RealitySeed_Thrown_Trajectory_Secondary.GA_RealitySeed_Thrown_Trajectory_Secondary_C.SpawnSaplingRadiusFeedback
// 0x0010 (0x0010 - 0x0000)
struct GA_RealitySeed_Thrown_Trajectory_Secondary_C_SpawnSaplingRadiusFeedback final
{
public:
	class ABuildingRealitySapling*                Sapling;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SpawnSaplingRadiusFeedback) == 0x000008, "Wrong alignment on GA_RealitySeed_Thrown_Trajectory_Secondary_C_SpawnSaplingRadiusFeedback");
static_assert(sizeof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SpawnSaplingRadiusFeedback) == 0x000010, "Wrong size on GA_RealitySeed_Thrown_Trajectory_Secondary_C_SpawnSaplingRadiusFeedback");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SpawnSaplingRadiusFeedback, Sapling) == 0x000000, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SpawnSaplingRadiusFeedback::Sapling' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_SpawnSaplingRadiusFeedback, Valid) == 0x000008, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_SpawnSaplingRadiusFeedback::Valid' has a wrong offset!");

// Function GA_RealitySeed_Thrown_Trajectory_Secondary.GA_RealitySeed_Thrown_Trajectory_Secondary_C.K2_CanActivateAbility
// 0x0098 (0x0098 - 0x0000)
struct GA_RealitySeed_Thrown_Trajectory_Secondary_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_RealitySeed_Thrown_Trajectory_Secondary_C_K2_CanActivateAbility");
static_assert(sizeof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_K2_CanActivateAbility) == 0x000098, "Wrong size on GA_RealitySeed_Thrown_Trajectory_Secondary_C_K2_CanActivateAbility");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_RealitySeed_Thrown_Trajectory_Secondary_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_RealitySeed_Thrown_Trajectory_Secondary_C_K2_CanActivateAbility::Handle' has a wrong offset!");
