#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ResTorch_PercentHealingVehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ResTorch_PercentHealingVehicle.GA_ResTorch_PercentHealingVehicle_C
// 0x00A0 (0x0BB0 - 0x0B10)
class UGA_ResTorch_PercentHealingVehicle_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         HealingPercent;                                    // 0x0B18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HealingEnabled_;                                   // 0x0B40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxHealing;                                        // 0x0B68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class UGameplayEffect>            Gameplay_Effect_Class;                             // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          FullHealth_;                                       // 0x0B98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B99[0x7];                                      // 0x0B99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFX_FullyHealedOneShot;                            // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_HealVehicle;                                    // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_ResTorch_PercentHealingVehicle(int32 EntryPoint);
	void FailedToActivatePassiveAbility();
	void HealDamagedParts(class AFortAthenaVehicle* Vehicle);
	bool IsFullHealthVehicle_(TScriptInterface<class IFortVehicleInterface> Vehicle);
	void K2_ActivateAbility();
	void K2_CommitExecute();
	void RepPlayFullHeal(const struct FVector& Location);
	void UpdateQuests(int32 Amount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_ResTorch_PercentHealingVehicle_C">();
	}
	static class UGA_ResTorch_PercentHealingVehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ResTorch_PercentHealingVehicle_C>();
	}
};
static_assert(alignof(UGA_ResTorch_PercentHealingVehicle_C) == 0x000008, "Wrong alignment on UGA_ResTorch_PercentHealingVehicle_C");
static_assert(sizeof(UGA_ResTorch_PercentHealingVehicle_C) == 0x000BB0, "Wrong size on UGA_ResTorch_PercentHealingVehicle_C");
static_assert(offsetof(UGA_ResTorch_PercentHealingVehicle_C, UberGraphFrame) == 0x000B10, "Member 'UGA_ResTorch_PercentHealingVehicle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_ResTorch_PercentHealingVehicle_C, HealingPercent) == 0x000B18, "Member 'UGA_ResTorch_PercentHealingVehicle_C::HealingPercent' has a wrong offset!");
static_assert(offsetof(UGA_ResTorch_PercentHealingVehicle_C, HealingEnabled_) == 0x000B40, "Member 'UGA_ResTorch_PercentHealingVehicle_C::HealingEnabled_' has a wrong offset!");
static_assert(offsetof(UGA_ResTorch_PercentHealingVehicle_C, MaxHealing) == 0x000B68, "Member 'UGA_ResTorch_PercentHealingVehicle_C::MaxHealing' has a wrong offset!");
static_assert(offsetof(UGA_ResTorch_PercentHealingVehicle_C, Gameplay_Effect_Class) == 0x000B90, "Member 'UGA_ResTorch_PercentHealingVehicle_C::Gameplay_Effect_Class' has a wrong offset!");
static_assert(offsetof(UGA_ResTorch_PercentHealingVehicle_C, FullHealth_) == 0x000B98, "Member 'UGA_ResTorch_PercentHealingVehicle_C::FullHealth_' has a wrong offset!");
static_assert(offsetof(UGA_ResTorch_PercentHealingVehicle_C, SFX_FullyHealedOneShot) == 0x000BA0, "Member 'UGA_ResTorch_PercentHealingVehicle_C::SFX_FullyHealedOneShot' has a wrong offset!");
static_assert(offsetof(UGA_ResTorch_PercentHealingVehicle_C, GE_HealVehicle) == 0x000BA8, "Member 'UGA_ResTorch_PercentHealingVehicle_C::GE_HealVehicle' has a wrong offset!");

}

