#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_RealitySeedling_ApplyTreeListener

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_RealitySeedling_ApplyTreeListener.GA_RealitySeedling_ApplyTreeListener_C.ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener
// 0x0030 (0x0030 - 0x0000)
struct GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	EFortGetPlayerPawnExecutions                  CallFunc_GetAvatarAsValidFortPlayerPawn_OutExec;   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsValidFortPlayerPawn_OutFortPlayerPawn; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener) == 0x000008, "Wrong alignment on GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener");
static_assert(sizeof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener) == 0x000030, "Wrong size on GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener");
static_assert(offsetof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener, EntryPoint) == 0x000000, "Member 'GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener, CallFunc_GetAvatarAsValidFortPlayerPawn_OutExec) == 0x00000C, "Member 'GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener::CallFunc_GetAvatarAsValidFortPlayerPawn_OutExec' has a wrong offset!");
static_assert(offsetof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener, CallFunc_GetAvatarAsValidFortPlayerPawn_OutFortPlayerPawn) == 0x000010, "Member 'GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener::CallFunc_GetAvatarAsValidFortPlayerPawn_OutFortPlayerPawn' has a wrong offset!");
static_assert(offsetof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x000024, "Member 'GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'GA_RealitySeedling_ApplyTreeListener_C_ExecuteUbergraph_GA_RealitySeedling_ApplyTreeListener::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

