#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Shotgun_DoubleDouble_Knockback

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Shotgun_DoubleDouble_Knockback.GA_Shotgun_DoubleDouble_Knockback_C
// 0x0150 (0x0C60 - 0x0B10)
class UGA_Shotgun_DoubleDouble_Knockback_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Distance;                                          // 0x0B18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceMagMod;                                    // 0x0B1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_ZAdd;                                          // 0x0B20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_KnockMag;                                      // 0x0B48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxDistance;                                   // 0x0B70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ResetFall;                                     // 0x0B98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                FinalLaunchVel;                                    // 0x0BC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_ZStartOffset;                                  // 0x0BD8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ZVelMult;                                      // 0x0C00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  DefaultTags;                                       // 0x0C28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 Launcher;                                          // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityForFX;                                     // 0x0C50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FX_Delay;                                          // 0x0C54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           KnockbackCue;                                      // 0x0C58(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckVel();
	void ExecuteUbergraph_GA_Shotgun_DoubleDouble_Knockback(int32 EntryPoint);
	void FailedToActivatePassiveAbility();
	void K2_ActivateAbility();
	void KnockPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Shotgun_DoubleDouble_Knockback_C">();
	}
	static class UGA_Shotgun_DoubleDouble_Knockback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Shotgun_DoubleDouble_Knockback_C>();
	}
};
static_assert(alignof(UGA_Shotgun_DoubleDouble_Knockback_C) == 0x000008, "Wrong alignment on UGA_Shotgun_DoubleDouble_Knockback_C");
static_assert(sizeof(UGA_Shotgun_DoubleDouble_Knockback_C) == 0x000C60, "Wrong size on UGA_Shotgun_DoubleDouble_Knockback_C");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Distance) == 0x000B18, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Distance' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, DistanceMagMod) == 0x000B1C, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::DistanceMagMod' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_ZAdd) == 0x000B20, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_ZAdd' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_KnockMag) == 0x000B48, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_KnockMag' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_MaxDistance) == 0x000B70, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_MaxDistance' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_ResetFall) == 0x000B98, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_ResetFall' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, FinalLaunchVel) == 0x000BC0, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::FinalLaunchVel' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_ZStartOffset) == 0x000BD8, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_ZStartOffset' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Row_ZVelMult) == 0x000C00, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Row_ZVelMult' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, DefaultTags) == 0x000C28, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::DefaultTags' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, Launcher) == 0x000C48, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::Launcher' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, VelocityForFX) == 0x000C50, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::VelocityForFX' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, FX_Delay) == 0x000C54, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::FX_Delay' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_Knockback_C, KnockbackCue) == 0x000C58, "Member 'UGA_Shotgun_DoubleDouble_Knockback_C::KnockbackCue' has a wrong offset!");

}

