#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SaddlerTracking_StopRidingOnRemoveHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SaddlerTracking_StopRidingOnRemoveHandler.GA_SaddlerTracking_StopRidingOnRemoveHandler_C
// 0x0018 (0x0B28 - 0x0B10)
class UGA_SaddlerTracking_StopRidingOnRemoveHandler_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               WID_Saddler;                                       // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Item_Count_Check;                                  // 0x0B20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_SaddlerTracking_StopRidingOnRemoveHandler(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void TryStopRidingIfSaddlerRemoved();

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SaddlerTracking_StopRidingOnRemoveHandler_C">();
	}
	static class UGA_SaddlerTracking_StopRidingOnRemoveHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SaddlerTracking_StopRidingOnRemoveHandler_C>();
	}
};
static_assert(alignof(UGA_SaddlerTracking_StopRidingOnRemoveHandler_C) == 0x000008, "Wrong alignment on UGA_SaddlerTracking_StopRidingOnRemoveHandler_C");
static_assert(sizeof(UGA_SaddlerTracking_StopRidingOnRemoveHandler_C) == 0x000B28, "Wrong size on UGA_SaddlerTracking_StopRidingOnRemoveHandler_C");
static_assert(offsetof(UGA_SaddlerTracking_StopRidingOnRemoveHandler_C, UberGraphFrame) == 0x000B10, "Member 'UGA_SaddlerTracking_StopRidingOnRemoveHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SaddlerTracking_StopRidingOnRemoveHandler_C, WID_Saddler) == 0x000B18, "Member 'UGA_SaddlerTracking_StopRidingOnRemoveHandler_C::WID_Saddler' has a wrong offset!");
static_assert(offsetof(UGA_SaddlerTracking_StopRidingOnRemoveHandler_C, Item_Count_Check) == 0x000B20, "Member 'UGA_SaddlerTracking_StopRidingOnRemoveHandler_C::Item_Count_Check' has a wrong offset!");

}

