#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Shotgun_DoubleDouble_KnockbackSelf

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Shotgun_DoubleDouble_KnockbackSelf.GA_Shotgun_DoubleDouble_KnockbackSelf_C
// 0x00F8 (0x0C08 - 0x0B10)
class UGA_Shotgun_DoubleDouble_KnockbackSelf_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_OffsetPitch;                                   // 0x0B18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                FinalLaunchVel;                                    // 0x0B40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_ResetFall;                                     // 0x0B58(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ZVelMult;                                      // 0x0B80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_KnockMag;                                      // 0x0BA8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ZAdd;                                          // 0x0BD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FX_Delay;                                          // 0x0BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityForFX;                                     // 0x0BFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           KnockbackCue;                                      // 0x0C00(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckVel();
	void ExecuteUbergraph_GA_Shotgun_DoubleDouble_KnockbackSelf(int32 EntryPoint);
	void FailedToActivatePassiveAbility();
	void K2_ActivateAbility();
	void LaunchPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Shotgun_DoubleDouble_KnockbackSelf_C">();
	}
	static class UGA_Shotgun_DoubleDouble_KnockbackSelf_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Shotgun_DoubleDouble_KnockbackSelf_C>();
	}
};
static_assert(alignof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C) == 0x000008, "Wrong alignment on UGA_Shotgun_DoubleDouble_KnockbackSelf_C");
static_assert(sizeof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C) == 0x000C08, "Wrong size on UGA_Shotgun_DoubleDouble_KnockbackSelf_C");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, Row_OffsetPitch) == 0x000B18, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::Row_OffsetPitch' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, FinalLaunchVel) == 0x000B40, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::FinalLaunchVel' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, Row_ResetFall) == 0x000B58, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::Row_ResetFall' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, Row_ZVelMult) == 0x000B80, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::Row_ZVelMult' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, Row_KnockMag) == 0x000BA8, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::Row_KnockMag' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, Row_ZAdd) == 0x000BD0, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::Row_ZAdd' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, FX_Delay) == 0x000BF8, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::FX_Delay' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, VelocityForFX) == 0x000BFC, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::VelocityForFX' has a wrong offset!");
static_assert(offsetof(UGA_Shotgun_DoubleDouble_KnockbackSelf_C, KnockbackCue) == 0x000C00, "Member 'UGA_Shotgun_DoubleDouble_KnockbackSelf_C::KnockbackCue' has a wrong offset!");

}

