#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Trap_FloorJumpPad

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Trap_FloorJumpPad.GA_Trap_FloorJumpPad_C.Cancelled_E91C59AB43D826926CE5CEAA22E84570
// 0x0030 (0x0030 - 0x0000)
struct GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData_0;                                      // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570) == 0x000008, "Wrong alignment on GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570");
static_assert(sizeof(GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570) == 0x000030, "Wrong size on GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570, TargetData_0) == 0x000000, "Member 'GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570::TargetData_0' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570, ApplicationTag) == 0x000028, "Member 'GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570::ApplicationTag' has a wrong offset!");

// Function GA_Trap_FloorJumpPad.GA_Trap_FloorJumpPad_C.ExecuteUbergraph_GA_Trap_FloorJumpPad
// 0x02F8 (0x02F8 - 0x0000)
struct GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0020(0x0010)()
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetReloadBeginGameplayCueTag_ReturnValue; // 0x005C(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTrapLevel_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0068(0x00B0)()
	float                                         CallFunc_GetDamageDelay_ReturnValue;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetActivateTrapGameplayCueTag_ReturnValue; // 0x011C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFireDelay_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0134(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetDelayBeginGameplayCueTag_ReturnValue;  // 0x0140(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataCountFromTargetData_ReturnValue;   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_187[0x1];                                      // 0x0187(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0190(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x01BC(0x0004)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_CustomEvent_Player;                         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x01D0(0x0010)(ReferenceParm)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue_1;            // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0208(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0230(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0238(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0248(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0270(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0274(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0288(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D3[0x5];                                      // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad) == 0x000008, "Wrong alignment on GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad");
static_assert(sizeof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad) == 0x0002F8, "Wrong size on GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, EntryPoint) == 0x000000, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000010, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetAbilityLevel_ReturnValue) == 0x000018, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000020, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000030, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000038, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_AsBuilding_Trap) == 0x000040, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_AsBuilding_Trap_1) == 0x000050, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_AsBuilding_Trap_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetReloadBeginGameplayCueTag_ReturnValue) == 0x00005C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetReloadBeginGameplayCueTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetTrapLevel_ReturnValue) == 0x000060, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetTrapLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_MakeStruct_GameplayEventData) == 0x000068, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetDamageDelay_ReturnValue) == 0x000118, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetDamageDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetActivateTrapGameplayCueTag_ReturnValue) == 0x00011C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetActivateTrapGameplayCueTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000120, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000128, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetFireDelay_ReturnValue) == 0x000130, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetFireDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000134, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00013C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetDelayBeginGameplayCueTag_ReturnValue) == 0x000140, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetDelayBeginGameplayCueTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_K2_CommitAbility_ReturnValue) == 0x000144, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_int_Loop_Counter_Variable) == 0x000148, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Add_IntInt_ReturnValue) == 0x00014C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_int_Array_Index_Variable) == 0x000150, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Get_Item) == 0x000158, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000168, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_bSuccess_2) == 0x000170, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Less_IntInt_ReturnValue) == 0x000171, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetDataCountFromTargetData_ReturnValue) == 0x000174, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetDataCountFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000178, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Subtract_IntInt_ReturnValue) == 0x000180, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsDBNO_ReturnValue) == 0x000184, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsDedicatedServer_ReturnValue) == 0x000185, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Not_PreBool_ReturnValue) == 0x000186, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_WaitTargetSelection_ReturnValue) == 0x000188, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_struct_Variable) == 0x000190, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsValid_ReturnValue) == 0x0001B8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_struct_Variable_1) == 0x0001BC, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_Player) == 0x0001C0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_int_Variable) == 0x0001C8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x0001D0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001E0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Get_Item_1) == 0x0001E8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Length_ReturnValue_1) == 0x0001F0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsValid_ReturnValue_1) == 0x0001F4, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Greater_IntInt_ReturnValue) == 0x0001F5, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x0001F8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_DoesSocketExist_ReturnValue) == 0x000200, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_DoesSocketExist_ReturnValue_1) == 0x000201, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_DoesSocketExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000202, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Add_IntInt_ReturnValue_1) == 0x000204, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_TargetData) == 0x000208, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_ApplicationTag) == 0x000230, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Add_ReturnValue) == 0x000234, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000238, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_TargetData_1) == 0x000248, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_ApplicationTag_1) == 0x000270, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CreateDelegate_OutputDelegate) == 0x000274, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetController_ReturnValue) == 0x000280, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CreateDelegate_OutputDelegate_1) == 0x000288, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000298, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0002A8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetVehicleUInterface_ReturnValue) == 0x0002B0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002C0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x0002C8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_BooleanAND_ReturnValue) == 0x0002D0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsInVehicle_ReturnValue) == 0x0002D1, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsValid_ReturnValue_2) == 0x0002D2, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_MakeVector_ReturnValue) == 0x0002D8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_BooleanAND_ReturnValue_1) == 0x0002F0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function GA_Trap_FloorJumpPad.GA_Trap_FloorJumpPad_C.PlayPlayerFX
// 0x0008 (0x0008 - 0x0000)
struct GA_Trap_FloorJumpPad_C_PlayPlayerFX final
{
public:
	class AFortPlayerPawn*                        Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Trap_FloorJumpPad_C_PlayPlayerFX) == 0x000008, "Wrong alignment on GA_Trap_FloorJumpPad_C_PlayPlayerFX");
static_assert(sizeof(GA_Trap_FloorJumpPad_C_PlayPlayerFX) == 0x000008, "Wrong size on GA_Trap_FloorJumpPad_C_PlayPlayerFX");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_PlayPlayerFX, Player) == 0x000000, "Member 'GA_Trap_FloorJumpPad_C_PlayPlayerFX::Player' has a wrong offset!");

// Function GA_Trap_FloorJumpPad.GA_Trap_FloorJumpPad_C.Targeted_E91C59AB43D826926CE5CEAA22E84570
// 0x0030 (0x0030 - 0x0000)
struct GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData_0;                                      // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570) == 0x000008, "Wrong alignment on GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570");
static_assert(sizeof(GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570) == 0x000030, "Wrong size on GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570, TargetData_0) == 0x000000, "Member 'GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570::TargetData_0' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570, ApplicationTag) == 0x000028, "Member 'GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570::ApplicationTag' has a wrong offset!");

}

