#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_VictoryCrown_QuestsAndAccolades

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_VictoryCrown_QuestsAndAccolades.GA_VictoryCrown_QuestsAndAccolades_C.Crown Wearer On Died
// 0x0060 (0x0060 - 0x0000)
struct GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died) == 0x000008, "Wrong alignment on GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died");
static_assert(sizeof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died) == 0x000060, "Wrong size on GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died, DamagedActor) == 0x000000, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died::DamagedActor' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died, Damage) == 0x000008, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died::Damage' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died, InstigatedBy) == 0x000010, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died::InstigatedBy' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died, DamageCauser) == 0x000018, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died::DamageCauser' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died, HitLocation) == 0x000020, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died::HitLocation' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died, FHitComponent) == 0x000038, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died::FHitComponent' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died, BoneName) == 0x000040, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died::BoneName' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died, Momentum) == 0x000048, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Crown_Wearer_On_Died::Momentum' has a wrong offset!");

// Function GA_VictoryCrown_QuestsAndAccolades.GA_VictoryCrown_QuestsAndAccolades_C.EventReceived_0B1984324C0E15BD613ABFB62FFD87B6
// 0x00B0 (0x00B0 - 0x0000)
struct GA_VictoryCrown_QuestsAndAccolades_C_EventReceived_0B1984324C0E15BD613ABFB62FFD87B6 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_VictoryCrown_QuestsAndAccolades_C_EventReceived_0B1984324C0E15BD613ABFB62FFD87B6) == 0x000008, "Wrong alignment on GA_VictoryCrown_QuestsAndAccolades_C_EventReceived_0B1984324C0E15BD613ABFB62FFD87B6");
static_assert(sizeof(GA_VictoryCrown_QuestsAndAccolades_C_EventReceived_0B1984324C0E15BD613ABFB62FFD87B6) == 0x0000B0, "Wrong size on GA_VictoryCrown_QuestsAndAccolades_C_EventReceived_0B1984324C0E15BD613ABFB62FFD87B6");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_EventReceived_0B1984324C0E15BD613ABFB62FFD87B6, Payload) == 0x000000, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_EventReceived_0B1984324C0E15BD613ABFB62FFD87B6::Payload' has a wrong offset!");

// Function GA_VictoryCrown_QuestsAndAccolades.GA_VictoryCrown_QuestsAndAccolades_C.ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades
// 0x04F8 (0x04F8 - 0x0000)
struct GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_Target;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestObjectiveStatEvent                  K2Node_CustomEvent_Type;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_AdditionalSourceTags;           // 0x0020(0x0020)()
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_BP_FindExistingItemForDefinition_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena_1;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortSafeZoneInterface> K2Node_CustomEvent_SafeZoneInterface_1;            // 0x0128(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          K2Node_CustomEvent_GamePhaseStep_1;                // 0x0138(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortControllerComponent_VictoryCrowns* CallFunc_GetComponentByClass_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortWorldItem*                   CallFunc_GetCrownInPlayerInventory_ReturnValue;    // 0x0168(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AuthorityHasSquadHeldCrownItem_ReturnValue; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0178(0x00B0)()
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x022C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, EAthenaGamePhaseStep GamePhaseStep)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0240(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue_1;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263[0x1];                                      // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, EAthenaGamePhaseStep GamePhaseStep)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0264(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortSafeZoneInterface> K2Node_CustomEvent_SafeZoneInterface;              // 0x0280(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          K2Node_CustomEvent_GamePhaseStep;                  // 0x0290(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0298(0x00B0)()
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue_2;         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0350(0x00D0)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0428(0x00D0)(ContainsInstancedReference)
};
static_assert(alignof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades) == 0x000008, "Wrong alignment on GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades");
static_assert(sizeof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades) == 0x0004F8, "Wrong size on GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, EntryPoint) == 0x000000, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_Target) == 0x000010, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_Type) == 0x000018, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_Type' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_AdditionalSourceTags) == 0x000020, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_AdditionalSourceTags' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000040, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000050, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetQuestManager_ReturnValue) == 0x000060, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_DamagedActor) == 0x000068, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_Damage) == 0x000070, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_InstigatedBy) == 0x000078, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_DamageCauser) == 0x000080, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_HitLocation) == 0x000088, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_FHitComponent) == 0x0000A0, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_BoneName) == 0x0000A8, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_Momentum) == 0x0000B0, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0000D8, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_BP_FindExistingItemForDefinition_ReturnValue) == 0x0000E8, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_BP_FindExistingItemForDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsValid_ReturnValue_2) == 0x0000F0, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsValid_ReturnValue_3) == 0x0000F1, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0000F8, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000108, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_bSuccess_3) == 0x000110, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_AsFort_Player_State_Athena_1) == 0x000118, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_AsFort_Player_State_Athena_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_DynamicCast_bSuccess_4) == 0x000120, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_OnSameTeam_ReturnValue) == 0x000121, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_Event_bWasCancelled) == 0x000122, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_SafeZoneInterface_1) == 0x000128, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_SafeZoneInterface_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_GamePhaseStep_1) == 0x000138, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_GamePhaseStep_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000139, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_Actor) == 0x000140, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000148, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsValid_ReturnValue_4) == 0x000150, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetComponentByClass_ReturnValue) == 0x000158, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsValid_ReturnValue_5) == 0x000160, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetCrownInPlayerInventory_ReturnValue) == 0x000168, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetCrownInPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_AuthorityHasSquadHeldCrownItem_ReturnValue) == 0x000170, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_AuthorityHasSquadHeldCrownItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_Payload) == 0x000178, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsServer_ReturnValue) == 0x000228, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CreateDelegate_OutputDelegate_1) == 0x00022C, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000238, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CreateDelegate_OutputDelegate_2) == 0x000240, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetGameStateAthena_ReturnValue) == 0x000250, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetGameStateAthena_ReturnValue_1) == 0x000258, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetGameStateAthena_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsValid_ReturnValue_6) == 0x000260, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000261, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetValueAsBool_ReturnValue) == 0x000262, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CreateDelegate_OutputDelegate_3) == 0x000264, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_BooleanAND_ReturnValue) == 0x000270, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsServer_ReturnValue_1) == 0x000271, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetValueAtLevel_ReturnValue) == 0x000274, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000278, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsServer_ReturnValue_2) == 0x00027C, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_SafeZoneInterface) == 0x000280, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_SafeZoneInterface' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, K2Node_CustomEvent_GamePhaseStep) == 0x000290, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::K2Node_CustomEvent_GamePhaseStep' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000291, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, Temp_struct_Variable) == 0x000298, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_GetGameStateAthena_ReturnValue_2) == 0x000348, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_GetGameStateAthena_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000350, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_IsValid_ReturnValue_7) == 0x000420, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000428, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_ExecuteUbergraph_GA_VictoryCrown_QuestsAndAccolades::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");

// Function GA_VictoryCrown_QuestsAndAccolades.GA_VictoryCrown_QuestsAndAccolades_C.GamePhaseChange
// 0x0018 (0x0018 - 0x0000)
struct GA_VictoryCrown_QuestsAndAccolades_C_GamePhaseChange final
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_VictoryCrown_QuestsAndAccolades_C_GamePhaseChange) == 0x000008, "Wrong alignment on GA_VictoryCrown_QuestsAndAccolades_C_GamePhaseChange");
static_assert(sizeof(GA_VictoryCrown_QuestsAndAccolades_C_GamePhaseChange) == 0x000018, "Wrong size on GA_VictoryCrown_QuestsAndAccolades_C_GamePhaseChange");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_GamePhaseChange, SafeZoneInterface) == 0x000000, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_GamePhaseChange::SafeZoneInterface' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_GamePhaseChange, GamePhaseStep) == 0x000010, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_GamePhaseChange::GamePhaseStep' has a wrong offset!");

// Function GA_VictoryCrown_QuestsAndAccolades.GA_VictoryCrown_QuestsAndAccolades_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_VictoryCrown_QuestsAndAccolades_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_VictoryCrown_QuestsAndAccolades_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_VictoryCrown_QuestsAndAccolades_C_K2_OnEndAbility");
static_assert(sizeof(GA_VictoryCrown_QuestsAndAccolades_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_VictoryCrown_QuestsAndAccolades_C_K2_OnEndAbility");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_VictoryCrown_QuestsAndAccolades.GA_VictoryCrown_QuestsAndAccolades_C.PhaseStepChanged
// 0x0018 (0x0018 - 0x0000)
struct GA_VictoryCrown_QuestsAndAccolades_C_PhaseStepChanged final
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_VictoryCrown_QuestsAndAccolades_C_PhaseStepChanged) == 0x000008, "Wrong alignment on GA_VictoryCrown_QuestsAndAccolades_C_PhaseStepChanged");
static_assert(sizeof(GA_VictoryCrown_QuestsAndAccolades_C_PhaseStepChanged) == 0x000018, "Wrong size on GA_VictoryCrown_QuestsAndAccolades_C_PhaseStepChanged");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_PhaseStepChanged, SafeZoneInterface) == 0x000000, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_PhaseStepChanged::SafeZoneInterface' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_PhaseStepChanged, GamePhaseStep) == 0x000010, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_PhaseStepChanged::GamePhaseStep' has a wrong offset!");

// Function GA_VictoryCrown_QuestsAndAccolades.GA_VictoryCrown_QuestsAndAccolades_C.Trigger Accolade
// 0x0030 (0x0030 - 0x0000)
struct GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade final
{
public:
	class AFortPlayerController*                  Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestObjectiveStatEvent                  Type;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AdditionalSourceTags;                              // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade) == 0x000008, "Wrong alignment on GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade");
static_assert(sizeof(GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade) == 0x000030, "Wrong size on GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade, Target) == 0x000000, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade::Target' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade, Type) == 0x000008, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade::Type' has a wrong offset!");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade, AdditionalSourceTags) == 0x000010, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Accolade::AdditionalSourceTags' has a wrong offset!");

// Function GA_VictoryCrown_QuestsAndAccolades.GA_VictoryCrown_QuestsAndAccolades_C.Trigger Pickup Accolade
// 0x0008 (0x0008 - 0x0000)
struct GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Pickup_Accolade final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Pickup_Accolade) == 0x000008, "Wrong alignment on GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Pickup_Accolade");
static_assert(sizeof(GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Pickup_Accolade) == 0x000008, "Wrong size on GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Pickup_Accolade");
static_assert(offsetof(GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Pickup_Accolade, Actor) == 0x000000, "Member 'GA_VictoryCrown_QuestsAndAccolades_C_Trigger_Pickup_Accolade::Actor' has a wrong offset!");

}

