#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WaffleTruck_SlurpBazooka_LockOnTargeting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_WaffleTruck_SlurpBazooka_LockOnTargeting.GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C.ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting
// 0x0238 (0x0238 - 0x0000)
struct GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0050(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0078(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x0088(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_WaffleTruck_Rocket_Slurp_C*          K2Node_DynamicCast_AsB_Waffle_Truck_Rocket_Slurp;  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags; // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0188(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAttributeChange*       CallFunc_WaitForAttributeChange_ReturnValue;       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_WaffleTruck_Rocket_Slurp_C*          K2Node_DynamicCast_AsB_Waffle_Truck_Rocket_Slurp_1; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponentBudgeted*         CallFunc_GetWeaponMesh_ReturnValue;                // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x01E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target_Pawn;                    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetBestAimedAtPawnByAngle_ReturnValue;    // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting) == 0x000008, "Wrong alignment on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting");
static_assert(sizeof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting) == 0x000238, "Wrong size on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, EntryPoint) == 0x000000, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CustomEvent_NotifyName_3) == 0x000004, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CustomEvent_NotifyName_2) == 0x000008, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CustomEvent_NotifyName_1) == 0x000018, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CustomEvent_NotifyName) == 0x000028, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, Temp_name_Variable) == 0x000038, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CreateDelegate_OutputDelegate_3) == 0x00003C, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000048, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CreateDelegate_OutputDelegate_4) == 0x000050, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000060, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, Temp_int_Array_Index_Variable) == 0x000074, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CreateDelegate_OutputDelegate_5) == 0x000078, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, Temp_bool_IsClosed_Variable) == 0x000084, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CreateDelegate_OutputDelegate_6) == 0x000088, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, Temp_bool_Has_Been_Initd_Variable) == 0x000094, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, Temp_bool_IsClosed_Variable_1) == 0x000095, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000098, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000A0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0000B0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue_2) == 0x0000B9, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_DynamicCast_AsB_Waffle_Truck_Rocket_Slurp) == 0x0000C0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_DynamicCast_AsB_Waffle_Truck_Rocket_Slurp' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue_3) == 0x0000C9, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000CA, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000CB, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_Add_VectorVector_ReturnValue) == 0x000100, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x000118, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x000130, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetForwardVector_ReturnValue) == 0x000148, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x000160, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_Dot_VectorVector_ReturnValue) == 0x000178, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00017C, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags) == 0x00017D, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000180, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CreateDelegate_OutputDelegate_7) == 0x000188, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_WaitForAttributeChange_ReturnValue) == 0x000198, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_WaitForAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_DynamicCast_AsB_Waffle_Truck_Rocket_Slurp_1) == 0x0001A0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_DynamicCast_AsB_Waffle_Truck_Rocket_Slurp_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_DynamicCast_bSuccess_3) == 0x0001A8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetWeaponMesh_ReturnValue) == 0x0001B0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetWeaponMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue_4) == 0x0001B8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0001C0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue_5) == 0x0001C8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0001C9, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetFloatAttribute_ReturnValue) == 0x0001CC, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, Temp_bool_IsClosed_Variable_2) == 0x0001D0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0001D1, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, Temp_bool_Has_Been_Initd_Variable_2) == 0x0001D2, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001D8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0001E0, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001E8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue_6) == 0x0001F4, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001F8, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue_7) == 0x000200, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue_8) == 0x000201, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_IsValid_ReturnValue_9) == 0x000202, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetValueAtLevel_ReturnValue) == 0x000204, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000208, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_DegCos_ReturnValue) == 0x00020C, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_BooleanAND_ReturnValue) == 0x000210, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000214, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000218, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CustomEvent_Target_Pawn) == 0x000220, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CustomEvent_Target_Pawn' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, CallFunc_GetBestAimedAtPawnByAngle_ReturnValue) == 0x000228, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::CallFunc_GetBestAimedAtPawnByAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting, K2Node_CustomEvent_NotifyName_4) == 0x000230, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_LockOnTargeting::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");

// Function GA_WaffleTruck_SlurpBazooka_LockOnTargeting.GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C.LockOnTickNew
// 0x0008 (0x0008 - 0x0000)
struct GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_LockOnTickNew final
{
public:
	class AActor*                                 Target_Pawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_LockOnTickNew) == 0x000008, "Wrong alignment on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_LockOnTickNew");
static_assert(sizeof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_LockOnTickNew) == 0x000008, "Wrong size on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_LockOnTickNew");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_LockOnTickNew, Target_Pawn) == 0x000000, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_LockOnTickNew::Target_Pawn' has a wrong offset!");

// Function GA_WaffleTruck_SlurpBazooka_LockOnTargeting.GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C.OnBlendOut_85B7C13C4C88931642FC0BB4B11B0DA6
// 0x0004 (0x0004 - 0x0000)
struct GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnBlendOut_85B7C13C4C88931642FC0BB4B11B0DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnBlendOut_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong alignment on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnBlendOut_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(sizeof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnBlendOut_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong size on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnBlendOut_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnBlendOut_85B7C13C4C88931642FC0BB4B11B0DA6, NotifyName) == 0x000000, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnBlendOut_85B7C13C4C88931642FC0BB4B11B0DA6::NotifyName' has a wrong offset!");

// Function GA_WaffleTruck_SlurpBazooka_LockOnTargeting.GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C.OnCompleted_85B7C13C4C88931642FC0BB4B11B0DA6
// 0x0004 (0x0004 - 0x0000)
struct GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnCompleted_85B7C13C4C88931642FC0BB4B11B0DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnCompleted_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong alignment on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnCompleted_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(sizeof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnCompleted_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong size on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnCompleted_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnCompleted_85B7C13C4C88931642FC0BB4B11B0DA6, NotifyName) == 0x000000, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnCompleted_85B7C13C4C88931642FC0BB4B11B0DA6::NotifyName' has a wrong offset!");

// Function GA_WaffleTruck_SlurpBazooka_LockOnTargeting.GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C.OnInterrupted_85B7C13C4C88931642FC0BB4B11B0DA6
// 0x0004 (0x0004 - 0x0000)
struct GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnInterrupted_85B7C13C4C88931642FC0BB4B11B0DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnInterrupted_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong alignment on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnInterrupted_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(sizeof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnInterrupted_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong size on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnInterrupted_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnInterrupted_85B7C13C4C88931642FC0BB4B11B0DA6, NotifyName) == 0x000000, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnInterrupted_85B7C13C4C88931642FC0BB4B11B0DA6::NotifyName' has a wrong offset!");

// Function GA_WaffleTruck_SlurpBazooka_LockOnTargeting.GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C.OnNotifyBegin_85B7C13C4C88931642FC0BB4B11B0DA6
// 0x0004 (0x0004 - 0x0000)
struct GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyBegin_85B7C13C4C88931642FC0BB4B11B0DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyBegin_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong alignment on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyBegin_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(sizeof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyBegin_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong size on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyBegin_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyBegin_85B7C13C4C88931642FC0BB4B11B0DA6, NotifyName) == 0x000000, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyBegin_85B7C13C4C88931642FC0BB4B11B0DA6::NotifyName' has a wrong offset!");

// Function GA_WaffleTruck_SlurpBazooka_LockOnTargeting.GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C.OnNotifyEnd_85B7C13C4C88931642FC0BB4B11B0DA6
// 0x0004 (0x0004 - 0x0000)
struct GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyEnd_85B7C13C4C88931642FC0BB4B11B0DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyEnd_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong alignment on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyEnd_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(sizeof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyEnd_85B7C13C4C88931642FC0BB4B11B0DA6) == 0x000004, "Wrong size on GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyEnd_85B7C13C4C88931642FC0BB4B11B0DA6");
static_assert(offsetof(GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyEnd_85B7C13C4C88931642FC0BB4B11B0DA6, NotifyName) == 0x000000, "Member 'GA_WaffleTruck_SlurpBazooka_LockOnTargeting_C_OnNotifyEnd_85B7C13C4C88931642FC0BB4B11B0DA6::NotifyName' has a wrong offset!");

}

