#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WestSausage_InSwingingMovementMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_WestSausage_InSwingingMovementMode.GA_WestSausage_InSwingingMovementMode_C
// 0x0028 (0x0B38 - 0x0B10)
class UGA_WestSausage_InSwingingMovementMode_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraModifier_WestSausage_C*          Mod;                                               // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Ranged_WestSausage_Parallel_Athena_C* Weapon;                                            // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCameraModifier_WestSausage_C> CameraModifierClass;                               // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerCameraManager*                   CameraManager;                                     // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_WestSausage_InSwingingMovementMode(int32 EntryPoint);
	void FailedToActivatePassiveAbility();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_WestSausage_InSwingingMovementMode_C">();
	}
	static class UGA_WestSausage_InSwingingMovementMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_WestSausage_InSwingingMovementMode_C>();
	}
};
static_assert(alignof(UGA_WestSausage_InSwingingMovementMode_C) == 0x000008, "Wrong alignment on UGA_WestSausage_InSwingingMovementMode_C");
static_assert(sizeof(UGA_WestSausage_InSwingingMovementMode_C) == 0x000B38, "Wrong size on UGA_WestSausage_InSwingingMovementMode_C");
static_assert(offsetof(UGA_WestSausage_InSwingingMovementMode_C, UberGraphFrame) == 0x000B10, "Member 'UGA_WestSausage_InSwingingMovementMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_WestSausage_InSwingingMovementMode_C, Mod) == 0x000B18, "Member 'UGA_WestSausage_InSwingingMovementMode_C::Mod' has a wrong offset!");
static_assert(offsetof(UGA_WestSausage_InSwingingMovementMode_C, Weapon) == 0x000B20, "Member 'UGA_WestSausage_InSwingingMovementMode_C::Weapon' has a wrong offset!");
static_assert(offsetof(UGA_WestSausage_InSwingingMovementMode_C, CameraModifierClass) == 0x000B28, "Member 'UGA_WestSausage_InSwingingMovementMode_C::CameraModifierClass' has a wrong offset!");
static_assert(offsetof(UGA_WestSausage_InSwingingMovementMode_C, CameraManager) == 0x000B30, "Member 'UGA_WestSausage_InSwingingMovementMode_C::CameraManager' has a wrong offset!");

}

