#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WaffleTruck_SlurpBazooka_ApplySlurp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_WaffleTruck_SlurpBazooka_ApplySlurp.GA_WaffleTruck_SlurpBazooka_ApplySlurp_C
// 0x0048 (0x0B58 - 0x0B10)
class UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PrevMissingHealth;                                 // 0x0B18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1C[0x4];                                      // 0x0B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_HealShield;                                     // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         RowHealAmount;                                     // 0x0B30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_WaffleTruck_SlurpBazooka_ApplySlurp(int32 EntryPoint);
	void FailedToActivatePassiveAbility();
	void GetMagnitudes(float* HealMagnitude, float* ShieldMagnitude, bool* ApplyEffect);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_WaffleTruck_SlurpBazooka_ApplySlurp_C">();
	}
	static class UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C>();
	}
};
static_assert(alignof(UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C) == 0x000008, "Wrong alignment on UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C");
static_assert(sizeof(UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C) == 0x000B58, "Wrong size on UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C");
static_assert(offsetof(UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C, UberGraphFrame) == 0x000B10, "Member 'UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C, PrevMissingHealth) == 0x000B18, "Member 'UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C::PrevMissingHealth' has a wrong offset!");
static_assert(offsetof(UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C, GE_HealShield) == 0x000B20, "Member 'UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C::GE_HealShield' has a wrong offset!");
static_assert(offsetof(UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C, PlayerPawn) == 0x000B28, "Member 'UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C, RowHealAmount) == 0x000B30, "Member 'UGA_WaffleTruck_SlurpBazooka_ApplySlurp_C::RowHealAmount' has a wrong offset!");

}

