#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_InterrogatePlayer_Search

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_0_structs.hpp"


namespace SDK::Params
{

// Function GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.ApplyGameplayEffectToNPC
// 0x0048 (0x0048 - 0x0000)
struct GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC final
{
public:
	class UClass*                                 GameplayEffect;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetDBNOHoistee_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC");
static_assert(sizeof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC) == 0x000048, "Wrong size on GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC, GameplayEffect) == 0x000000, "Member 'GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC::GameplayEffect' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC, CallFunc_GetDBNOHoistee_ReturnValue) == 0x000010, "Member 'GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC::CallFunc_GetDBNOHoistee_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000028, "Member 'GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000030, "Member 'GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000040, "Member 'GAB_InterrogatePlayer_Search_C_ApplyGameplayEffectToNPC::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D
// 0x0030 (0x0030 - 0x0000)
struct GAB_InterrogatePlayer_Search_C_Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Search_C_Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Search_C_Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D");
static_assert(sizeof(GAB_InterrogatePlayer_Search_C_Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D) == 0x000030, "Wrong size on GAB_InterrogatePlayer_Search_C_Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D, TargetData) == 0x000000, "Member 'GAB_InterrogatePlayer_Search_C_Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D, ApplicationTag) == 0x000028, "Member 'GAB_InterrogatePlayer_Search_C_Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D::ApplicationTag' has a wrong offset!");

// Function GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.Completed_6BBDC9B445D4280492A25E8E5EA7A53D
// 0x0030 (0x0030 - 0x0000)
struct GAB_InterrogatePlayer_Search_C_Completed_6BBDC9B445D4280492A25E8E5EA7A53D final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Search_C_Completed_6BBDC9B445D4280492A25E8E5EA7A53D) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Search_C_Completed_6BBDC9B445D4280492A25E8E5EA7A53D");
static_assert(sizeof(GAB_InterrogatePlayer_Search_C_Completed_6BBDC9B445D4280492A25E8E5EA7A53D) == 0x000030, "Wrong size on GAB_InterrogatePlayer_Search_C_Completed_6BBDC9B445D4280492A25E8E5EA7A53D");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_Completed_6BBDC9B445D4280492A25E8E5EA7A53D, TargetData) == 0x000000, "Member 'GAB_InterrogatePlayer_Search_C_Completed_6BBDC9B445D4280492A25E8E5EA7A53D::TargetData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_Completed_6BBDC9B445D4280492A25E8E5EA7A53D, ApplicationTag) == 0x000028, "Member 'GAB_InterrogatePlayer_Search_C_Completed_6BBDC9B445D4280492A25E8E5EA7A53D::ApplicationTag' has a wrong offset!");

// Function GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.DropKeycard
// 0x0088 (0x0088 - 0x0000)
struct GAB_InterrogatePlayer_Search_C_DropKeycard final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetKeycardToDrop_HasKeycard;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               CallFunc_GetKeycardToDrop_Output;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Search_C_DropKeycard) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Search_C_DropKeycard");
static_assert(sizeof(GAB_InterrogatePlayer_Search_C_DropKeycard) == 0x000088, "Wrong size on GAB_InterrogatePlayer_Search_C_DropKeycard");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, Temp_int_Variable) == 0x000004, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_GetKeycardToDrop_HasKeycard) == 0x000008, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_GetKeycardToDrop_HasKeycard' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_GetKeycardToDrop_Output) == 0x000010, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_GetKeycardToDrop_Output' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_GetValueAtLevel_ReturnValue) == 0x000018, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_FTrunc_ReturnValue) == 0x00001C, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000028, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00002C, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_IsValid_ReturnValue) == 0x00002D, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_GetActorForwardVector_ReturnValue) == 0x000030, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropKeycard, CallFunc_K2_SpawnPickupInWorld_ReturnValue) == 0x000080, "Member 'GAB_InterrogatePlayer_Search_C_DropKeycard::CallFunc_K2_SpawnPickupInWorld_ReturnValue' has a wrong offset!");

// Function GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.DropLoot
// 0x0240 (0x0240 - 0x0000)
struct GAB_InterrogatePlayer_Search_C_DropLoot final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemEntry>                 CallFunc_PickLootDrops_OutLootToDrop;              // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_PickLootDrops_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemEntry                         CallFunc_Array_Get_Item;                           // 0x0038(0x01A0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               K2Node_DynamicCast_AsFort_World_Item_Definition;   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EB[0x5];                                      // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue;        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Search_C_DropLoot) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Search_C_DropLoot");
static_assert(sizeof(GAB_InterrogatePlayer_Search_C_DropLoot) == 0x000240, "Wrong size on GAB_InterrogatePlayer_Search_C_DropLoot");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_GetValueAtLevel_ReturnValue) == 0x000008, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, Temp_int_Variable) == 0x000014, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_PickLootDrops_OutLootToDrop) == 0x000020, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_PickLootDrops_OutLootToDrop' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_PickLootDrops_ReturnValue) == 0x000030, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_PickLootDrops_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_Array_Get_Item) == 0x000038, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_Array_Length_ReturnValue) == 0x0001D8, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_Less_IntInt_ReturnValue) == 0x0001DC, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, K2Node_DynamicCast_AsFort_World_Item_Definition) == 0x0001E0, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::K2Node_DynamicCast_AsFort_World_Item_Definition' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_IsValid_ReturnValue) == 0x0001E9, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_IsValid_ReturnValue_1) == 0x0001EA, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001F0, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_GetActorForwardVector_ReturnValue) == 0x000208, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_Add_VectorVector_ReturnValue) == 0x000220, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_DropLoot, CallFunc_K2_SpawnPickupInWorld_ReturnValue) == 0x000238, "Member 'GAB_InterrogatePlayer_Search_C_DropLoot::CallFunc_K2_SpawnPickupInWorld_ReturnValue' has a wrong offset!");

// Function GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.EndAbilityCleanup
// 0x0002 (0x0002 - 0x0000)
struct GAB_InterrogatePlayer_Search_C_EndAbilityCleanup final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Search_C_EndAbilityCleanup) == 0x000001, "Wrong alignment on GAB_InterrogatePlayer_Search_C_EndAbilityCleanup");
static_assert(sizeof(GAB_InterrogatePlayer_Search_C_EndAbilityCleanup) == 0x000002, "Wrong size on GAB_InterrogatePlayer_Search_C_EndAbilityCleanup");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_EndAbilityCleanup, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GAB_InterrogatePlayer_Search_C_EndAbilityCleanup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_EndAbilityCleanup, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'GAB_InterrogatePlayer_Search_C_EndAbilityCleanup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.ExecuteUbergraph_GAB_InterrogatePlayer_Search
// 0x02E8 (0x02E8 - 0x0000)
struct GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0030(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0040(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0068(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0078(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0080(0x0028)()
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeWaited;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeWaited)>             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00D4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputPress*            CallFunc_WaitInputPress_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor_1;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage_1;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy_1;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser_1;                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation_1;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent_1;                // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName_1;                     // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Momentum_1;                     // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x01D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetDBNOHoistee_ReturnValue;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0200(0x00B0)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x02B8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x02E0(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue;  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search");
static_assert(sizeof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search) == 0x0002E8, "Wrong size on GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, EntryPoint) == 0x000000, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_TargetData_1) == 0x000008, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_ApplicationTag_1) == 0x000030, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_TargetData) == 0x000040, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_ApplicationTag) == 0x000068, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, Temp_struct_Variable) == 0x000078, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, Temp_struct_Variable_1) == 0x000080, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000A8, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B8, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C4, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_TimeWaited) == 0x0000D0, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_TimeWaited' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000D4, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, Temp_float_Variable) == 0x0000E0, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_WaitInputPress_ReturnValue) == 0x0000E8, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_WaitInputPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_Event_bWasCancelled) == 0x0000F1, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x0000F8, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000108, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_IsValid_ReturnValue_2) == 0x000110, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_IsValid_ReturnValue_3) == 0x000111, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_IsValid_ReturnValue_4) == 0x000112, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_DamagedActor_1) == 0x000118, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_DamagedActor_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_Damage_1) == 0x000120, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_Damage_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_InstigatedBy_1) == 0x000128, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_DamageCauser_1) == 0x000130, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_HitLocation_1) == 0x000138, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_HitLocation_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_FHitComponent_1) == 0x000150, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_FHitComponent_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_BoneName_1) == 0x000158, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_BoneName_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_Momentum_1) == 0x000160, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_Momentum_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_DamagedActor) == 0x000178, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_Damage) == 0x000180, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_InstigatedBy) == 0x000188, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_DamageCauser) == 0x000190, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_HitLocation) == 0x000198, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_FHitComponent) == 0x0001B0, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_BoneName) == 0x0001B8, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_Momentum) == 0x0001C0, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001D8, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_IsValid_ReturnValue_5) == 0x0001E4, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0001E8, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_GetDBNOHoistee_ReturnValue) == 0x0001F0, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_GetDBNOHoistee_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0001F8, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_MakeStruct_GameplayEventData) == 0x000200, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0002B0, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_TargetData_2) == 0x0002B8, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, K2Node_CustomEvent_ApplicationTag_2) == 0x0002E0, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search, CallFunc_IncrementAnalyticMatchCount_ReturnValue) == 0x0002E4, "Member 'GAB_InterrogatePlayer_Search_C_ExecuteUbergraph_GAB_InterrogatePlayer_Search::CallFunc_IncrementAnalyticMatchCount_ReturnValue' has a wrong offset!");

// Function GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.GetKeycardToDrop
// 0x00B8 (0x00B8 - 0x0000)
struct GAB_InterrogatePlayer_Search_C_GetKeycardToDrop final
{
public:
	bool                                          HasKeycard;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KeycardIndex;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_3;  // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_3;     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_4;  // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_4;     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_5;  // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_5;     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_InterrogatePlayer_Search_C_GetKeycardToDrop) == 0x000008, "Wrong alignment on GAB_InterrogatePlayer_Search_C_GetKeycardToDrop");
static_assert(sizeof(GAB_InterrogatePlayer_Search_C_GetKeycardToDrop) == 0x0000B8, "Wrong size on GAB_InterrogatePlayer_Search_C_GetKeycardToDrop");
