#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SurfaceChange_OctopusVehicle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GAB_SurfaceChange_OctopusVehicle.GAB_SurfaceChange_OctopusVehicle_C.ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle
// 0x00D8 (0x00D8 - 0x0000)
struct GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_AvatarActor;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0010(0x00B0)(ConstParm)
	bool                                          GameplayTagsK2Node_SwitchGameplayTagContainer_CmpSuccess; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle) == 0x000008, "Wrong alignment on GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle");
static_assert(sizeof(GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle) == 0x0000D8, "Wrong size on GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle, EntryPoint) == 0x000000, "Member 'GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle, K2Node_CustomEvent_AvatarActor) == 0x000008, "Member 'GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle::K2Node_CustomEvent_AvatarActor' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle, K2Node_Event_EventData) == 0x000010, "Member 'GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle, GameplayTagsK2Node_SwitchGameplayTagContainer_CmpSuccess) == 0x0000C0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle::GameplayTagsK2Node_SwitchGameplayTagContainer_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000C8, "Member 'GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000D0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_ExecuteUbergraph_GAB_SurfaceChange_OctopusVehicle::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GAB_SurfaceChange_OctopusVehicle.GAB_SurfaceChange_OctopusVehicle_C.HotfixableGEApplication
// 0x0050 (0x0050 - 0x0000)
struct GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication final
{
public:
	struct FScalableFloat                         Input;                                             // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UClass*                                 GameplayEffectAppliedOnTrue;                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GameplayEffectAppliedOnFalse;                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication) == 0x000008, "Wrong alignment on GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication");
static_assert(sizeof(GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication) == 0x000050, "Wrong size on GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication, Input) == 0x000000, "Member 'GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication::Input' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication, GameplayEffectAppliedOnTrue) == 0x000028, "Member 'GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication::GameplayEffectAppliedOnTrue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication, GameplayEffectAppliedOnFalse) == 0x000030, "Member 'GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication::GameplayEffectAppliedOnFalse' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication, CallFunc_GetValueAtLevel_ReturnValue) == 0x000038, "Member 'GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00003C, "Member 'GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000044, "Member 'GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000048, "Member 'GAB_SurfaceChange_OctopusVehicle_C_HotfixableGEApplication::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");

// Function GAB_SurfaceChange_OctopusVehicle.GAB_SurfaceChange_OctopusVehicle_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GAB_SurfaceChange_OctopusVehicle_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_SurfaceChange_OctopusVehicle_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GAB_SurfaceChange_OctopusVehicle_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_SurfaceChange_OctopusVehicle_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GAB_SurfaceChange_OctopusVehicle_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_SurfaceChange_OctopusVehicle_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_SurfaceChange_OctopusVehicle.GAB_SurfaceChange_OctopusVehicle_C.LavaBounce
// 0x03A8 (0x03A8 - 0x0000)
struct GAB_SurfaceChange_OctopusVehicle_C_LavaBounce final
{
public:
	class UObject*                                AvatarActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOctopusVehicle_C*                      OctopusVehicle;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOctopusVehicle_C*                      K2Node_DynamicCast_AsOctopus_Vehicle;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_SetIgnoreNextFallingDamage_self_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPrimaryContact_bIstouching;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPrimaryContact_ContactPoint;           // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPrimaryContact_ContactNormal;          // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue_1;                   // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantizeNormal              CallFunc_MakeVector_NetQuantizeNormal_ReturnValue; // 0x02C0(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x02D8(0x00D0)(ContainsInstancedReference)
};
static_assert(alignof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce) == 0x000008, "Wrong alignment on GAB_SurfaceChange_OctopusVehicle_C_LavaBounce");
static_assert(sizeof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce) == 0x0003A8, "Wrong size on GAB_SurfaceChange_OctopusVehicle_C_LavaBounce");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, AvatarActor) == 0x000000, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::AvatarActor' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, OctopusVehicle) == 0x000008, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::OctopusVehicle' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, K2Node_DynamicCast_AsOctopus_Vehicle) == 0x000010, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::K2Node_DynamicCast_AsOctopus_Vehicle' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_SetIgnoreNextFallingDamage_self_CastInput) == 0x000020, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_SetIgnoreNextFallingDamage_self_CastInput' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_HasAuthority_ReturnValue) == 0x000030, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000050, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetVelocity_ReturnValue) == 0x000068, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_MirrorVectorByNormal_ReturnValue) == 0x000080, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_MirrorVectorByNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000098, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetPrimaryContact_bIstouching) == 0x0000A8, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetPrimaryContact_bIstouching' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetPrimaryContact_ContactPoint) == 0x0000B0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetPrimaryContact_ContactPoint' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetPrimaryContact_ContactNormal) == 0x0000C8, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetPrimaryContact_ContactNormal' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Normal2D_ReturnValue) == 0x0000E0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetVelocity_ReturnValue_1) == 0x000108, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetValueAtLevel_ReturnValue) == 0x000120, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_BreakVector_X) == 0x000124, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_BreakVector_Y) == 0x000128, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_BreakVector_Z) == 0x00012C, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000130, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_MakeVector_ReturnValue) == 0x000138, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_RandomFloatInRange_ReturnValue) == 0x000150, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Add_VectorVector_ReturnValue) == 0x000158, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000170, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000174, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Add_FloatFloat_ReturnValue) == 0x000178, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_FMin_ReturnValue) == 0x00017C, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000180, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000184, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x000188, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000190, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0001A8, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x0001B0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_MakeRotator_ReturnValue) == 0x0001C0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0001D8, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001F0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x0001F8, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Normal2D_ReturnValue_1) == 0x000208, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Normal2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Multiply_Vector2DFloat_ReturnValue_1) == 0x000218, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Multiply_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000228, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000238, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Normal_ReturnValue) == 0x000250, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000268, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000280, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_Normal_ReturnValue_1) == 0x000298, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_BreakVector_X_1) == 0x0002B0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_BreakVector_Y_1) == 0x0002B4, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_BreakVector_Z_1) == 0x0002B8, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_MakeVector_NetQuantizeNormal_ReturnValue) == 0x0002C0, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_MakeVector_NetQuantizeNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_LavaBounce, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0002D8, "Member 'GAB_SurfaceChange_OctopusVehicle_C_LavaBounce::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function GAB_SurfaceChange_OctopusVehicle.GAB_SurfaceChange_OctopusVehicle_C.MulticastLavaBounce
// 0x0008 (0x0008 - 0x0000)
struct GAB_SurfaceChange_OctopusVehicle_C_MulticastLavaBounce final
{
public:
	class UObject*                                AvatarActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_SurfaceChange_OctopusVehicle_C_MulticastLavaBounce) == 0x000008, "Wrong alignment on GAB_SurfaceChange_OctopusVehicle_C_MulticastLavaBounce");
static_assert(sizeof(GAB_SurfaceChange_OctopusVehicle_C_MulticastLavaBounce) == 0x000008, "Wrong size on GAB_SurfaceChange_OctopusVehicle_C_MulticastLavaBounce");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_MulticastLavaBounce, AvatarActor) == 0x000000, "Member 'GAB_SurfaceChange_OctopusVehicle_C_MulticastLavaBounce::AvatarActor' has a wrong offset!");

// Function GAB_SurfaceChange_OctopusVehicle.GAB_SurfaceChange_OctopusVehicle_C.SurfaceCleanup
// 0x0050 (0x0050 - 0x0000)
struct GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup final
{
public:
	EPhysicalSurface                              SurfaceType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasLava;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasIce;                                           // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOctopusVehicle_C*                      K2Node_DynamicCast_AsOctopus_Vehicle;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput_1; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue_1; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup) == 0x000008, "Wrong alignment on GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup");
static_assert(sizeof(GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup) == 0x000050, "Wrong size on GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup, SurfaceType) == 0x000000, "Member 'GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup::SurfaceType' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup, bHasLava) == 0x000001, "Member 'GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup::bHasLava' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup, bHasIce) == 0x000002, "Member 'GAB_SurfaceChange_OctopusVehicle_C_SurfaceCleanup::bHasIce' has a wrong offset!");
