#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayEventRouter

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct GameplayEventRouter.GameplayEventListenerList
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FGameplayEventListenerList final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameplayEventListenerList) == 0x000008, "Wrong alignment on FGameplayEventListenerList");
static_assert(sizeof(FGameplayEventListenerList) == 0x000010, "Wrong size on FGameplayEventListenerList");

// ScriptStruct GameplayEventRouter.GameplayEventListenerHandle
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FGameplayEventListenerHandle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Handle;                                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameplayEventListenerHandle) == 0x000008, "Wrong alignment on FGameplayEventListenerHandle");
static_assert(sizeof(FGameplayEventListenerHandle) == 0x000020, "Wrong size on FGameplayEventListenerHandle");
static_assert(offsetof(FGameplayEventListenerHandle, Handle) == 0x000010, "Member 'FGameplayEventListenerHandle::Handle' has a wrong offset!");

// ScriptStruct GameplayEventRouter.GameplayEventListenerData
// 0x00B0 (0x00B0 - 0x0000)
struct alignas(0x10) FGameplayEventListenerData final
{
public:
	uint8                                         Pad_0[0x80];                                       // 0x0000(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          EventType;                                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EventContext;                                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameplayEventListenerData) == 0x000010, "Wrong alignment on FGameplayEventListenerData");
static_assert(sizeof(FGameplayEventListenerData) == 0x0000B0, "Wrong size on FGameplayEventListenerData");
static_assert(offsetof(FGameplayEventListenerData, EventType) == 0x000080, "Member 'FGameplayEventListenerData::EventType' has a wrong offset!");
static_assert(offsetof(FGameplayEventListenerData, EventContext) == 0x000088, "Member 'FGameplayEventListenerData::EventContext' has a wrong offset!");

}

