#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadMappingInfo_v3

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.ClearAllComboTextLines
// 0x0018 (0x0018 - 0x0000)
struct GamepadMappingInfo_v3_C_ClearAllComboTextLines final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
};
static_assert(alignof(GamepadMappingInfo_v3_C_ClearAllComboTextLines) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_ClearAllComboTextLines");
static_assert(sizeof(GamepadMappingInfo_v3_C_ClearAllComboTextLines) == 0x000018, "Wrong size on GamepadMappingInfo_v3_C_ClearAllComboTextLines");
static_assert(offsetof(GamepadMappingInfo_v3_C_ClearAllComboTextLines, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'GamepadMappingInfo_v3_C_ClearAllComboTextLines::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.DeadzoneLookResetButtonClicked_Bind
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind");
static_assert(sizeof(GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind) == 0x000008, "Wrong size on GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind");
static_assert(offsetof(GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind, Button) == 0x000000, "Member 'GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind::Button' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.DeadzoneMoveResetButtonClicked_Bind
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind");
static_assert(sizeof(GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind) == 0x000008, "Wrong size on GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind");
static_assert(offsetof(GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind, Button) == 0x000000, "Member 'GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind::Button' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.ExecuteUbergraph_GamepadMappingInfo_v3
// 0x0190 (0x0190 - 0x0000)
struct GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetControllerImage_Texture;               // 0x0020(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_CustomEvent_Button_2;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGamepadKeyTextButton_C*                K2Node_DynamicCast_AsGamepad_Key_Text_Button;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButtonLegacy* Button)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGamepadKeyTextButton_C*>        K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue_1;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue_2;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue_3;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue_4;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTabCount_ReturnValue;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGamepadKeyTextButton_C*                CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName;     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText;       // 0x00D0(0x0018)()
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName_1;   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText_1;     // 0x00F0(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_CustomEvent_Button_1;                       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_CustomEvent_Button;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonLegacy* Button)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0128(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonLegacy* Button)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0134(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName_2;   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText_2;     // 0x0168(0x0018)()
	class UGamepadKeyTextButton_C*                CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3");
static_assert(sizeof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3) == 0x000190, "Wrong size on GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, EntryPoint) == 0x000000, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::EntryPoint' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_object_Variable) == 0x000008, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_DynamicCast_AsTexture_2D) == 0x000010, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetControllerImage_Texture) == 0x000020, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetControllerImage_Texture' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_IsAssetNull_ReturnValue) == 0x000048, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CustomEvent_Button_2) == 0x000050, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_DynamicCast_AsGamepad_Key_Text_Button) == 0x000068, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_DynamicCast_AsGamepad_Key_Text_Button' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_MakeArray_Array) == 0x000088, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabIdAtIndex_ReturnValue) == 0x000098, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabIdAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabIdAtIndex_ReturnValue_1) == 0x00009C, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabIdAtIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabIdAtIndex_ReturnValue_2) == 0x0000A0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabIdAtIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabIdAtIndex_ReturnValue_3) == 0x0000A4, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabIdAtIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabIdAtIndex_ReturnValue_4) == 0x0000A8, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabIdAtIndex_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabCount_ReturnValue) == 0x0000AC, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_int_Array_Index_Variable_1) == 0x0000B4, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_int_Loop_Counter_Variable) == 0x0000B8, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_ActionName) == 0x0000C8, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_ActionName' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_DescText) == 0x0000D0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_DescText' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_ActionName_1) == 0x0000E8, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_ActionName_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_DescText_1) == 0x0000F0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_DescText_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Add_IntInt_ReturnValue) == 0x00010C, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CustomEvent_Loaded) == 0x000110, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CustomEvent_Button_1) == 0x000118, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CustomEvent_Button) == 0x000120, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CreateDelegate_OutputDelegate_2) == 0x000128, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CreateDelegate_OutputDelegate_3) == 0x000134, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_int_Loop_Counter_Variable_1) == 0x000140, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Add_IntInt_ReturnValue_1) == 0x000144, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetContext_ReturnValue) == 0x000148, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetValue_ReturnValue) == 0x000150, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetContext_ReturnValue_1) == 0x000158, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetValue_ReturnValue_1) == 0x000160, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_ActionName_2) == 0x000164, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_ActionName_2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_DescText_2) == 0x000168, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_DescText_2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Less_IntInt_ReturnValue_1) == 0x00018C, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.GetControllerImage
// 0x0058 (0x0058 - 0x0000)
struct GamepadMappingInfo_v3_C_GetControllerImage final
{
public:
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item;                           // 0x0030(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_GetControllerImage) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_GetControllerImage");
static_assert(sizeof(GamepadMappingInfo_v3_C_GetControllerImage) == 0x000058, "Wrong size on GamepadMappingInfo_v3_C_GetControllerImage");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetControllerImage, Texture) == 0x000000, "Member 'GamepadMappingInfo_v3_C_GetControllerImage::Texture' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetControllerImage, CallFunc_MakeLiteralByte_ReturnValue) == 0x000028, "Member 'GamepadMappingInfo_v3_C_GetControllerImage::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetControllerImage, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'GamepadMappingInfo_v3_C_GetControllerImage::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetControllerImage, CallFunc_Array_Get_Item) == 0x000030, "Member 'GamepadMappingInfo_v3_C_GetControllerImage::CallFunc_Array_Get_Item' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.GetCustomButtonDataForKey
// 0x00D8 (0x00D8 - 0x0000)
struct GamepadMappingInfo_v3_C_GetCustomButtonDataForKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FName                                   ActionName;                                        // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DescText;                                          // 0x0020(0x0018)(Parm, OutParm)
	EFortInputActionGroup                         InputActionGroup_Local;                            // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DescText_Local;                                    // 0x0040(0x0018)(Edit, BlueprintVisible)
	class FName                                   ActionName_Local;                                  // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PresetName_Local;                                  // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key_Local;                                         // 0x0060(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EFortInputActionGroup                         Temp_byte_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCustomGamepadInputPresetName_ReturnValue; // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInputData*                         CallFunc_GetFortInputDataForBlueprint_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetScreenLabel_ReturnValue;               // 0x00B0(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_2;                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActionForKey_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputActionGroup                         CallFunc_GetInputActionGroup_OutInputActionGroup;  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputActionGroup_ReturnValue;          // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputActionGroup                         K2Node_Select_Default;                             // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_GetCustomButtonDataForKey");
static_assert(sizeof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey) == 0x0000D8, "Wrong size on GamepadMappingInfo_v3_C_GetCustomButtonDataForKey");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, Key) == 0x000000, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::Key' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, ActionName) == 0x000018, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::ActionName' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, DescText) == 0x000020, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::DescText' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, InputActionGroup_Local) == 0x000038, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::InputActionGroup_Local' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, DescText_Local) == 0x000040, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::DescText_Local' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, ActionName_Local) == 0x000058, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::ActionName_Local' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, PresetName_Local) == 0x00005C, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::PresetName_Local' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, Key_Local) == 0x000060, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::Key_Local' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, Temp_byte_Variable) == 0x000078, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_GetContext_ReturnValue) == 0x000080, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_GetContext_ReturnValue_1) == 0x000088, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_GetCustomGamepadInputPresetName_ReturnValue) == 0x000090, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_GetCustomGamepadInputPresetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_Conv_StringToName_ReturnValue) == 0x0000A0, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, Temp_bool_Variable) == 0x0000A4, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_GetFortInputDataForBlueprint_ReturnValue) == 0x0000A8, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_GetFortInputDataForBlueprint_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_GetScreenLabel_ReturnValue) == 0x0000B0, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_GetScreenLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_GetContext_ReturnValue_2) == 0x0000C8, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_GetActionForKey_ReturnValue) == 0x0000D0, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_GetActionForKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_GetInputActionGroup_OutInputActionGroup) == 0x0000D4, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_GetInputActionGroup_OutInputActionGroup' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, CallFunc_GetInputActionGroup_ReturnValue) == 0x0000D5, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::CallFunc_GetInputActionGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetCustomButtonDataForKey, K2Node_Select_Default) == 0x0000D6, "Member 'GamepadMappingInfo_v3_C_GetCustomButtonDataForKey::K2Node_Select_Default' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.GetDesiredSlateVisibilityForAbilityChordFromTextDisplay
// 0x0050 (0x0050 - 0x0000)
struct GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay final
{
public:
	class UTextBlock*                             TextWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              DesiredSlateVisibility;                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay");
static_assert(sizeof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay) == 0x000050, "Wrong size on GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay, TextWidget) == 0x000000, "Member 'GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay::TextWidget' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay, DesiredSlateVisibility) == 0x000008, "Member 'GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay::DesiredSlateVisibility' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay, Temp_bool_Variable) == 0x000009, "Member 'GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay, Temp_byte_Variable) == 0x000028, "Member 'GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay, Temp_byte_Variable_1) == 0x000029, "Member 'GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay, CallFunc_MakeLiteralText_ReturnValue) == 0x000030, "Member 'GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000048, "Member 'GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay, K2Node_Select_Default) == 0x000049, "Member 'GamepadMappingInfo_v3_C_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay::K2Node_Select_Default' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.Handle Config Changed Hide or Show Unused Text Lines
// 0x000A (0x000A - 0x0000)
struct GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay_DesiredSlateVisibility; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay_DesiredSlateVisibility_1; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay_DesiredSlateVisibility_2; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines) == 0x000001, "Wrong alignment on GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines");
static_assert(sizeof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines) == 0x00000A, "Wrong size on GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, Temp_byte_Variable) == 0x000000, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, Temp_byte_Variable_1) == 0x000001, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, Temp_bool_Variable) == 0x000002, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, CallFunc_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay_DesiredSlateVisibility) == 0x000003, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::CallFunc_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay_DesiredSlateVisibility' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, CallFunc_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay_DesiredSlateVisibility_1) == 0x000004, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::CallFunc_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay_DesiredSlateVisibility_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, CallFunc_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay_DesiredSlateVisibility_2) == 0x000006, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::CallFunc_GetDesiredSlateVisibilityForAbilityChordFromTextDisplay_DesiredSlateVisibility_2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000007, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines, K2Node_Select_Default) == 0x000009, "Member 'GamepadMappingInfo_v3_C_Handle_Config_Changed_Hide_or_Show_Unused_Text_Lines::K2Node_Select_Default' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.Handle Config Changed STW Build Mode
// 0x07D8 (0x07D8 - 0x0000)
struct GamepadMappingInfo_v3_C_Handle_Config_Changed_STW_Build_Mode final
{
public:
	int32                                         Config;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	int32                                         Temp_int_Variable_2;                               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00C8(0x0018)()
	int32                                         Temp_int_Variable_3;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x00E8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0100(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x0118(0x0018)()
	int32                                         Temp_int_Variable_4;                               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0168(0x0018)()
	int32                                         Temp_int_Variable_5;                               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x0188(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x01A0(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x01B8(0x0018)()
	int32                                         Temp_int_Variable_6;                               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_5;                           // 0x01D8(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x01F0(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0208(0x0018)()
	int32                                         Temp_int_Variable_7;                               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_6;                           // 0x0228(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0240(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0258(0x0018)()
	int32                                         Temp_int_Variable_8;                               // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_7;                           // 0x0278(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x0290(0x0018)()
	class FText                                   Temp_text_Variable_17;                             // 0x02A8(0x0018)()
	int32                                         Temp_int_Variable_9;                               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_8;                           // 0x02C8(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x02E0(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x02F8(0x0018)()
	int32                                         Temp_int_Variable_10;                              // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_9;                           // 0x0318(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x0330(0x0018)()
	class FText                                   Temp_text_Variable_21;                             // 0x0348(0x0018)()
	int32                                         Temp_int_Variable_11;                              // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_10;                          // 0x0368(0x0018)()
	class FText                                   Temp_text_Variable_22;                             // 0x0380(0x0018)()
	class FText                                   Temp_text_Variable_23;                             // 0x0398(0x0018)()
	int32                                         Temp_int_Variable_12;                              // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_11;                          // 0x03B8(0x0018)()
	class FText                                   Temp_text_Variable_24;                             // 0x03D0(0x0018)()
	class FText                                   Temp_text_Variable_25;                             // 0x03E8(0x0018)()
	int32                                         Temp_int_Variable_13;                              // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_12;                          // 0x0408(0x0018)()
	class FText                                   Temp_text_Variable_26;                             // 0x0420(0x0018)()
	class FText                                   Temp_text_Variable_27;                             // 0x0438(0x0018)()
	int32                                         Temp_int_Variable_14;                              // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
