#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadInfoSelectorPanel_v3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GamepadInfoSelectorPanel_v3.GamepadInfoSelectorPanel_v3_C
// 0x00C8 (0x0630 - 0x0568)
class UGamepadInfoSelectorPanel_v3_C final : public UFortGamePadInfoSelectorPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          CommonBorder_Reset;                                // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRadioButtonGroup_C*                FortRadioButtonGroup_Configs;                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRadioButtonGroup_C*                FortRadioButtonGroup_Platforms;                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlockLegacy*               FortRichTextBlock_Reset1;                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlockLegacy*               FortRichTextBlock_Reset2;                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget_Reset;                               // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuHeader_C*                   OptionsMenuHeader_Configs;                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuHeader_C*                   OptionsMenuHeader_Platforms;                       // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ResetButton;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Platforms;                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Back;                                              // 0x05C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void()>              GamepadInfoSelectorBack;                           // 0x05D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    Apply;                                             // 0x05E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void()>              GamepadInfoSelectorApply;                          // 0x05F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    Reset;                                             // 0x0600(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void()>              GamepadInfoSelectorReset;                          // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              GamepadInfoSelectorFocus;                          // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_GamepadInfoSelectorPanel_v3(int32 EntryPoint);
	void HandleApply(bool* Passthrough);
	void HandleBack(bool* Passthrough);
	void HandleReset(bool* Passthrough);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GamepadInfoSelectorPanel_v3_C">();
	}
	static class UGamepadInfoSelectorPanel_v3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamepadInfoSelectorPanel_v3_C>();
	}
};
static_assert(alignof(UGamepadInfoSelectorPanel_v3_C) == 0x000008, "Wrong alignment on UGamepadInfoSelectorPanel_v3_C");
static_assert(sizeof(UGamepadInfoSelectorPanel_v3_C) == 0x000630, "Wrong size on UGamepadInfoSelectorPanel_v3_C");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, UberGraphFrame) == 0x000568, "Member 'UGamepadInfoSelectorPanel_v3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, CommonBorder_Reset) == 0x000570, "Member 'UGamepadInfoSelectorPanel_v3_C::CommonBorder_Reset' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, FortRadioButtonGroup_Configs) == 0x000578, "Member 'UGamepadInfoSelectorPanel_v3_C::FortRadioButtonGroup_Configs' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, FortRadioButtonGroup_Platforms) == 0x000580, "Member 'UGamepadInfoSelectorPanel_v3_C::FortRadioButtonGroup_Platforms' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, FortRichTextBlock_Reset1) == 0x000588, "Member 'UGamepadInfoSelectorPanel_v3_C::FortRichTextBlock_Reset1' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, FortRichTextBlock_Reset2) == 0x000590, "Member 'UGamepadInfoSelectorPanel_v3_C::FortRichTextBlock_Reset2' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, KeybindWidget_Reset) == 0x000598, "Member 'UGamepadInfoSelectorPanel_v3_C::KeybindWidget_Reset' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, OptionsMenuHeader_Configs) == 0x0005A0, "Member 'UGamepadInfoSelectorPanel_v3_C::OptionsMenuHeader_Configs' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, OptionsMenuHeader_Platforms) == 0x0005A8, "Member 'UGamepadInfoSelectorPanel_v3_C::OptionsMenuHeader_Platforms' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, ResetButton) == 0x0005B0, "Member 'UGamepadInfoSelectorPanel_v3_C::ResetButton' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, VerticalBox_Platforms) == 0x0005B8, "Member 'UGamepadInfoSelectorPanel_v3_C::VerticalBox_Platforms' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, Back) == 0x0005C0, "Member 'UGamepadInfoSelectorPanel_v3_C::Back' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, GamepadInfoSelectorBack) == 0x0005D0, "Member 'UGamepadInfoSelectorPanel_v3_C::GamepadInfoSelectorBack' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, Apply) == 0x0005E0, "Member 'UGamepadInfoSelectorPanel_v3_C::Apply' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, GamepadInfoSelectorApply) == 0x0005F0, "Member 'UGamepadInfoSelectorPanel_v3_C::GamepadInfoSelectorApply' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, Reset) == 0x000600, "Member 'UGamepadInfoSelectorPanel_v3_C::Reset' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, GamepadInfoSelectorReset) == 0x000610, "Member 'UGamepadInfoSelectorPanel_v3_C::GamepadInfoSelectorReset' has a wrong offset!");
static_assert(offsetof(UGamepadInfoSelectorPanel_v3_C, GamepadInfoSelectorFocus) == 0x000620, "Member 'UGamepadInfoSelectorPanel_v3_C::GamepadInfoSelectorFocus' has a wrong offset!");

}

