#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayTags

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GameplayTags.GameplayTags_C
// 0x0030 (0x00D0 - 0x00A0)
class UGameplayTags_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FGameplayTagContainer                  TC_BTDecoratorGameplayTags;                        // 0x00A0(0x0020)(Edit, BlueprintVisible)
	bool                                          Inverse_Condition;                                 // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerActor;                                        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameplayTags_C">();
	}
	static class UGameplayTags_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayTags_C>();
	}
};
static_assert(alignof(UGameplayTags_C) == 0x000008, "Wrong alignment on UGameplayTags_C");
static_assert(sizeof(UGameplayTags_C) == 0x0000D0, "Wrong size on UGameplayTags_C");
static_assert(offsetof(UGameplayTags_C, TC_BTDecoratorGameplayTags) == 0x0000A0, "Member 'UGameplayTags_C::TC_BTDecoratorGameplayTags' has a wrong offset!");
static_assert(offsetof(UGameplayTags_C, Inverse_Condition) == 0x0000C0, "Member 'UGameplayTags_C::Inverse_Condition' has a wrong offset!");
static_assert(offsetof(UGameplayTags_C, OwnerActor) == 0x0000C8, "Member 'UGameplayTags_C::OwnerActor' has a wrong offset!");

}

