#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadCustomActionSelectorPanel_v3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GamepadCustomActionSelectorPanel_v3.GamepadCustomActionSelectorPanel_v3_C
// 0x00B8 (0x0620 - 0x0568)
class UGamepadCustomActionSelectorPanel_v3_C final : public UFortGamePadCustomActionSelectorPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Clear;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Clear;                                // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        CommonListView_GamepadActions;                     // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlockLegacy*               FortRichTextBlock_Clear1;                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlockLegacy*               FortRichTextBlock_Clear2;                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget_Clear;                               // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuHeader_C*                   OptionsMenuHeader;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Back;                                              // 0x05A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void(int32 SelectedIndex, class FName ActionName)> CustomActionSelected;                              // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UFortOptionsMenuInputData*>      CurrentInputData;                                  // 0x05C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              CustomClosedUsingBack;                             // 0x05D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              CustomClearButton;                                 // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FKey                                   KeyNone;                                           // 0x05F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Clear;                                             // 0x0610(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__Button_Clear_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BP_OnItemClicked_Bind(class UObject* Item);
	void Construct();
	void CreateCustomListItem(class FName ActionName, EFortInputActionGroup InputActionGroup, class UGamepadKeyTextButton_C** ReturnItem);
	void ExecuteUbergraph_GamepadCustomActionSelectorPanel_v3(int32 EntryPoint);
	void HandleBack(bool* Passthrough);
	void HandleClear(bool* Passthrough);
	void UpdatePanel(const TArray<class UFortOptionsMenuInputData*>& InputData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GamepadCustomActionSelectorPanel_v3_C">();
	}
	static class UGamepadCustomActionSelectorPanel_v3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamepadCustomActionSelectorPanel_v3_C>();
	}
};
static_assert(alignof(UGamepadCustomActionSelectorPanel_v3_C) == 0x000008, "Wrong alignment on UGamepadCustomActionSelectorPanel_v3_C");
static_assert(sizeof(UGamepadCustomActionSelectorPanel_v3_C) == 0x000620, "Wrong size on UGamepadCustomActionSelectorPanel_v3_C");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, UberGraphFrame) == 0x000568, "Member 'UGamepadCustomActionSelectorPanel_v3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, Button_Clear) == 0x000570, "Member 'UGamepadCustomActionSelectorPanel_v3_C::Button_Clear' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CommonBorder_Clear) == 0x000578, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CommonBorder_Clear' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CommonListView_GamepadActions) == 0x000580, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CommonListView_GamepadActions' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, FortRichTextBlock_Clear1) == 0x000588, "Member 'UGamepadCustomActionSelectorPanel_v3_C::FortRichTextBlock_Clear1' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, FortRichTextBlock_Clear2) == 0x000590, "Member 'UGamepadCustomActionSelectorPanel_v3_C::FortRichTextBlock_Clear2' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, KeybindWidget_Clear) == 0x000598, "Member 'UGamepadCustomActionSelectorPanel_v3_C::KeybindWidget_Clear' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, OptionsMenuHeader) == 0x0005A0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::OptionsMenuHeader' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, Back) == 0x0005A8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::Back' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CustomActionSelected) == 0x0005B8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CustomActionSelected' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CurrentInputData) == 0x0005C8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CurrentInputData' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CustomClosedUsingBack) == 0x0005D8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CustomClosedUsingBack' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CustomClearButton) == 0x0005E8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CustomClearButton' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, KeyNone) == 0x0005F8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::KeyNone' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, Clear) == 0x000610, "Member 'UGamepadCustomActionSelectorPanel_v3_C::Clear' has a wrong offset!");

}

