#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayTags

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameplayTags.GameplayTags_C.PerformConditionCheckAI
// 0x0048 (0x0048 - 0x0000)
struct GameplayTags_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReturnVal;                                        // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GameplayTags_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on GameplayTags_C_PerformConditionCheckAI");
static_assert(sizeof(GameplayTags_C_PerformConditionCheckAI) == 0x000048, "Wrong size on GameplayTags_C_PerformConditionCheckAI");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'GameplayTags_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'GameplayTags_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'GameplayTags_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, bReturnVal) == 0x000011, "Member 'GameplayTags_C_PerformConditionCheckAI::bReturnVal' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, Temp_bool_Variable) == 0x000012, "Member 'GameplayTags_C_PerformConditionCheckAI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, K2Node_DynamicCast_AsFort_AIController) == 0x000018, "Member 'GameplayTags_C_PerformConditionCheckAI::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GameplayTags_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, CallFunc_HasAllMatchingGameplayTags_self_CastInput) == 0x000028, "Member 'GameplayTags_C_PerformConditionCheckAI::CallFunc_HasAllMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000038, "Member 'GameplayTags_C_PerformConditionCheckAI::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x00003C, "Member 'GameplayTags_C_PerformConditionCheckAI::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'GameplayTags_C_PerformConditionCheckAI::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'GameplayTags_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue_1) == 0x000042, "Member 'GameplayTags_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue) == 0x000043, "Member 'GameplayTags_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayTags_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue_2) == 0x000044, "Member 'GameplayTags_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

}

