#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_BoostJumpPack_FuelRegen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCL_BoostJumpPack_FuelRegen.GCL_BoostJumpPack_FuelRegen_C
// 0x0018 (0x0488 - 0x0470)
class AGCL_BoostJumpPack_FuelRegen_C final : public AGameplayCueNotify_Jetpack_FuelRegen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FullBlinkTimeline_Blink_108772B949790E60DC9BE1BAC70C2EA1; // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FullBlinkTimeline__Direction_108772B949790E60DC9BE1BAC70C2EA1; // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47D[0x3];                                      // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FullBlinkTimeline;                                 // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCL_BoostJumpPack_FuelRegen(int32 EntryPoint);
	void FullBlinkTimeline__FinishedFunc();
	void FullBlinkTimeline__UpdateFunc();
	void ResetBlink(class AFortPlayerPawn* PlayerPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCL_BoostJumpPack_FuelRegen_C">();
	}
	static class AGCL_BoostJumpPack_FuelRegen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCL_BoostJumpPack_FuelRegen_C>();
	}
};
static_assert(alignof(AGCL_BoostJumpPack_FuelRegen_C) == 0x000008, "Wrong alignment on AGCL_BoostJumpPack_FuelRegen_C");
static_assert(sizeof(AGCL_BoostJumpPack_FuelRegen_C) == 0x000488, "Wrong size on AGCL_BoostJumpPack_FuelRegen_C");
static_assert(offsetof(AGCL_BoostJumpPack_FuelRegen_C, UberGraphFrame) == 0x000470, "Member 'AGCL_BoostJumpPack_FuelRegen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_FuelRegen_C, FullBlinkTimeline_Blink_108772B949790E60DC9BE1BAC70C2EA1) == 0x000478, "Member 'AGCL_BoostJumpPack_FuelRegen_C::FullBlinkTimeline_Blink_108772B949790E60DC9BE1BAC70C2EA1' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_FuelRegen_C, FullBlinkTimeline__Direction_108772B949790E60DC9BE1BAC70C2EA1) == 0x00047C, "Member 'AGCL_BoostJumpPack_FuelRegen_C::FullBlinkTimeline__Direction_108772B949790E60DC9BE1BAC70C2EA1' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_FuelRegen_C, FullBlinkTimeline) == 0x000480, "Member 'AGCL_BoostJumpPack_FuelRegen_C::FullBlinkTimeline' has a wrong offset!");

}

