#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_RezIn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_RezIn.GCN_RezIn_C.Clean-Up Teleportation Light
// 0x0001 (0x0001 - 0x0000)
struct GCN_RezIn_C_Clean_Up_Teleportation_Light final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_Clean_Up_Teleportation_Light) == 0x000001, "Wrong alignment on GCN_RezIn_C_Clean_Up_Teleportation_Light");
static_assert(sizeof(GCN_RezIn_C_Clean_Up_Teleportation_Light) == 0x000001, "Wrong size on GCN_RezIn_C_Clean_Up_Teleportation_Light");
static_assert(offsetof(GCN_RezIn_C_Clean_Up_Teleportation_Light, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCN_RezIn_C_Clean_Up_Teleportation_Light::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.ExecuteUbergraph_GCN_RezIn
// 0x01A8 (0x01A8 - 0x0000)
struct GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetSkeletalMeshesForAllParts_ReturnValue; // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0038(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x0108(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0118(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      K2Node_CustomEvent_Spawned_Teleport_In_FX;         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_CustomEvent_Drone_FX;                       // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0158(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_ApplyMaterialOverrideLocal_ReturnValue;   // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveMaterialOverrideLocal_ReturnValue;  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0198(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn) == 0x000008, "Wrong alignment on GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn");
static_assert(sizeof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn) == 0x0001A8, "Wrong size on GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, EntryPoint) == 0x000000, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, Temp_int_Variable) == 0x000004, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, CallFunc_GetSkeletalMeshesForAllParts_ReturnValue) == 0x000010, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::CallFunc_GetSkeletalMeshesForAllParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, CallFunc_Array_Get_Item) == 0x000020, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, CallFunc_IsValid_ReturnValue) == 0x00002D, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_Event_MyTarget) == 0x000030, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_Event_Parameters) == 0x000038, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_Event_ParticleComponents) == 0x000108, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_Event_AudioComponents) == 0x000118, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_Event_BurstCameraShakeInstance) == 0x000128, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_Event_BurstDecalInstance) == 0x000130, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000138, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_CustomEvent_Spawned_Teleport_In_FX) == 0x000148, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_CustomEvent_Spawned_Teleport_In_FX' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_CustomEvent_Drone_FX) == 0x000150, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_CustomEvent_Drone_FX' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000158, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, CallFunc_ApplyMaterialOverrideLocal_ReturnValue) == 0x000180, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::CallFunc_ApplyMaterialOverrideLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, CallFunc_RemoveMaterialOverrideLocal_ReturnValue) == 0x000190, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::CallFunc_RemoveMaterialOverrideLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn, K2Node_MakeArray_Array) == 0x000198, "Member 'GCN_RezIn_C_ExecuteUbergraph_GCN_RezIn::K2Node_MakeArray_Array' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.Restore Character Materials
// 0x0088 (0x0088 - 0x0000)
struct GCN_RezIn_C_Restore_Character_Materials final
{
public:
	bool                                          Fully_Completed;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentReplacementIndex;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Itr;                                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_Restore_Character_Materials) == 0x000008, "Wrong alignment on GCN_RezIn_C_Restore_Character_Materials");
static_assert(sizeof(GCN_RezIn_C_Restore_Character_Materials) == 0x000088, "Wrong size on GCN_RezIn_C_Restore_Character_Materials");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, Fully_Completed) == 0x000000, "Member 'GCN_RezIn_C_Restore_Character_Materials::Fully_Completed' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CurrentReplacementIndex) == 0x000004, "Member 'GCN_RezIn_C_Restore_Character_Materials::CurrentReplacementIndex' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, Itr) == 0x000008, "Member 'GCN_RezIn_C_Restore_Character_Materials::Itr' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'GCN_RezIn_C_Restore_Character_Materials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, Temp_int_Array_Index_Variable) == 0x000014, "Member 'GCN_RezIn_C_Restore_Character_Materials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'GCN_RezIn_C_Restore_Character_Materials::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, Temp_object_Variable) == 0x000020, "Member 'GCN_RezIn_C_Restore_Character_Materials::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, Temp_bool_Variable) == 0x000028, "Member 'GCN_RezIn_C_Restore_Character_Materials::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Array_Get_Item) == 0x000030, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, K2Node_Select_Default) == 0x000040, "Member 'GCN_RezIn_C_Restore_Character_Materials::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, Temp_int_Loop_Counter_Variable_1) == 0x000048, "Member 'GCN_RezIn_C_Restore_Character_Materials::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_GetMaterials_ReturnValue) == 0x000068, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Array_Length_ReturnValue_2) == 0x00007C, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Add_IntInt_ReturnValue_3) == 0x000080, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Restore_Character_Materials, CallFunc_Less_IntInt_ReturnValue_1) == 0x000084, "Member 'GCN_RezIn_C_Restore_Character_Materials::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.Set Additional Niagara Parameter on Drone FX
// 0x0008 (0x0008 - 0x0000)
struct GCN_RezIn_C_Set_Additional_Niagara_Parameter_on_Drone_FX final
{
public:
	class UNiagaraComponent*                      Drone_FX;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_Set_Additional_Niagara_Parameter_on_Drone_FX) == 0x000008, "Wrong alignment on GCN_RezIn_C_Set_Additional_Niagara_Parameter_on_Drone_FX");
static_assert(sizeof(GCN_RezIn_C_Set_Additional_Niagara_Parameter_on_Drone_FX) == 0x000008, "Wrong size on GCN_RezIn_C_Set_Additional_Niagara_Parameter_on_Drone_FX");
static_assert(offsetof(GCN_RezIn_C_Set_Additional_Niagara_Parameter_on_Drone_FX, Drone_FX) == 0x000000, "Member 'GCN_RezIn_C_Set_Additional_Niagara_Parameter_on_Drone_FX::Drone_FX' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.Set Additional Niagara Parameters on Spawned FX
// 0x0008 (0x0008 - 0x0000)
struct GCN_RezIn_C_Set_Additional_Niagara_Parameters_on_Spawned_FX final
{
public:
	class UNiagaraComponent*                      Spawned_Teleport_In_FX;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_Set_Additional_Niagara_Parameters_on_Spawned_FX) == 0x000008, "Wrong alignment on GCN_RezIn_C_Set_Additional_Niagara_Parameters_on_Spawned_FX");
static_assert(sizeof(GCN_RezIn_C_Set_Additional_Niagara_Parameters_on_Spawned_FX) == 0x000008, "Wrong size on GCN_RezIn_C_Set_Additional_Niagara_Parameters_on_Spawned_FX");
static_assert(offsetof(GCN_RezIn_C_Set_Additional_Niagara_Parameters_on_Spawned_FX, Spawned_Teleport_In_FX) == 0x000000, "Member 'GCN_RezIn_C_Set_Additional_Niagara_Parameters_on_Spawned_FX::Spawned_Teleport_In_FX' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.Spawn Drone VFX
// 0x0008 (0x0008 - 0x0000)
struct GCN_RezIn_C_Spawn_Drone_VFX final
{
public:
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_Spawn_Drone_VFX) == 0x000008, "Wrong alignment on GCN_RezIn_C_Spawn_Drone_VFX");
static_assert(sizeof(GCN_RezIn_C_Spawn_Drone_VFX) == 0x000008, "Wrong size on GCN_RezIn_C_Spawn_Drone_VFX");
static_assert(offsetof(GCN_RezIn_C_Spawn_Drone_VFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000000, "Member 'GCN_RezIn_C_Spawn_Drone_VFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.Spawn Teleport In VFX
// 0x0028 (0x0028 - 0x0000)
struct GCN_RezIn_C_Spawn_Teleport_In_VFX final
{
public:
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_Spawn_Teleport_In_VFX) == 0x000008, "Wrong alignment on GCN_RezIn_C_Spawn_Teleport_In_VFX");
static_assert(sizeof(GCN_RezIn_C_Spawn_Teleport_In_VFX) == 0x000028, "Wrong size on GCN_RezIn_C_Spawn_Teleport_In_VFX");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleport_In_VFX, CallFunc_GetSocketLocation_ReturnValue) == 0x000000, "Member 'GCN_RezIn_C_Spawn_Teleport_In_VFX::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleport_In_VFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000018, "Member 'GCN_RezIn_C_Spawn_Teleport_In_VFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleport_In_VFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000020, "Member 'GCN_RezIn_C_Spawn_Teleport_In_VFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.Spawn Teleportation Drone
// 0x0080 (0x0080 - 0x0000)
struct GCN_RezIn_C_Spawn_Teleportation_Drone final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0060)(IsPlainOldData, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TeleportationDrone_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_Spawn_Teleportation_Drone) == 0x000010, "Wrong alignment on GCN_RezIn_C_Spawn_Teleportation_Drone");
static_assert(sizeof(GCN_RezIn_C_Spawn_Teleportation_Drone) == 0x000080, "Wrong size on GCN_RezIn_C_Spawn_Teleportation_Drone");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Drone, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'GCN_RezIn_C_Spawn_Teleportation_Drone::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Drone, CallFunc_GetContext_ReturnValue) == 0x000060, "Member 'GCN_RezIn_C_Spawn_Teleportation_Drone::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Drone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'GCN_RezIn_C_Spawn_Teleportation_Drone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Drone, CallFunc_IsInZone_ReturnValue) == 0x000070, "Member 'GCN_RezIn_C_Spawn_Teleportation_Drone::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Drone, CallFunc_Not_PreBool_ReturnValue) == 0x000071, "Member 'GCN_RezIn_C_Spawn_Teleportation_Drone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Drone, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'GCN_RezIn_C_Spawn_Teleportation_Drone::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.Spawn Teleportation Light
// 0x00B0 (0x00B0 - 0x0000)
struct GCN_RezIn_C_Spawn_Teleportation_Light final
{
public:
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0040(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_Spawn_Teleportation_Light) == 0x000010, "Wrong alignment on GCN_RezIn_C_Spawn_Teleportation_Light");
static_assert(sizeof(GCN_RezIn_C_Spawn_Teleportation_Light) == 0x0000B0, "Wrong size on GCN_RezIn_C_Spawn_Teleportation_Light");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Light, CallFunc_GetSocketLocation_ReturnValue) == 0x000000, "Member 'GCN_RezIn_C_Spawn_Teleportation_Light::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Light, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GCN_RezIn_C_Spawn_Teleportation_Light::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Light, CallFunc_Add_VectorVector_ReturnValue) == 0x000020, "Member 'GCN_RezIn_C_Spawn_Teleportation_Light::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Light, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000040, "Member 'GCN_RezIn_C_Spawn_Teleportation_Light::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Light, CallFunc_IsMobilePlatform_ReturnValue) == 0x0000A0, "Member 'GCN_RezIn_C_Spawn_Teleportation_Light::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Spawn_Teleportation_Light, CallFunc_AddComponent_ReturnValue) == 0x0000A8, "Member 'GCN_RezIn_C_Spawn_Teleportation_Light::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.Stop Looping Audio
// 0x0002 (0x0002 - 0x0000)
struct GCN_RezIn_C_Stop_Looping_Audio final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_Stop_Looping_Audio) == 0x000001, "Wrong alignment on GCN_RezIn_C_Stop_Looping_Audio");
static_assert(sizeof(GCN_RezIn_C_Stop_Looping_Audio) == 0x000002, "Wrong size on GCN_RezIn_C_Stop_Looping_Audio");
static_assert(offsetof(GCN_RezIn_C_Stop_Looping_Audio, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCN_RezIn_C_Stop_Looping_Audio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_Stop_Looping_Audio, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'GCN_RezIn_C_Stop_Looping_Audio::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GCN_RezIn.GCN_RezIn_C.OnBurstGeneric
// 0x0108 (0x0108 - 0x0000)
struct GCN_RezIn_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_RezIn_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_RezIn_C_OnBurstGeneric");
static_assert(sizeof(GCN_RezIn_C_OnBurstGeneric) == 0x000108, "Wrong size on GCN_RezIn_C_OnBurstGeneric");
static_assert(offsetof(GCN_RezIn_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_RezIn_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_RezIn_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_OnBurstGeneric, ParticleComponents) == 0x0000D8, "Member 'GCN_RezIn_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_RezIn_C_OnBurstGeneric, AudioComponents) == 0x0000E8, "Member 'GCN_RezIn_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
