#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Bush

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_Bush.GCN_Athena_Bush_C.ExecuteUbergraph_GCN_Athena_Bush
// 0x0490 (0x0490 - 0x0000)
struct GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_2;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0088(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0170(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x0240(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0250(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0268(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x0338(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0348(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0368(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0380(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             Temp_object_Variable;                              // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush) == 0x000010, "Wrong alignment on GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush");
static_assert(sizeof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush) == 0x000490, "Wrong size on GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, EntryPoint) == 0x000000, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_GetVelocity_ReturnValue) == 0x000008, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_VSize_ReturnValue) == 0x000024, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_FClamp_ReturnValue) == 0x00002C, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000031, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_IsValid_ReturnValue_1) == 0x000032, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000038, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1) == 0x000060, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_IsLocallyControlled_ReturnValue) == 0x000069, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_DynamicCast_AsFort_Player_Pawn_Athena_2) == 0x000078, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_DynamicCast_AsFort_Player_Pawn_Athena_2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000088, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_MyTarget_1) == 0x000168, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_Parameters_1) == 0x000170, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_ParticleComponents_1) == 0x000240, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_AudioComponents_1) == 0x000250, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_MyTarget) == 0x000260, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_Parameters) == 0x000268, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_ParticleComponents) == 0x000338, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_AudioComponents) == 0x000348, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_BurstCameraShakeInstance) == 0x000358, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_BurstDecalInstance) == 0x000360, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_CreateDelegate_OutputDelegate_1) == 0x000368, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000374, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000378, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_Add_FloatFloat_ReturnValue) == 0x00037C, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_GetTransform_ReturnValue) == 0x000380, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_BreakTransform_Location) == 0x0003E0, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_BreakTransform_Rotation) == 0x0003F8, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_BreakTransform_Scale) == 0x000410, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_BreakRotator_Roll) == 0x000428, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_BreakRotator_Pitch) == 0x00042C, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_BreakRotator_Yaw) == 0x000430, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_MakeRotator_ReturnValue) == 0x000438, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, Temp_object_Variable) == 0x000450, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000458, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000460, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000468, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_DeltaSeconds) == 0x000470, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, Temp_object_Variable_1) == 0x000478, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, Temp_bool_Variable) == 0x000480, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Select_Default) == 0x000488, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Select_Default' has a wrong offset!");

// Function GCN_Athena_Bush.GCN_Athena_Bush_C.OnLoopingStart
// 0x00F8 (0x00F8 - 0x0000)
struct GCN_Athena_Bush_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Athena_Bush_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCN_Athena_Bush_C_OnLoopingStart");
static_assert(sizeof(GCN_Athena_Bush_C_OnLoopingStart) == 0x0000F8, "Wrong size on GCN_Athena_Bush_C_OnLoopingStart");
static_assert(offsetof(GCN_Athena_Bush_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCN_Athena_Bush_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCN_Athena_Bush_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnLoopingStart, ParticleComponents) == 0x0000D8, "Member 'GCN_Athena_Bush_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnLoopingStart, AudioComponents) == 0x0000E8, "Member 'GCN_Athena_Bush_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GCN_Athena_Bush.GCN_Athena_Bush_C.OnRemoval
// 0x0108 (0x0108 - 0x0000)
struct GCN_Athena_Bush_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Bush_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_Athena_Bush_C_OnRemoval");
static_assert(sizeof(GCN_Athena_Bush_C_OnRemoval) == 0x000108, "Wrong size on GCN_Athena_Bush_C_OnRemoval");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCN_Athena_Bush_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_Athena_Bush_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemoval, ParticleComponents) == 0x0000D8, "Member 'GCN_Athena_Bush_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemoval, AudioComponents) == 0x0000E8, "Member 'GCN_Athena_Bush_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemoval, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCN_Athena_Bush_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemoval, BurstDecalInstance) == 0x000100, "Member 'GCN_Athena_Bush_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCN_Athena_Bush.GCN_Athena_Bush_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCN_Athena_Bush_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Bush_C_ReceiveTick) == 0x000004, "Wrong alignment on GCN_Athena_Bush_C_ReceiveTick");
static_assert(sizeof(GCN_Athena_Bush_C_ReceiveTick) == 0x000004, "Wrong size on GCN_Athena_Bush_C_ReceiveTick");
static_assert(offsetof(GCN_Athena_Bush_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCN_Athena_Bush_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

