#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericModalButton

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GenericModalButton.GenericModalButton_C
// 0x00A0 (0x10D0 - 0x1030)
class UGenericModalButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover2;                                            // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Material;                                   // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_45;                                          // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Right_Image;                               // 0x1060(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Rich_text;                                         // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height;                                    // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_text;                                       // 0x1078(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            Text_Color;                                        // 0x1090(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_10A4[0x4];                                     // 0x10A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material_Brush;                                    // 0x10A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Right_Image;                                       // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justifiction;                                      // 0x10B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_wrap_text;                                    // 0x10B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SimpleHover;                                       // 0x10BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FontSizeOverride;                                  // 0x10BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x10BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShearText;                                         // 0x10C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_GenericModalButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBorderShowEffectWhenDisable(bool ShowEffectWhenDisabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GenericModalButton_C">();
	}
	static class UGenericModalButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericModalButton_C>();
	}
};
static_assert(alignof(UGenericModalButton_C) == 0x000010, "Wrong alignment on UGenericModalButton_C");
static_assert(sizeof(UGenericModalButton_C) == 0x0010D0, "Wrong size on UGenericModalButton_C");
static_assert(offsetof(UGenericModalButton_C, UberGraphFrame) == 0x001030, "Member 'UGenericModalButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Hover2) == 0x001038, "Member 'UGenericModalButton_C::Hover2' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Hover) == 0x001040, "Member 'UGenericModalButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Border_Material) == 0x001048, "Member 'UGenericModalButton_C::Border_Material' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Image) == 0x001050, "Member 'UGenericModalButton_C::Image' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Image_45) == 0x001058, "Member 'UGenericModalButton_C::Image_45' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Overlay_Right_Image) == 0x001060, "Member 'UGenericModalButton_C::Overlay_Right_Image' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Rich_text) == 0x001068, "Member 'UGenericModalButton_C::Rich_text' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, SizeBox_Height) == 0x001070, "Member 'UGenericModalButton_C::SizeBox_Height' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Button_text) == 0x001078, "Member 'UGenericModalButton_C::Button_text' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Text_Color) == 0x001090, "Member 'UGenericModalButton_C::Text_Color' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Material_Brush) == 0x0010A8, "Member 'UGenericModalButton_C::Material_Brush' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Right_Image) == 0x0010B0, "Member 'UGenericModalButton_C::Right_Image' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Justifiction) == 0x0010B8, "Member 'UGenericModalButton_C::Justifiction' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Auto_wrap_text) == 0x0010B9, "Member 'UGenericModalButton_C::Auto_wrap_text' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, SimpleHover) == 0x0010BA, "Member 'UGenericModalButton_C::SimpleHover' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, FontSizeOverride) == 0x0010BB, "Member 'UGenericModalButton_C::FontSizeOverride' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, FontSize) == 0x0010BC, "Member 'UGenericModalButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, ShearText) == 0x0010C0, "Member 'UGenericModalButton_C::ShearText' has a wrong offset!");

}

