#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericModalButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GenericModalButton.GenericModalButton_C.ExecuteUbergraph_GenericModalButton
// 0x00C0 (0x00C0 - 0x0000)
struct GenericModalButton_C_ExecuteUbergraph_GenericModalButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0058(0x0050)(HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShowEffectWhenDisabled;         // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton) == 0x000008, "Wrong alignment on GenericModalButton_C_ExecuteUbergraph_GenericModalButton");
static_assert(sizeof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton) == 0x0000C0, "Wrong size on GenericModalButton_C_ExecuteUbergraph_GenericModalButton");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, EntryPoint) == 0x000000, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, Temp_byte_Variable) == 0x000004, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, Temp_bool_Variable) == 0x000005, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, Temp_bool_Variable_1) == 0x000006, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, Temp_int_Variable) == 0x000008, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, Temp_bool_Variable_2) == 0x00000C, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, Temp_struct_Variable) == 0x000010, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, Temp_struct_Variable_1) == 0x000020, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, K2Node_Event_IsDesignTime) == 0x000030, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, Temp_byte_Variable_1) == 0x000031, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, K2Node_Select_Default) == 0x000038, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000040, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, K2Node_Select_Default_1) == 0x000050, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, K2Node_MakeStruct_SlateFontInfo) == 0x000058, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, K2Node_Select_Default_2) == 0x0000A8, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, Temp_bool_Variable_3) == 0x0000B8, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, K2Node_CustomEvent_ShowEffectWhenDisabled) == 0x0000B9, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::K2Node_CustomEvent_ShowEffectWhenDisabled' has a wrong offset!");
static_assert(offsetof(GenericModalButton_C_ExecuteUbergraph_GenericModalButton, K2Node_Select_Default_3) == 0x0000BA, "Member 'GenericModalButton_C_ExecuteUbergraph_GenericModalButton::K2Node_Select_Default_3' has a wrong offset!");

// Function GenericModalButton.GenericModalButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct GenericModalButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericModalButton_C_PreConstruct) == 0x000001, "Wrong alignment on GenericModalButton_C_PreConstruct");
static_assert(sizeof(GenericModalButton_C_PreConstruct) == 0x000001, "Wrong size on GenericModalButton_C_PreConstruct");
static_assert(offsetof(GenericModalButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'GenericModalButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function GenericModalButton.GenericModalButton_C.SetBorderShowEffectWhenDisable
// 0x0001 (0x0001 - 0x0000)
struct GenericModalButton_C_SetBorderShowEffectWhenDisable final
{
public:
	bool                                          ShowEffectWhenDisabled;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericModalButton_C_SetBorderShowEffectWhenDisable) == 0x000001, "Wrong alignment on GenericModalButton_C_SetBorderShowEffectWhenDisable");
static_assert(sizeof(GenericModalButton_C_SetBorderShowEffectWhenDisable) == 0x000001, "Wrong size on GenericModalButton_C_SetBorderShowEffectWhenDisable");
static_assert(offsetof(GenericModalButton_C_SetBorderShowEffectWhenDisable, ShowEffectWhenDisabled) == 0x000000, "Member 'GenericModalButton_C_SetBorderShowEffectWhenDisable::ShowEffectWhenDisabled' has a wrong offset!");

}

