#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Grapple_Gloves_Gadget_AnimBP_copied

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_AnimGraph) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_AnimGraph");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_AnimGraph) == 0x000020, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_AnimGraph");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_AnimGraph, InPose) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.BlueprintProcessAnimInputEvent
// 0x0008 (0x0008 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintProcessAnimInputEvent final
{
public:
	const class UFortAnimInputEvent*              AnimInputEvent;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintProcessAnimInputEvent) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintProcessAnimInputEvent");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintProcessAnimInputEvent) == 0x000008, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintProcessAnimInputEvent");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintProcessAnimInputEvent, AnimInputEvent) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintProcessAnimInputEvent::AnimInputEvent' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintUpdateAnimation");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintUpdateAnimation");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.CharacterSkeletalControlPostLegIK
// 0x0020 (0x0020 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_CharacterSkeletalControlPostLegIK final
{
public:
	struct FPoseLink                              InPosePostLegIK;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CharacterSkeletalControlPostLegIK_0;               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_CharacterSkeletalControlPostLegIK) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_CharacterSkeletalControlPostLegIK");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_CharacterSkeletalControlPostLegIK) == 0x000020, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_CharacterSkeletalControlPostLegIK");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_CharacterSkeletalControlPostLegIK, InPosePostLegIK) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_CharacterSkeletalControlPostLegIK::InPosePostLegIK' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_CharacterSkeletalControlPostLegIK, CharacterSkeletalControlPostLegIK_0) == 0x000010, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_CharacterSkeletalControlPostLegIK::CharacterSkeletalControlPostLegIK_0' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied
// 0x00B0 (0x00B0 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_3;    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortAnimInputEvent*              K2Node_Event_AnimInputEvent;                       // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNamed_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Ranged_WestSausage_Parallel_Athena_C* K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_4;    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_5;    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_6;    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_7;    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_8;    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_4;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_5;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_6;            // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_7;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_9;    // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied) == 0x0000B0, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, EntryPoint) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::EntryPoint' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000005, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x000015, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Less_FloatFloat_ReturnValue) == 0x000016, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, K2Node_Event_DeltaTimeX) == 0x000018, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue_3) == 0x00001C, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00001D, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, K2Node_Event_AnimInputEvent) == 0x000020, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::K2Node_Event_AnimInputEvent' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_IsNamed_ReturnValue) == 0x000028, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_IsNamed_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena) == 0x000030, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::K2Node_DynamicCast_AsB_Ranged_West_Sausage_Parallel_Athena' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000040, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_ComposeRotators_ReturnValue) == 0x000058, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000070, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue_4) == 0x000071, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanOR_ReturnValue) == 0x000072, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue_5) == 0x000073, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue_1) == 0x000074, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x000075, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue_2) == 0x000076, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Not_PreBool_ReturnValue) == 0x000077, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue_3) == 0x000078, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue_4) == 0x000079, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GetCurveValue_ReturnValue) == 0x00007C, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue_6) == 0x000080, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue_7) == 0x000081, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanOR_ReturnValue_1) == 0x000082, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue_5) == 0x000083, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GetCurveValue_ReturnValue_1) == 0x000084, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BreakVector_X) == 0x000088, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BreakVector_Y) == 0x00008C, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BreakVector_Z) == 0x000090, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue_8) == 0x000094, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Abs_ReturnValue) == 0x000098, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Abs_ReturnValue_1) == 0x00009C, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Less_FloatFloat_ReturnValue_4) == 0x0000A0, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Less_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Less_FloatFloat_ReturnValue_5) == 0x0000A1, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Less_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Less_FloatFloat_ReturnValue_6) == 0x0000A2, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Less_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue_6) == 0x0000A3, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue_7) == 0x0000A4, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue_8) == 0x0000A5, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x0000A8, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_Less_FloatFloat_ReturnValue_7) == 0x0000AC, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_Less_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_GreaterEqual_FloatFloat_ReturnValue_9) == 0x0000AD, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_GreaterEqual_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied, CallFunc_BooleanAND_ReturnValue_9) == 0x0000AE, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_ExecuteUbergraph_Grapple_Gloves_Gadget_AnimBP_copied::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.FullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_FullBodyOverride final
{
public:
	struct FPoseLink                              PassThroughFullBodyPose;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBodyOverride_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_FullBodyOverride) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_FullBodyOverride");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_FullBodyOverride) == 0x000020, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_FullBodyOverride");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_FullBodyOverride, PassThroughFullBodyPose) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_FullBodyOverride::PassThroughFullBodyPose' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_FullBodyOverride, FullBodyOverride_0) == 0x000010, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_FullBodyOverride::FullBodyOverride_0' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.SplitVector
// 0x0070 (0x0070 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector final
{
public:
	struct FVector                                Vec;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Magnitude;                                         // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Direction;                                         // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHigh;                                            // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector) == 0x000070, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector, Vec) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector::Vec' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector, Magnitude) == 0x000018, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector::Magnitude' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector, Direction) == 0x000020, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector::Direction' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector, IsHigh) == 0x000038, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector::IsHigh' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector, CallFunc_VSize_ReturnValue) == 0x00003C, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000040, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector, CallFunc_Divide_VectorVector_ReturnValue) == 0x000058, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SplitVector::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.SwingReleaseSelection_-90
// 0x0060 (0x0060 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90 final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_SetSequence_ReturnValue;                  // 0x0050(0x0010)(NoDestructor)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90) == 0x000060, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, Context) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::Context' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, Node) == 0x000010, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::Node' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000020, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000030, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, Temp_int_Variable) == 0x00003C, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, CallFunc_Array_Get_Item) == 0x000040, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90, CallFunc_SetSequence_ReturnValue) == 0x000050, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection__90::CallFunc_SetSequence_ReturnValue' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.SwingReleaseSelection_0
// 0x0060 (0x0060 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0 final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_SetSequence_ReturnValue;                  // 0x0050(0x0010)(NoDestructor)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0) == 0x000060, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, Context) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::Context' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, Node) == 0x000010, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::Node' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000020, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000030, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, Temp_int_Variable) == 0x00003C, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, CallFunc_Array_Get_Item) == 0x000040, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0, CallFunc_SetSequence_ReturnValue) == 0x000050, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_0::CallFunc_SetSequence_ReturnValue' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.SwingReleaseSelection_45
// 0x0060 (0x0060 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45 final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSequencePlayerReference               CallFunc_SetSequence_ReturnValue;                  // 0x0050(0x0010)(NoDestructor)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45) == 0x000060, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, Context) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::Context' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, Node) == 0x000010, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::Node' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000020, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000030, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, Temp_int_Variable) == 0x00003C, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, CallFunc_Array_Get_Item) == 0x000048, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45, CallFunc_SetSequence_ReturnValue) == 0x000050, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_45::CallFunc_SetSequence_ReturnValue' has a wrong offset!");

// Function Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.SwingReleaseSelection_90
// 0x0060 (0x0060 - 0x0000)
struct Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_90 final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_SetSequence_ReturnValue;                  // 0x0050(0x0010)(NoDestructor)
};
static_assert(alignof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_90) == 0x000008, "Wrong alignment on Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_90");
static_assert(sizeof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_90) == 0x000060, "Wrong size on Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_90");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_90, Context) == 0x000000, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_90::Context' has a wrong offset!");
static_assert(offsetof(Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_90, Node) == 0x000010, "Member 'Grapple_Gloves_Gadget_AnimBP_copied_C_SwingReleaseSelection_90::Node' has a wrong offset!");
