#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hamster_Ball_Veh_AnimBP_Dyn

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Hamster_Ball_Veh_AnimBP_Dyn.Hamster_Ball_Veh_AnimBP_Dyn_C.ExecuteUbergraph_Hamster_Ball_Veh_AnimBP_Dyn
// 0x0004 (0x0004 - 0x0000)
struct Hamster_Ball_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Hamster_Ball_Veh_AnimBP_Dyn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Hamster_Ball_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Hamster_Ball_Veh_AnimBP_Dyn) == 0x000004, "Wrong alignment on Hamster_Ball_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Hamster_Ball_Veh_AnimBP_Dyn");
static_assert(sizeof(Hamster_Ball_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Hamster_Ball_Veh_AnimBP_Dyn) == 0x000004, "Wrong size on Hamster_Ball_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Hamster_Ball_Veh_AnimBP_Dyn");
static_assert(offsetof(Hamster_Ball_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Hamster_Ball_Veh_AnimBP_Dyn, EntryPoint) == 0x000000, "Member 'Hamster_Ball_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Hamster_Ball_Veh_AnimBP_Dyn::EntryPoint' has a wrong offset!");

// Function Hamster_Ball_Veh_AnimBP_Dyn.Hamster_Ball_Veh_AnimBP_Dyn_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Hamster_Ball_Veh_AnimBP_Dyn_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Hamster_Ball_Veh_AnimBP_Dyn_C_AnimGraph) == 0x000008, "Wrong alignment on Hamster_Ball_Veh_AnimBP_Dyn_C_AnimGraph");
static_assert(sizeof(Hamster_Ball_Veh_AnimBP_Dyn_C_AnimGraph) == 0x000020, "Wrong size on Hamster_Ball_Veh_AnimBP_Dyn_C_AnimGraph");
static_assert(offsetof(Hamster_Ball_Veh_AnimBP_Dyn_C_AnimGraph, InPose) == 0x000000, "Member 'Hamster_Ball_Veh_AnimBP_Dyn_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(Hamster_Ball_Veh_AnimBP_Dyn_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'Hamster_Ball_Veh_AnimBP_Dyn_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

