#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hamster_Ball_Veh_AnimBP_Dyn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Hamster_Ball_Veh_AnimBP_Dyn.Hamster_Ball_Veh_AnimBP_Dyn_C
// 0x0AC0 (0x1130 - 0x0670)
class UHamster_Ball_Veh_AnimBP_Dyn_C final : public UFortOctopusVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0678(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0680(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0688(0x0020)()
	uint8                                         Pad_6A8[0x8];                                      // 0x06A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x06B0(0x0980)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1030(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x1050(0x00C0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1110(0x0020)()

public:
	void ExecuteUbergraph_Hamster_Ball_Veh_AnimBP_Dyn(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Hamster_Ball_Veh_AnimBP_Dyn_C">();
	}
	static class UHamster_Ball_Veh_AnimBP_Dyn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHamster_Ball_Veh_AnimBP_Dyn_C>();
	}
};
static_assert(alignof(UHamster_Ball_Veh_AnimBP_Dyn_C) == 0x000010, "Wrong alignment on UHamster_Ball_Veh_AnimBP_Dyn_C");
static_assert(sizeof(UHamster_Ball_Veh_AnimBP_Dyn_C) == 0x001130, "Wrong size on UHamster_Ball_Veh_AnimBP_Dyn_C");
static_assert(offsetof(UHamster_Ball_Veh_AnimBP_Dyn_C, UberGraphFrame) == 0x000670, "Member 'UHamster_Ball_Veh_AnimBP_Dyn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHamster_Ball_Veh_AnimBP_Dyn_C, AnimBlueprintExtension_PropertyAccess) == 0x000678, "Member 'UHamster_Ball_Veh_AnimBP_Dyn_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UHamster_Ball_Veh_AnimBP_Dyn_C, AnimBlueprintExtension_Base) == 0x000680, "Member 'UHamster_Ball_Veh_AnimBP_Dyn_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UHamster_Ball_Veh_AnimBP_Dyn_C, AnimGraphNode_Root) == 0x000688, "Member 'UHamster_Ball_Veh_AnimBP_Dyn_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHamster_Ball_Veh_AnimBP_Dyn_C, AnimGraphNode_RigidBody) == 0x0006B0, "Member 'UHamster_Ball_Veh_AnimBP_Dyn_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UHamster_Ball_Veh_AnimBP_Dyn_C, AnimGraphNode_LocalToComponentSpace) == 0x001030, "Member 'UHamster_Ball_Veh_AnimBP_Dyn_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UHamster_Ball_Veh_AnimBP_Dyn_C, AnimGraphNode_SubInput) == 0x001050, "Member 'UHamster_Ball_Veh_AnimBP_Dyn_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UHamster_Ball_Veh_AnimBP_Dyn_C, AnimGraphNode_ComponentToLocalSpace) == 0x001110, "Member 'UHamster_Ball_Veh_AnimBP_Dyn_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

