#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroesCamera_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HeroesCamera_Blueprint.HeroesCamera_Blueprint_C
// 0x0020 (0x09B0 - 0x0990)
class AHeroesCamera_Blueprint_C final : public AFortCameraBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0990(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          MouseDown;                                         // 0x0998(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_999[0x7];                                      // 0x0999(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        Cached_Pawn;                                       // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void InpActEvt_RightMouseButton_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_RightMouseButton_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void HandleMouseRelease();
	void HandleMousePress();
	void ExecuteUbergraph_HeroesCamera_Blueprint(int32 EntryPoint);
	void BP_OnDeactivated(class AFortPlayerController* PlayerController);
	void BP_OnActivated(class AFortPlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroesCamera_Blueprint_C">();
	}
	static class AHeroesCamera_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHeroesCamera_Blueprint_C>();
	}
};
static_assert(alignof(AHeroesCamera_Blueprint_C) == 0x000010, "Wrong alignment on AHeroesCamera_Blueprint_C");
static_assert(sizeof(AHeroesCamera_Blueprint_C) == 0x0009B0, "Wrong size on AHeroesCamera_Blueprint_C");
static_assert(offsetof(AHeroesCamera_Blueprint_C, UberGraphFrame) == 0x000990, "Member 'AHeroesCamera_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHeroesCamera_Blueprint_C, MouseDown) == 0x000998, "Member 'AHeroesCamera_Blueprint_C::MouseDown' has a wrong offset!");
static_assert(offsetof(AHeroesCamera_Blueprint_C, Cached_Pawn) == 0x0009A0, "Member 'AHeroesCamera_Blueprint_C::Cached_Pawn' has a wrong offset!");

}

