#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HidingProp_ZeroPointEnergy_SpectatorCameraModifier

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HidingProp_ZeroPointEnergy_SpectatorCameraModifier.HidingProp_ZeroPointEnergy_SpectatorCameraModifier_C
// 0x0010 (0x0058 - 0x0048)
class UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C final : public UCameraModifier
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetAmountAlongRot;                              // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UpMin;                                             // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintModifyCamera(float DeltaTime, const struct FVector& ViewLocation, const struct FRotator& ViewRotation, float FOV, struct FVector* NewViewLocation, struct FRotator* NewViewRotation, float* NewFOV);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HidingProp_ZeroPointEnergy_SpectatorCameraModifier_C">();
	}
	static class UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C>();
	}
};
static_assert(alignof(UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C) == 0x000008, "Wrong alignment on UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C");
static_assert(sizeof(UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C) == 0x000058, "Wrong size on UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C");
static_assert(offsetof(UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C, Pawn) == 0x000048, "Member 'UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C::Pawn' has a wrong offset!");
static_assert(offsetof(UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C, OffsetAmountAlongRot) == 0x000050, "Member 'UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C::OffsetAmountAlongRot' has a wrong offset!");
static_assert(offsetof(UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C, UpMin) == 0x000054, "Member 'UHidingProp_ZeroPointEnergy_SpectatorCameraModifier_C::UpMin' has a wrong offset!");

}

