#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HidingProp_CameraModifier

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HidingProp_CameraModifier.HidingProp_CameraModifier_C.BlueprintModifyCamera
// 0x00C8 (0x00C8 - 0x0000)
struct HidingProp_CameraModifier_C_BlueprintModifyCamera final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ViewLocation;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ViewRotation;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         FOV;                                               // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewViewLocation;                                   // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewViewRotation;                                   // 0x0058(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         NewFOV;                                            // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HidingProp_CameraModifier_C_BlueprintModifyCamera) == 0x000008, "Wrong alignment on HidingProp_CameraModifier_C_BlueprintModifyCamera");
static_assert(sizeof(HidingProp_CameraModifier_C_BlueprintModifyCamera) == 0x0000C8, "Wrong size on HidingProp_CameraModifier_C_BlueprintModifyCamera");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, DeltaTime) == 0x000000, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::DeltaTime' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, ViewLocation) == 0x000008, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::ViewLocation' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, ViewRotation) == 0x000020, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::ViewRotation' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, FOV) == 0x000038, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::FOV' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, NewViewLocation) == 0x000040, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::NewViewLocation' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, NewViewRotation) == 0x000058, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::NewViewRotation' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, NewFOV) == 0x000070, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::NewFOV' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_BreakVector_X) == 0x000074, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_BreakVector_Y) == 0x000078, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_BreakVector_Z) == 0x00007C, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_BreakVector_X_1) == 0x000098, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_BreakVector_Y_1) == 0x00009C, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_BreakVector_Z_1) == 0x0000A0, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A4, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_FClamp_ReturnValue) == 0x0000A8, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HidingProp_CameraModifier_C_BlueprintModifyCamera, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'HidingProp_CameraModifier_C_BlueprintModifyCamera::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

