#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HorizontalTabList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HorizontalTabList.HorizontalTabList_C
// 0x0090 (0x0500 - 0x0470)
class UHorizontalTabList_C final : public UFortTabListWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImageGamepadKeyPrompt;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageHorizRule;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               NextTabActionWrapper;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Container;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PreviousTabActionWrapper;                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TabButtonBox;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                TabButtonPadding;                                  // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	class UClass*                                 ButtonStyle;                                       // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UseButtonStyle;                                    // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowGamePadInputPrompt;                            // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowRail;                                          // 0x04D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4D3[0x1];                                      // 0x04D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinTabWidth;                                       // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceTabLabelsCollapsed;                           // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ForceTabIconsCollapsed;                            // 0x04D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4DA[0x6];                                      // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              RefreshGamepad;                                    // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 DebugButtonTypeDisplay;                            // 0x04F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DebugTabCount;                                     // 0x04F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent_0(class FName TabId);
	void CustomEvent_1(ESlateVisibility InVisibility);
	void DebugCreateTabsForDesigner();
	void ExecuteUbergraph_HorizontalTabList(int32 EntryPoint);
	void HandleOnInputMethodChanged(ECommonInputType bNewInputType);
	void HandleTabCreation(class FName TabNameID, class UCommonButtonBase* TabButton);
	void HandleTabRemoval(class FName TabNameID, class UCommonButtonBase* TabButton);
	void PreConstruct(bool IsDesignTime);
	void Previous_Visibility();
	void SetVerticalAlignment(EVerticalAlignment FillVertically);
	void UpdateGamepadKeyVisibility();
	void UpdateTabStyles(class UCommonButtonBase* ButtonWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HorizontalTabList_C">();
	}
	static class UHorizontalTabList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHorizontalTabList_C>();
	}
};
static_assert(alignof(UHorizontalTabList_C) == 0x000008, "Wrong alignment on UHorizontalTabList_C");
static_assert(sizeof(UHorizontalTabList_C) == 0x000500, "Wrong size on UHorizontalTabList_C");
static_assert(offsetof(UHorizontalTabList_C, UberGraphFrame) == 0x000470, "Member 'UHorizontalTabList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, ImageGamepadKeyPrompt) == 0x000478, "Member 'UHorizontalTabList_C::ImageGamepadKeyPrompt' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, ImageHorizRule) == 0x000480, "Member 'UHorizontalTabList_C::ImageHorizRule' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, NextTabAction) == 0x000488, "Member 'UHorizontalTabList_C::NextTabAction' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, NextTabActionWrapper) == 0x000490, "Member 'UHorizontalTabList_C::NextTabActionWrapper' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, Overlay_Container) == 0x000498, "Member 'UHorizontalTabList_C::Overlay_Container' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, PreviousTabAction) == 0x0004A0, "Member 'UHorizontalTabList_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, PreviousTabActionWrapper) == 0x0004A8, "Member 'UHorizontalTabList_C::PreviousTabActionWrapper' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, TabButtonBox) == 0x0004B0, "Member 'UHorizontalTabList_C::TabButtonBox' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, TabButtonPadding) == 0x0004B8, "Member 'UHorizontalTabList_C::TabButtonPadding' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, ButtonStyle) == 0x0004C8, "Member 'UHorizontalTabList_C::ButtonStyle' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, UseButtonStyle) == 0x0004D0, "Member 'UHorizontalTabList_C::UseButtonStyle' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, ShowGamePadInputPrompt) == 0x0004D1, "Member 'UHorizontalTabList_C::ShowGamePadInputPrompt' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, ShowRail) == 0x0004D2, "Member 'UHorizontalTabList_C::ShowRail' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, MinTabWidth) == 0x0004D4, "Member 'UHorizontalTabList_C::MinTabWidth' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, ForceTabLabelsCollapsed) == 0x0004D8, "Member 'UHorizontalTabList_C::ForceTabLabelsCollapsed' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, ForceTabIconsCollapsed) == 0x0004D9, "Member 'UHorizontalTabList_C::ForceTabIconsCollapsed' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, RefreshGamepad) == 0x0004E0, "Member 'UHorizontalTabList_C::RefreshGamepad' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, DebugButtonTypeDisplay) == 0x0004F0, "Member 'UHorizontalTabList_C::DebugButtonTypeDisplay' has a wrong offset!");
static_assert(offsetof(UHorizontalTabList_C, DebugTabCount) == 0x0004F8, "Member 'UHorizontalTabList_C::DebugTabCount' has a wrong offset!");

}

