#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDLayoutToolFireModePanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C
// 0x00F8 (0x0678 - 0x0580)
class UHUDLayoutToolFireModePanel_C final : public UHUDLayoutToolFireModePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ScreenTutorial;                                    // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnOpen;                                            // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         AutofireBox;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCheckbox_C*                        AutofireCheckbox;                                  // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ClickBlocker;                                      // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_0;                            // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CustomButton;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CustomOverlay;                                     // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DedicatedButtonBox;                                // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCheckbox_C*                        DedicatedButtonCheckbox;                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DismissDialogue;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  FireMode_AutoFire;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  FireMode_FireButton;                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  FireMode_TapToShoot;                               // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FireModeOptionTutorialMessage;                     // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ModeButtonSwitcher;                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PresetOverlay;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PresetsButton;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PreviewDescriptionText;                            // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SelectionTypeSwitcher;                             // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TapAnywhereBox;                                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCheckbox_C*                        TapAnywhereCheckbox;                               // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      TutorialConfirm;                                   // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UFireModeSelectTile_C*>          FireOptionTiles;                                   // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UFireModeSelectTile_C*                  CurSelectedTile;                                   // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MoviePlayTimer;                                    // 0x0668(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  NextPanelToPlay;                                   // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__AutofireCheckbox_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();
	void BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__DedicatedButtonCheckbox_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature();
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__TapAnywhereCheckbox_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature();
	void BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void DeselectTile(class UFireModeSelectTile_C* Tile);
	void Destruct();
	void ExecuteUbergraph_HUDLayoutToolFireModePanel(int32 EntryPoint);
	void HandleCurSelectedTile(class UFireModeSelectTile_C* Tile);
	void HandleTileButtonFocused(class UFireModeSelectTile_C* Tile);
	void HasSelectedCustomMode(bool* Value);
	void InitButtonBindings(TArray<class UHUDLayoutToolFireModeButton*>& ArrayOfFireModeButtons);
	void InitializeSelection();
	void NewTileSelected(class UFireModeSelectTile_C* Tile);
	void OnFire_Mode_Changed(EFireModeType NewFireMode);
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PlayCurFocusedTileMovie(class UFireModeSelectTile_C* CurFocusedTile);
	void PlayTileMovie();
	void SetCustomFireMode();
	void SetCustomModeVisibilities();
	void SetOpenState(bool bNewOpenState);
	void UpdateSelectButtonVisibility();

	void IsInCustomMode(bool* IsCustom) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUDLayoutToolFireModePanel_C">();
	}
	static class UHUDLayoutToolFireModePanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDLayoutToolFireModePanel_C>();
	}
};
static_assert(alignof(UHUDLayoutToolFireModePanel_C) == 0x000008, "Wrong alignment on UHUDLayoutToolFireModePanel_C");
static_assert(sizeof(UHUDLayoutToolFireModePanel_C) == 0x000678, "Wrong size on UHUDLayoutToolFireModePanel_C");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, UberGraphFrame) == 0x000580, "Member 'UHUDLayoutToolFireModePanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, ScreenTutorial) == 0x000588, "Member 'UHUDLayoutToolFireModePanel_C::ScreenTutorial' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, OnOpen) == 0x000590, "Member 'UHUDLayoutToolFireModePanel_C::OnOpen' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, AutofireBox) == 0x000598, "Member 'UHUDLayoutToolFireModePanel_C::AutofireBox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, AutofireCheckbox) == 0x0005A0, "Member 'UHUDLayoutToolFireModePanel_C::AutofireCheckbox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, ClickBlocker) == 0x0005A8, "Member 'UHUDLayoutToolFireModePanel_C::ClickBlocker' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, CommonWidgetSwitcher_0) == 0x0005B0, "Member 'UHUDLayoutToolFireModePanel_C::CommonWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, CustomButton) == 0x0005B8, "Member 'UHUDLayoutToolFireModePanel_C::CustomButton' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, CustomOverlay) == 0x0005C0, "Member 'UHUDLayoutToolFireModePanel_C::CustomOverlay' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, DedicatedButtonBox) == 0x0005C8, "Member 'UHUDLayoutToolFireModePanel_C::DedicatedButtonBox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, DedicatedButtonCheckbox) == 0x0005D0, "Member 'UHUDLayoutToolFireModePanel_C::DedicatedButtonCheckbox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, DismissDialogue) == 0x0005D8, "Member 'UHUDLayoutToolFireModePanel_C::DismissDialogue' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireMode_AutoFire) == 0x0005E0, "Member 'UHUDLayoutToolFireModePanel_C::FireMode_AutoFire' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireMode_FireButton) == 0x0005E8, "Member 'UHUDLayoutToolFireModePanel_C::FireMode_FireButton' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireMode_TapToShoot) == 0x0005F0, "Member 'UHUDLayoutToolFireModePanel_C::FireMode_TapToShoot' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireModeOptionTutorialMessage) == 0x0005F8, "Member 'UHUDLayoutToolFireModePanel_C::FireModeOptionTutorialMessage' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, ModeButtonSwitcher) == 0x000600, "Member 'UHUDLayoutToolFireModePanel_C::ModeButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, PresetOverlay) == 0x000608, "Member 'UHUDLayoutToolFireModePanel_C::PresetOverlay' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, PresetsButton) == 0x000610, "Member 'UHUDLayoutToolFireModePanel_C::PresetsButton' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, PreviewDescriptionText) == 0x000618, "Member 'UHUDLayoutToolFireModePanel_C::PreviewDescriptionText' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, SafeZone_0) == 0x000620, "Member 'UHUDLayoutToolFireModePanel_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, SelectionTypeSwitcher) == 0x000628, "Member 'UHUDLayoutToolFireModePanel_C::SelectionTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, TapAnywhereBox) == 0x000630, "Member 'UHUDLayoutToolFireModePanel_C::TapAnywhereBox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, TapAnywhereCheckbox) == 0x000638, "Member 'UHUDLayoutToolFireModePanel_C::TapAnywhereCheckbox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, TextDescription) == 0x000640, "Member 'UHUDLayoutToolFireModePanel_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, TutorialConfirm) == 0x000648, "Member 'UHUDLayoutToolFireModePanel_C::TutorialConfirm' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireOptionTiles) == 0x000650, "Member 'UHUDLayoutToolFireModePanel_C::FireOptionTiles' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, CurSelectedTile) == 0x000660, "Member 'UHUDLayoutToolFireModePanel_C::CurSelectedTile' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, MoviePlayTimer) == 0x000668, "Member 'UHUDLayoutToolFireModePanel_C::MoviePlayTimer' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, NextPanelToPlay) == 0x000670, "Member 'UHUDLayoutToolFireModePanel_C::NextPanelToPlay' has a wrong offset!");

}

