#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InfoFlag

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InfoFlag.InfoFlag_C
// 0x0070 (0x0328 - 0x02B8)
class UInfoFlag_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_Gradient;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_114;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Trim;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           TrimColor;                                         // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GradientColor;                                     // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TrimWidth;                                         // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InfoText;                                          // 0x0308(0x0018)(Edit, BlueprintVisible)
	float                                         GradientDistance;                                  // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxWidth;                                          // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTrimColor(const struct FLinearColor& Color);
	void UpdateText(const class FText& Text);
	void UpdateGradientColor(const struct FLinearColor& Color);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_InfoFlag(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InfoFlag_C">();
	}
	static class UInfoFlag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInfoFlag_C>();
	}
};
static_assert(alignof(UInfoFlag_C) == 0x000008, "Wrong alignment on UInfoFlag_C");
static_assert(sizeof(UInfoFlag_C) == 0x000328, "Wrong size on UInfoFlag_C");
static_assert(offsetof(UInfoFlag_C, UberGraphFrame) == 0x0002B8, "Member 'UInfoFlag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, BG_Gradient) == 0x0002C0, "Member 'UInfoFlag_C::BG_Gradient' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, CommonRichTextBlock_114) == 0x0002C8, "Member 'UInfoFlag_C::CommonRichTextBlock_114' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, SizeBox_0) == 0x0002D0, "Member 'UInfoFlag_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, Trim) == 0x0002D8, "Member 'UInfoFlag_C::Trim' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, TrimColor) == 0x0002E0, "Member 'UInfoFlag_C::TrimColor' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, GradientColor) == 0x0002F0, "Member 'UInfoFlag_C::GradientColor' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, TrimWidth) == 0x000300, "Member 'UInfoFlag_C::TrimWidth' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, InfoText) == 0x000308, "Member 'UInfoFlag_C::InfoText' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, GradientDistance) == 0x000320, "Member 'UInfoFlag_C::GradientDistance' has a wrong offset!");
static_assert(offsetof(UInfoFlag_C, MaxWidth) == 0x000324, "Member 'UInfoFlag_C::MaxWidth' has a wrong offset!");

}

