#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameSocialUserWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InGameSocialUserWidget.InGameSocialUserWidget_C
// 0x0060 (0x0440 - 0x03E0)
class UInGameSocialUserWidget_C final : public UAthenaIGMPartyMemberWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ready;                                             // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected_Effect;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_AvatarExtension;                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PartyLeaderIcon;                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox_Shadow;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_ItemSize;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Readiness;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          notPlayer;                                         // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_HandleExtensionWidgetCreated(class UUserWidget* Widget, EUIExtensionSlot SlotType);
	void ExecuteUbergraph_InGameSocialUserWidget(int32 EntryPoint);
	void OnIsPartyLeaderChanged(bool bIsPartyLeader);
	void OnNewReadiness(EGameReadiness GameReadiness);
	void OnUserSet();
	void OnWidgetReset();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGameSocialUserWidget_C">();
	}
	static class UInGameSocialUserWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInGameSocialUserWidget_C>();
	}
};
static_assert(alignof(UInGameSocialUserWidget_C) == 0x000008, "Wrong alignment on UInGameSocialUserWidget_C");
static_assert(sizeof(UInGameSocialUserWidget_C) == 0x000440, "Wrong size on UInGameSocialUserWidget_C");
static_assert(offsetof(UInGameSocialUserWidget_C, UberGraphFrame) == 0x0003E0, "Member 'UInGameSocialUserWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Ready) == 0x0003E8, "Member 'UInGameSocialUserWidget_C::Ready' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Selected) == 0x0003F0, "Member 'UInGameSocialUserWidget_C::Selected' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Image_Selected) == 0x0003F8, "Member 'UInGameSocialUserWidget_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Image_Selected_Effect) == 0x000400, "Member 'UInGameSocialUserWidget_C::Image_Selected_Effect' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Overlay_AvatarExtension) == 0x000408, "Member 'UInGameSocialUserWidget_C::Overlay_AvatarExtension' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Overlay_PartyLeaderIcon) == 0x000410, "Member 'UInGameSocialUserWidget_C::Overlay_PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, ReadyCheckBox) == 0x000418, "Member 'UInGameSocialUserWidget_C::ReadyCheckBox' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, ReadyCheckBox_Shadow) == 0x000420, "Member 'UInGameSocialUserWidget_C::ReadyCheckBox_Shadow' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, ScaleBox_ItemSize) == 0x000428, "Member 'UInGameSocialUserWidget_C::ScaleBox_ItemSize' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, Text_Readiness) == 0x000430, "Member 'UInGameSocialUserWidget_C::Text_Readiness' has a wrong offset!");
static_assert(offsetof(UInGameSocialUserWidget_C, notPlayer) == 0x000438, "Member 'UInGameSocialUserWidget_C::notPlayer' has a wrong offset!");

}

