#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InLobbySocialUserWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InLobbySocialUserWidget.InLobbySocialUserWidget_C
// 0x0058 (0x0438 - 0x03E0)
class UInLobbySocialUserWidget_C final : public UAthenaIGMPartyMemberWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ready;                                             // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_ReadyState;                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected_Effect;                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PartyLeaderIcon;                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox_Shadow;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Location;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Readiness;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InLobbySocialUserWidget(int32 EntryPoint);
	void OnIsPartyLeaderChanged(bool bIsPartyLeader);
	void OnNewLocation(EFortPartyMemberLocation NewLocation);
	void OnNewReadiness(EGameReadiness GameReadiness);
	void OnUserSet();
	void OnWidgetReset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InLobbySocialUserWidget_C">();
	}
	static class UInLobbySocialUserWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInLobbySocialUserWidget_C>();
	}
};
static_assert(alignof(UInLobbySocialUserWidget_C) == 0x000008, "Wrong alignment on UInLobbySocialUserWidget_C");
static_assert(sizeof(UInLobbySocialUserWidget_C) == 0x000438, "Wrong size on UInLobbySocialUserWidget_C");
static_assert(offsetof(UInLobbySocialUserWidget_C, UberGraphFrame) == 0x0003E0, "Member 'UInLobbySocialUserWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, Ready) == 0x0003E8, "Member 'UInLobbySocialUserWidget_C::Ready' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, CommonWidgetSwitcher_ReadyState) == 0x0003F0, "Member 'UInLobbySocialUserWidget_C::CommonWidgetSwitcher_ReadyState' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, Image_BG) == 0x0003F8, "Member 'UInLobbySocialUserWidget_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, Image_Selected) == 0x000400, "Member 'UInLobbySocialUserWidget_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, Image_Selected_Effect) == 0x000408, "Member 'UInLobbySocialUserWidget_C::Image_Selected_Effect' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, Overlay_PartyLeaderIcon) == 0x000410, "Member 'UInLobbySocialUserWidget_C::Overlay_PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, ReadyCheckBox) == 0x000418, "Member 'UInLobbySocialUserWidget_C::ReadyCheckBox' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, ReadyCheckBox_Shadow) == 0x000420, "Member 'UInLobbySocialUserWidget_C::ReadyCheckBox_Shadow' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, Text_Location) == 0x000428, "Member 'UInLobbySocialUserWidget_C::Text_Location' has a wrong offset!");
static_assert(offsetof(UInLobbySocialUserWidget_C, Text_Readiness) == 0x000430, "Member 'UInLobbySocialUserWidget_C::Text_Readiness' has a wrong offset!");

}

