#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputBlockedWarning

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function InputBlockedWarning.InputBlockedWarning_C.ExecuteUbergraph_InputBlockedWarning
// 0x0068 (0x0068 - 0x0000)
struct InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType AttemptedInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_AttemptedInput;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetInputTypeIcon_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning) == 0x000008, "Wrong alignment on InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning");
static_assert(sizeof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning) == 0x000068, "Wrong size on InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, EntryPoint) == 0x000000, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, K2Node_CustomEvent_AttemptedInput) == 0x000031, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::K2Node_CustomEvent_AttemptedInput' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, CallFunc_GetInputTypeIcon_ReturnValue) == 0x000038, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::CallFunc_GetInputTypeIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000041, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'InputBlockedWarning_C_ExecuteUbergraph_InputBlockedWarning::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function InputBlockedWarning.InputBlockedWarning_C.InputFiltered
// 0x0001 (0x0001 - 0x0000)
struct InputBlockedWarning_C_InputFiltered final
{
public:
	ECommonInputType                              AttemptedInput;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlockedWarning_C_InputFiltered) == 0x000001, "Wrong alignment on InputBlockedWarning_C_InputFiltered");
static_assert(sizeof(InputBlockedWarning_C_InputFiltered) == 0x000001, "Wrong size on InputBlockedWarning_C_InputFiltered");
static_assert(offsetof(InputBlockedWarning_C_InputFiltered, AttemptedInput) == 0x000000, "Member 'InputBlockedWarning_C_InputFiltered::AttemptedInput' has a wrong offset!");

}

