#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InviteListEntry_FriendInvite_XS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InviteListEntry_FriendInvite_XS.InviteListEntry_FriendInvite_XS_C
// 0x0070 (0x1120 - 0x10B0)
class UInviteListEntry_FriendInvite_XS_C final : public UFortConnectionsUserListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x10B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x10C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x10C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x10D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x10D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x10E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_SentRequest;                                  // 0x10E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Online;                                            // 0x10F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Offline;                                           // 0x1100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Away;                                              // 0x1110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_InviteListEntry_FriendInvite_XS(int32 EntryPoint);
	void HandleOnlineIndicatorView(uint8 OnlineStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InviteListEntry_FriendInvite_XS_C">();
	}
	static class UInviteListEntry_FriendInvite_XS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInviteListEntry_FriendInvite_XS_C>();
	}
};
static_assert(alignof(UInviteListEntry_FriendInvite_XS_C) == 0x000010, "Wrong alignment on UInviteListEntry_FriendInvite_XS_C");
static_assert(sizeof(UInviteListEntry_FriendInvite_XS_C) == 0x001120, "Wrong size on UInviteListEntry_FriendInvite_XS_C");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, UberGraphFrame) == 0x0010B0, "Member 'UInviteListEntry_FriendInvite_XS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, Selected) == 0x0010B8, "Member 'UInviteListEntry_FriendInvite_XS_C::Selected' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, Hovered) == 0x0010C0, "Member 'UInviteListEntry_FriendInvite_XS_C::Hovered' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, Arrow) == 0x0010C8, "Member 'UInviteListEntry_FriendInvite_XS_C::Arrow' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, Border_OnlineStatusIndicator) == 0x0010D0, "Member 'UInviteListEntry_FriendInvite_XS_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, EmptyButtonToEatOneMouseUpEvent) == 0x0010D8, "Member 'UInviteListEntry_FriendInvite_XS_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, EntryBorder) == 0x0010E0, "Member 'UInviteListEntry_FriendInvite_XS_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, Text_SentRequest) == 0x0010E8, "Member 'UInviteListEntry_FriendInvite_XS_C::Text_SentRequest' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, Online) == 0x0010F0, "Member 'UInviteListEntry_FriendInvite_XS_C::Online' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, Offline) == 0x001100, "Member 'UInviteListEntry_FriendInvite_XS_C::Offline' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_FriendInvite_XS_C, Away) == 0x001110, "Member 'UInviteListEntry_FriendInvite_XS_C::Away' has a wrong offset!");

}

