#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemOnPawnPreview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ItemOnPawnPreview.ItemOnPawnPreview_C.SwitchPCLighting
// 0x0001 (0x0001 - 0x0000)
struct ItemOnPawnPreview_C_SwitchPCLighting final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemOnPawnPreview_C_SwitchPCLighting) == 0x000001, "Wrong alignment on ItemOnPawnPreview_C_SwitchPCLighting");
static_assert(sizeof(ItemOnPawnPreview_C_SwitchPCLighting) == 0x000001, "Wrong size on ItemOnPawnPreview_C_SwitchPCLighting");
static_assert(offsetof(ItemOnPawnPreview_C_SwitchPCLighting, Visibility) == 0x000000, "Member 'ItemOnPawnPreview_C_SwitchPCLighting::Visibility' has a wrong offset!");

// Function ItemOnPawnPreview.ItemOnPawnPreview_C.SwitchMobileLighting
// 0x0001 (0x0001 - 0x0000)
struct ItemOnPawnPreview_C_SwitchMobileLighting final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemOnPawnPreview_C_SwitchMobileLighting) == 0x000001, "Wrong alignment on ItemOnPawnPreview_C_SwitchMobileLighting");
static_assert(sizeof(ItemOnPawnPreview_C_SwitchMobileLighting) == 0x000001, "Wrong size on ItemOnPawnPreview_C_SwitchMobileLighting");
static_assert(offsetof(ItemOnPawnPreview_C_SwitchMobileLighting, NewParam) == 0x000000, "Member 'ItemOnPawnPreview_C_SwitchMobileLighting::NewParam' has a wrong offset!");

// Function ItemOnPawnPreview.ItemOnPawnPreview_C.SwitchErebusLighting
// 0x0018 (0x0018 - 0x0000)
struct ItemOnPawnPreview_C_SwitchErebusLighting final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USpotLightComponent*>            l_lights;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
static_assert(alignof(ItemOnPawnPreview_C_SwitchErebusLighting) == 0x000008, "Wrong alignment on ItemOnPawnPreview_C_SwitchErebusLighting");
static_assert(sizeof(ItemOnPawnPreview_C_SwitchErebusLighting) == 0x000018, "Wrong size on ItemOnPawnPreview_C_SwitchErebusLighting");
static_assert(offsetof(ItemOnPawnPreview_C_SwitchErebusLighting, Visibility) == 0x000000, "Member 'ItemOnPawnPreview_C_SwitchErebusLighting::Visibility' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_SwitchErebusLighting, l_lights) == 0x000008, "Member 'ItemOnPawnPreview_C_SwitchErebusLighting::l_lights' has a wrong offset!");

// Function ItemOnPawnPreview.ItemOnPawnPreview_C.SetFloorEnabled
// 0x0002 (0x0002 - 0x0000)
struct ItemOnPawnPreview_C_SetFloorEnabled final
{
public:
	bool                                          Show_Floor;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemOnPawnPreview_C_SetFloorEnabled) == 0x000001, "Wrong alignment on ItemOnPawnPreview_C_SetFloorEnabled");
static_assert(sizeof(ItemOnPawnPreview_C_SetFloorEnabled) == 0x000002, "Wrong size on ItemOnPawnPreview_C_SetFloorEnabled");
static_assert(offsetof(ItemOnPawnPreview_C_SetFloorEnabled, Show_Floor) == 0x000000, "Member 'ItemOnPawnPreview_C_SetFloorEnabled::Show_Floor' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_SetFloorEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'ItemOnPawnPreview_C_SetFloorEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ItemOnPawnPreview.ItemOnPawnPreview_C.OnUpdateFloorMaterial
// 0x0001 (0x0001 - 0x0000)
struct ItemOnPawnPreview_C_OnUpdateFloorMaterial final
{
public:
	bool                                          bEnableAutotestBackground;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemOnPawnPreview_C_OnUpdateFloorMaterial) == 0x000001, "Wrong alignment on ItemOnPawnPreview_C_OnUpdateFloorMaterial");
static_assert(sizeof(ItemOnPawnPreview_C_OnUpdateFloorMaterial) == 0x000001, "Wrong size on ItemOnPawnPreview_C_OnUpdateFloorMaterial");
static_assert(offsetof(ItemOnPawnPreview_C_OnUpdateFloorMaterial, bEnableAutotestBackground) == 0x000000, "Member 'ItemOnPawnPreview_C_OnUpdateFloorMaterial::bEnableAutotestBackground' has a wrong offset!");

// Function ItemOnPawnPreview.ItemOnPawnPreview_C.OnSetFloorMaterial
// 0x0008 (0x0008 - 0x0000)
struct ItemOnPawnPreview_C_OnSetFloorMaterial final
{
public:
	class UMaterialInterface*                     InMaterialInstance;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemOnPawnPreview_C_OnSetFloorMaterial) == 0x000008, "Wrong alignment on ItemOnPawnPreview_C_OnSetFloorMaterial");
static_assert(sizeof(ItemOnPawnPreview_C_OnSetFloorMaterial) == 0x000008, "Wrong size on ItemOnPawnPreview_C_OnSetFloorMaterial");
static_assert(offsetof(ItemOnPawnPreview_C_OnSetFloorMaterial, InMaterialInstance) == 0x000000, "Member 'ItemOnPawnPreview_C_OnSetFloorMaterial::InMaterialInstance' has a wrong offset!");

// Function ItemOnPawnPreview.ItemOnPawnPreview_C.OnPreviewVisualsSpawned
// 0x0002 (0x0002 - 0x0000)
struct ItemOnPawnPreview_C_OnPreviewVisualsSpawned final
{
public:
	bool                                          bUseSecondaryTransitionEffects;                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowFloor;                                        // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemOnPawnPreview_C_OnPreviewVisualsSpawned) == 0x000001, "Wrong alignment on ItemOnPawnPreview_C_OnPreviewVisualsSpawned");
static_assert(sizeof(ItemOnPawnPreview_C_OnPreviewVisualsSpawned) == 0x000002, "Wrong size on ItemOnPawnPreview_C_OnPreviewVisualsSpawned");
static_assert(offsetof(ItemOnPawnPreview_C_OnPreviewVisualsSpawned, bUseSecondaryTransitionEffects) == 0x000000, "Member 'ItemOnPawnPreview_C_OnPreviewVisualsSpawned::bUseSecondaryTransitionEffects' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_OnPreviewVisualsSpawned, bShowFloor) == 0x000001, "Member 'ItemOnPawnPreview_C_OnPreviewVisualsSpawned::bShowFloor' has a wrong offset!");

// Function ItemOnPawnPreview.ItemOnPawnPreview_C.LightControl
// 0x0028 (0x0028 - 0x0000)
struct ItemOnPawnPreview_C_LightControl final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameUserSettings*                  CallFunc_GetFortGameUserSettings_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPerformanceMode_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue_1;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemOnPawnPreview_C_LightControl) == 0x000008, "Wrong alignment on ItemOnPawnPreview_C_LightControl");
static_assert(sizeof(ItemOnPawnPreview_C_LightControl) == 0x000028, "Wrong size on ItemOnPawnPreview_C_LightControl");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, Active) == 0x000000, "Member 'ItemOnPawnPreview_C_LightControl::Active' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_IsErebus_ReturnValue) == 0x000001, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_GetFortGameUserSettings_ReturnValue) == 0x000008, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_GetFortGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_IsMobileGame_ReturnValue) == 0x000010, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_IsInPerformanceMode_ReturnValue) == 0x000011, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_IsInPerformanceMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_BooleanOR_ReturnValue_1) == 0x000013, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_IsErebus_ReturnValue_1) == 0x000014, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_IsErebus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_GetShadowQuality_ReturnValue) == 0x000020, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_BooleanOR_ReturnValue_2) == 0x000025, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_LightControl, CallFunc_BooleanOR_ReturnValue_3) == 0x000026, "Member 'ItemOnPawnPreview_C_LightControl::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function ItemOnPawnPreview.ItemOnPawnPreview_C.ExecuteUbergraph_ItemOnPawnPreview
// 0x0108 (0x0108 - 0x0000)
struct ItemOnPawnPreview_C_ExecuteUbergraph_ItemOnPawnPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUseSecondaryTransitionEffects;       // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowFloor;                           // 0x0006(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPawnLocation_ReturnValue;              // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Event_InMaterialInstance;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaSkyDiveContrailItemDefinition*   K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameUserSettings*                  CallFunc_GetFortGameUserSettings_ReturnValue;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPerformanceMode_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnableAutotestBackground;            // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemOnPawnPreview_C_ExecuteUbergraph_ItemOnPawnPreview) == 0x000008, "Wrong alignment on ItemOnPawnPreview_C_ExecuteUbergraph_ItemOnPawnPreview");
static_assert(sizeof(ItemOnPawnPreview_C_ExecuteUbergraph_ItemOnPawnPreview) == 0x000108, "Wrong size on ItemOnPawnPreview_C_ExecuteUbergraph_ItemOnPawnPreview");
static_assert(offsetof(ItemOnPawnPreview_C_ExecuteUbergraph_ItemOnPawnPreview, EntryPoint) == 0x000000, "Member 'ItemOnPawnPreview_C_ExecuteUbergraph_ItemOnPawnPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemOnPawnPreview_C_ExecuteUbergraph_ItemOnPawnPreview, Temp_bool_Variable) == 0x000004, "Member 'ItemOnPawnPreview_C_ExecuteUbergraph_ItemOnPawnPreview::Temp_bool_Variable' has a wrong offset!");
