#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JoinRequestUserListEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass JoinRequestUserListEntry.JoinRequestUserListEntry_C
// 0x0060 (0x1130 - 0x10D0)
class UJoinRequestUserListEntry_C final : public UFortSocialUserListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x10D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x10E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x10E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x10F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   JoinRequest;                                       // 0x10F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x1100(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x1108(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x1110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x1120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_JoinRequestUserListEntry(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JoinRequestUserListEntry_C">();
	}
	static class UJoinRequestUserListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoinRequestUserListEntry_C>();
	}
};
static_assert(alignof(UJoinRequestUserListEntry_C) == 0x000010, "Wrong alignment on UJoinRequestUserListEntry_C");
static_assert(sizeof(UJoinRequestUserListEntry_C) == 0x001130, "Wrong size on UJoinRequestUserListEntry_C");
static_assert(offsetof(UJoinRequestUserListEntry_C, UberGraphFrame) == 0x0010D0, "Member 'UJoinRequestUserListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJoinRequestUserListEntry_C, Selected) == 0x0010D8, "Member 'UJoinRequestUserListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UJoinRequestUserListEntry_C, Hovered) == 0x0010E0, "Member 'UJoinRequestUserListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UJoinRequestUserListEntry_C, Arrow) == 0x0010E8, "Member 'UJoinRequestUserListEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(UJoinRequestUserListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x0010F0, "Member 'UJoinRequestUserListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UJoinRequestUserListEntry_C, JoinRequest) == 0x0010F8, "Member 'UJoinRequestUserListEntry_C::JoinRequest' has a wrong offset!");
static_assert(offsetof(UJoinRequestUserListEntry_C, Text_DisplayName) == 0x001100, "Member 'UJoinRequestUserListEntry_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(UJoinRequestUserListEntry_C, UserActionMenuInputButton) == 0x001108, "Member 'UJoinRequestUserListEntry_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(UJoinRequestUserListEntry_C, EncourageEpicFriend_IdleColor) == 0x001110, "Member 'UJoinRequestUserListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(UJoinRequestUserListEntry_C, EncourageEpicFriend_HoveredColor) == 0x001120, "Member 'UJoinRequestUserListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

