#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillerHealthAndShield

#include "Basic.hpp"


namespace SDK::Params
{

// Function KillerHealthAndShield.KillerHealthAndShield_C.ExecuteUbergraph_KillerHealthAndShield
// 0x0058 (0x0058 - 0x0000)
struct KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Health_PCT;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Shield_PCT;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0030(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield) == 0x000008, "Wrong alignment on KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield");
static_assert(sizeof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield) == 0x000058, "Wrong size on KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, EntryPoint) == 0x000000, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, K2Node_CustomEvent_Health_PCT) == 0x000004, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::K2Node_CustomEvent_Health_PCT' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, K2Node_CustomEvent_Shield_PCT) == 0x000008, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::K2Node_CustomEvent_Shield_PCT' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000014, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, CallFunc_Conv_FloatToText_ReturnValue) == 0x000018, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000030, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000050, "Member 'KillerHealthAndShield_C_ExecuteUbergraph_KillerHealthAndShield::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function KillerHealthAndShield.KillerHealthAndShield_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct KillerHealthAndShield_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillerHealthAndShield_C_PreConstruct) == 0x000001, "Wrong alignment on KillerHealthAndShield_C_PreConstruct");
static_assert(sizeof(KillerHealthAndShield_C_PreConstruct) == 0x000001, "Wrong size on KillerHealthAndShield_C_PreConstruct");
static_assert(offsetof(KillerHealthAndShield_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'KillerHealthAndShield_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function KillerHealthAndShield.KillerHealthAndShield_C.Set Health And Shield
// 0x0008 (0x0008 - 0x0000)
struct KillerHealthAndShield_C_Set_Health_And_Shield final
{
public:
	float                                         Health_PCT;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shield_PCT;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillerHealthAndShield_C_Set_Health_And_Shield) == 0x000004, "Wrong alignment on KillerHealthAndShield_C_Set_Health_And_Shield");
static_assert(sizeof(KillerHealthAndShield_C_Set_Health_And_Shield) == 0x000008, "Wrong size on KillerHealthAndShield_C_Set_Health_And_Shield");
static_assert(offsetof(KillerHealthAndShield_C_Set_Health_And_Shield, Health_PCT) == 0x000000, "Member 'KillerHealthAndShield_C_Set_Health_And_Shield::Health_PCT' has a wrong offset!");
static_assert(offsetof(KillerHealthAndShield_C_Set_Health_And_Shield, Shield_PCT) == 0x000004, "Member 'KillerHealthAndShield_C_Set_Health_And_Shield::Shield_PCT' has a wrong offset!");

}

