#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LatencyContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LatencyContainer.LatencyContainer_C
// 0x0028 (0x0348 - 0x0320)
class ULatencyContainer_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULatencyGraph_C*                        LatencyGraph;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULatencyUI_C*                           LatencyUI;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_LatencyContainer(int32 EntryPoint);
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LatencyContainer_C">();
	}
	static class ULatencyContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULatencyContainer_C>();
	}
};
static_assert(alignof(ULatencyContainer_C) == 0x000008, "Wrong alignment on ULatencyContainer_C");
static_assert(sizeof(ULatencyContainer_C) == 0x000348, "Wrong size on ULatencyContainer_C");
static_assert(offsetof(ULatencyContainer_C, UberGraphFrame) == 0x000320, "Member 'ULatencyContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULatencyContainer_C, InvalidationBox_0) == 0x000328, "Member 'ULatencyContainer_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(ULatencyContainer_C, LatencyGraph) == 0x000330, "Member 'ULatencyContainer_C::LatencyGraph' has a wrong offset!");
static_assert(offsetof(ULatencyContainer_C, LatencyUI) == 0x000338, "Member 'ULatencyContainer_C::LatencyUI' has a wrong offset!");
static_assert(offsetof(ULatencyContainer_C, SizeBox_0) == 0x000340, "Member 'ULatencyContainer_C::SizeBox_0' has a wrong offset!");

}

