#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaveButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaveButton.LeaveButton_C
// 0x0108 (0x03E8 - 0x02E0)
class ULeaveButton_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      Leave;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool Visibility)> Update_Visibility;                                 // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 ButtonStyleOverride;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ControllerStyleOverride;                           // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseButtoneStyleOverride;                           // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideButtonText;                                // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonTextOverride;                                // 0x0328(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   HordModeLeaveDescription;                          // 0x0340(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MissionLeaveDescriptionAlone;                      // 0x0358(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MissionLeaveDescriptionParty;                      // 0x0370(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StormshieldLeaveDescriptionAlone;                  // 0x0388(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StormshieldLeaveDescriptionParty;                  // 0x03A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StormshieldLeaveTitle;                             // 0x03B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ULeaveDialog_C*                         LeaveDialog;                                       // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              LeaveDialogCancelled;                              // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BindDelegates();
	void BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Change_Main_Menu_Music_State();
	void ClearLeaveDialogDelegate();
	void Construct();
	void Destruct();
	void DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B(EFortDialogResult Result, class FName ResultName);
	void DialogResult_F5AF58094777CFEEC0BF28BEA620800C(EFortDialogResult Result, class FName ResultName);
	void ExecuteUbergraph_LeaveButton(int32 EntryPoint);
	void GetBRConfirmationDialogText(class FText* TitleText, class FText* MessagText);
	void GetButton(class UIconTextButton_C** Leave_0);
	void GetDescriptionText(class FText* DescriptionText);
	void GetLeaveActionText(class FText* Text);
	void GetSTWConfirmationDialogText(bool bIsInNeighborhood, class FText* OutTitle, class FText* OutDescription, bool* bOutIsInParty);
	void GetSTWOutpostConfirmationDialogText(class FText* OutTitle, class FText* OutDescription);
	void HandleCanceled();
	void HandleLeft();
	void HandleLobbyEvents();
	void HandlePlayerStateChanged(const struct FFortTeamMemberInfo& TeamMemberInfo);
	void HandleTeamMemberAdded(const struct FFortTeamMemberInfo& NewTeamMemberInfo);
	void HandleTeamMemberRemoved(int32 PlayerIndex);
	void HasUnsavedQuestProgress(bool* HasUnsavedQuestProgress_0);
	void IsConsideredInGame(bool* InGame);
	void IsInNeighborhood(bool* bIsInNeighborhood);
	void LeaveParty();
	void PerformLeave();
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& TextOverride);
	void ShowLeaveScreen();
	void UnbindDelegates();
	void Update_Style_State();
	void UpdateState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaveButton_C">();
	}
	static class ULeaveButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaveButton_C>();
	}
};
static_assert(alignof(ULeaveButton_C) == 0x000008, "Wrong alignment on ULeaveButton_C");
static_assert(sizeof(ULeaveButton_C) == 0x0003E8, "Wrong size on ULeaveButton_C");
static_assert(offsetof(ULeaveButton_C, UberGraphFrame) == 0x0002E0, "Member 'ULeaveButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, Leave) == 0x0002E8, "Member 'ULeaveButton_C::Leave' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, OnClicked) == 0x0002F0, "Member 'ULeaveButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, Update_Visibility) == 0x000300, "Member 'ULeaveButton_C::Update_Visibility' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, ButtonStyleOverride) == 0x000310, "Member 'ULeaveButton_C::ButtonStyleOverride' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, ControllerStyleOverride) == 0x000318, "Member 'ULeaveButton_C::ControllerStyleOverride' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, UseButtoneStyleOverride) == 0x000320, "Member 'ULeaveButton_C::UseButtoneStyleOverride' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, OverrideButtonText) == 0x000321, "Member 'ULeaveButton_C::OverrideButtonText' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, ButtonTextOverride) == 0x000328, "Member 'ULeaveButton_C::ButtonTextOverride' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, HordModeLeaveDescription) == 0x000340, "Member 'ULeaveButton_C::HordModeLeaveDescription' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, MissionLeaveDescriptionAlone) == 0x000358, "Member 'ULeaveButton_C::MissionLeaveDescriptionAlone' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, MissionLeaveDescriptionParty) == 0x000370, "Member 'ULeaveButton_C::MissionLeaveDescriptionParty' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, StormshieldLeaveDescriptionAlone) == 0x000388, "Member 'ULeaveButton_C::StormshieldLeaveDescriptionAlone' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, StormshieldLeaveDescriptionParty) == 0x0003A0, "Member 'ULeaveButton_C::StormshieldLeaveDescriptionParty' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, StormshieldLeaveTitle) == 0x0003B8, "Member 'ULeaveButton_C::StormshieldLeaveTitle' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, LeaveDialog) == 0x0003D0, "Member 'ULeaveButton_C::LeaveDialog' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, LeaveDialogCancelled) == 0x0003D8, "Member 'ULeaveButton_C::LeaveDialogCancelled' has a wrong offset!");

}

