#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaveDialog

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function LeaveDialog.LeaveDialog_C.OnMouseButtonDownTapToClose
// 0x03D8 (0x03D8 - 0x0000)
struct LeaveDialog_C_OnMouseButtonDownTapToClose final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0188(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_PointerEvent_IsTouchEvent_ReturnValue;    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01A8(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0268(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x0320(0x00B8)()
};
static_assert(alignof(LeaveDialog_C_OnMouseButtonDownTapToClose) == 0x000008, "Wrong alignment on LeaveDialog_C_OnMouseButtonDownTapToClose");
static_assert(sizeof(LeaveDialog_C_OnMouseButtonDownTapToClose) == 0x0003D8, "Wrong size on LeaveDialog_C_OnMouseButtonDownTapToClose");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, MyGeometry) == 0x000000, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::MyGeometry' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, MouseEvent) == 0x000040, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::MouseEvent' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, ReturnValue) == 0x0000D0, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000188, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_PointerEvent_IsTouchEvent_ReturnValue) == 0x0001A0, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_PointerEvent_IsTouchEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0001A1, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, Temp_bool_Variable) == 0x0001A2, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_BooleanOR_ReturnValue) == 0x0001A3, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_Handled_ReturnValue) == 0x0001A8, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_Not_PreBool_ReturnValue) == 0x000260, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_Unhandled_ReturnValue) == 0x000268, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, K2Node_Select_Default) == 0x000320, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::K2Node_Select_Default' has a wrong offset!");

}

