#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeavePartyListEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function LeavePartyListEntry.LeavePartyListEntry_C.BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct LeavePartyListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeavePartyListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on LeavePartyListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(LeavePartyListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on LeavePartyListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(LeavePartyListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'LeavePartyListEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function LeavePartyListEntry.LeavePartyListEntry_C.ExecuteUbergraph_LeavePartyListEntry
// 0x0030 (0x0030 - 0x0000)
struct LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry) == 0x000008, "Wrong alignment on LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry");
static_assert(sizeof(LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry) == 0x000030, "Wrong size on LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry");
static_assert(offsetof(LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry, EntryPoint) == 0x000000, "Member 'LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry, K2Node_ComponentBoundEvent_bIsOpen) == 0x000004, "Member 'LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000020, "Member 'LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'LeavePartyListEntry_C_ExecuteUbergraph_LeavePartyListEntry::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

}

