#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Legacy_MovieWidget

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Legacy_MovieWidget.Legacy_MovieWidget_C
// 0x0040 (0x0338 - 0x02F8)
class ULegacy_MovieWidget_C final : public UFortMovieWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Video_Image;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Video_ScaleBox;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          shouldloop;                                        // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          AutoPlay;                                          // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          MaintainAspectRatio;                               // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_313[0x5];                                      // 0x0313(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMediaReadyToPlay;                                // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnMediaFailedToOpen;                               // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Destruct();
	void ExecuteUbergraph_Legacy_MovieWidget(int32 EntryPoint);
	void Init(class UMediaPlayer* InMediaPlayer, class UMediaSource* InMediaSource, class UObject* InMediaSoundWave, int32 AudioTrack);
	void MediaDimensionsUpdated(float NewWidth, float NewHeight);
	void OnMediaLoaded();
	void Play(bool ShouldRewind);
	void SetDelayedContentValues();
	void StopPlaying();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Legacy_MovieWidget_C">();
	}
	static class ULegacy_MovieWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacy_MovieWidget_C>();
	}
};
static_assert(alignof(ULegacy_MovieWidget_C) == 0x000008, "Wrong alignment on ULegacy_MovieWidget_C");
static_assert(sizeof(ULegacy_MovieWidget_C) == 0x000338, "Wrong size on ULegacy_MovieWidget_C");
static_assert(offsetof(ULegacy_MovieWidget_C, UberGraphFrame) == 0x0002F8, "Member 'ULegacy_MovieWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULegacy_MovieWidget_C, Video_Image) == 0x000300, "Member 'ULegacy_MovieWidget_C::Video_Image' has a wrong offset!");
static_assert(offsetof(ULegacy_MovieWidget_C, Video_ScaleBox) == 0x000308, "Member 'ULegacy_MovieWidget_C::Video_ScaleBox' has a wrong offset!");
static_assert(offsetof(ULegacy_MovieWidget_C, shouldloop) == 0x000310, "Member 'ULegacy_MovieWidget_C::shouldloop' has a wrong offset!");
static_assert(offsetof(ULegacy_MovieWidget_C, AutoPlay) == 0x000311, "Member 'ULegacy_MovieWidget_C::AutoPlay' has a wrong offset!");
static_assert(offsetof(ULegacy_MovieWidget_C, MaintainAspectRatio) == 0x000312, "Member 'ULegacy_MovieWidget_C::MaintainAspectRatio' has a wrong offset!");
static_assert(offsetof(ULegacy_MovieWidget_C, OnMediaReadyToPlay) == 0x000318, "Member 'ULegacy_MovieWidget_C::OnMediaReadyToPlay' has a wrong offset!");
static_assert(offsetof(ULegacy_MovieWidget_C, OnMediaFailedToOpen) == 0x000328, "Member 'ULegacy_MovieWidget_C::OnMediaFailedToOpen' has a wrong offset!");

}

