#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LetoBorder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LetoBorder.LetoBorder_C
// 0x0038 (0x0320 - 0x02E8)
class ULetoBorder_C final : public UFortLetoLayoutBorder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BorderBottom;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderLeft;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderNameplate;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderRight;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderTop;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LetoBorder(int32 EntryPoint);
	void UpdateBorderWidth(float HalfBorderWidth);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LetoBorder_C">();
	}
	static class ULetoBorder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULetoBorder_C>();
	}
};
static_assert(alignof(ULetoBorder_C) == 0x000008, "Wrong alignment on ULetoBorder_C");
static_assert(sizeof(ULetoBorder_C) == 0x000320, "Wrong size on ULetoBorder_C");
static_assert(offsetof(ULetoBorder_C, UberGraphFrame) == 0x0002E8, "Member 'ULetoBorder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderBottom) == 0x0002F0, "Member 'ULetoBorder_C::BorderBottom' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderLeft) == 0x0002F8, "Member 'ULetoBorder_C::BorderLeft' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderNameplate) == 0x000300, "Member 'ULetoBorder_C::BorderNameplate' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderRight) == 0x000308, "Member 'ULetoBorder_C::BorderRight' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderTop) == 0x000310, "Member 'ULetoBorder_C::BorderTop' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, SafeZone_0) == 0x000318, "Member 'ULetoBorder_C::SafeZone_0' has a wrong offset!");

}

