#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGB_PlayEmote_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function LGB_PlayEmote_Base.LGB_PlayEmote_Base_C.SetFocalPoint
// 0x0068 (0x0068 - 0x0000)
struct LGB_PlayEmote_Base_C_SetFocalPoint final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LGB_PlayEmote_Base_C_SetFocalPoint) == 0x000008, "Wrong alignment on LGB_PlayEmote_Base_C_SetFocalPoint");
static_assert(sizeof(LGB_PlayEmote_Base_C_SetFocalPoint) == 0x000068, "Wrong size on LGB_PlayEmote_Base_C_SetFocalPoint");
static_assert(offsetof(LGB_PlayEmote_Base_C_SetFocalPoint, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'LGB_PlayEmote_Base_C_SetFocalPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_SetFocalPoint, CallFunc_GetActorForwardVector_ReturnValue) == 0x000008, "Member 'LGB_PlayEmote_Base_C_SetFocalPoint::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_SetFocalPoint, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000020, "Member 'LGB_PlayEmote_Base_C_SetFocalPoint::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_SetFocalPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'LGB_PlayEmote_Base_C_SetFocalPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_SetFocalPoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'LGB_PlayEmote_Base_C_SetFocalPoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function LGB_PlayEmote_Base.LGB_PlayEmote_Base_C.ResetFocalPoint
// 0x0001 (0x0001 - 0x0000)
struct LGB_PlayEmote_Base_C_ResetFocalPoint final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LGB_PlayEmote_Base_C_ResetFocalPoint) == 0x000001, "Wrong alignment on LGB_PlayEmote_Base_C_ResetFocalPoint");
static_assert(sizeof(LGB_PlayEmote_Base_C_ResetFocalPoint) == 0x000001, "Wrong size on LGB_PlayEmote_Base_C_ResetFocalPoint");
static_assert(offsetof(LGB_PlayEmote_Base_C_ResetFocalPoint, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'LGB_PlayEmote_Base_C_ResetFocalPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LGB_PlayEmote_Base.LGB_PlayEmote_Base_C.OnExecute
// 0x0008 (0x0008 - 0x0000)
struct LGB_PlayEmote_Base_C_OnExecute final
{
public:
	class AActor*                                 Activator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LGB_PlayEmote_Base_C_OnExecute) == 0x000008, "Wrong alignment on LGB_PlayEmote_Base_C_OnExecute");
static_assert(sizeof(LGB_PlayEmote_Base_C_OnExecute) == 0x000008, "Wrong size on LGB_PlayEmote_Base_C_OnExecute");
static_assert(offsetof(LGB_PlayEmote_Base_C_OnExecute, Activator) == 0x000000, "Member 'LGB_PlayEmote_Base_C_OnExecute::Activator' has a wrong offset!");

// Function LGB_PlayEmote_Base.LGB_PlayEmote_Base_C.ExecuteUbergraph_LGB_PlayEmote_Base
// 0x0078 (0x0078 - 0x0000)
struct LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Activator;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaAIBotController*             K2Node_DynamicCast_AsFort_Athena_AIBot_Controller; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_1; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_2;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base) == 0x000008, "Wrong alignment on LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base");
static_assert(sizeof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base) == 0x000078, "Wrong size on LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, EntryPoint) == 0x000000, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000010, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000025, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, K2Node_Event_Activator) == 0x000028, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::K2Node_Event_Activator' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, K2Node_DynamicCast_AsFort_Athena_AIBot_Controller) == 0x000030, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::K2Node_DynamicCast_AsFort_Athena_AIBot_Controller' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000040, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000050, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, Temp_bool_Variable) == 0x000051, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000052, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_IsValid_ReturnValue_1) == 0x000053, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_RemoveActiveGameplayEffect_ReturnValue_1) == 0x000054, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_RemoveActiveGameplayEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000055, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, K2Node_Select_Default) == 0x000058, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_IsValidClass_ReturnValue) == 0x000060, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_IsValidClass_ReturnValue_1) == 0x000061, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_BooleanAND_ReturnValue_1) == 0x000063, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_BooleanAND_ReturnValue_2) == 0x000064, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_BooleanAND_ReturnValue_3) == 0x000065, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x000068, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base, CallFunc_IsValidClass_ReturnValue_2) == 0x000070, "Member 'LGB_PlayEmote_Base_C_ExecuteUbergraph_LGB_PlayEmote_Base::CallFunc_IsValidClass_ReturnValue_2' has a wrong offset!");

}

