#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamMenuButtonToggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LiveStreamMenuButtonToggle.LiveStreamMenuButtonToggle_C
// 0x0040 (0x1080 - 0x1040)
class ULiveStreamMenuButtonToggle_C final : public ULiveStreamMenuToggleButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Art;                                               // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonText;                                        // 0x1060(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IconBox;                                           // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULiveViolator_C*                        LiveViolator;                                      // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spikes_1;                                          // 0x1078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_LiveStreamMenuButtonToggle(int32 EntryPoint);
	void RefreshButton(bool IsLiveStreamEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveStreamMenuButtonToggle_C">();
	}
	static class ULiveStreamMenuButtonToggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamMenuButtonToggle_C>();
	}
};
static_assert(alignof(ULiveStreamMenuButtonToggle_C) == 0x000010, "Wrong alignment on ULiveStreamMenuButtonToggle_C");
static_assert(sizeof(ULiveStreamMenuButtonToggle_C) == 0x001080, "Wrong size on ULiveStreamMenuButtonToggle_C");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, UberGraphFrame) == 0x001040, "Member 'ULiveStreamMenuButtonToggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, Hover) == 0x001048, "Member 'ULiveStreamMenuButtonToggle_C::Hover' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, Art) == 0x001050, "Member 'ULiveStreamMenuButtonToggle_C::Art' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, ButtonBacking) == 0x001058, "Member 'ULiveStreamMenuButtonToggle_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, ButtonText) == 0x001060, "Member 'ULiveStreamMenuButtonToggle_C::ButtonText' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, IconBox) == 0x001068, "Member 'ULiveStreamMenuButtonToggle_C::IconBox' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, LiveViolator) == 0x001070, "Member 'ULiveStreamMenuButtonToggle_C::LiveViolator' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, Spikes_1) == 0x001078, "Member 'ULiveStreamMenuButtonToggle_C::Spikes_1' has a wrong offset!");

}

