#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveEditObject

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "LiveEditObject_structs.hpp"


namespace SDK
{

// Class LiveEditObject.LiveEditNetworkStreamChannel
// 0x0000 (0x0068 - 0x0068)
class ULiveEditNetworkStreamChannel : public UChannel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditNetworkStreamChannel">();
	}
	static class ULiveEditNetworkStreamChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditNetworkStreamChannel>();
	}
};
static_assert(alignof(ULiveEditNetworkStreamChannel) == 0x000008, "Wrong alignment on ULiveEditNetworkStreamChannel");
static_assert(sizeof(ULiveEditNetworkStreamChannel) == 0x000068, "Wrong size on ULiveEditNetworkStreamChannel");

// Class LiveEditObject.LiveEditLargeNetworkMessageChannel
// 0x0040 (0x00A8 - 0x0068)
class ULiveEditLargeNetworkMessageChannel : public ULiveEditNetworkStreamChannel
{
public:
	uint8                                         Pad_68[0x30];                                      // 0x0068(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReceiveBufferMaxBytes;                             // 0x0098(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                         ReceiveBufferMaxBytesServer;                       // 0x00A0(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditLargeNetworkMessageChannel">();
	}
	static class ULiveEditLargeNetworkMessageChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditLargeNetworkMessageChannel>();
	}
};
static_assert(alignof(ULiveEditLargeNetworkMessageChannel) == 0x000008, "Wrong alignment on ULiveEditLargeNetworkMessageChannel");
static_assert(sizeof(ULiveEditLargeNetworkMessageChannel) == 0x0000A8, "Wrong size on ULiveEditLargeNetworkMessageChannel");
static_assert(offsetof(ULiveEditLargeNetworkMessageChannel, ReceiveBufferMaxBytes) == 0x000098, "Member 'ULiveEditLargeNetworkMessageChannel::ReceiveBufferMaxBytes' has a wrong offset!");
static_assert(offsetof(ULiveEditLargeNetworkMessageChannel, ReceiveBufferMaxBytesServer) == 0x0000A0, "Member 'ULiveEditLargeNetworkMessageChannel::ReceiveBufferMaxBytesServer' has a wrong offset!");

// Class LiveEditObject.LiveEditObjectChannel
// 0x0010 (0x00B8 - 0x00A8)
class ULiveEditObjectChannel final : public ULiveEditLargeNetworkMessageChannel
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectChannel">();
	}
	static class ULiveEditObjectChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectChannel>();
	}
};
static_assert(alignof(ULiveEditObjectChannel) == 0x000008, "Wrong alignment on ULiveEditObjectChannel");
static_assert(sizeof(ULiveEditObjectChannel) == 0x0000B8, "Wrong size on ULiveEditObjectChannel");

// Class LiveEditObject.LiveEditObjectConnection
// 0x0248 (0x0270 - 0x0028)
class ULiveEditObjectConnection final : public UObject
{
public:
	uint8                                         Pad_28[0x248];                                     // 0x0028(0x0248)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectConnection">();
	}
	static class ULiveEditObjectConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectConnection>();
	}
};
static_assert(alignof(ULiveEditObjectConnection) == 0x000008, "Wrong alignment on ULiveEditObjectConnection");
static_assert(sizeof(ULiveEditObjectConnection) == 0x000270, "Wrong size on ULiveEditObjectConnection");

// Class LiveEditObject.LiveEditObjectSubsystemState
// 0x0200 (0x0228 - 0x0028)
class ULiveEditObjectSubsystemState final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULiveEditObjectConnection*>      Connections;                                       // 0x0038(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x1E0];                                     // 0x0048(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectSubsystemState">();
	}
	static class ULiveEditObjectSubsystemState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectSubsystemState>();
	}
};
static_assert(alignof(ULiveEditObjectSubsystemState) == 0x000008, "Wrong alignment on ULiveEditObjectSubsystemState");
static_assert(sizeof(ULiveEditObjectSubsystemState) == 0x000228, "Wrong size on ULiveEditObjectSubsystemState");
static_assert(offsetof(ULiveEditObjectSubsystemState, Connections) == 0x000038, "Member 'ULiveEditObjectSubsystemState::Connections' has a wrong offset!");

// Class LiveEditObject.LiveEditObjectSubsystem
// 0x00D0 (0x0100 - 0x0030)
class ULiveEditObjectSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBytesQueuedForReplication;                      // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULiveEditObjectSubsystemState*>  NetDriverStates;                                   // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0xB0];                                      // 0x0050(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectSubsystem">();
	}
	static class ULiveEditObjectSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectSubsystem>();
	}
};
static_assert(alignof(ULiveEditObjectSubsystem) == 0x000008, "Wrong alignment on ULiveEditObjectSubsystem");
static_assert(sizeof(ULiveEditObjectSubsystem) == 0x000100, "Wrong size on ULiveEditObjectSubsystem");
static_assert(offsetof(ULiveEditObjectSubsystem, MaxBytesQueuedForReplication) == 0x000038, "Member 'ULiveEditObjectSubsystem::MaxBytesQueuedForReplication' has a wrong offset!");
static_assert(offsetof(ULiveEditObjectSubsystem, NetDriverStates) == 0x000040, "Member 'ULiveEditObjectSubsystem::NetDriverStates' has a wrong offset!");

// Class LiveEditObject.LiveEditObjectTestObject
// 0x0158 (0x0180 - 0x0028)
class ULiveEditObjectTestObject final : public UObject
{
public:
	int32                                         Int32[0x3];                                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLiveEditObjectTestStruct              StructProperty;                                    // 0x0038(0x0148)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectTestObject">();
	}
	static class ULiveEditObjectTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectTestObject>();
	}
};
static_assert(alignof(ULiveEditObjectTestObject) == 0x000008, "Wrong alignment on ULiveEditObjectTestObject");
static_assert(sizeof(ULiveEditObjectTestObject) == 0x000180, "Wrong size on ULiveEditObjectTestObject");
static_assert(offsetof(ULiveEditObjectTestObject, Int32) == 0x000028, "Member 'ULiveEditObjectTestObject::Int32' has a wrong offset!");
static_assert(offsetof(ULiveEditObjectTestObject, StructProperty) == 0x000038, "Member 'ULiveEditObjectTestObject::StructProperty' has a wrong offset!");

}

