#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamHUDElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LiveStreamHUDElement.LiveStreamHUDElement_C
// 0x0068 (0x0438 - 0x03D0)
class ULiveStreamHUDElement_C final : public ULiveStreamHUDElement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderRoot;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HideInstructions;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_HideInstructions;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VideoPlayerSlot;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   VideoPlayerClass;                                  // 0x0400(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ULiveStreamStandalonePlayer*            VideoPlayer;                                       // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InstructionsShown;                                 // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldCleanup;                                    // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CreateVideoPlayer();
	void DestroyVideoPlayer();
	void ExecuteUbergraph_LiveStreamHUDElement(int32 EntryPoint);
	void Finished_93DE0A3C4B82FE3C7555818E7982E00A();
	void InitializeVideoPlayer();
	void OnComplete_17963E1E4795FBCACA9C17990725A1D0(class UUserWidget* UserWidget);
	void OnComplete_74112BA8413888C7EAD38CA589F3B588(class UUserWidget* UserWidget);
	void TryCleanupVideoPlayer();
	void VideoPlayerReady();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveStreamHUDElement_C">();
	}
	static class ULiveStreamHUDElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamHUDElement_C>();
	}
};
static_assert(alignof(ULiveStreamHUDElement_C) == 0x000008, "Wrong alignment on ULiveStreamHUDElement_C");
static_assert(sizeof(ULiveStreamHUDElement_C) == 0x000438, "Wrong size on ULiveStreamHUDElement_C");
static_assert(offsetof(ULiveStreamHUDElement_C, UberGraphFrame) == 0x0003D0, "Member 'ULiveStreamHUDElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, Fade) == 0x0003D8, "Member 'ULiveStreamHUDElement_C::Fade' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, BorderRoot) == 0x0003E0, "Member 'ULiveStreamHUDElement_C::BorderRoot' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, HideInstructions) == 0x0003E8, "Member 'ULiveStreamHUDElement_C::HideInstructions' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, Text_HideInstructions) == 0x0003F0, "Member 'ULiveStreamHUDElement_C::Text_HideInstructions' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, VideoPlayerSlot) == 0x0003F8, "Member 'ULiveStreamHUDElement_C::VideoPlayerSlot' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, VideoPlayerClass) == 0x000400, "Member 'ULiveStreamHUDElement_C::VideoPlayerClass' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, VideoPlayer) == 0x000428, "Member 'ULiveStreamHUDElement_C::VideoPlayer' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, InstructionsShown) == 0x000430, "Member 'ULiveStreamHUDElement_C::InstructionsShown' has a wrong offset!");
static_assert(offsetof(ULiveStreamHUDElement_C, bShouldCleanup) == 0x000431, "Member 'ULiveStreamHUDElement_C::bShouldCleanup' has a wrong offset!");

}

