#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginCamera_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LoginCamera_Blueprint.LoginCamera_Blueprint_C
// 0x0020 (0x09B0 - 0x0990)
class ALoginCamera_Blueprint_C final : public AFortCameraBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0990(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0998(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       LoginCamera_0;                                     // 0x09A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoginCamera_Blueprint(int32 EntryPoint);
	void BP_OnActivated(class AFortPlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoginCamera_Blueprint_C">();
	}
	static class ALoginCamera_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALoginCamera_Blueprint_C>();
	}
};
static_assert(alignof(ALoginCamera_Blueprint_C) == 0x000010, "Wrong alignment on ALoginCamera_Blueprint_C");
static_assert(sizeof(ALoginCamera_Blueprint_C) == 0x0009B0, "Wrong size on ALoginCamera_Blueprint_C");
static_assert(offsetof(ALoginCamera_Blueprint_C, UberGraphFrame) == 0x000990, "Member 'ALoginCamera_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALoginCamera_Blueprint_C, StaticMesh) == 0x000998, "Member 'ALoginCamera_Blueprint_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ALoginCamera_Blueprint_C, LoginCamera_0) == 0x0009A0, "Member 'ALoginCamera_Blueprint_C::LoginCamera_0' has a wrong offset!");

}

