#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginCamera_Blueprint

#include "Basic.hpp"


namespace SDK::Params
{

// Function LoginCamera_Blueprint.LoginCamera_Blueprint_C.ExecuteUbergraph_LoginCamera_Blueprint
// 0x0048 (0x0048 - 0x0000)
struct LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_Event_PlayerController;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint) == 0x000008, "Wrong alignment on LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint");
static_assert(sizeof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint) == 0x000048, "Wrong size on LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, EntryPoint) == 0x000000, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, K2Node_Event_PlayerController) == 0x000010, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::K2Node_Event_PlayerController' has a wrong offset!");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue) == 0x000018, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, CallFunc_Array_Get_Item) == 0x000038, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'LoginCamera_Blueprint_C_ExecuteUbergraph_LoginCamera_Blueprint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function LoginCamera_Blueprint.LoginCamera_Blueprint_C.BP_OnActivated
// 0x0008 (0x0008 - 0x0000)
struct LoginCamera_Blueprint_C_BP_OnActivated final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginCamera_Blueprint_C_BP_OnActivated) == 0x000008, "Wrong alignment on LoginCamera_Blueprint_C_BP_OnActivated");
static_assert(sizeof(LoginCamera_Blueprint_C_BP_OnActivated) == 0x000008, "Wrong size on LoginCamera_Blueprint_C_BP_OnActivated");
static_assert(offsetof(LoginCamera_Blueprint_C_BP_OnActivated, PlayerController) == 0x000000, "Member 'LoginCamera_Blueprint_C_BP_OnActivated::PlayerController' has a wrong offset!");

}

