#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Marksman_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Marksman_BP.Marksman_BP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Marksman_BP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Marksman_BP_C_AnimGraph) == 0x000008, "Wrong alignment on Marksman_BP_C_AnimGraph");
static_assert(sizeof(Marksman_BP_C_AnimGraph) == 0x000010, "Wrong size on Marksman_BP_C_AnimGraph");
static_assert(offsetof(Marksman_BP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Marksman_BP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Marksman_BP.Marksman_BP_C.ExecuteUbergraph_Marksman_BP
// 0x0004 (0x0004 - 0x0000)
struct Marksman_BP_C_ExecuteUbergraph_Marksman_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Marksman_BP_C_ExecuteUbergraph_Marksman_BP) == 0x000004, "Wrong alignment on Marksman_BP_C_ExecuteUbergraph_Marksman_BP");
static_assert(sizeof(Marksman_BP_C_ExecuteUbergraph_Marksman_BP) == 0x000004, "Wrong size on Marksman_BP_C_ExecuteUbergraph_Marksman_BP");
static_assert(offsetof(Marksman_BP_C_ExecuteUbergraph_Marksman_BP, EntryPoint) == 0x000000, "Member 'Marksman_BP_C_ExecuteUbergraph_Marksman_BP::EntryPoint' has a wrong offset!");

}

