#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchXPScreen

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function MatchXPScreen.MatchXPScreen_C.BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MatchXPScreen_C_BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchXPScreen_C_BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on MatchXPScreen_C_BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(MatchXPScreen_C_BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on MatchXPScreen_C_BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(MatchXPScreen_C_BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'MatchXPScreen_C_BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'MatchXPScreen_C_BndEvt__CommonWidgetSwitcher_DetailSwitch_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function MatchXPScreen.MatchXPScreen_C.ExecuteUbergraph_MatchXPScreen
// 0x00A0 (0x00A0 - 0x0000)
struct MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0008(0x0020)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputReflectorButton_C*                K2Node_DynamicCast_AsInput_Reflector_Button;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0040(0x0018)(ConstParm)
	class UMatchXPRecap_C*                        K2Node_DynamicCast_AsMatch_XPRecap;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchXPRecap_C*                        K2Node_DynamicCast_AsMatch_XPRecap_1;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen) == 0x000008, "Wrong alignment on MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen");
static_assert(sizeof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen) == 0x0000A0, "Wrong size on MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, EntryPoint) == 0x000000, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000008, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, Temp_bool_IsClosed_Variable) == 0x000028, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_DynamicCast_AsInput_Reflector_Button) == 0x000030, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_DynamicCast_AsInput_Reflector_Button' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_Event_InText) == 0x000040, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_DynamicCast_AsMatch_XPRecap) == 0x000058, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_DynamicCast_AsMatch_XPRecap' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, Temp_bool_Has_Been_Initd_Variable) == 0x000061, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000068, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000070, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000074, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000080, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_DynamicCast_AsMatch_XPRecap_1) == 0x000090, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_DynamicCast_AsMatch_XPRecap_1' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000099, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00009A, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen, CallFunc_Not_PreBool_ReturnValue) == 0x00009B, "Member 'MatchXPScreen_C_ExecuteUbergraph_MatchXPScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function MatchXPScreen.MatchXPScreen_C.SetStatButtonText
// 0x0018 (0x0018 - 0x0000)
struct MatchXPScreen_C_SetStatButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MatchXPScreen_C_SetStatButtonText) == 0x000008, "Wrong alignment on MatchXPScreen_C_SetStatButtonText");
static_assert(sizeof(MatchXPScreen_C_SetStatButtonText) == 0x000018, "Wrong size on MatchXPScreen_C_SetStatButtonText");
static_assert(offsetof(MatchXPScreen_C_SetStatButtonText, InText) == 0x000000, "Member 'MatchXPScreen_C_SetStatButtonText::InText' has a wrong offset!");

}

