#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchXPRecapSquadMemberWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchXPRecapSquadMemberWidget.MatchXPRecapSquadMemberWidget_C
// 0x0080 (0x0488 - 0x0408)
class UMatchXPRecapSquadMemberWidget_C final : public UAthenaIGMSquadMemberWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowNameBriefly;                                   // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ready;                                             // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected_Effect;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_AvatarExtension;                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PartyLeaderIcon;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyCheckBox_Shadow;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_ItemSize;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Portrait;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           OptedOutFadedGray;                                 // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NonUserScaleValue;                                 // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_HandleExtensionWidgetCreated(class UUserWidget* Widget, EUIExtensionSlot SlotType);
	void Construct();
	void ExecuteUbergraph_MatchXPRecapSquadMemberWidget(int32 EntryPoint);
	void OnIsPartyLeaderChanged(bool bIsPartyLeader);
	void OnKeepPlayingTogetherVotingStatusChanged(const EKeepPlayingTogetherVotingStatus NewStatus, const bool bWasOptedIn);
	void OnMatchmakingStarted(const bool bWasOptedIn);
	void OnWidgetReset();
	void PreConstruct(bool IsDesignTime);
	void UnreadyAndCollapse(bool WasOptedIn);
	void UpdatePortraitUserSpecifiedScale();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchXPRecapSquadMemberWidget_C">();
	}
	static class UMatchXPRecapSquadMemberWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchXPRecapSquadMemberWidget_C>();
	}
};
static_assert(alignof(UMatchXPRecapSquadMemberWidget_C) == 0x000008, "Wrong alignment on UMatchXPRecapSquadMemberWidget_C");
static_assert(sizeof(UMatchXPRecapSquadMemberWidget_C) == 0x000488, "Wrong size on UMatchXPRecapSquadMemberWidget_C");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, UberGraphFrame) == 0x000408, "Member 'UMatchXPRecapSquadMemberWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ShowNameBriefly) == 0x000410, "Member 'UMatchXPRecapSquadMemberWidget_C::ShowNameBriefly' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Reset) == 0x000418, "Member 'UMatchXPRecapSquadMemberWidget_C::Reset' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Ready) == 0x000420, "Member 'UMatchXPRecapSquadMemberWidget_C::Ready' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Selected) == 0x000428, "Member 'UMatchXPRecapSquadMemberWidget_C::Selected' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Image_Selected) == 0x000430, "Member 'UMatchXPRecapSquadMemberWidget_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Image_Selected_Effect) == 0x000438, "Member 'UMatchXPRecapSquadMemberWidget_C::Image_Selected_Effect' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Overlay_AvatarExtension) == 0x000440, "Member 'UMatchXPRecapSquadMemberWidget_C::Overlay_AvatarExtension' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, Overlay_PartyLeaderIcon) == 0x000448, "Member 'UMatchXPRecapSquadMemberWidget_C::Overlay_PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ReadyCheckBox) == 0x000450, "Member 'UMatchXPRecapSquadMemberWidget_C::ReadyCheckBox' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ReadyCheckBox_Shadow) == 0x000458, "Member 'UMatchXPRecapSquadMemberWidget_C::ReadyCheckBox_Shadow' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ScaleBox_ItemSize) == 0x000460, "Member 'UMatchXPRecapSquadMemberWidget_C::ScaleBox_ItemSize' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, ScaleBox_Portrait) == 0x000468, "Member 'UMatchXPRecapSquadMemberWidget_C::ScaleBox_Portrait' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, OptedOutFadedGray) == 0x000470, "Member 'UMatchXPRecapSquadMemberWidget_C::OptedOutFadedGray' has a wrong offset!");
static_assert(offsetof(UMatchXPRecapSquadMemberWidget_C, NonUserScaleValue) == 0x000480, "Member 'UMatchXPRecapSquadMemberWidget_C::NonUserScaleValue' has a wrong offset!");

}

