#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Meatball_UI_Gauge

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Meatball_UI_Gauge.Meatball_UI_Gauge_C
// 0x0128 (0x04D8 - 0x03B0)
class UMeatball_UI_Gauge_C final : public UFortAthenaVehicleDashboardWidget_Meatball
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NoFuelMessage;                                     // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IsLowFuel;                                         // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BoostMeter;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FuelMeter;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BoostIcon;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_darken;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LowFuelIcon;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LowFuelPulse;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_messageBG;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MeterIcon;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RoundCard_Bolt;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FuelContainer;                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_LowFuel;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NoFuelMessage;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NoFuelText;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeedMeter;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeedNeedleMeter;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_FuelWarning;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FuelMeterMaterial;                                 // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GaugeFillParamName;                                // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FuelMeterFillColorParamName;                       // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelMeterFillColor_Default;                        // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelMeterFillColor_LowFuel;                        // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BoostMeterMaterial;                                // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SpeedMeterMaterial;                                // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SpeedNeedleMeterMaterial;                          // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           WarningIconColor_On;                               // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           WarningIconColor_Off;                              // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PulseInterval;                                     // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LowFuelAnimationTimerHandle;                       // 0x04B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultFuelWarningIconRenderOpacity;               // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     LowFuelMaterialInstance;                           // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     FuelEmptyMaterialInstance;                         // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Meatball_UI_Gauge(int32 EntryPoint);
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel);
	void OnLowFuel();
	void OnOutOfFuel();
	void OnUpdateBoostChargePercent(float BoostPercent);
	void OnWidgetVisibilityChanged(bool bNewVisibility);
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel);
	void ShowNoFuelMessage();
	void UpdateSpeedometer(float NormalizedSpeed, float RawSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Meatball_UI_Gauge_C">();
	}
	static class UMeatball_UI_Gauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeatball_UI_Gauge_C>();
	}
};
static_assert(alignof(UMeatball_UI_Gauge_C) == 0x000008, "Wrong alignment on UMeatball_UI_Gauge_C");
static_assert(sizeof(UMeatball_UI_Gauge_C) == 0x0004D8, "Wrong size on UMeatball_UI_Gauge_C");
static_assert(offsetof(UMeatball_UI_Gauge_C, UberGraphFrame) == 0x0003B0, "Member 'UMeatball_UI_Gauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, NoFuelMessage) == 0x0003B8, "Member 'UMeatball_UI_Gauge_C::NoFuelMessage' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, IsLowFuel) == 0x0003C0, "Member 'UMeatball_UI_Gauge_C::IsLowFuel' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, BoostMeter) == 0x0003C8, "Member 'UMeatball_UI_Gauge_C::BoostMeter' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, FuelMeter) == 0x0003D0, "Member 'UMeatball_UI_Gauge_C::FuelMeter' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Image_BoostIcon) == 0x0003D8, "Member 'UMeatball_UI_Gauge_C::Image_BoostIcon' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Image_darken) == 0x0003E0, "Member 'UMeatball_UI_Gauge_C::Image_darken' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Image_LowFuelIcon) == 0x0003E8, "Member 'UMeatball_UI_Gauge_C::Image_LowFuelIcon' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Image_LowFuelPulse) == 0x0003F0, "Member 'UMeatball_UI_Gauge_C::Image_LowFuelPulse' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Image_messageBG) == 0x0003F8, "Member 'UMeatball_UI_Gauge_C::Image_messageBG' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Image_MeterIcon) == 0x000400, "Member 'UMeatball_UI_Gauge_C::Image_MeterIcon' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Image_RoundCard_Bolt) == 0x000408, "Member 'UMeatball_UI_Gauge_C::Image_RoundCard_Bolt' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Overlay_FuelContainer) == 0x000410, "Member 'UMeatball_UI_Gauge_C::Overlay_FuelContainer' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Overlay_LowFuel) == 0x000418, "Member 'UMeatball_UI_Gauge_C::Overlay_LowFuel' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Overlay_NoFuelMessage) == 0x000420, "Member 'UMeatball_UI_Gauge_C::Overlay_NoFuelMessage' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Overlay_NoFuelText) == 0x000428, "Member 'UMeatball_UI_Gauge_C::Overlay_NoFuelText' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, SpeedMeter) == 0x000430, "Member 'UMeatball_UI_Gauge_C::SpeedMeter' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, SpeedNeedleMeter) == 0x000438, "Member 'UMeatball_UI_Gauge_C::SpeedNeedleMeter' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, Switcher_FuelWarning) == 0x000440, "Member 'UMeatball_UI_Gauge_C::Switcher_FuelWarning' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, FuelMeterMaterial) == 0x000448, "Member 'UMeatball_UI_Gauge_C::FuelMeterMaterial' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, GaugeFillParamName) == 0x000450, "Member 'UMeatball_UI_Gauge_C::GaugeFillParamName' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, FuelMeterFillColorParamName) == 0x000454, "Member 'UMeatball_UI_Gauge_C::FuelMeterFillColorParamName' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, FuelMeterFillColor_Default) == 0x000458, "Member 'UMeatball_UI_Gauge_C::FuelMeterFillColor_Default' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, FuelMeterFillColor_LowFuel) == 0x000468, "Member 'UMeatball_UI_Gauge_C::FuelMeterFillColor_LowFuel' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, BoostMeterMaterial) == 0x000478, "Member 'UMeatball_UI_Gauge_C::BoostMeterMaterial' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, SpeedMeterMaterial) == 0x000480, "Member 'UMeatball_UI_Gauge_C::SpeedMeterMaterial' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, SpeedNeedleMeterMaterial) == 0x000488, "Member 'UMeatball_UI_Gauge_C::SpeedNeedleMeterMaterial' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, WarningIconColor_On) == 0x000490, "Member 'UMeatball_UI_Gauge_C::WarningIconColor_On' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, WarningIconColor_Off) == 0x0004A0, "Member 'UMeatball_UI_Gauge_C::WarningIconColor_Off' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, PulseInterval) == 0x0004B0, "Member 'UMeatball_UI_Gauge_C::PulseInterval' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, LowFuelAnimationTimerHandle) == 0x0004B8, "Member 'UMeatball_UI_Gauge_C::LowFuelAnimationTimerHandle' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, DefaultFuelWarningIconRenderOpacity) == 0x0004C0, "Member 'UMeatball_UI_Gauge_C::DefaultFuelWarningIconRenderOpacity' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, LowFuelMaterialInstance) == 0x0004C8, "Member 'UMeatball_UI_Gauge_C::LowFuelMaterialInstance' has a wrong offset!");
static_assert(offsetof(UMeatball_UI_Gauge_C, FuelEmptyMaterialInstance) == 0x0004D0, "Member 'UMeatball_UI_Gauge_C::FuelEmptyMaterialInstance' has a wrong offset!");

}

