#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Meat_Gadget_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Meat_Gadget_Skeleton_AnimBlueprint.Meat_Gadget_Skeleton_AnimBlueprint_C
// 0x0B70 (0x0EC0 - 0x0350)
class UMeat_Gadget_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0388(0x00C0)()
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0450(0x0980)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0DD0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0DF0(0x0020)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0x0E10(0x00A8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Meat_Gadget_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Meat_Gadget_Skeleton_AnimBlueprint_C">();
	}
	static class UMeat_Gadget_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeat_Gadget_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UMeat_Gadget_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UMeat_Gadget_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UMeat_Gadget_Skeleton_AnimBlueprint_C) == 0x000EC0, "Wrong size on UMeat_Gadget_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UMeat_Gadget_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000350, "Member 'UMeat_Gadget_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMeat_Gadget_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UMeat_Gadget_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UMeat_Gadget_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UMeat_Gadget_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UMeat_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000368, "Member 'UMeat_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMeat_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_LinkedInputPose) == 0x000388, "Member 'UMeat_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UMeat_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody) == 0x000450, "Member 'UMeat_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UMeat_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000DD0, "Member 'UMeat_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMeat_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000DF0, "Member 'UMeat_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMeat_Gadget_Skeleton_AnimBlueprint_C, AnimGraphNode_RotateRootBone) == 0x000E10, "Member 'UMeat_Gadget_Skeleton_AnimBlueprint_C::AnimGraphNode_RotateRootBone' has a wrong offset!");

}

