#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeatBallVehicle_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct MeatBallVehicle_AnimBP.MeatBallVehicle_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01C7 (0x01C8 - 0x0001)
struct MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_273;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_274;                               // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_275;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_276;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_277;                            // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_278;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_279;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_280;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_281;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_282;                            // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_283;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_284;                            // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_285;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_286;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_287;                            // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_288;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_289;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_290;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_291;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_292;                                 // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_293;                            // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_294;                            // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_295;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_296;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_297;                               // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_298;                              // 0x00B0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_299;                               // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_300;                            // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_301;                                // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_302;                                // 0x00E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_303;                                // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_304;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_305;                                  // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_306;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_307;                                // 0x0101(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_308;                                // 0x0102(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_309;                               // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_310;                              // 0x0118(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0130(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01B0(0x0018)()
};
static_assert(alignof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001C8, "Wrong size on MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_273) == 0x000004, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_273' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_274) == 0x000008, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_274' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_275) == 0x000018, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_275' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_276) == 0x000020, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_276' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_277) == 0x000028, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_277' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_278) == 0x000030, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_278' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_279) == 0x000034, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_279' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_280) == 0x000038, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_280' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_281) == 0x000040, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_281' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_282) == 0x000048, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_282' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_283) == 0x000050, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_283' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_284) == 0x000058, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_284' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_285) == 0x000060, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_285' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_286) == 0x000064, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_286' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_287) == 0x000068, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_287' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_288) == 0x000070, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_288' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_289) == 0x000074, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_289' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_290) == 0x000078, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_290' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_291) == 0x00007C, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_291' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_292) == 0x000080, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_292' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_293) == 0x000088, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_293' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_294) == 0x000090, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_294' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_295) == 0x000098, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_295' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_296) == 0x0000A8, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_296' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_297) == 0x0000AC, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_297' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_298) == 0x0000B0, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_298' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_299) == 0x0000DC, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_299' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_300) == 0x0000E0, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_300' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_301) == 0x0000E8, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_301' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_302) == 0x0000E9, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_302' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_303) == 0x0000EC, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_303' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_304) == 0x0000F0, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_304' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_305) == 0x0000F8, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_305' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_306) == 0x000100, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_306' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_307) == 0x000101, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_307' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_308) == 0x000102, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_308' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_309) == 0x000108, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_309' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_310) == 0x000118, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_310' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000130, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001B0, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct MeatBallVehicle_AnimBP.MeatBallVehicle_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0005 (0x0006 - 0x0001)
struct MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000006, "Wrong size on MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000004, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000005, "Member 'MeatBallVehicle_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");

}

