#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mechanical_Engineer_Female_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Mechanical_Engineer_Female_AnimBP.Mechanical_Engineer_Female_AnimBP_C.ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP
// 0x0038 (0x0038 - 0x0000)
struct Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP) == 0x000008, "Wrong alignment on Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP");
static_assert(sizeof(Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP) == 0x000038, "Wrong size on Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP, EntryPoint) == 0x000000, "Member 'Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput) == 0x000014, "Member 'Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput) == 0x000018, "Member 'Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'Mechanical_Engineer_Female_AnimBP_C_ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function Mechanical_Engineer_Female_AnimBP.Mechanical_Engineer_Female_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Mechanical_Engineer_Female_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mechanical_Engineer_Female_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Mechanical_Engineer_Female_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Mechanical_Engineer_Female_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Mechanical_Engineer_Female_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Mechanical_Engineer_Female_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Mechanical_Engineer_Female_AnimBP.Mechanical_Engineer_Female_AnimBP_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Mechanical_Engineer_Female_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Mechanical_Engineer_Female_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Mechanical_Engineer_Female_AnimBP_C_AnimGraph");
static_assert(sizeof(Mechanical_Engineer_Female_AnimBP_C_AnimGraph) == 0x000020, "Wrong size on Mechanical_Engineer_Female_AnimBP_C_AnimGraph");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_AnimGraph, InPose) == 0x000000, "Member 'Mechanical_Engineer_Female_AnimBP_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(Mechanical_Engineer_Female_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'Mechanical_Engineer_Female_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

