#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaCDNWarmer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MediaCDNWarmer.MediaCDNWarmer_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct MediaCDNWarmer_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MediaCDNWarmer_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on MediaCDNWarmer_C_ReceiveEndPlay");
static_assert(sizeof(MediaCDNWarmer_C_ReceiveEndPlay) == 0x000001, "Wrong size on MediaCDNWarmer_C_ReceiveEndPlay");
static_assert(offsetof(MediaCDNWarmer_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'MediaCDNWarmer_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function MediaCDNWarmer.MediaCDNWarmer_C.ExecuteUbergraph_MediaCDNWarmer
// 0x0060 (0x0060 - 0x0000)
struct MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMediaCDNWarmer*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer) == 0x000008, "Wrong alignment on MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer");
static_assert(sizeof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer) == 0x000060, "Wrong size on MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, EntryPoint) == 0x000000, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::EntryPoint' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_ParseIntoArray_ReturnValue) == 0x000008, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, Temp_int_Array_Index_Variable) == 0x000018, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_Array_Get_Item) == 0x000020, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000030, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, K2Node_Event_EndPlayReason) == 0x000040, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_IsDedicatedServer_ReturnValue) == 0x000041, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_SpawnObject_ReturnValue) == 0x000048, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer, CallFunc_IsEmpty_ReturnValue) == 0x000058, "Member 'MediaCDNWarmer_C_ExecuteUbergraph_MediaCDNWarmer::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

}

