#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaMovieStreamer

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MediaMovieStreamer.MediaMovieAssets
// 0x0028 (0x0050 - 0x0028)
class UMediaMovieAssets final : public UObject
{
public:
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSoundComponent*                   MediaSoundComponent;                               // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSource*                           MediaSource;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaTexture*                          MediaTexture;                                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMediaEnd();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaMovieAssets">();
	}
	static class UMediaMovieAssets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaMovieAssets>();
	}
};
static_assert(alignof(UMediaMovieAssets) == 0x000008, "Wrong alignment on UMediaMovieAssets");
static_assert(sizeof(UMediaMovieAssets) == 0x000050, "Wrong size on UMediaMovieAssets");
static_assert(offsetof(UMediaMovieAssets, MediaPlayer) == 0x000028, "Member 'UMediaMovieAssets::MediaPlayer' has a wrong offset!");
static_assert(offsetof(UMediaMovieAssets, MediaSoundComponent) == 0x000030, "Member 'UMediaMovieAssets::MediaSoundComponent' has a wrong offset!");
static_assert(offsetof(UMediaMovieAssets, MediaSource) == 0x000038, "Member 'UMediaMovieAssets::MediaSource' has a wrong offset!");
static_assert(offsetof(UMediaMovieAssets, MediaTexture) == 0x000040, "Member 'UMediaMovieAssets::MediaTexture' has a wrong offset!");

}

