#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MicIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MicIndicator.MicIndicator_C
// 0x0030 (0x0338 - 0x0308)
class UMicIndicator_C final : public UFortMicIndicatorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Zero1_NotSpeaking;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Zero2_Speaking;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Zero3_Muted;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MicStateSwitcher;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsMuted;                                          // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTalking;                                        // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MicIndicator(int32 EntryPoint);
	void OnPlayerMuted(bool bIsMuted_0);
	void OnPlayerTalkingChanged(bool bIsTalking_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MicIndicator_C">();
	}
	static class UMicIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMicIndicator_C>();
	}
};
static_assert(alignof(UMicIndicator_C) == 0x000008, "Wrong alignment on UMicIndicator_C");
static_assert(sizeof(UMicIndicator_C) == 0x000338, "Wrong size on UMicIndicator_C");
static_assert(offsetof(UMicIndicator_C, UberGraphFrame) == 0x000308, "Member 'UMicIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMicIndicator_C, Zero1_NotSpeaking) == 0x000310, "Member 'UMicIndicator_C::Zero1_NotSpeaking' has a wrong offset!");
static_assert(offsetof(UMicIndicator_C, Zero2_Speaking) == 0x000318, "Member 'UMicIndicator_C::Zero2_Speaking' has a wrong offset!");
static_assert(offsetof(UMicIndicator_C, Zero3_Muted) == 0x000320, "Member 'UMicIndicator_C::Zero3_Muted' has a wrong offset!");
static_assert(offsetof(UMicIndicator_C, MicStateSwitcher) == 0x000328, "Member 'UMicIndicator_C::MicStateSwitcher' has a wrong offset!");
static_assert(offsetof(UMicIndicator_C, bIsMuted) == 0x000330, "Member 'UMicIndicator_C::bIsMuted' has a wrong offset!");
static_assert(offsetof(UMicIndicator_C, bIsTalking) == 0x000331, "Member 'UMicIndicator_C::bIsTalking' has a wrong offset!");

}

