#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissedInvitesActionMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function MissedInvitesActionMenu.MissedInvitesActionMenu_C.ExecuteUbergraph_MissedInvitesActionMenu
// 0x0010 (0x0010 - 0x0000)
struct MissedInvitesActionMenu_C_ExecuteUbergraph_MissedInvitesActionMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissedInvitesActionMenu_C_ExecuteUbergraph_MissedInvitesActionMenu) == 0x000008, "Wrong alignment on MissedInvitesActionMenu_C_ExecuteUbergraph_MissedInvitesActionMenu");
static_assert(sizeof(MissedInvitesActionMenu_C_ExecuteUbergraph_MissedInvitesActionMenu) == 0x000010, "Wrong size on MissedInvitesActionMenu_C_ExecuteUbergraph_MissedInvitesActionMenu");
static_assert(offsetof(MissedInvitesActionMenu_C_ExecuteUbergraph_MissedInvitesActionMenu, EntryPoint) == 0x000000, "Member 'MissedInvitesActionMenu_C_ExecuteUbergraph_MissedInvitesActionMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MissedInvitesActionMenu_C_ExecuteUbergraph_MissedInvitesActionMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'MissedInvitesActionMenu_C_ExecuteUbergraph_MissedInvitesActionMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function MissedInvitesActionMenu.MissedInvitesActionMenu_C.OnKeyUp
// 0x02C0 (0x02C0 - 0x0000)
struct MissedInvitesActionMenu_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0130(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01E8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0208(0x00B8)()
};
static_assert(alignof(MissedInvitesActionMenu_C_OnKeyUp) == 0x000008, "Wrong alignment on MissedInvitesActionMenu_C_OnKeyUp");
static_assert(sizeof(MissedInvitesActionMenu_C_OnKeyUp) == 0x0002C0, "Wrong size on MissedInvitesActionMenu_C_OnKeyUp");
static_assert(offsetof(MissedInvitesActionMenu_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'MissedInvitesActionMenu_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(MissedInvitesActionMenu_C_OnKeyUp, InKeyEvent) == 0x000040, "Member 'MissedInvitesActionMenu_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(MissedInvitesActionMenu_C_OnKeyUp, ReturnValue) == 0x000078, "Member 'MissedInvitesActionMenu_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(MissedInvitesActionMenu_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000130, "Member 'MissedInvitesActionMenu_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissedInvitesActionMenu_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x0001E8, "Member 'MissedInvitesActionMenu_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissedInvitesActionMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000200, "Member 'MissedInvitesActionMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissedInvitesActionMenu_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x000208, "Member 'MissedInvitesActionMenu_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

