#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoistyPropPrompt

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function MoistyPropPrompt.MoistyPropPrompt_C.ExecuteUbergraph_MoistyPropPrompt
// 0x0070 (0x0070 - 0x0000)
struct MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortHUDTagPromptData                  K2Node_Event_PrompData;                            // 0x0018(0x0048)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt) == 0x000008, "Wrong alignment on MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt");
static_assert(sizeof(MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt) == 0x000070, "Wrong size on MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt");
static_assert(offsetof(MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt, EntryPoint) == 0x000000, "Member 'MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt, K2Node_Event_PrompData) == 0x000018, "Member 'MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt::K2Node_Event_PrompData' has a wrong offset!");
static_assert(offsetof(MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'MoistyPropPrompt_C_ExecuteUbergraph_MoistyPropPrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function MoistyPropPrompt.MoistyPropPrompt_C.OpenWidget
// 0x0048 (0x0048 - 0x0000)
struct MoistyPropPrompt_C_OpenWidget final
{
public:
	struct FFortHUDTagPromptData                  PrompData;                                         // 0x0000(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MoistyPropPrompt_C_OpenWidget) == 0x000008, "Wrong alignment on MoistyPropPrompt_C_OpenWidget");
static_assert(sizeof(MoistyPropPrompt_C_OpenWidget) == 0x000048, "Wrong size on MoistyPropPrompt_C_OpenWidget");
static_assert(offsetof(MoistyPropPrompt_C_OpenWidget, PrompData) == 0x000000, "Member 'MoistyPropPrompt_C_OpenWidget::PrompData' has a wrong offset!");

}

