#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoleGameRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "GameplayMessages_structs.hpp"
#include "MoleGameRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnAssociatedTaskActorsAdded
// 0x0010 (0x0010 - 0x0000)
struct MoleTaskLogicSubobject_OnAssociatedTaskActorsAdded final
{
public:
	TArray<class AActor*>                         InNewlyAddedTaskActors;                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicSubobject_OnAssociatedTaskActorsAdded) == 0x000008, "Wrong alignment on MoleTaskLogicSubobject_OnAssociatedTaskActorsAdded");
static_assert(sizeof(MoleTaskLogicSubobject_OnAssociatedTaskActorsAdded) == 0x000010, "Wrong size on MoleTaskLogicSubobject_OnAssociatedTaskActorsAdded");
static_assert(offsetof(MoleTaskLogicSubobject_OnAssociatedTaskActorsAdded, InNewlyAddedTaskActors) == 0x000000, "Member 'MoleTaskLogicSubobject_OnAssociatedTaskActorsAdded::InNewlyAddedTaskActors' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnAssociatedTaskActorsPendingRemoval
// 0x0010 (0x0010 - 0x0000)
struct MoleTaskLogicSubobject_OnAssociatedTaskActorsPendingRemoval final
{
public:
	TArray<class AActor*>                         InPendingRemovalTaskActors;                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicSubobject_OnAssociatedTaskActorsPendingRemoval) == 0x000008, "Wrong alignment on MoleTaskLogicSubobject_OnAssociatedTaskActorsPendingRemoval");
static_assert(sizeof(MoleTaskLogicSubobject_OnAssociatedTaskActorsPendingRemoval) == 0x000010, "Wrong size on MoleTaskLogicSubobject_OnAssociatedTaskActorsPendingRemoval");
static_assert(offsetof(MoleTaskLogicSubobject_OnAssociatedTaskActorsPendingRemoval, InPendingRemovalTaskActors) == 0x000000, "Member 'MoleTaskLogicSubobject_OnAssociatedTaskActorsPendingRemoval::InPendingRemovalTaskActors' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnOwningTaskBecomePrimaryActiveTask
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicSubobject_OnOwningTaskBecomePrimaryActiveTask final
{
public:
	bool                                          bIsActivePhase;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicSubobject_OnOwningTaskBecomePrimaryActiveTask) == 0x000001, "Wrong alignment on MoleTaskLogicSubobject_OnOwningTaskBecomePrimaryActiveTask");
static_assert(sizeof(MoleTaskLogicSubobject_OnOwningTaskBecomePrimaryActiveTask) == 0x000001, "Wrong size on MoleTaskLogicSubobject_OnOwningTaskBecomePrimaryActiveTask");
static_assert(offsetof(MoleTaskLogicSubobject_OnOwningTaskBecomePrimaryActiveTask, bIsActivePhase) == 0x000000, "Member 'MoleTaskLogicSubobject_OnOwningTaskBecomePrimaryActiveTask::bIsActivePhase' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnOwningTaskNoLongerPrimaryActiveTask
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicSubobject_OnOwningTaskNoLongerPrimaryActiveTask final
{
public:
	bool                                          bIsActivePhase;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicSubobject_OnOwningTaskNoLongerPrimaryActiveTask) == 0x000001, "Wrong alignment on MoleTaskLogicSubobject_OnOwningTaskNoLongerPrimaryActiveTask");
static_assert(sizeof(MoleTaskLogicSubobject_OnOwningTaskNoLongerPrimaryActiveTask) == 0x000001, "Wrong size on MoleTaskLogicSubobject_OnOwningTaskNoLongerPrimaryActiveTask");
static_assert(offsetof(MoleTaskLogicSubobject_OnOwningTaskNoLongerPrimaryActiveTask, bIsActivePhase) == 0x000000, "Member 'MoleTaskLogicSubobject_OnOwningTaskNoLongerPrimaryActiveTask::bIsActivePhase' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnTaskExternalInterruption
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicSubobject_OnTaskExternalInterruption final
{
public:
	EMoleTaskInterruptionType                     InterruptionType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicSubobject_OnTaskExternalInterruption) == 0x000001, "Wrong alignment on MoleTaskLogicSubobject_OnTaskExternalInterruption");
static_assert(sizeof(MoleTaskLogicSubobject_OnTaskExternalInterruption) == 0x000001, "Wrong size on MoleTaskLogicSubobject_OnTaskExternalInterruption");
static_assert(offsetof(MoleTaskLogicSubobject_OnTaskExternalInterruption, InterruptionType) == 0x000000, "Member 'MoleTaskLogicSubobject_OnTaskExternalInterruption::InterruptionType' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicSubobject.GetAssociatedTaskActors
// 0x0010 (0x0010 - 0x0000)
struct MoleTaskLogicSubobject_GetAssociatedTaskActors final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicSubobject_GetAssociatedTaskActors) == 0x000008, "Wrong alignment on MoleTaskLogicSubobject_GetAssociatedTaskActors");
static_assert(sizeof(MoleTaskLogicSubobject_GetAssociatedTaskActors) == 0x000010, "Wrong size on MoleTaskLogicSubobject_GetAssociatedTaskActors");
static_assert(offsetof(MoleTaskLogicSubobject_GetAssociatedTaskActors, ReturnValue) == 0x000000, "Member 'MoleTaskLogicSubobject_GetAssociatedTaskActors::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicSubobject.GetOwnerRole
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicSubobject_GetOwnerRole final
{
public:
	ENetRole                                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicSubobject_GetOwnerRole) == 0x000001, "Wrong alignment on MoleTaskLogicSubobject_GetOwnerRole");
static_assert(sizeof(MoleTaskLogicSubobject_GetOwnerRole) == 0x000001, "Wrong size on MoleTaskLogicSubobject_GetOwnerRole");
static_assert(offsetof(MoleTaskLogicSubobject_GetOwnerRole, ReturnValue) == 0x000000, "Member 'MoleTaskLogicSubobject_GetOwnerRole::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicSubobject.GetOwningController
// 0x0008 (0x0008 - 0x0000)
struct MoleTaskLogicSubobject_GetOwningController final
{
public:
	class AController*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicSubobject_GetOwningController) == 0x000008, "Wrong alignment on MoleTaskLogicSubobject_GetOwningController");
static_assert(sizeof(MoleTaskLogicSubobject_GetOwningController) == 0x000008, "Wrong size on MoleTaskLogicSubobject_GetOwningController");
static_assert(offsetof(MoleTaskLogicSubobject_GetOwningController, ReturnValue) == 0x000000, "Member 'MoleTaskLogicSubobject_GetOwningController::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicSubobject.GetOwningPlayerTaskComponent
// 0x0008 (0x0008 - 0x0000)
struct MoleTaskLogicSubobject_GetOwningPlayerTaskComponent final
{
public:
	class UMolePlayerTaskManagementComponent*     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicSubobject_GetOwningPlayerTaskComponent) == 0x000008, "Wrong alignment on MoleTaskLogicSubobject_GetOwningPlayerTaskComponent");
static_assert(sizeof(MoleTaskLogicSubobject_GetOwningPlayerTaskComponent) == 0x000008, "Wrong size on MoleTaskLogicSubobject_GetOwningPlayerTaskComponent");
static_assert(offsetof(MoleTaskLogicSubobject_GetOwningPlayerTaskComponent, ReturnValue) == 0x000000, "Member 'MoleTaskLogicSubobject_GetOwningPlayerTaskComponent::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.ApplyCurrentValueDelta
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_ApplyCurrentValueDelta final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_ApplyCurrentValueDelta) == 0x000004, "Wrong alignment on MoleTaskLogicObjective_ApplyCurrentValueDelta");
static_assert(sizeof(MoleTaskLogicObjective_ApplyCurrentValueDelta) == 0x000004, "Wrong size on MoleTaskLogicObjective_ApplyCurrentValueDelta");
static_assert(offsetof(MoleTaskLogicObjective_ApplyCurrentValueDelta, Delta) == 0x000000, "Member 'MoleTaskLogicObjective_ApplyCurrentValueDelta::Delta' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.CaptureInitialValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_CaptureInitialValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_CaptureInitialValue) == 0x000004, "Wrong alignment on MoleTaskLogicObjective_CaptureInitialValue");
static_assert(sizeof(MoleTaskLogicObjective_CaptureInitialValue) == 0x000004, "Wrong size on MoleTaskLogicObjective_CaptureInitialValue");
static_assert(offsetof(MoleTaskLogicObjective_CaptureInitialValue, ReturnValue) == 0x000000, "Member 'MoleTaskLogicObjective_CaptureInitialValue::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.CaptureTargetValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_CaptureTargetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_CaptureTargetValue) == 0x000004, "Wrong alignment on MoleTaskLogicObjective_CaptureTargetValue");
static_assert(sizeof(MoleTaskLogicObjective_CaptureTargetValue) == 0x000004, "Wrong size on MoleTaskLogicObjective_CaptureTargetValue");
static_assert(offsetof(MoleTaskLogicObjective_CaptureTargetValue, ReturnValue) == 0x000000, "Member 'MoleTaskLogicObjective_CaptureTargetValue::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.ServerSuggestObjectiveStatus
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicObjective_ServerSuggestObjectiveStatus final
{
public:
	EMoleTaskObjectiveStatus                      InNewSuggestedStatus;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_ServerSuggestObjectiveStatus) == 0x000001, "Wrong alignment on MoleTaskLogicObjective_ServerSuggestObjectiveStatus");
static_assert(sizeof(MoleTaskLogicObjective_ServerSuggestObjectiveStatus) == 0x000001, "Wrong size on MoleTaskLogicObjective_ServerSuggestObjectiveStatus");
static_assert(offsetof(MoleTaskLogicObjective_ServerSuggestObjectiveStatus, InNewSuggestedStatus) == 0x000000, "Member 'MoleTaskLogicObjective_ServerSuggestObjectiveStatus::InNewSuggestedStatus' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.SetObjectiveStatus
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicObjective_SetObjectiveStatus final
{
public:
	EMoleTaskObjectiveStatus                      InNewStatus;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_SetObjectiveStatus) == 0x000001, "Wrong alignment on MoleTaskLogicObjective_SetObjectiveStatus");
static_assert(sizeof(MoleTaskLogicObjective_SetObjectiveStatus) == 0x000001, "Wrong size on MoleTaskLogicObjective_SetObjectiveStatus");
static_assert(offsetof(MoleTaskLogicObjective_SetObjectiveStatus, InNewStatus) == 0x000000, "Member 'MoleTaskLogicObjective_SetObjectiveStatus::InNewStatus' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.GetCapturedInitialValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_GetCapturedInitialValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_GetCapturedInitialValue) == 0x000004, "Wrong alignment on MoleTaskLogicObjective_GetCapturedInitialValue");
static_assert(sizeof(MoleTaskLogicObjective_GetCapturedInitialValue) == 0x000004, "Wrong size on MoleTaskLogicObjective_GetCapturedInitialValue");
static_assert(offsetof(MoleTaskLogicObjective_GetCapturedInitialValue, ReturnValue) == 0x000000, "Member 'MoleTaskLogicObjective_GetCapturedInitialValue::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.GetCapturedTargetValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_GetCapturedTargetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_GetCapturedTargetValue) == 0x000004, "Wrong alignment on MoleTaskLogicObjective_GetCapturedTargetValue");
static_assert(sizeof(MoleTaskLogicObjective_GetCapturedTargetValue) == 0x000004, "Wrong size on MoleTaskLogicObjective_GetCapturedTargetValue");
static_assert(offsetof(MoleTaskLogicObjective_GetCapturedTargetValue, ReturnValue) == 0x000000, "Member 'MoleTaskLogicObjective_GetCapturedTargetValue::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.GetCurrentValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_GetCurrentValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_GetCurrentValue) == 0x000004, "Wrong alignment on MoleTaskLogicObjective_GetCurrentValue");
static_assert(sizeof(MoleTaskLogicObjective_GetCurrentValue) == 0x000004, "Wrong size on MoleTaskLogicObjective_GetCurrentValue");
static_assert(offsetof(MoleTaskLogicObjective_GetCurrentValue, ReturnValue) == 0x000000, "Member 'MoleTaskLogicObjective_GetCurrentValue::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.GetObjectiveStatus
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicObjective_GetObjectiveStatus final
{
public:
	EMoleTaskObjectiveStatus                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_GetObjectiveStatus) == 0x000001, "Wrong alignment on MoleTaskLogicObjective_GetObjectiveStatus");
static_assert(sizeof(MoleTaskLogicObjective_GetObjectiveStatus) == 0x000001, "Wrong size on MoleTaskLogicObjective_GetObjectiveStatus");
static_assert(offsetof(MoleTaskLogicObjective_GetObjectiveStatus, ReturnValue) == 0x000000, "Member 'MoleTaskLogicObjective_GetObjectiveStatus::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective.GetObjectiveText
// 0x0018 (0x0018 - 0x0000)
struct MoleTaskLogicObjective_GetObjectiveText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_GetObjectiveText) == 0x000008, "Wrong alignment on MoleTaskLogicObjective_GetObjectiveText");
static_assert(sizeof(MoleTaskLogicObjective_GetObjectiveText) == 0x000018, "Wrong size on MoleTaskLogicObjective_GetObjectiveText");
static_assert(offsetof(MoleTaskLogicObjective_GetObjectiveText, ReturnValue) == 0x000000, "Member 'MoleTaskLogicObjective_GetObjectiveText::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleEliminationAbility.ValidatePotentialEliminationTarget
// 0x0010 (0x0010 - 0x0000)
struct MoleEliminationAbility_ValidatePotentialEliminationTarget final
{
public:
	class AFortPlayerPawn*                        PotentialTargetPawn;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoleEliminationAbility_ValidatePotentialEliminationTarget) == 0x000008, "Wrong alignment on MoleEliminationAbility_ValidatePotentialEliminationTarget");
static_assert(sizeof(MoleEliminationAbility_ValidatePotentialEliminationTarget) == 0x000010, "Wrong size on MoleEliminationAbility_ValidatePotentialEliminationTarget");
static_assert(offsetof(MoleEliminationAbility_ValidatePotentialEliminationTarget, PotentialTargetPawn) == 0x000000, "Member 'MoleEliminationAbility_ValidatePotentialEliminationTarget::PotentialTargetPawn' has a wrong offset!");
static_assert(offsetof(MoleEliminationAbility_ValidatePotentialEliminationTarget, ReturnValue) == 0x000008, "Member 'MoleEliminationAbility_ValidatePotentialEliminationTarget::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.FortCinematicComponent.FadeFromBlackscreen
// 0x0004 (0x0004 - 0x0000)
struct FortCinematicComponent_FadeFromBlackscreen final
{
public:
	float                                         InFadeTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCinematicComponent_FadeFromBlackscreen) == 0x000004, "Wrong alignment on FortCinematicComponent_FadeFromBlackscreen");
static_assert(sizeof(FortCinematicComponent_FadeFromBlackscreen) == 0x000004, "Wrong size on FortCinematicComponent_FadeFromBlackscreen");
static_assert(offsetof(FortCinematicComponent_FadeFromBlackscreen, InFadeTime) == 0x000000, "Member 'FortCinematicComponent_FadeFromBlackscreen::InFadeTime' has a wrong offset!");

// Function MoleGameRuntime.FortCinematicComponent.FadeToBlackscreen
// 0x0008 (0x0008 - 0x0000)
struct FortCinematicComponent_FadeToBlackscreen final
{
public:
	float                                         InFadeTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHold;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCinematicComponent_FadeToBlackscreen) == 0x000004, "Wrong alignment on FortCinematicComponent_FadeToBlackscreen");
static_assert(sizeof(FortCinematicComponent_FadeToBlackscreen) == 0x000008, "Wrong size on FortCinematicComponent_FadeToBlackscreen");
static_assert(offsetof(FortCinematicComponent_FadeToBlackscreen, InFadeTime) == 0x000000, "Member 'FortCinematicComponent_FadeToBlackscreen::InFadeTime' has a wrong offset!");
static_assert(offsetof(FortCinematicComponent_FadeToBlackscreen, bInHold) == 0x000004, "Member 'FortCinematicComponent_FadeToBlackscreen::bInHold' has a wrong offset!");

// Function MoleGameRuntime.FortCinematicComponent.IsCinematicStateActive
// 0x0008 (0x0008 - 0x0000)
struct FortCinematicComponent_IsCinematicStateActive final
{
public:
	struct FGameplayTag                           StateTag;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCinematicComponent_IsCinematicStateActive) == 0x000004, "Wrong alignment on FortCinematicComponent_IsCinematicStateActive");
static_assert(sizeof(FortCinematicComponent_IsCinematicStateActive) == 0x000008, "Wrong size on FortCinematicComponent_IsCinematicStateActive");
static_assert(offsetof(FortCinematicComponent_IsCinematicStateActive, StateTag) == 0x000000, "Member 'FortCinematicComponent_IsCinematicStateActive::StateTag' has a wrong offset!");
static_assert(offsetof(FortCinematicComponent_IsCinematicStateActive, ReturnValue) == 0x000004, "Member 'FortCinematicComponent_IsCinematicStateActive::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.FortCinematicComponent.PushCinematicState
// 0x0048 (0x0048 - 0x0000)
struct FortCinematicComponent_PushCinematicState final
{
public:
	struct FFortCinematicState                    InState;                                           // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCinematicComponent_PushCinematicState) == 0x000008, "Wrong alignment on FortCinematicComponent_PushCinematicState");
static_assert(sizeof(FortCinematicComponent_PushCinematicState) == 0x000048, "Wrong size on FortCinematicComponent_PushCinematicState");
static_assert(offsetof(FortCinematicComponent_PushCinematicState, InState) == 0x000000, "Member 'FortCinematicComponent_PushCinematicState::InState' has a wrong offset!");

// Function MoleGameRuntime.FortCinematicComponent.RemoveCinematicState
// 0x0004 (0x0004 - 0x0000)
struct FortCinematicComponent_RemoveCinematicState final
{
public:
	struct FGameplayTag                           StateId;                                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCinematicComponent_RemoveCinematicState) == 0x000004, "Wrong alignment on FortCinematicComponent_RemoveCinematicState");
static_assert(sizeof(FortCinematicComponent_RemoveCinematicState) == 0x000004, "Wrong size on FortCinematicComponent_RemoveCinematicState");
static_assert(offsetof(FortCinematicComponent_RemoveCinematicState, StateId) == 0x000000, "Member 'FortCinematicComponent_RemoveCinematicState::StateId' has a wrong offset!");

// Function MoleGameRuntime.MoleAFKComponent.HasEverBeenAFK
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_HasEverBeenAFK final
{
public:
	const class AFortPlayerController*            FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoleAFKComponent_HasEverBeenAFK) == 0x000008, "Wrong alignment on MoleAFKComponent_HasEverBeenAFK");
static_assert(sizeof(MoleAFKComponent_HasEverBeenAFK) == 0x000010, "Wrong size on MoleAFKComponent_HasEverBeenAFK");
static_assert(offsetof(MoleAFKComponent_HasEverBeenAFK, FortPC) == 0x000000, "Member 'MoleAFKComponent_HasEverBeenAFK::FortPC' has a wrong offset!");
static_assert(offsetof(MoleAFKComponent_HasEverBeenAFK, ReturnValue) == 0x000008, "Member 'MoleAFKComponent_HasEverBeenAFK::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleAFKComponent.HasEverBeenAFKForTooLong
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_HasEverBeenAFKForTooLong final
{
public:
	const class AFortPlayerController*            FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoleAFKComponent_HasEverBeenAFKForTooLong) == 0x000008, "Wrong alignment on MoleAFKComponent_HasEverBeenAFKForTooLong");
static_assert(sizeof(MoleAFKComponent_HasEverBeenAFKForTooLong) == 0x000010, "Wrong size on MoleAFKComponent_HasEverBeenAFKForTooLong");
static_assert(offsetof(MoleAFKComponent_HasEverBeenAFKForTooLong, FortPC) == 0x000000, "Member 'MoleAFKComponent_HasEverBeenAFKForTooLong::FortPC' has a wrong offset!");
static_assert(offsetof(MoleAFKComponent_HasEverBeenAFKForTooLong, ReturnValue) == 0x000008, "Member 'MoleAFKComponent_HasEverBeenAFKForTooLong::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleAFKComponent.IsControllerAFK
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_IsControllerAFK final
{
public:
	class AFortPlayerController*                  FortPC;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoleAFKComponent_IsControllerAFK) == 0x000008, "Wrong alignment on MoleAFKComponent_IsControllerAFK");
static_assert(sizeof(MoleAFKComponent_IsControllerAFK) == 0x000010, "Wrong size on MoleAFKComponent_IsControllerAFK");
static_assert(offsetof(MoleAFKComponent_IsControllerAFK, FortPC) == 0x000000, "Member 'MoleAFKComponent_IsControllerAFK::FortPC' has a wrong offset!");
static_assert(offsetof(MoleAFKComponent_IsControllerAFK, ReturnValue) == 0x000008, "Member 'MoleAFKComponent_IsControllerAFK::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleAFKComponent.IsPlayerAFK
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_IsPlayerAFK final
{
public:
	const class APlayerState*                     Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoleAFKComponent_IsPlayerAFK) == 0x000008, "Wrong alignment on MoleAFKComponent_IsPlayerAFK");
static_assert(sizeof(MoleAFKComponent_IsPlayerAFK) == 0x000010, "Wrong size on MoleAFKComponent_IsPlayerAFK");
static_assert(offsetof(MoleAFKComponent_IsPlayerAFK, Player) == 0x000000, "Member 'MoleAFKComponent_IsPlayerAFK::Player' has a wrong offset!");
static_assert(offsetof(MoleAFKComponent_IsPlayerAFK, ReturnValue) == 0x000008, "Member 'MoleAFKComponent_IsPlayerAFK::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleAFKComponent.OnPlayerEnteredPOI
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_OnPlayerEnteredPOI final
{
public:
	class AActor*                                 OverlapingVolume;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EnteringActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleAFKComponent_OnPlayerEnteredPOI) == 0x000008, "Wrong alignment on MoleAFKComponent_OnPlayerEnteredPOI");
static_assert(sizeof(MoleAFKComponent_OnPlayerEnteredPOI) == 0x000010, "Wrong size on MoleAFKComponent_OnPlayerEnteredPOI");
static_assert(offsetof(MoleAFKComponent_OnPlayerEnteredPOI, OverlapingVolume) == 0x000000, "Member 'MoleAFKComponent_OnPlayerEnteredPOI::OverlapingVolume' has a wrong offset!");
static_assert(offsetof(MoleAFKComponent_OnPlayerEnteredPOI, EnteringActor) == 0x000008, "Member 'MoleAFKComponent_OnPlayerEnteredPOI::EnteringActor' has a wrong offset!");

// Function MoleGameRuntime.MoleAFKComponent.OnPlayerLeftPOI
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_OnPlayerLeftPOI final
{
public:
	class AActor*                                 OverlapingVolume;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EnteringActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleAFKComponent_OnPlayerLeftPOI) == 0x000008, "Wrong alignment on MoleAFKComponent_OnPlayerLeftPOI");
static_assert(sizeof(MoleAFKComponent_OnPlayerLeftPOI) == 0x000010, "Wrong size on MoleAFKComponent_OnPlayerLeftPOI");
static_assert(offsetof(MoleAFKComponent_OnPlayerLeftPOI, OverlapingVolume) == 0x000000, "Member 'MoleAFKComponent_OnPlayerLeftPOI::OverlapingVolume' has a wrong offset!");
static_assert(offsetof(MoleAFKComponent_OnPlayerLeftPOI, EnteringActor) == 0x000008, "Member 'MoleAFKComponent_OnPlayerLeftPOI::EnteringActor' has a wrong offset!");

// Function MoleGameRuntime.MoleCheatManager.GoToStateGameover
// 0x0004 (0x0004 - 0x0000)
struct MoleCheatManager_GoToStateGameover final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleCheatManager_GoToStateGameover) == 0x000004, "Wrong alignment on MoleCheatManager_GoToStateGameover");
static_assert(sizeof(MoleCheatManager_GoToStateGameover) == 0x000004, "Wrong size on MoleCheatManager_GoToStateGameover");
static_assert(offsetof(MoleCheatManager_GoToStateGameover, InTag) == 0x000000, "Member 'MoleCheatManager_GoToStateGameover::InTag' has a wrong offset!");

// Function MoleGameRuntime.MoleCheatManager.GrantTask
// 0x0010 (0x0010 - 0x0000)
struct MoleCheatManager_GrantTask final
{
public:
	class FString                                 TaskAssetName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleCheatManager_GrantTask) == 0x000008, "Wrong alignment on MoleCheatManager_GrantTask");
static_assert(sizeof(MoleCheatManager_GrantTask) == 0x000010, "Wrong size on MoleCheatManager_GrantTask");
static_assert(offsetof(MoleCheatManager_GrantTask, TaskAssetName) == 0x000000, "Member 'MoleCheatManager_GrantTask::TaskAssetName' has a wrong offset!");

// Function MoleGameRuntime.MoleCheatManager.SpawnMoleBots
// 0x0004 (0x0004 - 0x0000)
struct MoleCheatManager_SpawnMoleBots final
{
public:
	int32                                         NumBotsToSpawn;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleCheatManager_SpawnMoleBots) == 0x000004, "Wrong alignment on MoleCheatManager_SpawnMoleBots");
static_assert(sizeof(MoleCheatManager_SpawnMoleBots) == 0x000004, "Wrong size on MoleCheatManager_SpawnMoleBots");
static_assert(offsetof(MoleCheatManager_SpawnMoleBots, NumBotsToSpawn) == 0x000000, "Member 'MoleCheatManager_SpawnMoleBots::NumBotsToSpawn' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective_DamageActors.OnBuildingActorDamaged
// 0x0060 (0x0060 - 0x0000)
struct MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged) == 0x000008, "Wrong alignment on MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged");
static_assert(sizeof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged) == 0x000060, "Wrong size on MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged, DamagedActor) == 0x000000, "Member 'MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged::DamagedActor' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged, Damage) == 0x000008, "Member 'MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged::Damage' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged, InstigatedBy) == 0x000010, "Member 'MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged::InstigatedBy' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged, DamageCauser) == 0x000018, "Member 'MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged::DamageCauser' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged, HitLocation) == 0x000020, "Member 'MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged::HitLocation' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged, FHitComponent) == 0x000038, "Member 'MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged::FHitComponent' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged, BoneName) == 0x000040, "Member 'MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged::BoneName' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged, Momentum) == 0x000048, "Member 'MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged::Momentum' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective_DamageActors.OnPawnDamaged
// 0x0060 (0x0060 - 0x0000)
struct MoleTaskLogicObjective_DamageActors_OnPawnDamaged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged) == 0x000008, "Wrong alignment on MoleTaskLogicObjective_DamageActors_OnPawnDamaged");
static_assert(sizeof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged) == 0x000060, "Wrong size on MoleTaskLogicObjective_DamageActors_OnPawnDamaged");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged, DamagedActor) == 0x000000, "Member 'MoleTaskLogicObjective_DamageActors_OnPawnDamaged::DamagedActor' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged, Damage) == 0x000008, "Member 'MoleTaskLogicObjective_DamageActors_OnPawnDamaged::Damage' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged, InstigatedBy) == 0x000010, "Member 'MoleTaskLogicObjective_DamageActors_OnPawnDamaged::InstigatedBy' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged, DamageCauser) == 0x000018, "Member 'MoleTaskLogicObjective_DamageActors_OnPawnDamaged::DamageCauser' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged, HitLocation) == 0x000020, "Member 'MoleTaskLogicObjective_DamageActors_OnPawnDamaged::HitLocation' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged, FHitComponent) == 0x000038, "Member 'MoleTaskLogicObjective_DamageActors_OnPawnDamaged::FHitComponent' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged, BoneName) == 0x000040, "Member 'MoleTaskLogicObjective_DamageActors_OnPawnDamaged::BoneName' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DamageActors_OnPawnDamaged, Momentum) == 0x000048, "Member 'MoleTaskLogicObjective_DamageActors_OnPawnDamaged::Momentum' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective_DestroyActors.OnBuildingActorDied
// 0x0060 (0x0060 - 0x0000)
struct MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied) == 0x000008, "Wrong alignment on MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied");
static_assert(sizeof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied) == 0x000060, "Wrong size on MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied, DamagedActor) == 0x000000, "Member 'MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied, Damage) == 0x000008, "Member 'MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied::Damage' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied, InstigatedBy) == 0x000010, "Member 'MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied, DamageCauser) == 0x000018, "Member 'MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied, HitLocation) == 0x000020, "Member 'MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied::HitLocation' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied, FHitComponent) == 0x000038, "Member 'MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied, BoneName) == 0x000040, "Member 'MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied::BoneName' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied, Momentum) == 0x000048, "Member 'MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied::Momentum' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective_DestroyActors.OnGenericActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct MoleTaskLogicObjective_DestroyActors_OnGenericActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_DestroyActors_OnGenericActorDestroyed) == 0x000008, "Wrong alignment on MoleTaskLogicObjective_DestroyActors_OnGenericActorDestroyed");
static_assert(sizeof(MoleTaskLogicObjective_DestroyActors_OnGenericActorDestroyed) == 0x000008, "Wrong size on MoleTaskLogicObjective_DestroyActors_OnGenericActorDestroyed");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnGenericActorDestroyed, DestroyedActor) == 0x000000, "Member 'MoleTaskLogicObjective_DestroyActors_OnGenericActorDestroyed::DestroyedActor' has a wrong offset!");

// Function MoleGameRuntime.MoleTaskLogicObjective_DestroyActors.OnPawnDied
// 0x0060 (0x0060 - 0x0000)
struct MoleTaskLogicObjective_DestroyActors_OnPawnDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleTaskLogicObjective_DestroyActors_OnPawnDied) == 0x000008, "Wrong alignment on MoleTaskLogicObjective_DestroyActors_OnPawnDied");
static_assert(sizeof(MoleTaskLogicObjective_DestroyActors_OnPawnDied) == 0x000060, "Wrong size on MoleTaskLogicObjective_DestroyActors_OnPawnDied");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnPawnDied, DamagedActor) == 0x000000, "Member 'MoleTaskLogicObjective_DestroyActors_OnPawnDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnPawnDied, Damage) == 0x000008, "Member 'MoleTaskLogicObjective_DestroyActors_OnPawnDied::Damage' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnPawnDied, InstigatedBy) == 0x000010, "Member 'MoleTaskLogicObjective_DestroyActors_OnPawnDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnPawnDied, DamageCauser) == 0x000018, "Member 'MoleTaskLogicObjective_DestroyActors_OnPawnDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnPawnDied, HitLocation) == 0x000020, "Member 'MoleTaskLogicObjective_DestroyActors_OnPawnDied::HitLocation' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnPawnDied, FHitComponent) == 0x000038, "Member 'MoleTaskLogicObjective_DestroyActors_OnPawnDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnPawnDied, BoneName) == 0x000040, "Member 'MoleTaskLogicObjective_DestroyActors_OnPawnDied::BoneName' has a wrong offset!");
static_assert(offsetof(MoleTaskLogicObjective_DestroyActors_OnPawnDied, Momentum) == 0x000048, "Member 'MoleTaskLogicObjective_DestroyActors_OnPawnDied::Momentum' has a wrong offset!");

// Function MoleGameRuntime.MoleGameplayAbility_Voting.OnVotingTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct MoleGameplayAbility_Voting_OnVotingTargetChanged final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleGameplayAbility_Voting_OnVotingTargetChanged) == 0x000008, "Wrong alignment on MoleGameplayAbility_Voting_OnVotingTargetChanged");
static_assert(sizeof(MoleGameplayAbility_Voting_OnVotingTargetChanged) == 0x000008, "Wrong size on MoleGameplayAbility_Voting_OnVotingTargetChanged");
static_assert(offsetof(MoleGameplayAbility_Voting_OnVotingTargetChanged, Target) == 0x000000, "Member 'MoleGameplayAbility_Voting_OnVotingTargetChanged::Target' has a wrong offset!");

// Function MoleGameRuntime.MoleGhostMannequin.OnRepresentedPlayerSet
// 0x0008 (0x0008 - 0x0000)
struct MoleGhostMannequin_OnRepresentedPlayerSet final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleGhostMannequin_OnRepresentedPlayerSet) == 0x000008, "Wrong alignment on MoleGhostMannequin_OnRepresentedPlayerSet");
static_assert(sizeof(MoleGhostMannequin_OnRepresentedPlayerSet) == 0x000008, "Wrong size on MoleGhostMannequin_OnRepresentedPlayerSet");
static_assert(offsetof(MoleGhostMannequin_OnRepresentedPlayerSet, PlayerState) == 0x000000, "Member 'MoleGhostMannequin_OnRepresentedPlayerSet::PlayerState' has a wrong offset!");

// Function MoleGameRuntime.MoleGhostMannequin.GetRepresentedPlayer
// 0x0008 (0x0008 - 0x0000)
struct MoleGhostMannequin_GetRepresentedPlayer final
{
public:
	class APlayerState*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleGhostMannequin_GetRepresentedPlayer) == 0x000008, "Wrong alignment on MoleGhostMannequin_GetRepresentedPlayer");
static_assert(sizeof(MoleGhostMannequin_GetRepresentedPlayer) == 0x000008, "Wrong size on MoleGhostMannequin_GetRepresentedPlayer");
static_assert(offsetof(MoleGhostMannequin_GetRepresentedPlayer, ReturnValue) == 0x000000, "Member 'MoleGhostMannequin_GetRepresentedPlayer::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleImpostorBiasComponent.IsImpostorBiasEnabled
// 0x0001 (0x0001 - 0x0000)
struct MoleImpostorBiasComponent_IsImpostorBiasEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoleImpostorBiasComponent_IsImpostorBiasEnabled) == 0x000001, "Wrong alignment on MoleImpostorBiasComponent_IsImpostorBiasEnabled");
static_assert(sizeof(MoleImpostorBiasComponent_IsImpostorBiasEnabled) == 0x000001, "Wrong size on MoleImpostorBiasComponent_IsImpostorBiasEnabled");
static_assert(offsetof(MoleImpostorBiasComponent_IsImpostorBiasEnabled, ReturnValue) == 0x000000, "Member 'MoleImpostorBiasComponent_IsImpostorBiasEnabled::ReturnValue' has a wrong offset!");

// Function MoleGameRuntime.MoleImpostorBiasComponent.SetRolePreference
// 0x0010 (0x0010 - 0x0000)
struct MoleImpostorBiasComponent_SetRolePreference final
{
public:
	class AFortPlayerController*                  FortPC;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoleRole                                     InRolePreference;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoleImpostorBiasComponent_SetRolePreference) == 0x000008, "Wrong alignment on MoleImpostorBiasComponent_SetRolePreference");
static_assert(sizeof(MoleImpostorBiasComponent_SetRolePreference) == 0x000010, "Wrong size on MoleImpostorBiasComponent_SetRolePreference");
static_assert(offsetof(MoleImpostorBiasComponent_SetRolePreference, FortPC) == 0x000000, "Member 'MoleImpostorBiasComponent_SetRolePreference::FortPC' has a wrong offset!");
static_assert(offsetof(MoleImpostorBiasComponent_SetRolePreference, InRolePreference) == 0x000008, "Member 'MoleImpostorBiasComponent_SetRolePreference::InRolePreference' has a wrong offset!");

// Function MoleGameRuntime.MolePawnComponent.HandlePawnCustomizationComplete
// 0x0008 (0x0008 - 0x0000)
struct MolePawnComponent_HandlePawnCustomizationComplete final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MolePawnComponent_HandlePawnCustomizationComplete) == 0x000008, "Wrong alignment on MolePawnComponent_HandlePawnCustomizationComplete");
static_assert(sizeof(MolePawnComponent_HandlePawnCustomizationComplete) == 0x000008, "Wrong size on MolePawnComponent_HandlePawnCustomizationComplete");
static_assert(offsetof(MolePawnComponent_HandlePawnCustomizationComplete, Pawn) == 0x000000, "Member 'MolePawnComponent_HandlePawnCustomizationComplete::Pawn' has a wrong offset!");

// Function MoleGameRuntime.MolePlayerStateComponent.BlueprintSetIsPlayerGhost
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerStateComponent_BlueprintSetIsPlayerGhost final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayerGhost;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MolePlayerStateComponent_BlueprintSetIsPlayerGhost) == 0x000008, "Wrong alignment on MolePlayerStateComponent_BlueprintSetIsPlayerGhost");
static_assert(sizeof(MolePlayerStateComponent_BlueprintSetIsPlayerGhost) == 0x000010, "Wrong size on MolePlayerStateComponent_BlueprintSetIsPlayerGhost");
static_assert(offsetof(MolePlayerStateComponent_BlueprintSetIsPlayerGhost, PlayerState) == 0x000000, "Member 'MolePlayerStateComponent_BlueprintSetIsPlayerGhost::PlayerState' has a wrong offset!");
static_assert(offsetof(MolePlayerStateComponent_BlueprintSetIsPlayerGhost, bIsPlayerGhost) == 0x000008, "Member 'MolePlayerStateComponent_BlueprintSetIsPlayerGhost::bIsPlayerGhost' has a wrong offset!");

// Function MoleGameRuntime.MolePlayerStateComponent.GetMolePlayerCosmeticData
// 0x0028 (0x0028 - 0x0000)
struct MolePlayerStateComponent_GetMolePlayerCosmeticData final
{
public:
