#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoleGameRuntime

#include "Basic.hpp"

#include "MoleGameRuntime_structs.hpp"
#include "GameplayMessages_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "GameplayTags_0_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "TargetingSystem_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayStateMachine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MoleGameRuntime.MoleTaskLogicSubobject
// 0x0038 (0x0060 - 0x0028)
class UMoleTaskLogicSubobject : public UObject
{
public:
	struct FGameplayTagContainer                  AssociatedTaskActorTags;                           // 0x0028(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         AssociatedTaskActors;                              // 0x0048(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         AssociatedActorRemovalPolicyBitmask;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUsesAssociatedTaskActors : 1;                     // 0x0059(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bReplicates : 1;                                   // 0x0059(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAssociatedTaskActorsAdded(const TArray<class AActor*>& InNewlyAddedTaskActors);
	void OnAssociatedTaskActorsPendingRemoval(const TArray<class AActor*>& InPendingRemovalTaskActors);
	void OnEnterOwningPhase();
	void OnExitOwningPhase();
	void OnOwningTaskBecomePrimaryActiveTask(bool bIsActivePhase);
	void OnOwningTaskNoLongerPrimaryActiveTask(bool bIsActivePhase);
	void OnTaskExternalInterruption(EMoleTaskInterruptionType InterruptionType);
	void OnTaskRemoved();

	const TArray<class AActor*> GetAssociatedTaskActors() const;
	ENetRole GetOwnerRole() const;
	class AController* GetOwningController() const;
	class UMolePlayerTaskManagementComponent* GetOwningPlayerTaskComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicSubobject">();
	}
	static class UMoleTaskLogicSubobject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicSubobject>();
	}
};
static_assert(alignof(UMoleTaskLogicSubobject) == 0x000008, "Wrong alignment on UMoleTaskLogicSubobject");
static_assert(sizeof(UMoleTaskLogicSubobject) == 0x000060, "Wrong size on UMoleTaskLogicSubobject");
static_assert(offsetof(UMoleTaskLogicSubobject, AssociatedTaskActorTags) == 0x000028, "Member 'UMoleTaskLogicSubobject::AssociatedTaskActorTags' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicSubobject, AssociatedTaskActors) == 0x000048, "Member 'UMoleTaskLogicSubobject::AssociatedTaskActors' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicSubobject, AssociatedActorRemovalPolicyBitmask) == 0x000058, "Member 'UMoleTaskLogicSubobject::AssociatedActorRemovalPolicyBitmask' has a wrong offset!");

// Class MoleGameRuntime.MoleTaskLogicObjective
// 0x0098 (0x00F8 - 0x0060)
class UMoleTaskLogicObjective : public UMoleTaskLogicSubobject
{
public:
	TMulticastInlineDelegate<void(float NewCurrentValue)> OnObjectiveCurrentValueChanged;                    // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float NewTargetValue)> OnObjectiveTargetValueChanged;                     // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FMoleObjectiveValue                    CurrentValue;                                      // 0x0080(0x0008)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         CapturedInitialValue;                              // 0x0088(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CapturedTargetValue;                               // 0x008C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMoleTaskObjectiveStatus                      CurrentStatus;                                     // 0x0090(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ObjectiveText;                                     // 0x0098(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                IndicatorRelativeOffset;                           // 0x00B0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumCompletionTimeSecurityThreshold;            // 0x00C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         bAllowClientCompletion : 1;                        // 0x00F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bValidateDistFromAssociatedActors : 1;             // 0x00F0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bValidateMinCompletionTime : 1;                    // 0x00F0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bInterruptTaskOnValidationFailure : 1;             // 0x00F0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bClearProgressOnTaskInterruption : 1;              // 0x00F0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHasPerformedInitialCapture : 1;                   // 0x00F0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAttemptSetPrimaryActiveTaskOnValueDelta : 1;      // 0x00F0(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAttemptHighlightAssociatedActorsIfPrimaryActiveTask : 1; // 0x00F0(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAttemptApplyIndicatorsToAssociatedActorsIfPrimaryActiveTask : 1; // 0x00F1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRequirePermissionForEmphasisFX : 1;               // 0x00F1(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyCurrentValueDelta(float Delta);
	float CaptureInitialValue();
	float CaptureTargetValue();
	void CheckObjectiveStatus();
	void OnRep_CapturedInitialValue();
	void OnRep_CapturedTargetValue();
	void OnRep_CurrentStatus();
	void OnRep_CurrentValue();
	void ServerSetAsPrimaryActiveTask();
	void ServerSuggestObjectiveStatus(EMoleTaskObjectiveStatus InNewSuggestedStatus);
	void SetObjectiveStatus(EMoleTaskObjectiveStatus InNewStatus);

	float GetCapturedInitialValue() const;
	float GetCapturedTargetValue() const;
	float GetCurrentValue() const;
	EMoleTaskObjectiveStatus GetObjectiveStatus() const;
	const class FText GetObjectiveText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicObjective">();
	}
	static class UMoleTaskLogicObjective* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicObjective>();
	}
};
static_assert(alignof(UMoleTaskLogicObjective) == 0x000008, "Wrong alignment on UMoleTaskLogicObjective");
static_assert(sizeof(UMoleTaskLogicObjective) == 0x0000F8, "Wrong size on UMoleTaskLogicObjective");
static_assert(offsetof(UMoleTaskLogicObjective, OnObjectiveCurrentValueChanged) == 0x000060, "Member 'UMoleTaskLogicObjective::OnObjectiveCurrentValueChanged' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicObjective, OnObjectiveTargetValueChanged) == 0x000070, "Member 'UMoleTaskLogicObjective::OnObjectiveTargetValueChanged' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicObjective, CurrentValue) == 0x000080, "Member 'UMoleTaskLogicObjective::CurrentValue' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicObjective, CapturedInitialValue) == 0x000088, "Member 'UMoleTaskLogicObjective::CapturedInitialValue' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicObjective, CapturedTargetValue) == 0x00008C, "Member 'UMoleTaskLogicObjective::CapturedTargetValue' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicObjective, CurrentStatus) == 0x000090, "Member 'UMoleTaskLogicObjective::CurrentStatus' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicObjective, ObjectiveText) == 0x000098, "Member 'UMoleTaskLogicObjective::ObjectiveText' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicObjective, IndicatorRelativeOffset) == 0x0000B0, "Member 'UMoleTaskLogicObjective::IndicatorRelativeOffset' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicObjective, MinimumCompletionTimeSecurityThreshold) == 0x0000C8, "Member 'UMoleTaskLogicObjective::MinimumCompletionTimeSecurityThreshold' has a wrong offset!");

// Class MoleGameRuntime.MoleEliminationAbility
// 0x0040 (0x0B50 - 0x0B10)
class UMoleEliminationAbility final : public UFortGameplayAbility
{
public:
	struct FGameplayTagContainer                  CooldownTagsToListenTo;                            // 0x0B10(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  CombinedCooldownTags;                              // 0x0B30(0x0020)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)

public:
	bool ValidatePotentialEliminationTarget(class AFortPlayerPawn* PotentialTargetPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleEliminationAbility">();
	}
	static class UMoleEliminationAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEliminationAbility>();
	}
};
static_assert(alignof(UMoleEliminationAbility) == 0x000008, "Wrong alignment on UMoleEliminationAbility");
static_assert(sizeof(UMoleEliminationAbility) == 0x000B50, "Wrong size on UMoleEliminationAbility");
static_assert(offsetof(UMoleEliminationAbility, CooldownTagsToListenTo) == 0x000B10, "Member 'UMoleEliminationAbility::CooldownTagsToListenTo' has a wrong offset!");
static_assert(offsetof(UMoleEliminationAbility, CombinedCooldownTags) == 0x000B30, "Member 'UMoleEliminationAbility::CombinedCooldownTags' has a wrong offset!");

// Class MoleGameRuntime.MoleTaskLogicAction
// 0x0008 (0x0068 - 0x0060)
class UMoleTaskLogicAction : public UMoleTaskLogicSubobject
{
public:
	uint8                                         ActionRemovalPolicyBitmask;                        // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUsesActionRemovalPolicyBitmask : 1;               // 0x0061(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActionRemovalPolicyInvoked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicAction">();
	}
	static class UMoleTaskLogicAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction>();
	}
};
static_assert(alignof(UMoleTaskLogicAction) == 0x000008, "Wrong alignment on UMoleTaskLogicAction");
static_assert(sizeof(UMoleTaskLogicAction) == 0x000068, "Wrong size on UMoleTaskLogicAction");
static_assert(offsetof(UMoleTaskLogicAction, ActionRemovalPolicyBitmask) == 0x000060, "Member 'UMoleTaskLogicAction::ActionRemovalPolicyBitmask' has a wrong offset!");

// Class MoleGameRuntime.MoleTaskLogicAction_GrantAbilitySet
// 0x0070 (0x00D8 - 0x0068)
class UMoleTaskLogicAction_GrantAbilitySet final : public UMoleTaskLogicAction
{
public:
	TSoftObjectPtr<class UFortAbilitySet>         AbilitySetToGrant;                                 // 0x0068(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortAbilitySetHandle                  GrantedHandle;                                     // 0x0090(0x0038)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  GrantedInputGuid;                                  // 0x00C8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicAction_GrantAbilitySet">();
	}
	static class UMoleTaskLogicAction_GrantAbilitySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_GrantAbilitySet>();
	}
};
static_assert(alignof(UMoleTaskLogicAction_GrantAbilitySet) == 0x000008, "Wrong alignment on UMoleTaskLogicAction_GrantAbilitySet");
static_assert(sizeof(UMoleTaskLogicAction_GrantAbilitySet) == 0x0000D8, "Wrong size on UMoleTaskLogicAction_GrantAbilitySet");
static_assert(offsetof(UMoleTaskLogicAction_GrantAbilitySet, AbilitySetToGrant) == 0x000068, "Member 'UMoleTaskLogicAction_GrantAbilitySet::AbilitySetToGrant' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicAction_GrantAbilitySet, GrantedHandle) == 0x000090, "Member 'UMoleTaskLogicAction_GrantAbilitySet::GrantedHandle' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicAction_GrantAbilitySet, GrantedInputGuid) == 0x0000C8, "Member 'UMoleTaskLogicAction_GrantAbilitySet::GrantedInputGuid' has a wrong offset!");

// Class MoleGameRuntime.FortCinematicComponent
// 0x00B0 (0x0150 - 0x00A0)
class UFortCinematicComponent : public UControllerComponent
{
public:
	TMap<TWeakObjectPtr<class AFortPawn>, bool>   PawnVisibilityMap;                                 // 0x00A0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class AFortPawn>, bool>   LocalPawnVisibilityMap;                            // 0x00F0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortCinematicState>            StateStack;                                        // 0x0140(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void CancelBlackscreen();
	void FadeFromBlackscreen(float InFadeTime);
	void FadeToBlackscreen(float InFadeTime, bool bInHold);
	bool IsCinematicStateActive(const struct FGameplayTag& StateTag);
	void PushCinematicState(const struct FFortCinematicState& InState);
	void RemoveCinematicState(const struct FGameplayTag& StateId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCinematicComponent">();
	}
	static class UFortCinematicComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCinematicComponent>();
	}
};
static_assert(alignof(UFortCinematicComponent) == 0x000008, "Wrong alignment on UFortCinematicComponent");
static_assert(sizeof(UFortCinematicComponent) == 0x000150, "Wrong size on UFortCinematicComponent");
static_assert(offsetof(UFortCinematicComponent, PawnVisibilityMap) == 0x0000A0, "Member 'UFortCinematicComponent::PawnVisibilityMap' has a wrong offset!");
static_assert(offsetof(UFortCinematicComponent, LocalPawnVisibilityMap) == 0x0000F0, "Member 'UFortCinematicComponent::LocalPawnVisibilityMap' has a wrong offset!");
static_assert(offsetof(UFortCinematicComponent, StateStack) == 0x000140, "Member 'UFortCinematicComponent::StateStack' has a wrong offset!");

// Class MoleGameRuntime.MoleTaskLogicAction_GrantTag
// 0x0020 (0x0088 - 0x0068)
class UMoleTaskLogicAction_GrantTag final : public UMoleTaskLogicAction
{
public:
	struct FGameplayTagContainer                  TagsToGrant;                                       // 0x0068(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicAction_GrantTag">();
	}
	static class UMoleTaskLogicAction_GrantTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_GrantTag>();
	}
};
static_assert(alignof(UMoleTaskLogicAction_GrantTag) == 0x000008, "Wrong alignment on UMoleTaskLogicAction_GrantTag");
static_assert(sizeof(UMoleTaskLogicAction_GrantTag) == 0x000088, "Wrong size on UMoleTaskLogicAction_GrantTag");
static_assert(offsetof(UMoleTaskLogicAction_GrantTag, TagsToGrant) == 0x000068, "Member 'UMoleTaskLogicAction_GrantTag::TagsToGrant' has a wrong offset!");

// Class MoleGameRuntime.MoleAFKComponent
// 0x0028 (0x0118 - 0x00F0)
class UMoleAFKComponent final : public UFortAFKComponent
{
public:
	float                                         LongestAFKPeriod;                                  // 0x00F0(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F4[0x24];                                      // 0x00F4(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool HasEverBeenAFK(const class AFortPlayerController* FortPC);
	static bool HasEverBeenAFKForTooLong(const class AFortPlayerController* FortPC);
	static bool IsControllerAFK(class AFortPlayerController* FortPC);
	static bool IsPlayerAFK(const class APlayerState* Player);

	void OnPlayerEnteredPOI(class AActor* OverlapingVolume, class AActor* EnteringActor);
	void OnPlayerLeftPOI(class AActor* OverlapingVolume, class AActor* EnteringActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleAFKComponent">();
	}
	static class UMoleAFKComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAFKComponent>();
	}
};
static_assert(alignof(UMoleAFKComponent) == 0x000008, "Wrong alignment on UMoleAFKComponent");
static_assert(sizeof(UMoleAFKComponent) == 0x000118, "Wrong size on UMoleAFKComponent");
static_assert(offsetof(UMoleAFKComponent, LongestAFKPeriod) == 0x0000F0, "Member 'UMoleAFKComponent::LongestAFKPeriod' has a wrong offset!");

// Class MoleGameRuntime.MoleTaskLogicAction_GrantWeapon
// 0x0040 (0x00A8 - 0x0068)
class UMoleTaskLogicAction_GrantWeapon final : public UMoleTaskLogicAction
{
public:
	TSoftObjectPtr<class UFortWeaponItemDefinition> WeaponToGrant;                                     // 0x0068(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWeaponItemDefinition*              PreviousWeapon;                                    // 0x0090(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  GrantedWeaponGuid;                                 // 0x0098(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicAction_GrantWeapon">();
	}
	static class UMoleTaskLogicAction_GrantWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_GrantWeapon>();
	}
};
static_assert(alignof(UMoleTaskLogicAction_GrantWeapon) == 0x000008, "Wrong alignment on UMoleTaskLogicAction_GrantWeapon");
static_assert(sizeof(UMoleTaskLogicAction_GrantWeapon) == 0x0000A8, "Wrong size on UMoleTaskLogicAction_GrantWeapon");
static_assert(offsetof(UMoleTaskLogicAction_GrantWeapon, WeaponToGrant) == 0x000068, "Member 'UMoleTaskLogicAction_GrantWeapon::WeaponToGrant' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicAction_GrantWeapon, PreviousWeapon) == 0x000090, "Member 'UMoleTaskLogicAction_GrantWeapon::PreviousWeapon' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicAction_GrantWeapon, GrantedWeaponGuid) == 0x000098, "Member 'UMoleTaskLogicAction_GrantWeapon::GrantedWeaponGuid' has a wrong offset!");

// Class MoleGameRuntime.MoleAnalyticsComponent
// 0x01E0 (0x0280 - 0x00A0)
class UMoleAnalyticsComponent final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_A0[0x1E0];                                     // 0x00A0(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleAnalyticsComponent">();
	}
	static class UMoleAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAnalyticsComponent>();
	}
};
static_assert(alignof(UMoleAnalyticsComponent) == 0x000008, "Wrong alignment on UMoleAnalyticsComponent");
static_assert(sizeof(UMoleAnalyticsComponent) == 0x000280, "Wrong size on UMoleAnalyticsComponent");

// Class MoleGameRuntime.MoleTaskLogicAction_HighlightActors
// 0x0020 (0x0088 - 0x0068)
class UMoleTaskLogicAction_HighlightActors final : public UMoleTaskLogicAction
{
public:
	uint8                                         bHighlight : 1;                                    // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShowIndicator : 1;                                // 0x0068(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRequirePermissionForEmphasisFX : 1;               // 0x0068(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShowIndicatorInGoalMode : 1;                      // 0x0068(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IndicatorRelativeLocationOffset;                   // 0x0070(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicAction_HighlightActors">();
	}
	static class UMoleTaskLogicAction_HighlightActors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_HighlightActors>();
	}
};
static_assert(alignof(UMoleTaskLogicAction_HighlightActors) == 0x000008, "Wrong alignment on UMoleTaskLogicAction_HighlightActors");
static_assert(sizeof(UMoleTaskLogicAction_HighlightActors) == 0x000088, "Wrong size on UMoleTaskLogicAction_HighlightActors");
static_assert(offsetof(UMoleTaskLogicAction_HighlightActors, IndicatorRelativeLocationOffset) == 0x000070, "Member 'UMoleTaskLogicAction_HighlightActors::IndicatorRelativeLocationOffset' has a wrong offset!");

// Class MoleGameRuntime.MoleAssetManagerComponent
// 0x0038 (0x00D8 - 0x00A0)
class UMoleAssetManagerComponent : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMoleAssetLoadData>             AssetLoadInfo;                                     // 0x00B8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           BundlesToLoad;                                     // 0x00C8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleAssetManagerComponent">();
	}
	static class UMoleAssetManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAssetManagerComponent>();
	}
};
static_assert(alignof(UMoleAssetManagerComponent) == 0x000008, "Wrong alignment on UMoleAssetManagerComponent");
static_assert(sizeof(UMoleAssetManagerComponent) == 0x0000D8, "Wrong size on UMoleAssetManagerComponent");
static_assert(offsetof(UMoleAssetManagerComponent, AssetLoadInfo) == 0x0000B8, "Member 'UMoleAssetManagerComponent::AssetLoadInfo' has a wrong offset!");
static_assert(offsetof(UMoleAssetManagerComponent, BundlesToLoad) == 0x0000C8, "Member 'UMoleAssetManagerComponent::BundlesToLoad' has a wrong offset!");

// Class MoleGameRuntime.MoleTaskLogicAction_SetInteractionData
// 0x0008 (0x0070 - 0x0068)
class UMoleTaskLogicAction_SetInteractionData final : public UMoleTaskLogicAction
{
public:
	class FName                                   InteractionRow;                                    // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bAlsoGrantPermission : 1;                          // 0x006C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicAction_SetInteractionData">();
	}
	static class UMoleTaskLogicAction_SetInteractionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_SetInteractionData>();
	}
};
static_assert(alignof(UMoleTaskLogicAction_SetInteractionData) == 0x000008, "Wrong alignment on UMoleTaskLogicAction_SetInteractionData");
static_assert(sizeof(UMoleTaskLogicAction_SetInteractionData) == 0x000070, "Wrong size on UMoleTaskLogicAction_SetInteractionData");
static_assert(offsetof(UMoleTaskLogicAction_SetInteractionData, InteractionRow) == 0x000068, "Member 'UMoleTaskLogicAction_SetInteractionData::InteractionRow' has a wrong offset!");

// Class MoleGameRuntime.MoleAudioManagerComponent
// 0x0000 (0x00A0 - 0x00A0)
class UMoleAudioManagerComponent final : public UPlayspaceComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleAudioManagerComponent">();
	}
	static class UMoleAudioManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAudioManagerComponent>();
	}
};
static_assert(alignof(UMoleAudioManagerComponent) == 0x000008, "Wrong alignment on UMoleAudioManagerComponent");
static_assert(sizeof(UMoleAudioManagerComponent) == 0x0000A0, "Wrong size on UMoleAudioManagerComponent");

// Class MoleGameRuntime.MoleTaskLogicAction_SetPermission
// 0x0008 (0x0070 - 0x0068)
class UMoleTaskLogicAction_SetPermission final : public UMoleTaskLogicAction
{
public:
	uint8                                         bGrantPermission : 1;                              // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicAction_SetPermission">();
	}
	static class UMoleTaskLogicAction_SetPermission* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_SetPermission>();
	}
};
static_assert(alignof(UMoleTaskLogicAction_SetPermission) == 0x000008, "Wrong alignment on UMoleTaskLogicAction_SetPermission");
static_assert(sizeof(UMoleTaskLogicAction_SetPermission) == 0x000070, "Wrong size on UMoleTaskLogicAction_SetPermission");

// Class MoleGameRuntime.MoleCheatManager
// 0x0000 (0x0028 - 0x0028)
class UMoleCheatManager final : public UChildCheatManager
{
public:
	void GoToStateGameover(const struct FGameplayTag& InTag);
	void GoToStateGameplay();
	void GoToStateLobby();
	void GoToStateVoting();
	void GrantTask(const class FString& TaskAssetName);
	void MakeSelfMoleGhost();
	void MakeTargetMoleGhost();
	void MoleClearRequestSaboteur();
	void MoleDisableAllTasks();
	void MoleDisableSelfTasks();
	void MoleEnableAllTasks();
	void MoleEnableSelfTasks();
	void MoleInterruptAllTasks();
	void MoleInterruptSelfTasks();
	void MoleRecoverFromAFK();
	void MoleRequestSaboteur();
	void MoleShowImpostorBias();
	void SkipLobbyBackfillLogic();
	void SpawnMoleBots(int32 NumBotsToSpawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleCheatManager">();
	}
	static class UMoleCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleCheatManager>();
	}
};
static_assert(alignof(UMoleCheatManager) == 0x000008, "Wrong alignment on UMoleCheatManager");
static_assert(sizeof(UMoleCheatManager) == 0x000028, "Wrong size on UMoleCheatManager");

// Class MoleGameRuntime.MoleTaskLogicAction_SetPlayerLeash
// 0x0030 (0x0098 - 0x0068)
class UMoleTaskLogicAction_SetPlayerLeash final : public UMoleTaskLogicAction
{
public:
	EMoleTaskLeashType                            LeashType;                                         // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         LeashDistance;                                     // 0x0070(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicAction_SetPlayerLeash">();
	}
	static class UMoleTaskLogicAction_SetPlayerLeash* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_SetPlayerLeash>();
	}
};
static_assert(alignof(UMoleTaskLogicAction_SetPlayerLeash) == 0x000008, "Wrong alignment on UMoleTaskLogicAction_SetPlayerLeash");
static_assert(sizeof(UMoleTaskLogicAction_SetPlayerLeash) == 0x000098, "Wrong size on UMoleTaskLogicAction_SetPlayerLeash");
static_assert(offsetof(UMoleTaskLogicAction_SetPlayerLeash, LeashType) == 0x000068, "Member 'UMoleTaskLogicAction_SetPlayerLeash::LeashType' has a wrong offset!");
static_assert(offsetof(UMoleTaskLogicAction_SetPlayerLeash, LeashDistance) == 0x000070, "Member 'UMoleTaskLogicAction_SetPlayerLeash::LeashDistance' has a wrong offset!");

// Class MoleGameRuntime.MoleCinematicComponent
// 0x0270 (0x03C0 - 0x0150)
class UMoleCinematicComponent final : public UFortCinematicComponent
{
public:
	uint8                                         Pad_150[0x8];                                      // 0x0150(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRoleAssignedTeleport;                             // 0x0158(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageReceiverHandle         RoleAssignTeleportHandle;                          // 0x0160(0x0018)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FFortCinematicState                    RoleAssignedCineState;                             // 0x0178(0x0048)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FMoleEmergencyMeetingData              MeetingPayload;                                    // 0x01C0(0x0020)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FFortCinematicState                    MeetingCalledCineState;                            // 0x01E0(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bVoteDiscussionTeleport;                           // 0x0230(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageReceiverHandle         VoteDiscussTeleportHandle;                         // 0x0238(0x0018)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FFortCinematicState                    VoteDiscussCineState;                              // 0x0250(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_298[0x20];                                     // 0x0298(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCinematicState                    VoteResolvedCineState;                             // 0x02B8(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bVotingTeleport;                                   // 0x0300(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageReceiverHandle         VotingTeleportHandle;                              // 0x0308(0x0018)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCinematicState                    VoteSkippedCineState;                              // 0x0328(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCinematicState                    VoteEjectionCineState;                             // 0x0378(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleCinematicComponent">();
	}
	static class UMoleCinematicComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleCinematicComponent>();
	}
};
static_assert(alignof(UMoleCinematicComponent) == 0x000008, "Wrong alignment on UMoleCinematicComponent");
static_assert(sizeof(UMoleCinematicComponent) == 0x0003C0, "Wrong size on UMoleCinematicComponent");
static_assert(offsetof(UMoleCinematicComponent, bRoleAssignedTeleport) == 0x000158, "Member 'UMoleCinematicComponent::bRoleAssignedTeleport' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, RoleAssignTeleportHandle) == 0x000160, "Member 'UMoleCinematicComponent::RoleAssignTeleportHandle' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, RoleAssignedCineState) == 0x000178, "Member 'UMoleCinematicComponent::RoleAssignedCineState' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, MeetingPayload) == 0x0001C0, "Member 'UMoleCinematicComponent::MeetingPayload' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, MeetingCalledCineState) == 0x0001E0, "Member 'UMoleCinematicComponent::MeetingCalledCineState' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, bVoteDiscussionTeleport) == 0x000230, "Member 'UMoleCinematicComponent::bVoteDiscussionTeleport' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, VoteDiscussTeleportHandle) == 0x000238, "Member 'UMoleCinematicComponent::VoteDiscussTeleportHandle' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, VoteDiscussCineState) == 0x000250, "Member 'UMoleCinematicComponent::VoteDiscussCineState' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, VoteResolvedCineState) == 0x0002B8, "Member 'UMoleCinematicComponent::VoteResolvedCineState' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, bVotingTeleport) == 0x000300, "Member 'UMoleCinematicComponent::bVotingTeleport' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, VotingTeleportHandle) == 0x000308, "Member 'UMoleCinematicComponent::VotingTeleportHandle' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, VoteSkippedCineState) == 0x000328, "Member 'UMoleCinematicComponent::VoteSkippedCineState' has a wrong offset!");
static_assert(offsetof(UMoleCinematicComponent, VoteEjectionCineState) == 0x000378, "Member 'UMoleCinematicComponent::VoteEjectionCineState' has a wrong offset!");

// Class MoleGameRuntime.MoleTaskLogicObjective_DamageActors
// 0x0030 (0x0128 - 0x00F8)
class UMoleTaskLogicObjective_DamageActors final : public UMoleTaskLogicObjective
{
public:
	struct FScalableFloat                         DamageAmount;                                      // 0x00F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         bOnlyCountDamageFromTaskOwner : 1;                 // 0x0120(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBuildingActorDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnPawnDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicObjective_DamageActors">();
	}
	static class UMoleTaskLogicObjective_DamageActors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicObjective_DamageActors>();
	}
};
static_assert(alignof(UMoleTaskLogicObjective_DamageActors) == 0x000008, "Wrong alignment on UMoleTaskLogicObjective_DamageActors");
static_assert(sizeof(UMoleTaskLogicObjective_DamageActors) == 0x000128, "Wrong size on UMoleTaskLogicObjective_DamageActors");
static_assert(offsetof(UMoleTaskLogicObjective_DamageActors, DamageAmount) == 0x0000F8, "Member 'UMoleTaskLogicObjective_DamageActors::DamageAmount' has a wrong offset!");

// Class MoleGameRuntime.MoleEliminationMarker
// 0x0008 (0x0978 - 0x0970)
class AMoleEliminationMarker final : public ABuildingGameplayActor
{
public:
	class APlayerState*                           RepresentedPlayer;                                 // 0x0970(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_RepresentedPlayer();
	void OnRepresentedPlayerSet();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleEliminationMarker">();
	}
	static class AMoleEliminationMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoleEliminationMarker>();
	}
};
static_assert(alignof(AMoleEliminationMarker) == 0x000008, "Wrong alignment on AMoleEliminationMarker");
static_assert(sizeof(AMoleEliminationMarker) == 0x000978, "Wrong size on AMoleEliminationMarker");
static_assert(offsetof(AMoleEliminationMarker, RepresentedPlayer) == 0x000970, "Member 'AMoleEliminationMarker::RepresentedPlayer' has a wrong offset!");

// Class MoleGameRuntime.MoleTaskLogicObjective_DestroyActors
// 0x0038 (0x0130 - 0x00F8)
class UMoleTaskLogicObjective_DestroyActors final : public UMoleTaskLogicObjective
{
public:
	struct FMoleObjectiveCriteriaFloat            Quantity;                                          // 0x00F8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnBuildingActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnGenericActorDestroyed(class AActor* DestroyedActor);
	void OnPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleTaskLogicObjective_DestroyActors">();
	}
	static class UMoleTaskLogicObjective_DestroyActors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicObjective_DestroyActors>();
	}
};
static_assert(alignof(UMoleTaskLogicObjective_DestroyActors) == 0x000008, "Wrong alignment on UMoleTaskLogicObjective_DestroyActors");
static_assert(sizeof(UMoleTaskLogicObjective_DestroyActors) == 0x000130, "Wrong size on UMoleTaskLogicObjective_DestroyActors");
static_assert(offsetof(UMoleTaskLogicObjective_DestroyActors, Quantity) == 0x0000F8, "Member 'UMoleTaskLogicObjective_DestroyActors::Quantity' has a wrong offset!");

// Class MoleGameRuntime.MoleGameBaseMutator
// 0x00C8 (0x03E0 - 0x0318)
class AMoleGameBaseMutator final : public AFortAthenaMutator
{
public:
	struct FGameplayTagContainer                  BlockedEmoteTags;                                  // 0x0318(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockedEmoteTagsForGhosts;                         // 0x0338(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   LeaveTextOverride;                                 // 0x0358(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   LeavePartyTextOverride;                            // 0x0370(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   GhostLeaveTextOverride;                            // 0x0388(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   GhostLeavePartyTextOverride;                       // 0x03A0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         IsSlideEnabled;                                    // 0x03B8(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleGameBaseMutator">();
	}
	static class AMoleGameBaseMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoleGameBaseMutator>();
	}
};
static_assert(alignof(AMoleGameBaseMutator) == 0x000008, "Wrong alignment on AMoleGameBaseMutator");
static_assert(sizeof(AMoleGameBaseMutator) == 0x0003E0, "Wrong size on AMoleGameBaseMutator");
static_assert(offsetof(AMoleGameBaseMutator, BlockedEmoteTags) == 0x000318, "Member 'AMoleGameBaseMutator::BlockedEmoteTags' has a wrong offset!");
static_assert(offsetof(AMoleGameBaseMutator, BlockedEmoteTagsForGhosts) == 0x000338, "Member 'AMoleGameBaseMutator::BlockedEmoteTagsForGhosts' has a wrong offset!");
static_assert(offsetof(AMoleGameBaseMutator, LeaveTextOverride) == 0x000358, "Member 'AMoleGameBaseMutator::LeaveTextOverride' has a wrong offset!");
static_assert(offsetof(AMoleGameBaseMutator, LeavePartyTextOverride) == 0x000370, "Member 'AMoleGameBaseMutator::LeavePartyTextOverride' has a wrong offset!");
static_assert(offsetof(AMoleGameBaseMutator, GhostLeaveTextOverride) == 0x000388, "Member 'AMoleGameBaseMutator::GhostLeaveTextOverride' has a wrong offset!");
static_assert(offsetof(AMoleGameBaseMutator, GhostLeavePartyTextOverride) == 0x0003A0, "Member 'AMoleGameBaseMutator::GhostLeavePartyTextOverride' has a wrong offset!");
static_assert(offsetof(AMoleGameBaseMutator, IsSlideEnabled) == 0x0003B8, "Member 'AMoleGameBaseMutator::IsSlideEnabled' has a wrong offset!");

// Class MoleGameRuntime.MoleGameplayAbility_Voting
// 0x0018 (0x0B28 - 0x0B10)
class UMoleGameplayAbility_Voting final : public UFortGameplayAbility
{
public:
	class UTargetingPreset*                       VotingTargetingPreset;                             // 0x0B10(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTargetingRequestHandle                AsyncTargetingHandle;                              // 0x0B18(0x0004)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1C[0x4];                                      // 0x0B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 BestVotingTarget;                                  // 0x0B20(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnVotingTargetChanged(class AActor* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleGameplayAbility_Voting">();
	}
	static class UMoleGameplayAbility_Voting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGameplayAbility_Voting>();
	}
};
static_assert(alignof(UMoleGameplayAbility_Voting) == 0x000008, "Wrong alignment on UMoleGameplayAbility_Voting");
static_assert(sizeof(UMoleGameplayAbility_Voting) == 0x000B28, "Wrong size on UMoleGameplayAbility_Voting");
static_assert(offsetof(UMoleGameplayAbility_Voting, VotingTargetingPreset) == 0x000B10, "Member 'UMoleGameplayAbility_Voting::VotingTargetingPreset' has a wrong offset!");
static_assert(offsetof(UMoleGameplayAbility_Voting, AsyncTargetingHandle) == 0x000B18, "Member 'UMoleGameplayAbility_Voting::AsyncTargetingHandle' has a wrong offset!");
static_assert(offsetof(UMoleGameplayAbility_Voting, BestVotingTarget) == 0x000B20, "Member 'UMoleGameplayAbility_Voting::BestVotingTarget' has a wrong offset!");

// Class MoleGameRuntime.MoleGamePlayerSpawningComponent
// 0x0038 (0x00E8 - 0x00B0)
class UMoleGamePlayerSpawningComponent final : public UPlayspaceComponent_PlayerSpawning
{
public:
	uint8                                         Pad_B0[0x38];                                      // 0x00B0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleGamePlayerSpawningComponent">();
	}
	static class UMoleGamePlayerSpawningComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGamePlayerSpawningComponent>();
	}
};
static_assert(alignof(UMoleGamePlayerSpawningComponent) == 0x000008, "Wrong alignment on UMoleGamePlayerSpawningComponent");
static_assert(sizeof(UMoleGamePlayerSpawningComponent) == 0x0000E8, "Wrong size on UMoleGamePlayerSpawningComponent");

// Class MoleGameRuntime.MoleGamePlayspace
// 0x0028 (0x05D8 - 0x05B0)
class AMoleGamePlayspace final : public AFortPlayspace
{
public:
	TSubclassOf<class UGameplayStateMachine>      MoleStateMachineClass;                             // 0x05B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B8[0x10];                                     // 0x05B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryManager*                  InventoryManager;                                  // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayStateMachineManager*           StateMachineManager;                               // 0x05D0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleGamePlayspace">();
	}
	static class AMoleGamePlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoleGamePlayspace>();
	}
};
static_assert(alignof(AMoleGamePlayspace) == 0x000008, "Wrong alignment on AMoleGamePlayspace");
static_assert(sizeof(AMoleGamePlayspace) == 0x0005D8, "Wrong size on AMoleGamePlayspace");
static_assert(offsetof(AMoleGamePlayspace, MoleStateMachineClass) == 0x0005B0, "Member 'AMoleGamePlayspace::MoleStateMachineClass' has a wrong offset!");
static_assert(offsetof(AMoleGamePlayspace, InventoryManager) == 0x0005C8, "Member 'AMoleGamePlayspace::InventoryManager' has a wrong offset!");
static_assert(offsetof(AMoleGamePlayspace, StateMachineManager) == 0x0005D0, "Member 'AMoleGamePlayspace::StateMachineManager' has a wrong offset!");

// Class MoleGameRuntime.MoleGameplayState_Tasks
// 0x0010 (0x0088 - 0x0078)
class UMoleGameplayState_Tasks final : public UGameplayState
{
public:
	float                                         PrepareStateDelayTime;                             // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0xC];                                       // 0x007C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleGameplayState_Tasks">();
	}
	static class UMoleGameplayState_Tasks* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGameplayState_Tasks>();
	}
};
static_assert(alignof(UMoleGameplayState_Tasks) == 0x000008, "Wrong alignment on UMoleGameplayState_Tasks");
static_assert(sizeof(UMoleGameplayState_Tasks) == 0x000088, "Wrong size on UMoleGameplayState_Tasks");
static_assert(offsetof(UMoleGameplayState_Tasks, PrepareStateDelayTime) == 0x000078, "Member 'UMoleGameplayState_Tasks::PrepareStateDelayTime' has a wrong offset!");

// Class MoleGameRuntime.MoleGhostControllerComponent
// 0x0008 (0x00A8 - 0x00A0)
class UMoleGhostControllerComponent final : public UFortControllerComponent
{
public:
	class UInputComponent*                        GhostInputComp;                                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ClientRevertGhost();
	void CLientSetupGhost();
	void OnPlayerBecameGhost();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleGhostControllerComponent">();
	}
	static class UMoleGhostControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGhostControllerComponent>();
	}
};
static_assert(alignof(UMoleGhostControllerComponent) == 0x000008, "Wrong alignment on UMoleGhostControllerComponent");
static_assert(sizeof(UMoleGhostControllerComponent) == 0x0000A8, "Wrong size on UMoleGhostControllerComponent");
static_assert(offsetof(UMoleGhostControllerComponent, GhostInputComp) == 0x0000A0, "Member 'UMoleGhostControllerComponent::GhostInputComp' has a wrong offset!");

// Class MoleGameRuntime.MoleGhostMannequin
// 0x0018 (0x05C8 - 0x05B0)
class AMoleGhostMannequin final : public AFortPlayerMannequin
{
public:
	class UMaterialInterface*                     GhostMaterial;                                     // 0x05B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           RepresentedPlayerState;                            // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C0[0x8];                                      // 0x05C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRepresentedPlayerSet(class APlayerState* PlayerState);

	class APlayerState* GetRepresentedPlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleGhostMannequin">();
	}
	static class AMoleGhostMannequin* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoleGhostMannequin>();
	}
};
static_assert(alignof(AMoleGhostMannequin) == 0x000008, "Wrong alignment on AMoleGhostMannequin");
static_assert(sizeof(AMoleGhostMannequin) == 0x0005C8, "Wrong size on AMoleGhostMannequin");
static_assert(offsetof(AMoleGhostMannequin, GhostMaterial) == 0x0005B0, "Member 'AMoleGhostMannequin::GhostMaterial' has a wrong offset!");
static_assert(offsetof(AMoleGhostMannequin, RepresentedPlayerState) == 0x0005B8, "Member 'AMoleGhostMannequin::RepresentedPlayerState' has a wrong offset!");

// Class MoleGameRuntime.MoleGlobals
// 0x0000 (0x0028 - 0x0028)
class UMoleGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleGlobals">();
	}
	static class UMoleGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGlobals>();
	}
};
static_assert(alignof(UMoleGlobals) == 0x000008, "Wrong alignment on UMoleGlobals");
static_assert(sizeof(UMoleGlobals) == 0x000028, "Wrong size on UMoleGlobals");

// Class MoleGameRuntime.MoleImpostorBiasComponent
// 0x0020 (0x00C0 - 0x00A0)
class UMoleImpostorBiasComponent final : public UControllerComponent
{
public:
	EMoleRole                                     RolePreference;                                    // 0x00A0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x1F];                                      // 0x00A1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool IsImpostorBiasEnabled();
	static void SetRolePreference(class AFortPlayerController* FortPC, EMoleRole InRolePreference);

	void OnRep_RolePreference();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleImpostorBiasComponent">();
	}
	static class UMoleImpostorBiasComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleImpostorBiasComponent>();
	}
};
static_assert(alignof(UMoleImpostorBiasComponent) == 0x000008, "Wrong alignment on UMoleImpostorBiasComponent");
static_assert(sizeof(UMoleImpostorBiasComponent) == 0x0000C0, "Wrong size on UMoleImpostorBiasComponent");
static_assert(offsetof(UMoleImpostorBiasComponent, RolePreference) == 0x0000A0, "Member 'UMoleImpostorBiasComponent::RolePreference' has a wrong offset!");

// Class MoleGameRuntime.MoleInitialPlayerCountModMagnitudeCalculation
// 0x0000 (0x0040 - 0x0040)
class UMoleInitialPlayerCountModMagnitudeCalculation final : public UFortGameplayModMagnitudeCalculation
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleInitialPlayerCountModMagnitudeCalculation">();
	}
	static class UMoleInitialPlayerCountModMagnitudeCalculation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleInitialPlayerCountModMagnitudeCalculation>();
	}
};
static_assert(alignof(UMoleInitialPlayerCountModMagnitudeCalculation) == 0x000008, "Wrong alignment on UMoleInitialPlayerCountModMagnitudeCalculation");
static_assert(sizeof(UMoleInitialPlayerCountModMagnitudeCalculation) == 0x000040, "Wrong size on UMoleInitialPlayerCountModMagnitudeCalculation");

// Class MoleGameRuntime.MoleLevelDataAsset
// 0x0040 (0x0070 - 0x0030)
class UMoleLevelDataAsset final : public UPrimaryDataAsset
{
public:
	TArray<TSoftObjectPtr<class UWorld>>          Levels;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  LevelDescriptionTags;                              // 0x0040(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FMoleLevelTaskRequest>          TaskRequests;                                      // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoleLevelDataAsset">();
	}
	static class UMoleLevelDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLevelDataAsset>();
	}
};
static_assert(alignof(UMoleLevelDataAsset) == 0x000008, "Wrong alignment on UMoleLevelDataAsset");
static_assert(sizeof(UMoleLevelDataAsset) == 0x000070, "Wrong size on UMoleLevelDataAsset");
static_assert(offsetof(UMoleLevelDataAsset, Levels) == 0x000030, "Member 'UMoleLevelDataAsset::Levels' has a wrong offset!");
static_assert(offsetof(UMoleLevelDataAsset, LevelDescriptionTags) == 0x000040, "Member 'UMoleLevelDataAsset::LevelDescriptionTags' has a wrong offset!");
static_assert(offsetof(UMoleLevelDataAsset, TaskRequests) == 0x000060, "Member 'UMoleLevelDataAsset::TaskRequests' has a wrong offset!");

// Class MoleGameRuntime.MoleLevelBalanceDataAsset
// 0x0020 (0x0050 - 0x0030)
