#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Moonbeam_PowerRatingWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Moonbeam_PowerRatingWidget.Moonbeam_PowerRatingWidget_C
// 0x00B8 (0x03C0 - 0x0308)
class UMoonbeam_PowerRatingWidget_C final : public UFortPlayerPowerRating
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BaseRatingValue;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BaseRatingValue_Large;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BuffedRatingOuterGlow;                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHomebaseRatingBar_C*                   HomebaseRatingBar;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Power;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            ModeTypeSwitcher;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Moonbeam_Power_Back;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           OversizedMode;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PowerIconGlow;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rating_Glow_Large;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RatingBar;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RegularMode;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TeamRatingValue;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TeamRatingValue_Large;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowDualPower;                                     // 0x0380(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowProgress;                                      // 0x0381(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowGlow;                                          // 0x0382(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLargeStyle;                                     // 0x0383(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOversizedMode;                                  // 0x0384(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpDuration;                                    // 0x0388(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             PowerIncreasedSound;                               // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Power_Rating_Num;                                  // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PowerBackingColor;                                 // 0x039C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            FontColor;                                         // 0x03AC(0x0014)(Edit, BlueprintVisible)

public:
	void Construct();
	void ExecuteUbergraph_Moonbeam_PowerRatingWidget(int32 EntryPoint);
	void OnBasePowerRatingUpdated(int32 BasePowerRating);
	void OnPowerRatingProgressUpdated(float BaseRatingProgress, float TeamRatingProgress);
	void OnTeamMembershipChanged();
	void OnTeamPowerRatingUpdated(int32 TeamPowerRating);
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundColor(const struct FLinearColor& NewColor);
	void UpdateWidgetState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Moonbeam_PowerRatingWidget_C">();
	}
	static class UMoonbeam_PowerRatingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoonbeam_PowerRatingWidget_C>();
	}
};
static_assert(alignof(UMoonbeam_PowerRatingWidget_C) == 0x000008, "Wrong alignment on UMoonbeam_PowerRatingWidget_C");
static_assert(sizeof(UMoonbeam_PowerRatingWidget_C) == 0x0003C0, "Wrong size on UMoonbeam_PowerRatingWidget_C");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, UberGraphFrame) == 0x000308, "Member 'UMoonbeam_PowerRatingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, BaseRatingValue) == 0x000310, "Member 'UMoonbeam_PowerRatingWidget_C::BaseRatingValue' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, BaseRatingValue_Large) == 0x000318, "Member 'UMoonbeam_PowerRatingWidget_C::BaseRatingValue_Large' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, BuffedRatingOuterGlow) == 0x000320, "Member 'UMoonbeam_PowerRatingWidget_C::BuffedRatingOuterGlow' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, HomebaseRatingBar) == 0x000328, "Member 'UMoonbeam_PowerRatingWidget_C::HomebaseRatingBar' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, Image_Power) == 0x000330, "Member 'UMoonbeam_PowerRatingWidget_C::Image_Power' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, ModeTypeSwitcher) == 0x000338, "Member 'UMoonbeam_PowerRatingWidget_C::ModeTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, Moonbeam_Power_Back) == 0x000340, "Member 'UMoonbeam_PowerRatingWidget_C::Moonbeam_Power_Back' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, OversizedMode) == 0x000348, "Member 'UMoonbeam_PowerRatingWidget_C::OversizedMode' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, PowerIconGlow) == 0x000350, "Member 'UMoonbeam_PowerRatingWidget_C::PowerIconGlow' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, Rating_Glow_Large) == 0x000358, "Member 'UMoonbeam_PowerRatingWidget_C::Rating_Glow_Large' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, RatingBar) == 0x000360, "Member 'UMoonbeam_PowerRatingWidget_C::RatingBar' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, RegularMode) == 0x000368, "Member 'UMoonbeam_PowerRatingWidget_C::RegularMode' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, TeamRatingValue) == 0x000370, "Member 'UMoonbeam_PowerRatingWidget_C::TeamRatingValue' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, TeamRatingValue_Large) == 0x000378, "Member 'UMoonbeam_PowerRatingWidget_C::TeamRatingValue_Large' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, ShowDualPower) == 0x000380, "Member 'UMoonbeam_PowerRatingWidget_C::ShowDualPower' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, ShowProgress) == 0x000381, "Member 'UMoonbeam_PowerRatingWidget_C::ShowProgress' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, ShowGlow) == 0x000382, "Member 'UMoonbeam_PowerRatingWidget_C::ShowGlow' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, UseLargeStyle) == 0x000383, "Member 'UMoonbeam_PowerRatingWidget_C::UseLargeStyle' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, UseOversizedMode) == 0x000384, "Member 'UMoonbeam_PowerRatingWidget_C::UseOversizedMode' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, InterpDuration) == 0x000388, "Member 'UMoonbeam_PowerRatingWidget_C::InterpDuration' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, PowerIncreasedSound) == 0x000390, "Member 'UMoonbeam_PowerRatingWidget_C::PowerIncreasedSound' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, Power_Rating_Num) == 0x000398, "Member 'UMoonbeam_PowerRatingWidget_C::Power_Rating_Num' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, PowerBackingColor) == 0x00039C, "Member 'UMoonbeam_PowerRatingWidget_C::PowerBackingColor' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, FontColor) == 0x0003AC, "Member 'UMoonbeam_PowerRatingWidget_C::FontColor' has a wrong offset!");

}

