#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiInteractDisplayWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MultiInteractDisplayWidget.MultiInteractDisplayWidget_C.CheckSquadSize
// 0x0058 (0x0058 - 0x0000)
struct MultiInteractDisplayWidget_C_CheckSquadSize final
{
public:
	int32                                         SquadCount;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSquadConnectedCount_ReturnValue;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MultiInteractDisplayWidget_C_CheckSquadSize) == 0x000008, "Wrong alignment on MultiInteractDisplayWidget_C_CheckSquadSize");
static_assert(sizeof(MultiInteractDisplayWidget_C_CheckSquadSize) == 0x000058, "Wrong size on MultiInteractDisplayWidget_C_CheckSquadSize");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, SquadCount) == 0x000000, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::SquadCount' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, Temp_bool_Variable) == 0x000004, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, Temp_byte_Variable) == 0x000005, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, Temp_byte_Variable_1) == 0x000006, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, Temp_int_Array_Index_Variable) == 0x000008, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, CallFunc_GetSquadConnectedCount_ReturnValue) == 0x000024, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::CallFunc_GetSquadConnectedCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, K2Node_Select_Default) == 0x000028, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, CallFunc_GetAllChildren_ReturnValue) == 0x000030, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, CallFunc_Array_Get_Item) == 0x000048, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CheckSquadSize, CallFunc_Less_IntInt_ReturnValue_1) == 0x000050, "Member 'MultiInteractDisplayWidget_C_CheckSquadSize::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function MultiInteractDisplayWidget.MultiInteractDisplayWidget_C.CurrentInteractionCount
// 0x00E0 (0x00E0 - 0x0000)
struct MultiInteractDisplayWidget_C_CurrentInteractionCount final
{
public:
	int32                                         CurrentCount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MultiInteractDisplayWidget_C_CurrentInteractionCount) == 0x000008, "Wrong alignment on MultiInteractDisplayWidget_C_CurrentInteractionCount");
static_assert(sizeof(MultiInteractDisplayWidget_C_CurrentInteractionCount) == 0x0000E0, "Wrong size on MultiInteractDisplayWidget_C_CurrentInteractionCount");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CurrentCount) == 0x000000, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CurrentCount' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, Temp_bool_Variable) == 0x000004, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, Temp_float_Variable) == 0x000008, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, Temp_float_Variable_1) == 0x00000C, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, Temp_int_Array_Index_Variable) == 0x000010, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000020, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000078, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, K2Node_MakeArray_Array) == 0x000080, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, K2Node_SwitchInteger_CmpSuccess) == 0x000090, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_Format_ReturnValue) == 0x000098, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_GetAllChildren_ReturnValue) == 0x0000B8, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, K2Node_Select_Default) == 0x0000D0, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_Array_Length_ReturnValue) == 0x0000D4, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_CurrentInteractionCount, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D8, "Member 'MultiInteractDisplayWidget_C_CurrentInteractionCount::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function MultiInteractDisplayWidget.MultiInteractDisplayWidget_C.ExecuteUbergraph_MultiInteractDisplayWidget
// 0x0014 (0x0014 - 0x0000)
struct MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget) == 0x000004, "Wrong alignment on MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget");
static_assert(sizeof(MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget) == 0x000014, "Wrong size on MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget");
static_assert(offsetof(MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget, EntryPoint) == 0x000000, "Member 'MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget, Temp_bool_Variable) == 0x000004, "Member 'MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget, Temp_int_Variable) == 0x000008, "Member 'MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget, Temp_int_Variable_1) == 0x00000C, "Member 'MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget, K2Node_Select_Default) == 0x000010, "Member 'MultiInteractDisplayWidget_C_ExecuteUbergraph_MultiInteractDisplayWidget::K2Node_Select_Default' has a wrong offset!");

}

