#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MusicPartyPropComponent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.UpdateAudioAttenuation
// 0x04F8 (0x04F8 - 0x0000)
struct MusicPartyPropComponent_C_UpdateAudioAttenuation final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundAttenuationSettings              CallFunc_BP_GetAttenuationSettingsToApply_OutAttenuationSettings; // 0x0008(0x03A8)()
	bool                                          CallFunc_BP_GetAttenuationSettingsToApply_ReturnValue; // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorArrayBounds_Center;               // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorArrayBounds_BoxExtent;            // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorArrayAverageLocation_ReturnValue; // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0418(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(MusicPartyPropComponent_C_UpdateAudioAttenuation) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_UpdateAudioAttenuation");
static_assert(sizeof(MusicPartyPropComponent_C_UpdateAudioAttenuation) == 0x0004F8, "Wrong size on MusicPartyPropComponent_C_UpdateAudioAttenuation");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_BP_GetAttenuationSettingsToApply_OutAttenuationSettings) == 0x000008, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_BP_GetAttenuationSettingsToApply_OutAttenuationSettings' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_BP_GetAttenuationSettingsToApply_ReturnValue) == 0x0003B0, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_BP_GetAttenuationSettingsToApply_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_GetActorArrayBounds_Center) == 0x0003B8, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_GetActorArrayBounds_Center' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_GetActorArrayBounds_BoxExtent) == 0x0003D0, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_GetActorArrayBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_BreakVector_X) == 0x0003E8, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_BreakVector_Y) == 0x0003EC, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_BreakVector_Z) == 0x0003F0, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_GetActorArrayAverageLocation_ReturnValue) == 0x0003F8, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_GetActorArrayAverageLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_FMax_ReturnValue) == 0x000410, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000414, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_UpdateAudioAttenuation, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000418, "Member 'MusicPartyPropComponent_C_UpdateAudioAttenuation::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.Stop Party
// 0x0004 (0x0004 - 0x0000)
struct MusicPartyPropComponent_C_Stop_Party final
{
public:
	float                                         FadeOutDuration;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_Stop_Party) == 0x000004, "Wrong alignment on MusicPartyPropComponent_C_Stop_Party");
static_assert(sizeof(MusicPartyPropComponent_C_Stop_Party) == 0x000004, "Wrong size on MusicPartyPropComponent_C_Stop_Party");
static_assert(offsetof(MusicPartyPropComponent_C_Stop_Party, FadeOutDuration) == 0x000000, "Member 'MusicPartyPropComponent_C_Stop_Party::FadeOutDuration' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.Start Party
// 0x0008 (0x0008 - 0x0000)
struct MusicPartyPropComponent_C_Start_Party final
{
public:
	class UAudioComponent*                        Audio_Component;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_Start_Party) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_Start_Party");
static_assert(sizeof(MusicPartyPropComponent_C_Start_Party) == 0x000008, "Wrong size on MusicPartyPropComponent_C_Start_Party");
static_assert(offsetof(MusicPartyPropComponent_C_Start_Party, Audio_Component) == 0x000000, "Member 'MusicPartyPropComponent_C_Start_Party::Audio_Component' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.SetupAutoActivate
// 0x0018 (0x0018 - 0x0000)
struct MusicPartyPropComponent_C_SetupAutoActivate final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_SetupAutoActivate) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_SetupAutoActivate");
static_assert(sizeof(MusicPartyPropComponent_C_SetupAutoActivate) == 0x000018, "Wrong size on MusicPartyPropComponent_C_SetupAutoActivate");
static_assert(offsetof(MusicPartyPropComponent_C_SetupAutoActivate, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'MusicPartyPropComponent_C_SetupAutoActivate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_SetupAutoActivate, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'MusicPartyPropComponent_C_SetupAutoActivate::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_SetupAutoActivate, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'MusicPartyPropComponent_C_SetupAutoActivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.SetSourceBusComponent
// 0x0018 (0x0018 - 0x0000)
struct MusicPartyPropComponent_C_SetSourceBusComponent final
{
public:
	class UAudioComponent*                        SourceBusComponent_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsVirtualized)>          K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_SetSourceBusComponent) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_SetSourceBusComponent");
static_assert(sizeof(MusicPartyPropComponent_C_SetSourceBusComponent) == 0x000018, "Wrong size on MusicPartyPropComponent_C_SetSourceBusComponent");
static_assert(offsetof(MusicPartyPropComponent_C_SetSourceBusComponent, SourceBusComponent_0) == 0x000000, "Member 'MusicPartyPropComponent_C_SetSourceBusComponent::SourceBusComponent_0' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_SetSourceBusComponent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'MusicPartyPropComponent_C_SetSourceBusComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_SetSourceBusComponent, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'MusicPartyPropComponent_C_SetSourceBusComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.ResolveSpeakerActors
// 0x0068 (0x0068 - 0x0000)
struct MusicPartyPropComponent_C_ResolveSpeakerActors final
{
public:
	TArray<class ABuildingActor*>                 Resolved;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABuildingActor>          CallFunc_Array_Get_Item;                           // 0x0020(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_ResolveSpeakerActors) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_ResolveSpeakerActors");
static_assert(sizeof(MusicPartyPropComponent_C_ResolveSpeakerActors) == 0x000068, "Wrong size on MusicPartyPropComponent_C_ResolveSpeakerActors");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, Resolved) == 0x000000, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::Resolved' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, Temp_int_Array_Index_Variable) == 0x000010, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, CallFunc_Array_Get_Item) == 0x000020, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000050, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, K2Node_DynamicCast_AsBuilding_Actor) == 0x000058, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_ResolveSpeakerActors, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'MusicPartyPropComponent_C_ResolveSpeakerActors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.RemoveSpeakerServer
// 0x0038 (0x0038 - 0x0000)
struct MusicPartyPropComponent_C_RemoveSpeakerServer final
{
public:
	const class ABuildingActor*                   Speaker;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_RemoveSpeakerServer) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_RemoveSpeakerServer");
static_assert(sizeof(MusicPartyPropComponent_C_RemoveSpeakerServer) == 0x000038, "Wrong size on MusicPartyPropComponent_C_RemoveSpeakerServer");
static_assert(offsetof(MusicPartyPropComponent_C_RemoveSpeakerServer, Speaker) == 0x000000, "Member 'MusicPartyPropComponent_C_RemoveSpeakerServer::Speaker' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_RemoveSpeakerServer, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'MusicPartyPropComponent_C_RemoveSpeakerServer::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_RemoveSpeakerServer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'MusicPartyPropComponent_C_RemoveSpeakerServer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_RemoveSpeakerServer, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'MusicPartyPropComponent_C_RemoveSpeakerServer::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_RemoveSpeakerServer, CallFunc_Array_IsEmpty_ReturnValue) == 0x000030, "Member 'MusicPartyPropComponent_C_RemoveSpeakerServer::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_RemoveSpeakerServer, CallFunc_Array_RemoveItem_ReturnValue) == 0x000031, "Member 'MusicPartyPropComponent_C_RemoveSpeakerServer::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct MusicPartyPropComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on MusicPartyPropComponent_C_ReceiveEndPlay");
static_assert(sizeof(MusicPartyPropComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on MusicPartyPropComponent_C_ReceiveEndPlay");
static_assert(offsetof(MusicPartyPropComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'MusicPartyPropComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.OnSourceBusVirtualizationChanged
// 0x0010 (0x0010 - 0x0000)
struct MusicPartyPropComponent_C_OnSourceBusVirtualizationChanged final
{
public:
	bool                                          bIsVirtualized;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMusicEventSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_OnSourceBusVirtualizationChanged) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_OnSourceBusVirtualizationChanged");
static_assert(sizeof(MusicPartyPropComponent_C_OnSourceBusVirtualizationChanged) == 0x000010, "Wrong size on MusicPartyPropComponent_C_OnSourceBusVirtualizationChanged");
static_assert(offsetof(MusicPartyPropComponent_C_OnSourceBusVirtualizationChanged, bIsVirtualized) == 0x000000, "Member 'MusicPartyPropComponent_C_OnSourceBusVirtualizationChanged::bIsVirtualized' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnSourceBusVirtualizationChanged, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'MusicPartyPropComponent_C_OnSourceBusVirtualizationChanged::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.OnRep_SpeakerActorsResolved
// 0x0010 (0x0010 - 0x0000)
struct MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved");
static_assert(sizeof(MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved) == 0x000010, "Wrong size on MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved");
static_assert(offsetof(MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000008, "Member 'MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved, CallFunc_Array_IsEmpty_ReturnValue) == 0x000009, "Member 'MusicPartyPropComponent_C_OnRep_SpeakerActorsResolved::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.OnReady_96C85A044ED9A5029B7FE68338D3E70F
// 0x0008 (0x0008 - 0x0000)
struct MusicPartyPropComponent_C_OnReady_96C85A044ED9A5029B7FE68338D3E70F final
{
public:
	class AGameStateBase*                         GameState_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_OnReady_96C85A044ED9A5029B7FE68338D3E70F) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_OnReady_96C85A044ED9A5029B7FE68338D3E70F");
static_assert(sizeof(MusicPartyPropComponent_C_OnReady_96C85A044ED9A5029B7FE68338D3E70F) == 0x000008, "Wrong size on MusicPartyPropComponent_C_OnReady_96C85A044ED9A5029B7FE68338D3E70F");
static_assert(offsetof(MusicPartyPropComponent_C_OnReady_96C85A044ED9A5029B7FE68338D3E70F, GameState_0) == 0x000000, "Member 'MusicPartyPropComponent_C_OnReady_96C85A044ED9A5029B7FE68338D3E70F::GameState_0' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.OnOwnerDeathEffectsClient
// 0x0248 (0x0248 - 0x0000)
struct MusicPartyPropComponent_C_OnOwnerDeathEffectsClient final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_OnOwnerDeathEffectsClient");
static_assert(sizeof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient) == 0x000248, "Wrong size on MusicPartyPropComponent_C_OnOwnerDeathEffectsClient");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, Damage) == 0x000000, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::Damage' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, DamageTags) == 0x000008, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::DamageTags' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, Momentum) == 0x000028, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::Momentum' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, HitInfo) == 0x000040, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::HitInfo' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, InstigatedBy) == 0x000120, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::InstigatedBy' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, DamageCauser) == 0x000128, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::DamageCauser' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, EffectContext) == 0x000130, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::EffectContext' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_GetOwner_ReturnValue) == 0x000148, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_bBlockingHit) == 0x000150, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_bInitialOverlap) == 0x000151, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_Time) == 0x000154, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_Distance) == 0x000158, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_Location) == 0x000160, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_Normal) == 0x000190, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A8, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_PhysMat) == 0x0001C0, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_HitActor) == 0x0001C8, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_HitComponent) == 0x0001D0, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_HitBoneName) == 0x0001D8, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_BoneName) == 0x0001DC, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_FaceIndex) == 0x0001E8, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000220, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, K2Node_DynamicCast_AsBuilding_Actor) == 0x000238, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_Array_RemoveItem_ReturnValue) == 0x000241, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnOwnerDeathEffectsClient, CallFunc_Array_IsEmpty_ReturnValue) == 0x000242, "Member 'MusicPartyPropComponent_C_OnOwnerDeathEffectsClient::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.OnDiedServer
// 0x0070 (0x0070 - 0x0000)
struct MusicPartyPropComponent_C_OnDiedServer final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_OnDiedServer) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_OnDiedServer");
static_assert(sizeof(MusicPartyPropComponent_C_OnDiedServer) == 0x000070, "Wrong size on MusicPartyPropComponent_C_OnDiedServer");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, DamagedActor) == 0x000000, "Member 'MusicPartyPropComponent_C_OnDiedServer::DamagedActor' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, Damage) == 0x000008, "Member 'MusicPartyPropComponent_C_OnDiedServer::Damage' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, InstigatedBy) == 0x000010, "Member 'MusicPartyPropComponent_C_OnDiedServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, DamageCauser) == 0x000018, "Member 'MusicPartyPropComponent_C_OnDiedServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, HitLocation) == 0x000020, "Member 'MusicPartyPropComponent_C_OnDiedServer::HitLocation' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, FHitComponent) == 0x000038, "Member 'MusicPartyPropComponent_C_OnDiedServer::FHitComponent' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, BoneName) == 0x000040, "Member 'MusicPartyPropComponent_C_OnDiedServer::BoneName' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, Momentum) == 0x000048, "Member 'MusicPartyPropComponent_C_OnDiedServer::Momentum' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, K2Node_DynamicCast_AsBuilding_Actor) == 0x000060, "Member 'MusicPartyPropComponent_C_OnDiedServer::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDiedServer, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'MusicPartyPropComponent_C_OnDiedServer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.OnDamagedServer
// 0x0068 (0x0068 - 0x0000)
struct MusicPartyPropComponent_C_OnDamagedServer final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_OnDamagedServer) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_OnDamagedServer");
static_assert(sizeof(MusicPartyPropComponent_C_OnDamagedServer) == 0x000068, "Wrong size on MusicPartyPropComponent_C_OnDamagedServer");
static_assert(offsetof(MusicPartyPropComponent_C_OnDamagedServer, DamagedActor) == 0x000000, "Member 'MusicPartyPropComponent_C_OnDamagedServer::DamagedActor' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDamagedServer, Damage) == 0x000008, "Member 'MusicPartyPropComponent_C_OnDamagedServer::Damage' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDamagedServer, InstigatedBy) == 0x000010, "Member 'MusicPartyPropComponent_C_OnDamagedServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDamagedServer, DamageCauser) == 0x000018, "Member 'MusicPartyPropComponent_C_OnDamagedServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDamagedServer, HitLocation) == 0x000020, "Member 'MusicPartyPropComponent_C_OnDamagedServer::HitLocation' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDamagedServer, FHitComponent) == 0x000038, "Member 'MusicPartyPropComponent_C_OnDamagedServer::FHitComponent' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDamagedServer, BoneName) == 0x000040, "Member 'MusicPartyPropComponent_C_OnDamagedServer::BoneName' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDamagedServer, Momentum) == 0x000048, "Member 'MusicPartyPropComponent_C_OnDamagedServer::Momentum' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_OnDamagedServer, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'MusicPartyPropComponent_C_OnDamagedServer::CallFunc_GetOwner_ReturnValue' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.OnBuildingHealthChangedClient
// 0x0018 (0x0018 - 0x0000)
struct MusicPartyPropComponent_C_OnBuildingHealthChangedClient final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_OnBuildingHealthChangedClient) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_OnBuildingHealthChangedClient");
static_assert(sizeof(MusicPartyPropComponent_C_OnBuildingHealthChangedClient) == 0x000018, "Wrong size on MusicPartyPropComponent_C_OnBuildingHealthChangedClient");
static_assert(offsetof(MusicPartyPropComponent_C_OnBuildingHealthChangedClient, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'MusicPartyPropComponent_C_OnBuildingHealthChangedClient::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.On Speaker Removed Rep
// 0x0018 (0x0018 - 0x0000)
struct MusicPartyPropComponent_C_On_Speaker_Removed_Rep final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_On_Speaker_Removed_Rep) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_On_Speaker_Removed_Rep");
static_assert(sizeof(MusicPartyPropComponent_C_On_Speaker_Removed_Rep) == 0x000018, "Wrong size on MusicPartyPropComponent_C_On_Speaker_Removed_Rep");
static_assert(offsetof(MusicPartyPropComponent_C_On_Speaker_Removed_Rep, Location) == 0x000000, "Member 'MusicPartyPropComponent_C_On_Speaker_Removed_Rep::Location' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.On Speaker Damaged Rep
// 0x0018 (0x0018 - 0x0000)
struct MusicPartyPropComponent_C_On_Speaker_Damaged_Rep final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_On_Speaker_Damaged_Rep) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_On_Speaker_Damaged_Rep");
static_assert(sizeof(MusicPartyPropComponent_C_On_Speaker_Damaged_Rep) == 0x000018, "Wrong size on MusicPartyPropComponent_C_On_Speaker_Damaged_Rep");
static_assert(offsetof(MusicPartyPropComponent_C_On_Speaker_Damaged_Rep, Location) == 0x000000, "Member 'MusicPartyPropComponent_C_On_Speaker_Damaged_Rep::Location' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.On All Speakers Removed Rep
// 0x0018 (0x0018 - 0x0000)
struct MusicPartyPropComponent_C_On_All_Speakers_Removed_Rep final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_On_All_Speakers_Removed_Rep) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_On_All_Speakers_Removed_Rep");
static_assert(sizeof(MusicPartyPropComponent_C_On_All_Speakers_Removed_Rep) == 0x000018, "Wrong size on MusicPartyPropComponent_C_On_All_Speakers_Removed_Rep");
static_assert(offsetof(MusicPartyPropComponent_C_On_All_Speakers_Removed_Rep, Location) == 0x000000, "Member 'MusicPartyPropComponent_C_On_All_Speakers_Removed_Rep::Location' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.IsOwnedByBuildingActor
// 0x0020 (0x0020 - 0x0000)
struct MusicPartyPropComponent_C_IsOwnedByBuildingActor final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MusicPartyPropComponent_C_IsOwnedByBuildingActor) == 0x000008, "Wrong alignment on MusicPartyPropComponent_C_IsOwnedByBuildingActor");
static_assert(sizeof(MusicPartyPropComponent_C_IsOwnedByBuildingActor) == 0x000020, "Wrong size on MusicPartyPropComponent_C_IsOwnedByBuildingActor");
static_assert(offsetof(MusicPartyPropComponent_C_IsOwnedByBuildingActor, Result) == 0x000000, "Member 'MusicPartyPropComponent_C_IsOwnedByBuildingActor::Result' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_IsOwnedByBuildingActor, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'MusicPartyPropComponent_C_IsOwnedByBuildingActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_IsOwnedByBuildingActor, K2Node_DynamicCast_AsBuilding_Actor) == 0x000010, "Member 'MusicPartyPropComponent_C_IsOwnedByBuildingActor::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(MusicPartyPropComponent_C_IsOwnedByBuildingActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MusicPartyPropComponent_C_IsOwnedByBuildingActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MusicPartyPropComponent.MusicPartyPropComponent_C.ExecuteUbergraph_MusicPartyPropComponent
// 0x00E8 (0x00E8 - 0x0000)
struct MusicPartyPropComponent_C_ExecuteUbergraph_MusicPartyPropComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class UMusicPartyPropComponent_C*       Temp_object_Variable;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UMusicPartyPropComponent_C*       Temp_object_Variable_1;                            // 0x0010(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UMusicPartyPropComponent_C*       Temp_object_Variable_2;                            // 0x0020(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_GameStateReady*        CallFunc_GameStateReadyAsync_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        K2Node_CustomEvent_Audio_Component;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FadeOutDuration;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         K2Node_CustomEvent_GameState;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UMusicPartyPropComponent_C*       Temp_object_Variable_4;                            // 0x0058(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
