#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class NetUI.BadNetworkIndicator
// 0x0030 (0x0350 - 0x0320)
class UBadNetworkIndicator final : public UFortHUDElementWidget
{
public:
	bool                                          bEnabled;                                          // 0x0320(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDisplayTime;                                // 0x0324(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UpdateTime;                                        // 0x0328(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InitialDelay;                                      // 0x032C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_330[0x20];                                     // 0x0330(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateDisplay();

	float GetPacketLoss() const;
	float GetPing() const;
	bool HasBadPacketLoss() const;
	bool HasBadPing() const;
	bool HasSeverePacketLoss() const;
	bool HasSeverePing() const;
	bool ShouldDisplay() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BadNetworkIndicator">();
	}
	static class UBadNetworkIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBadNetworkIndicator>();
	}
};
static_assert(alignof(UBadNetworkIndicator) == 0x000008, "Wrong alignment on UBadNetworkIndicator");
static_assert(sizeof(UBadNetworkIndicator) == 0x000350, "Wrong size on UBadNetworkIndicator");
static_assert(offsetof(UBadNetworkIndicator, bEnabled) == 0x000320, "Member 'UBadNetworkIndicator::bEnabled' has a wrong offset!");
static_assert(offsetof(UBadNetworkIndicator, MinimumDisplayTime) == 0x000324, "Member 'UBadNetworkIndicator::MinimumDisplayTime' has a wrong offset!");
static_assert(offsetof(UBadNetworkIndicator, UpdateTime) == 0x000328, "Member 'UBadNetworkIndicator::UpdateTime' has a wrong offset!");
static_assert(offsetof(UBadNetworkIndicator, InitialDelay) == 0x00032C, "Member 'UBadNetworkIndicator::InitialDelay' has a wrong offset!");

// Class NetUI.NetDebugWidget
// 0x00E8 (0x03A0 - 0x02B8)
class UNetDebugWidget final : public UUserWidget
{
public:
	class UCommonTextBlock*                       PingUI;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PacketInRateUI;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PacketOutRateUI;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PacketInLossUI;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PacketOutLossUI;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       UpBandwidthUI;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       DownBandwidthUI;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F0[0xB0];                                     // 0x02F0(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartTimer();
	void StopTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetDebugWidget">();
	}
	static class UNetDebugWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetDebugWidget>();
	}
};
static_assert(alignof(UNetDebugWidget) == 0x000008, "Wrong alignment on UNetDebugWidget");
static_assert(sizeof(UNetDebugWidget) == 0x0003A0, "Wrong size on UNetDebugWidget");
static_assert(offsetof(UNetDebugWidget, PingUI) == 0x0002B8, "Member 'UNetDebugWidget::PingUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, PacketInRateUI) == 0x0002C0, "Member 'UNetDebugWidget::PacketInRateUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, PacketOutRateUI) == 0x0002C8, "Member 'UNetDebugWidget::PacketOutRateUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, PacketInLossUI) == 0x0002D0, "Member 'UNetDebugWidget::PacketInLossUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, PacketOutLossUI) == 0x0002D8, "Member 'UNetDebugWidget::PacketOutLossUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, UpBandwidthUI) == 0x0002E0, "Member 'UNetDebugWidget::UpBandwidthUI' has a wrong offset!");
static_assert(offsetof(UNetDebugWidget, DownBandwidthUI) == 0x0002E8, "Member 'UNetDebugWidget::DownBandwidthUI' has a wrong offset!");

// Class NetUI.NetGraph
// 0x0038 (0x02F0 - 0x02B8)
class UNetGraph final : public UUserWidget
{
public:
	struct FColor                                 BackgroundColor;                                   // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 PingLineColor;                                     // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 QueuedBunchesLineColor;                            // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 PacketLossLineColor;                               // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              DesiredSize;                                       // 0x02C8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxPingToGraph;                                    // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2DC[0x14];                                     // 0x02DC(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetGraph">();
	}
	static class UNetGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetGraph>();
	}
};
static_assert(alignof(UNetGraph) == 0x000008, "Wrong alignment on UNetGraph");
static_assert(sizeof(UNetGraph) == 0x0002F0, "Wrong size on UNetGraph");
static_assert(offsetof(UNetGraph, BackgroundColor) == 0x0002B8, "Member 'UNetGraph::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UNetGraph, PingLineColor) == 0x0002BC, "Member 'UNetGraph::PingLineColor' has a wrong offset!");
static_assert(offsetof(UNetGraph, QueuedBunchesLineColor) == 0x0002C0, "Member 'UNetGraph::QueuedBunchesLineColor' has a wrong offset!");
static_assert(offsetof(UNetGraph, PacketLossLineColor) == 0x0002C4, "Member 'UNetGraph::PacketLossLineColor' has a wrong offset!");
static_assert(offsetof(UNetGraph, DesiredSize) == 0x0002C8, "Member 'UNetGraph::DesiredSize' has a wrong offset!");
static_assert(offsetof(UNetGraph, MaxPingToGraph) == 0x0002D8, "Member 'UNetGraph::MaxPingToGraph' has a wrong offset!");

}

