#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Pawn_Irwin_Simple_Smackie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NPC_Pawn_Irwin_Simple_Smackie.NPC_Pawn_Irwin_Simple_Smackie_C.ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie
// 0x01F0 (0x01F0 - 0x0000)
struct NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0018(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x0110(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie) == 0x000008, "Wrong alignment on NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie");
static_assert(sizeof(NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie) == 0x0001F0, "Wrong size on NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie");
static_assert(offsetof(NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie, EntryPoint) == 0x000000, "Member 'NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie, K2Node_CustomEvent_Hit) == 0x000018, "Member 'NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F8, "Member 'NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie, K2Node_CustomEvent_HitResult) == 0x000110, "Member 'NPC_Pawn_Irwin_Simple_Smackie_C_ExecuteUbergraph_NPC_Pawn_Irwin_Simple_Smackie::K2Node_CustomEvent_HitResult' has a wrong offset!");

// Function NPC_Pawn_Irwin_Simple_Smackie.NPC_Pawn_Irwin_Simple_Smackie_C.OnSmackieLanded
// 0x00E0 (0x00E0 - 0x0000)
struct NPC_Pawn_Irwin_Simple_Smackie_C_OnSmackieLanded final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00E0)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(NPC_Pawn_Irwin_Simple_Smackie_C_OnSmackieLanded) == 0x000008, "Wrong alignment on NPC_Pawn_Irwin_Simple_Smackie_C_OnSmackieLanded");
static_assert(sizeof(NPC_Pawn_Irwin_Simple_Smackie_C_OnSmackieLanded) == 0x0000E0, "Wrong size on NPC_Pawn_Irwin_Simple_Smackie_C_OnSmackieLanded");
static_assert(offsetof(NPC_Pawn_Irwin_Simple_Smackie_C_OnSmackieLanded, HitResult) == 0x000000, "Member 'NPC_Pawn_Irwin_Simple_Smackie_C_OnSmackieLanded::HitResult' has a wrong offset!");

// Function NPC_Pawn_Irwin_Simple_Smackie.NPC_Pawn_Irwin_Simple_Smackie_C.SmackieLanded
// 0x00E0 (0x00E0 - 0x0000)
struct NPC_Pawn_Irwin_Simple_Smackie_C_SmackieLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(NPC_Pawn_Irwin_Simple_Smackie_C_SmackieLanded) == 0x000008, "Wrong alignment on NPC_Pawn_Irwin_Simple_Smackie_C_SmackieLanded");
static_assert(sizeof(NPC_Pawn_Irwin_Simple_Smackie_C_SmackieLanded) == 0x0000E0, "Wrong size on NPC_Pawn_Irwin_Simple_Smackie_C_SmackieLanded");
static_assert(offsetof(NPC_Pawn_Irwin_Simple_Smackie_C_SmackieLanded, Hit) == 0x000000, "Member 'NPC_Pawn_Irwin_Simple_Smackie_C_SmackieLanded::Hit' has a wrong offset!");

}

