#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_VoiceComponent

#include "Basic.hpp"

#include "FortniteAI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_VoiceComponent.NPC_VoiceComponent_C
// 0x0028 (0x00D0 - 0x00A8)
class UNPC_VoiceComponent_C final : public UFortAIComponent_Voice
{
public:
	class UFortTaggedSoundBank*                   DeprecatedBPSoundBank;                             // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachComponent;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerTimeThreshold;                              // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastTriggerTime;                                   // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Component;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundEffectSourcePresetChain*          SourceChainToApply;                                // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Deprecated_Set_Sound_Bank(class UFortTaggedSoundBank* SoundBank);
	void Internal_Get_Voice_Sound_Bank(class UFortTaggedSoundBank** Sound_Bank);
	void PlaySoundCue(class USoundCue* SoundToPlay, class UAudioComponent* AudioComponent, bool* Success);
	void PlayVoiceLine(const struct FGameplayTag& Gameplay_Tag, class UAudioComponent* AudioComponent, bool* Success);
	void SetSourceEffectChainToApply(class USoundEffectSourcePresetChain* SourceEffectChain);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_VoiceComponent_C">();
	}
	static class UNPC_VoiceComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_VoiceComponent_C>();
	}
};
static_assert(alignof(UNPC_VoiceComponent_C) == 0x000008, "Wrong alignment on UNPC_VoiceComponent_C");
static_assert(sizeof(UNPC_VoiceComponent_C) == 0x0000D0, "Wrong size on UNPC_VoiceComponent_C");
static_assert(offsetof(UNPC_VoiceComponent_C, DeprecatedBPSoundBank) == 0x0000A8, "Member 'UNPC_VoiceComponent_C::DeprecatedBPSoundBank' has a wrong offset!");
static_assert(offsetof(UNPC_VoiceComponent_C, AttachComponent) == 0x0000B0, "Member 'UNPC_VoiceComponent_C::AttachComponent' has a wrong offset!");
static_assert(offsetof(UNPC_VoiceComponent_C, TriggerTimeThreshold) == 0x0000B8, "Member 'UNPC_VoiceComponent_C::TriggerTimeThreshold' has a wrong offset!");
static_assert(offsetof(UNPC_VoiceComponent_C, LastTriggerTime) == 0x0000BC, "Member 'UNPC_VoiceComponent_C::LastTriggerTime' has a wrong offset!");
static_assert(offsetof(UNPC_VoiceComponent_C, Audio_Component) == 0x0000C0, "Member 'UNPC_VoiceComponent_C::Audio_Component' has a wrong offset!");
static_assert(offsetof(UNPC_VoiceComponent_C, SourceChainToApply) == 0x0000C8, "Member 'UNPC_VoiceComponent_C::SourceChainToApply' has a wrong offset!");

}

