#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Pawn_Irwin_Prey_Burt

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "NPC_Pawn_Wildlife_Prey_Parent_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_Pawn_Irwin_Prey_Burt.NPC_Pawn_Irwin_Prey_Burt_C
// 0x0090 (0x3A30 - 0x39A0)
class ANPC_Pawn_Irwin_Prey_Burt_C final : public ANPC_Pawn_Wildlife_Prey_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_Pawn_Irwin_Prey_Burt_C;         // 0x39A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFTP_NPC_Assignment_Loot_Omnivore_C*    FTP_NPC_Assignment_Loot_Omnivore;                  // 0x39A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortAthenaCollisionReactionComponent*  FortAthenaCollisionReaction_Riding_Charge;         // 0x39B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortCharacterPartsComponent*           FortCharacterParts;                                // 0x39B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Interaction_Preventing_Tags;                       // 0x39C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           SprintImpactGameplayCueTag;                        // 0x39E0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39E4[0x4];                                     // 0x39E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GESprintImpactPawn;                                // 0x39E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GESprintImpactVehicle;                             // 0x39F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  InteractingPawnPreventingTags;                     // 0x39F8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraSystem*                         Landing_FX;                                        // 0x3A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          playLandingFX;                                     // 0x3A20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Burt(int32 EntryPoint);
	void OnEnteredWaterBody(class AFortWaterBodyActor* WaterBody, bool bIsFirstBody);
	void OnExitedWaterBody(class AFortWaterBodyActor* WaterBody, bool bIsLastBody);
	void OnLanded(const struct FHitResult& Hit);

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Pawn_Irwin_Prey_Burt_C">();
	}
	static class ANPC_Pawn_Irwin_Prey_Burt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_Pawn_Irwin_Prey_Burt_C>();
	}
};
static_assert(alignof(ANPC_Pawn_Irwin_Prey_Burt_C) == 0x000010, "Wrong alignment on ANPC_Pawn_Irwin_Prey_Burt_C");
static_assert(sizeof(ANPC_Pawn_Irwin_Prey_Burt_C) == 0x003A30, "Wrong size on ANPC_Pawn_Irwin_Prey_Burt_C");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, UberGraphFrame_NPC_Pawn_Irwin_Prey_Burt_C) == 0x0039A0, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::UberGraphFrame_NPC_Pawn_Irwin_Prey_Burt_C' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, FTP_NPC_Assignment_Loot_Omnivore) == 0x0039A8, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::FTP_NPC_Assignment_Loot_Omnivore' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, FortAthenaCollisionReaction_Riding_Charge) == 0x0039B0, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::FortAthenaCollisionReaction_Riding_Charge' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, FortCharacterParts) == 0x0039B8, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::FortCharacterParts' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, Interaction_Preventing_Tags) == 0x0039C0, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::Interaction_Preventing_Tags' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, SprintImpactGameplayCueTag) == 0x0039E0, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::SprintImpactGameplayCueTag' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, GESprintImpactPawn) == 0x0039E8, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::GESprintImpactPawn' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, GESprintImpactVehicle) == 0x0039F0, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::GESprintImpactVehicle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, InteractingPawnPreventingTags) == 0x0039F8, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::InteractingPawnPreventingTags' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, Landing_FX) == 0x003A18, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::Landing_FX' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Irwin_Prey_Burt_C, playLandingFX) == 0x003A20, "Member 'ANPC_Pawn_Irwin_Prey_Burt_C::playLandingFX' has a wrong offset!");

}

