#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Pawn_Irwin_Prey_Nug_Loot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function NPC_Pawn_Irwin_Prey_Nug_Loot.NPC_Pawn_Irwin_Prey_Nug_Loot_C.ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot
// 0x0240 (0x0240 - 0x0000)
struct NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_ThisPawn;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0030(0x0080)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortPawn* ThisPawn)>    K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x00F0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0128(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0218(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   Temp_byte_Variable;                                // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x1];                                      // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_7;                             // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot) == 0x000008, "Wrong alignment on NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot");
static_assert(sizeof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot) == 0x000240, "Wrong size on NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, EntryPoint) == 0x000000, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_CustomEvent_ThisPawn) == 0x000008, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_CustomEvent_ThisPawn' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, Temp_float_Variable) == 0x000010, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, Temp_float_Variable_1) == 0x000014, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, Temp_float_Variable_2) == 0x000018, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, Temp_float_Variable_3) == 0x00001C, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, Temp_float_Variable_4) == 0x000020, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, Temp_float_Variable_5) == 0x000024, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, Temp_float_Variable_6) == 0x000028, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, CallFunc_Greater_ByteByte_ReturnValue) == 0x00002C, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, CallFunc_BPGetRarityData_ReturnValue) == 0x000030, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, CallFunc_SelectColor_ReturnValue) == 0x0000B0, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000C0, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000E4, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_Event_Damage) == 0x0000E8, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_Event_DamageTags) == 0x0000F0, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_Event_Momentum) == 0x000110, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_Event_HitInfo) == 0x000128, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_Event_InstigatedBy) == 0x000208, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_Event_DamageCauser) == 0x000210, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_Event_EffectContext) == 0x000218, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, CallFunc_IsValid_ReturnValue) == 0x000230, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, CallFunc_IsPlaying_ReturnValue) == 0x000231, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, Temp_byte_Variable) == 0x000232, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, Temp_float_Variable_7) == 0x000234, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot, K2Node_Select_Default) == 0x000238, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_ExecuteUbergraph_NPC_Pawn_Irwin_Prey_Nug_Loot::K2Node_Select_Default' has a wrong offset!");

// Function NPC_Pawn_Irwin_Prey_Nug_Loot.NPC_Pawn_Irwin_Prey_Nug_Loot_C.MeshLoaded
// 0x0008 (0x0008 - 0x0000)
struct NPC_Pawn_Irwin_Prey_Nug_Loot_C_MeshLoaded final
{
public:
	class AFortPawn*                              ThisPawn;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_MeshLoaded) == 0x000008, "Wrong alignment on NPC_Pawn_Irwin_Prey_Nug_Loot_C_MeshLoaded");
static_assert(sizeof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_MeshLoaded) == 0x000008, "Wrong size on NPC_Pawn_Irwin_Prey_Nug_Loot_C_MeshLoaded");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_MeshLoaded, ThisPawn) == 0x000000, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_MeshLoaded::ThisPawn' has a wrong offset!");

// Function NPC_Pawn_Irwin_Prey_Nug_Loot.NPC_Pawn_Irwin_Prey_Nug_Loot_C.OnDeathPlayEffects
// 0x0148 (0x0148 - 0x0000)
struct NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects");
static_assert(sizeof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects) == 0x000148, "Wrong size on NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects, HitInfo) == 0x000040, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects, InstigatedBy) == 0x000120, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects, DamageCauser) == 0x000128, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects, EffectContext) == 0x000130, "Member 'NPC_Pawn_Irwin_Prey_Nug_Loot_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

}

