#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Pawn_Wildlife_Parent

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "NPC_Pawn_Parent_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "Enum_NPC_AlertLevel_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_Pawn_Wildlife_Parent.NPC_Pawn_Wildlife_Parent_C
// 0x0130 (0x39A0 - 0x3870)
class ANPC_Pawn_Wildlife_Parent_C : public ANPC_Pawn_Parent_C
{
public:
	uint8                                         Pad_3864[0x4];                                     // 0x3864(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_Pawn_Wildlife_Parent_C;         // 0x3868(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Wildlife_FootDust;                                 // 0x3870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortPawnComponent_Convert*             ConvertComponent;                                  // 0x3878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Layer_Idle;                                        // 0x3880(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Layer_Locomotion;                                  // 0x38A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Layer_Jump;                                        // 0x38D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                         LeaderTeam;                                        // 0x38F8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38F9[0x7];                                     // 0x38F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundEffectSourcePresetChain*          VocalSourceEffectChainOverride;                    // 0x3900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTamingEnabled;                                    // 0x3908(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3909[0x7];                                     // 0x3909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ANPC_Pawn_Wildlife_Parent_C* WildlifePawn, class AActor* ActorGrabbed)> OnPickupGrabbed_Destroyed;                         // 0x3910(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bCanBeInteractedWithWhileTamed;                    // 0x3920(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3921[0x3];                                     // 0x3921(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            GE_Quest_Converted_Handle;                         // 0x3924(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392C[0x4];                                     // 0x392C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GE_Quest_Converted_Irwin;                          // 0x3930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Converted, class AFortPawn* InstigatorPawn)> ConvertedDispatcher;                               // 0x3938(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsBeingRidden;                                    // 0x3948(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPCStatusWidgetShouldDisplayDamage;                // 0x3949(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394A[0x6];                                     // 0x394A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GE_GoalSelectionWhileTamed;                        // 0x3950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_GoalSelectionWhileTamed;                         // 0x3958(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CurrentEnergy;                                     // 0x3978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           IrwinSlidingGC;                                    // 0x397C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bLeaderSetSuccess;                                 // 0x3980(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3981[0x3];                                     // 0x3981(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           JumpLandSoundLibTag;                               // 0x3984(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TameSoundLibTag;                                   // 0x3988(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_398C[0x4];                                     // 0x398C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundIndicatorSound_Unridden;                      // 0x3990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundIndicatorSound_Ridden;                        // 0x3998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AsyncLinkAnimationLayer(TSoftClassPtr<class UClass> AnimationLayer);
	void AttachAndApplyVocalFX(const struct FSoundLibraryPlaySoundResult& SoundLibraryResult);
	void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_0_ConvertedEvent__DelegateSignature(class AFortPawn* InstigatorPawn, class AFortPawn* ConvertedPawn);
	void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_1_UnconvertedEvent__DelegateSignature(class AFortPawn* UnconvertedPawn);
	void BndEvt__SoundLibrary_Component_K2Node_ComponentBoundEvent_2_OnSoundLibraryPlayEvent__DelegateSignature(const struct FSoundLibraryPlaySoundResult& Results, const class USoundLibraryContext* Context);
	void CanBeInteractedWithWhenTamed(bool* bCanInteract_0);
	void ExecuteUbergraph_NPC_Pawn_Wildlife_Parent(int32 EntryPoint);
	void HideStatus();
	void LinkAnimationLayers();
	void NPC_AlertLevelChangedServer(Enum_NPC_AlertLevel NPCAlertLevel);
	void NPC_CanBeInteractedWith(bool* CanInteract);
	void NPC_LeaderSet(bool Success_, class AActor* Leader);
	void NPC_PickupGrabbed_Destroyed(class AActor* ActorGrabbed);
	void NPC_SetupHealthBarOnDeath();
	void NPCStatusWidget_UpdateKeepVisible(bool ShouldKeepVisible);
	void On_NPC_PawnInteractedWith(class AActor* AIPawn, class AFortPlayerPawn* InteractingPlayerPawn);
	void On_Pawn_Focused(class AFortPawn* FocusedPawn);
	void OnApplyEffectOptimization(const int32 NewBudgetValue);
	void OnBeingControlledChanged(bool bControlled);
	void OnCustomizationsLoaded_BP();
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnLanded(const struct FHitResult& Hit);
	void OnLandedMulticast();
	void OnLoaded_9DC5FDA543FAF13BB29E95AA78B28A06(TSubclassOf<class UObject> Loaded);
	void OnPawnHealthChanged_Event_0();
	void OnRep_LeaderTeam();
	void OnSlidingStateChanged(bool bNewSlidingState);
	void OnTamedMulticast();
	void Play_Sound_Lib(const struct FGameplayTag& Event_Name);
	void Play_Water_Splash_at_Water_Surface(class AFortWaterBodyActor* Water_Body, bool Enter_Water_0);
	void ReceiveBeginPlay();
	void SetTamingEnabled(bool EnableTaming);
	void UpdateTamingIndicator();

	bool IsValidAutoFireTarget(const class AActor* Attacker) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Pawn_Wildlife_Parent_C">();
	}
	static class ANPC_Pawn_Wildlife_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_Pawn_Wildlife_Parent_C>();
	}
};
static_assert(alignof(ANPC_Pawn_Wildlife_Parent_C) == 0x000010, "Wrong alignment on ANPC_Pawn_Wildlife_Parent_C");
static_assert(sizeof(ANPC_Pawn_Wildlife_Parent_C) == 0x0039A0, "Wrong size on ANPC_Pawn_Wildlife_Parent_C");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, UberGraphFrame_NPC_Pawn_Wildlife_Parent_C) == 0x003868, "Member 'ANPC_Pawn_Wildlife_Parent_C::UberGraphFrame_NPC_Pawn_Wildlife_Parent_C' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, Wildlife_FootDust) == 0x003870, "Member 'ANPC_Pawn_Wildlife_Parent_C::Wildlife_FootDust' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, ConvertComponent) == 0x003878, "Member 'ANPC_Pawn_Wildlife_Parent_C::ConvertComponent' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, Layer_Idle) == 0x003880, "Member 'ANPC_Pawn_Wildlife_Parent_C::Layer_Idle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, Layer_Locomotion) == 0x0038A8, "Member 'ANPC_Pawn_Wildlife_Parent_C::Layer_Locomotion' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, Layer_Jump) == 0x0038D0, "Member 'ANPC_Pawn_Wildlife_Parent_C::Layer_Jump' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, LeaderTeam) == 0x0038F8, "Member 'ANPC_Pawn_Wildlife_Parent_C::LeaderTeam' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, VocalSourceEffectChainOverride) == 0x003900, "Member 'ANPC_Pawn_Wildlife_Parent_C::VocalSourceEffectChainOverride' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, bTamingEnabled) == 0x003908, "Member 'ANPC_Pawn_Wildlife_Parent_C::bTamingEnabled' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, OnPickupGrabbed_Destroyed) == 0x003910, "Member 'ANPC_Pawn_Wildlife_Parent_C::OnPickupGrabbed_Destroyed' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, bCanBeInteractedWithWhileTamed) == 0x003920, "Member 'ANPC_Pawn_Wildlife_Parent_C::bCanBeInteractedWithWhileTamed' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, GE_Quest_Converted_Handle) == 0x003924, "Member 'ANPC_Pawn_Wildlife_Parent_C::GE_Quest_Converted_Handle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, GE_Quest_Converted_Irwin) == 0x003930, "Member 'ANPC_Pawn_Wildlife_Parent_C::GE_Quest_Converted_Irwin' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, ConvertedDispatcher) == 0x003938, "Member 'ANPC_Pawn_Wildlife_Parent_C::ConvertedDispatcher' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, bIsBeingRidden) == 0x003948, "Member 'ANPC_Pawn_Wildlife_Parent_C::bIsBeingRidden' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, NPCStatusWidgetShouldDisplayDamage) == 0x003949, "Member 'ANPC_Pawn_Wildlife_Parent_C::NPCStatusWidgetShouldDisplayDamage' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, GE_GoalSelectionWhileTamed) == 0x003950, "Member 'ANPC_Pawn_Wildlife_Parent_C::GE_GoalSelectionWhileTamed' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, T_GoalSelectionWhileTamed) == 0x003958, "Member 'ANPC_Pawn_Wildlife_Parent_C::T_GoalSelectionWhileTamed' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, CurrentEnergy) == 0x003978, "Member 'ANPC_Pawn_Wildlife_Parent_C::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, IrwinSlidingGC) == 0x00397C, "Member 'ANPC_Pawn_Wildlife_Parent_C::IrwinSlidingGC' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, bLeaderSetSuccess) == 0x003980, "Member 'ANPC_Pawn_Wildlife_Parent_C::bLeaderSetSuccess' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, JumpLandSoundLibTag) == 0x003984, "Member 'ANPC_Pawn_Wildlife_Parent_C::JumpLandSoundLibTag' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, TameSoundLibTag) == 0x003988, "Member 'ANPC_Pawn_Wildlife_Parent_C::TameSoundLibTag' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, SoundIndicatorSound_Unridden) == 0x003990, "Member 'ANPC_Pawn_Wildlife_Parent_C::SoundIndicatorSound_Unridden' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, SoundIndicatorSound_Ridden) == 0x003998, "Member 'ANPC_Pawn_Wildlife_Parent_C::SoundIndicatorSound_Ridden' has a wrong offset!");

}

