#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCConvertedIndicatorMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NPCConvertedIndicatorMarker.NPCConvertedIndicatorMarker_C
// 0x0018 (0x0620 - 0x0608)
class UNPCConvertedIndicatorMarker_C final : public UAthenaMarkedActorIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IrwinIndicator;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConvertedMarkerInfo_C*                 RidingMarkerInfo;                                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NPCConvertedIndicatorMarker(int32 EntryPoint);
	void OnSetMarkerData(const struct FFortWorldMarkerData& FortWorldMarkerData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCConvertedIndicatorMarker_C">();
	}
	static class UNPCConvertedIndicatorMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCConvertedIndicatorMarker_C>();
	}
};
static_assert(alignof(UNPCConvertedIndicatorMarker_C) == 0x000008, "Wrong alignment on UNPCConvertedIndicatorMarker_C");
static_assert(sizeof(UNPCConvertedIndicatorMarker_C) == 0x000620, "Wrong size on UNPCConvertedIndicatorMarker_C");
static_assert(offsetof(UNPCConvertedIndicatorMarker_C, UberGraphFrame) == 0x000608, "Member 'UNPCConvertedIndicatorMarker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPCConvertedIndicatorMarker_C, IrwinIndicator) == 0x000610, "Member 'UNPCConvertedIndicatorMarker_C::IrwinIndicator' has a wrong offset!");
static_assert(offsetof(UNPCConvertedIndicatorMarker_C, RidingMarkerInfo) == 0x000618, "Member 'UNPCConvertedIndicatorMarker_C::RidingMarkerInfo' has a wrong offset!");

}

