#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCStatusWidgetBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function NPCStatusWidgetBar.NPCStatusWidgetBar_C.ExecuteUbergraph_NPCStatusWidgetBar
// 0x000C (0x000C - 0x0000)
struct NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar) == 0x000004, "Wrong alignment on NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar");
static_assert(sizeof(NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar) == 0x00000C, "Wrong size on NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar");
static_assert(offsetof(NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar, EntryPoint) == 0x000000, "Member 'NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar, K2Node_CustomEvent_Value) == 0x000004, "Member 'NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar, K2Node_Event_IsDesignTime) == 0x000008, "Member 'NPCStatusWidgetBar_C_ExecuteUbergraph_NPCStatusWidgetBar::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function NPCStatusWidgetBar.NPCStatusWidgetBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct NPCStatusWidgetBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCStatusWidgetBar_C_PreConstruct) == 0x000001, "Wrong alignment on NPCStatusWidgetBar_C_PreConstruct");
static_assert(sizeof(NPCStatusWidgetBar_C_PreConstruct) == 0x000001, "Wrong size on NPCStatusWidgetBar_C_PreConstruct");
static_assert(offsetof(NPCStatusWidgetBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'NPCStatusWidgetBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function NPCStatusWidgetBar.NPCStatusWidgetBar_C.SetPercent
// 0x0004 (0x0004 - 0x0000)
struct NPCStatusWidgetBar_C_SetPercent final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCStatusWidgetBar_C_SetPercent) == 0x000004, "Wrong alignment on NPCStatusWidgetBar_C_SetPercent");
static_assert(sizeof(NPCStatusWidgetBar_C_SetPercent) == 0x000004, "Wrong size on NPCStatusWidgetBar_C_SetPercent");
static_assert(offsetof(NPCStatusWidgetBar_C_SetPercent, Value) == 0x000000, "Member 'NPCStatusWidgetBar_C_SetPercent::Value' has a wrong offset!");

}

