#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCStatusWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NPCStatusWidget.NPCStatusWidget_C.BP_HandlePlaylistExtensionWidgetCreated
// 0x0010 (0x0010 - 0x0000)
struct NPCStatusWidget_C_BP_HandlePlaylistExtensionWidgetCreated final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIExtensionSlot                              SlotType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCStatusWidget_C_BP_HandlePlaylistExtensionWidgetCreated) == 0x000008, "Wrong alignment on NPCStatusWidget_C_BP_HandlePlaylistExtensionWidgetCreated");
static_assert(sizeof(NPCStatusWidget_C_BP_HandlePlaylistExtensionWidgetCreated) == 0x000010, "Wrong size on NPCStatusWidget_C_BP_HandlePlaylistExtensionWidgetCreated");
static_assert(offsetof(NPCStatusWidget_C_BP_HandlePlaylistExtensionWidgetCreated, Widget) == 0x000000, "Member 'NPCStatusWidget_C_BP_HandlePlaylistExtensionWidgetCreated::Widget' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_BP_HandlePlaylistExtensionWidgetCreated, SlotType) == 0x000008, "Member 'NPCStatusWidget_C_BP_HandlePlaylistExtensionWidgetCreated::SlotType' has a wrong offset!");

// Function NPCStatusWidget.NPCStatusWidget_C.ChangeWidgetVisibleDuration
// 0x0004 (0x0004 - 0x0000)
struct NPCStatusWidget_C_ChangeWidgetVisibleDuration final
{
public:
	float                                         StatusWidgetVisibleDuration_0;                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCStatusWidget_C_ChangeWidgetVisibleDuration) == 0x000004, "Wrong alignment on NPCStatusWidget_C_ChangeWidgetVisibleDuration");
static_assert(sizeof(NPCStatusWidget_C_ChangeWidgetVisibleDuration) == 0x000004, "Wrong size on NPCStatusWidget_C_ChangeWidgetVisibleDuration");
static_assert(offsetof(NPCStatusWidget_C_ChangeWidgetVisibleDuration, StatusWidgetVisibleDuration_0) == 0x000000, "Member 'NPCStatusWidget_C_ChangeWidgetVisibleDuration::StatusWidgetVisibleDuration_0' has a wrong offset!");

// Function NPCStatusWidget.NPCStatusWidget_C.EventUpdateStatus
// 0x000C (0x000C - 0x0000)
struct NPCStatusWidget_C_EventUpdateStatus final
{
public:
	float                                         Health;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shield;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowShield;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCStatusWidget_C_EventUpdateStatus) == 0x000004, "Wrong alignment on NPCStatusWidget_C_EventUpdateStatus");
static_assert(sizeof(NPCStatusWidget_C_EventUpdateStatus) == 0x00000C, "Wrong size on NPCStatusWidget_C_EventUpdateStatus");
static_assert(offsetof(NPCStatusWidget_C_EventUpdateStatus, Health) == 0x000000, "Member 'NPCStatusWidget_C_EventUpdateStatus::Health' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_EventUpdateStatus, Shield) == 0x000004, "Member 'NPCStatusWidget_C_EventUpdateStatus::Shield' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_EventUpdateStatus, ShowShield) == 0x000008, "Member 'NPCStatusWidget_C_EventUpdateStatus::ShowShield' has a wrong offset!");

// Function NPCStatusWidget.NPCStatusWidget_C.ExecuteUbergraph_NPCStatusWidget
// 0x0080 (0x0080 - 0x0000)
struct NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_StatusWidgetVisibleDuration;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_KeepVisibilityOn;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIExtensionSlot                              K2Node_Event_SlotType;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNPCStatusWidgetExtensionBase*          K2Node_DynamicCast_AsNPCStatus_Widget_Extension_Base; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_health;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_shield;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShowShield;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNAND_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_1;        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget) == 0x000008, "Wrong alignment on NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget");
static_assert(sizeof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget) == 0x000080, "Wrong size on NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, EntryPoint) == 0x000000, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_CustomEvent_StatusWidgetVisibleDuration) == 0x000004, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_CustomEvent_StatusWidgetVisibleDuration' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000008, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_CustomEvent_KeepVisibilityOn) == 0x000021, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_CustomEvent_KeepVisibilityOn' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x000022, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_Event_Widget) == 0x000028, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_Event_SlotType) == 0x000030, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_Event_SlotType' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000038, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_DynamicCast_AsNPCStatus_Widget_Extension_Base) == 0x000040, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_DynamicCast_AsNPCStatus_Widget_Extension_Base' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_AddChildToOverlay_ReturnValue) == 0x000050, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_CustomEvent_health) == 0x000058, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_CustomEvent_health' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_CustomEvent_shield) == 0x00005C, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_CustomEvent_shield' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_CustomEvent_ShowShield) == 0x000060, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_CustomEvent_ShowShield' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_BooleanNAND_ReturnValue) == 0x000061, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_BooleanNAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000070, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000078, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_NotEqual_FloatFloat_ReturnValue_1) == 0x000079, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_NotEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget, CallFunc_BooleanOR_ReturnValue_1) == 0x00007A, "Member 'NPCStatusWidget_C_ExecuteUbergraph_NPCStatusWidget::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function NPCStatusWidget.NPCStatusWidget_C.SetKeepVisibilityOn
// 0x0001 (0x0001 - 0x0000)
struct NPCStatusWidget_C_SetKeepVisibilityOn final
{
public:
	bool                                          KeepVisibilityOn_0;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCStatusWidget_C_SetKeepVisibilityOn) == 0x000001, "Wrong alignment on NPCStatusWidget_C_SetKeepVisibilityOn");
static_assert(sizeof(NPCStatusWidget_C_SetKeepVisibilityOn) == 0x000001, "Wrong size on NPCStatusWidget_C_SetKeepVisibilityOn");
static_assert(offsetof(NPCStatusWidget_C_SetKeepVisibilityOn, KeepVisibilityOn_0) == 0x000000, "Member 'NPCStatusWidget_C_SetKeepVisibilityOn::KeepVisibilityOn_0' has a wrong offset!");

}

