#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OakPrompt.OakPrompt_C
// 0x0040 (0x0370 - 0x0330)
class UOakPrompt_C final : public UFortHUDTagPromptWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Symbol;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title_1;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void CloseWidget();
	void ExecuteUbergraph_OakPrompt(int32 EntryPoint);
	void OpenWidget(const struct FFortHUDTagPromptData& PrompData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OakPrompt_C">();
	}
	static class UOakPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOakPrompt_C>();
	}
};
static_assert(alignof(UOakPrompt_C) == 0x000008, "Wrong alignment on UOakPrompt_C");
static_assert(sizeof(UOakPrompt_C) == 0x000370, "Wrong size on UOakPrompt_C");
static_assert(offsetof(UOakPrompt_C, UberGraphFrame) == 0x000330, "Member 'UOakPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOakPrompt_C, Outro) == 0x000338, "Member 'UOakPrompt_C::Outro' has a wrong offset!");
static_assert(offsetof(UOakPrompt_C, Intro) == 0x000340, "Member 'UOakPrompt_C::Intro' has a wrong offset!");
static_assert(offsetof(UOakPrompt_C, Image_Shadow) == 0x000348, "Member 'UOakPrompt_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UOakPrompt_C, Image_Symbol) == 0x000350, "Member 'UOakPrompt_C::Image_Symbol' has a wrong offset!");
static_assert(offsetof(UOakPrompt_C, Text_Description) == 0x000358, "Member 'UOakPrompt_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UOakPrompt_C, Text_Title) == 0x000360, "Member 'UOakPrompt_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UOakPrompt_C, Text_Title_1) == 0x000368, "Member 'UOakPrompt_C::Text_Title_1' has a wrong offset!");

}

