#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OctopusVehicle_Driver_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "OctopusVehicle_Driver_AnimBP_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass OctopusVehicle_Driver_AnimBP.OctopusVehicle_Driver_AnimBP_C
// 0x1C10 (0x3EA0 - 0x2290)
class UOctopusVehicle_Driver_AnimBP_C final : public UFortPlayerAnimInstance_OctopusDriver
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct OctopusVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x2298(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x22B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x22C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x22C8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x22E8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2410(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2430(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x2450(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x24B8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x2580(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x25A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x25D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x25F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x2620(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x2648(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x2670(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x2698(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x26C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x26E8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x2728(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x2748(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x2788(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x27A8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x27E8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x2808(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x2848(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x2868(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2930(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2998(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x29E0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x2A20(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x2A60(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2A80(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2B38(0x0100)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x2C38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x2C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x2C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x2CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x2CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x2D00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x2D28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x2D50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x2D78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x2DA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x2DC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2DF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x2E18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2E40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x2E68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x2E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2EE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2F30(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x2F58(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2F98(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x2FB8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2FF8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x3018(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x3058(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3078(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x30A0(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x30C0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x3108(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x3148(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x3188(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x31C8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x3208(0x0040)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x3248(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x3290(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x32B0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x32D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x32F8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x3338(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x3358(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x3398(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x33B8(0x00B8)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x3470(0x0110)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x3580(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x3648(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x3690(0x0040)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x36D0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x37F8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x3920(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3A48(0x0128)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_2;                             // 0x3B70(0x00F8)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_1;                             // 0x3C68(0x00F8)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x3D60(0x00F8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3E58(0x0040)()

public:
	void ExecuteUbergraph_OctopusVehicle_Driver_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OctopusVehicle_Driver_AnimBP_C">();
	}
	static class UOctopusVehicle_Driver_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOctopusVehicle_Driver_AnimBP_C>();
	}
};
static_assert(alignof(UOctopusVehicle_Driver_AnimBP_C) == 0x000010, "Wrong alignment on UOctopusVehicle_Driver_AnimBP_C");
static_assert(sizeof(UOctopusVehicle_Driver_AnimBP_C) == 0x003EA0, "Wrong size on UOctopusVehicle_Driver_AnimBP_C");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, UberGraphFrame) == 0x002290, "Member 'UOctopusVehicle_Driver_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, __AnimBlueprintMutables) == 0x002298, "Member 'UOctopusVehicle_Driver_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0022B8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimBlueprintExtension_Base) == 0x0022C0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_Root) == 0x0022C8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x0022E8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002410, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002430, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x002450, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_ApplyAdditive_2) == 0x0024B8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_28) == 0x002580, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_28' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_27) == 0x0025A8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_27' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_26) == 0x0025D0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_26' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_25) == 0x0025F8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_25' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_24) == 0x002620, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_24' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_23) == 0x002648, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_23' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_22) == 0x002670, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_22' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_21) == 0x002698, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_21' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_20) == 0x0026C0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_20' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_17) == 0x0026E8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_12) == 0x002728, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_12' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_16) == 0x002748, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_11) == 0x002788, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_11' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_15) == 0x0027A8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_10) == 0x0027E8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_14) == 0x002808, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_9) == 0x002848, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_ApplyAdditive_1) == 0x002868, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x002930, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x002998, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_13) == 0x0029E0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_12) == 0x002A20, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_8) == 0x002A60, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x002A80, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002B38, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_19) == 0x002C38, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_19' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_18) == 0x002C60, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_18' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_17) == 0x002C88, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_16) == 0x002CB0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_15) == 0x002CD8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_14) == 0x002D00, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_13) == 0x002D28, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_12) == 0x002D50, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_11) == 0x002D78, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x002DA0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x002DC8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x002DF0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x002E18, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x002E40, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x002E68, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x002E90, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x002EB8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x002EE0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x002F08, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_TransitionResult) == 0x002F30, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_11) == 0x002F58, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_7) == 0x002F98, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_10) == 0x002FB8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_6) == 0x002FF8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x003018, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_5) == 0x003058, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x003078, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_4) == 0x0030A0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_BlendListByEnum_2) == 0x0030C0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x003108, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x003148, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x003188, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x0031C8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x003208, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_BlendListByEnum_1) == 0x003248, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_3) == 0x003290, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0032B0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0032D8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0032F8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult_1) == 0x003338, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x003358, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateResult) == 0x003398, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_StateMachine) == 0x0033B8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x003470, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x003580, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x003648, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x003690, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x0036D0, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x0037F8, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x003920, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_ModifyBone) == 0x003A48, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_LegIK_2) == 0x003B70, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_LegIK_2' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_LegIK_1) == 0x003C68, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_LegIK_1' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_LegIK) == 0x003D60, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_LegIK' has a wrong offset!");
static_assert(offsetof(UOctopusVehicle_Driver_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x003E58, "Member 'UOctopusVehicle_Driver_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

