#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuSetting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsMenuSetting.OptionsMenuSetting_C
// 0x0080 (0x03E0 - 0x0360)
class UOptionsMenuSetting_C final : public UFortOptionsMenuSetting
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonTouchTooltip;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Right;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchorSettingDescription;                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxContainer;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxLabel;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SliderBackground;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SliderText;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SliderValue;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Right;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerBottom;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Slider_Texture;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERoundingMode                                 RoundingMode;                                      // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ToolTipSizeMobile;                                 // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_107_OnControllerCaptureEndEvent__DelegateSignature();
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_86_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Construct();
	void ConvertSettingsValueToSliderValue(float SettingsValue, float* SliderValue_0);
	void ConvertSliderValueToSettingsValue(float SliderValue_0, float* SettingsValue);
	void ExecuteUbergraph_OptionsMenuSetting(int32 EntryPoint);
	void HandlePawnSet();
	void Hide_Tooltip();
	class UUserWidget* OnGetUserMenuContent();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Refresh();
	void SetFontSize(class UCommonTextBlock* Text, int32 DefaulFontSize, int32 MobileFont);
	void SetSliderTextRenderScale(float Scale_Normalized);
	void Show_Tooltip();
	void Update_Visuals_BP();
	void UpdateSize();
	void UpdateSliderTexture();
	void UpdateVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsMenuSetting_C">();
	}
	static class UOptionsMenuSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsMenuSetting_C>();
	}
};
static_assert(alignof(UOptionsMenuSetting_C) == 0x000008, "Wrong alignment on UOptionsMenuSetting_C");
static_assert(sizeof(UOptionsMenuSetting_C) == 0x0003E0, "Wrong size on UOptionsMenuSetting_C");
static_assert(offsetof(UOptionsMenuSetting_C, UberGraphFrame) == 0x000360, "Member 'UOptionsMenuSetting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, Button_0) == 0x000368, "Member 'UOptionsMenuSetting_C::Button_0' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, ButtonTouchTooltip) == 0x000370, "Member 'UOptionsMenuSetting_C::ButtonTouchTooltip' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, HorizontalBox_Right) == 0x000378, "Member 'UOptionsMenuSetting_C::HorizontalBox_Right' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, MenuAnchorSettingDescription) == 0x000380, "Member 'UOptionsMenuSetting_C::MenuAnchorSettingDescription' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, SizeBoxContainer) == 0x000388, "Member 'UOptionsMenuSetting_C::SizeBoxContainer' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, SizeBoxLabel) == 0x000390, "Member 'UOptionsMenuSetting_C::SizeBoxLabel' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, SliderBackground) == 0x000398, "Member 'UOptionsMenuSetting_C::SliderBackground' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, SliderText) == 0x0003A0, "Member 'UOptionsMenuSetting_C::SliderText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, SliderValue) == 0x0003A8, "Member 'UOptionsMenuSetting_C::SliderValue' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, Spacer_Right) == 0x0003B0, "Member 'UOptionsMenuSetting_C::Spacer_Right' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, SpacerBottom) == 0x0003B8, "Member 'UOptionsMenuSetting_C::SpacerBottom' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, Slider_Texture) == 0x0003C0, "Member 'UOptionsMenuSetting_C::Slider_Texture' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, RoundingMode) == 0x0003C8, "Member 'UOptionsMenuSetting_C::RoundingMode' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSetting_C, ToolTipSizeMobile) == 0x0003D0, "Member 'UOptionsMenuSetting_C::ToolTipSizeMobile' has a wrong offset!");

}

