#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PackTent_TaskNode

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PackTent_TaskNode.PackTent_TaskNode_C
// 0x0030 (0x0278 - 0x0248)
class UPackTent_TaskNode_C final : public UFortConversationTaskNode_DataDrivenService
{
public:
	bool                                          Debug;                                             // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               PickupWID;                                         // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Failed_Reason;                                     // 0x0258(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	struct FConversationTaskResult ExecuteTaskNode(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PackTent_TaskNode_C">();
	}
	static class UPackTent_TaskNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPackTent_TaskNode_C>();
	}
};
static_assert(alignof(UPackTent_TaskNode_C) == 0x000008, "Wrong alignment on UPackTent_TaskNode_C");
static_assert(sizeof(UPackTent_TaskNode_C) == 0x000278, "Wrong size on UPackTent_TaskNode_C");
static_assert(offsetof(UPackTent_TaskNode_C, Debug) == 0x000248, "Member 'UPackTent_TaskNode_C::Debug' has a wrong offset!");
static_assert(offsetof(UPackTent_TaskNode_C, PickupWID) == 0x000250, "Member 'UPackTent_TaskNode_C::PickupWID' has a wrong offset!");
static_assert(offsetof(UPackTent_TaskNode_C, Failed_Reason) == 0x000258, "Member 'UPackTent_TaskNode_C::Failed_Reason' has a wrong offset!");

}

