#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Papaya_ServerWarning

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Papaya_ServerWarning.Papaya_ServerWarning_C
// 0x01B0 (0x04D8 - 0x0328)
class UPapaya_ServerWarning_C final : public UFortServerMessageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FinalPhaseOutro;                                   // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FinalCountdown;                                    // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FinalTick;                                         // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NormalTick;                                        // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           CountdownVerticalBox;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Diamondpulse;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Diamondpulse_1;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCountdownNumber;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_Countdown;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_Countdown_Shadow;                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CountdownLoopAudioEnabled;                         // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnTickLoop;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnTickNormal;                                 // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnTickFinal;                                  // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        TickLoopAudioComp;                                 // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveCountdownLoopVolume;                          // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveCountdownLoopPitch;                           // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentTimeRemaining;                              // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpolatedTimeRemaining;                         // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FinalCountdownStartValue;                          // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnFinal10Countdown;                           // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFinal60Countdown;                           // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCountdownStarted;                                 // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnFinal10Countdown_Music;                     // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFinal60Countdown_Music;                     // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFinalCountdownWarning_Music;                // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Final_60_Countdown_Music_Instance;                 // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Final_60_Countdown_Music_Fadeout;                  // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantPlaylistTags;                              // 0x0428(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              VerticalOffset;                                    // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FVector2D>   PlaylistOffsetMap;                                 // 0x0458(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           TimerEnd;                                          // 0x04A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         StartSeconds;                                      // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FinalCountdownLoop;                                // 0x04B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BorderColor;                                       // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideDiamondPulse;                                  // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckTagsForWidgetOffset(TArray<struct FGameplayTag>& GameplayTags);
	void Construct();
	void EventFinalCountdown();
	void EventTimerEnd();
	void ExecuteUbergraph_Papaya_ServerWarning(int32 EntryPoint);
	void OnAlertBegin(int32 SecondsRemainingStart, int32 SecondsRemainingEnd, const class FText& AlertText);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Papaya_ServerWarning_C">();
	}
	static class UPapaya_ServerWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPapaya_ServerWarning_C>();
	}
};
static_assert(alignof(UPapaya_ServerWarning_C) == 0x000008, "Wrong alignment on UPapaya_ServerWarning_C");
static_assert(sizeof(UPapaya_ServerWarning_C) == 0x0004D8, "Wrong size on UPapaya_ServerWarning_C");
static_assert(offsetof(UPapaya_ServerWarning_C, UberGraphFrame) == 0x000328, "Member 'UPapaya_ServerWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, Outro) == 0x000330, "Member 'UPapaya_ServerWarning_C::Outro' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, Intro) == 0x000338, "Member 'UPapaya_ServerWarning_C::Intro' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, FinalPhaseOutro) == 0x000340, "Member 'UPapaya_ServerWarning_C::FinalPhaseOutro' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, FinalCountdown) == 0x000348, "Member 'UPapaya_ServerWarning_C::FinalCountdown' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, FinalTick) == 0x000350, "Member 'UPapaya_ServerWarning_C::FinalTick' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, NormalTick) == 0x000358, "Member 'UPapaya_ServerWarning_C::NormalTick' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, CountdownVerticalBox) == 0x000360, "Member 'UPapaya_ServerWarning_C::CountdownVerticalBox' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, Image_BG) == 0x000368, "Member 'UPapaya_ServerWarning_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, Image_Diamondpulse) == 0x000370, "Member 'UPapaya_ServerWarning_C::Image_Diamondpulse' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, Image_Diamondpulse_1) == 0x000378, "Member 'UPapaya_ServerWarning_C::Image_Diamondpulse_1' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, OverlayCountdownNumber) == 0x000380, "Member 'UPapaya_ServerWarning_C::OverlayCountdownNumber' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, Text_Description) == 0x000388, "Member 'UPapaya_ServerWarning_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, TextBlock_Countdown) == 0x000390, "Member 'UPapaya_ServerWarning_C::TextBlock_Countdown' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, TextBlock_Countdown_Shadow) == 0x000398, "Member 'UPapaya_ServerWarning_C::TextBlock_Countdown_Shadow' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, CountdownLoopAudioEnabled) == 0x0003A0, "Member 'UPapaya_ServerWarning_C::CountdownLoopAudioEnabled' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, SoundOnTickLoop) == 0x0003A8, "Member 'UPapaya_ServerWarning_C::SoundOnTickLoop' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, SoundOnTickNormal) == 0x0003B0, "Member 'UPapaya_ServerWarning_C::SoundOnTickNormal' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, SoundOnTickFinal) == 0x0003B8, "Member 'UPapaya_ServerWarning_C::SoundOnTickFinal' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, TickLoopAudioComp) == 0x0003C0, "Member 'UPapaya_ServerWarning_C::TickLoopAudioComp' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, CurveCountdownLoopVolume) == 0x0003C8, "Member 'UPapaya_ServerWarning_C::CurveCountdownLoopVolume' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, CurveCountdownLoopPitch) == 0x0003D0, "Member 'UPapaya_ServerWarning_C::CurveCountdownLoopPitch' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, CurrentTimeRemaining) == 0x0003D8, "Member 'UPapaya_ServerWarning_C::CurrentTimeRemaining' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, InterpolatedTimeRemaining) == 0x0003DC, "Member 'UPapaya_ServerWarning_C::InterpolatedTimeRemaining' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, FinalCountdownStartValue) == 0x0003E0, "Member 'UPapaya_ServerWarning_C::FinalCountdownStartValue' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, SoundOnFinal10Countdown) == 0x0003E8, "Member 'UPapaya_ServerWarning_C::SoundOnFinal10Countdown' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, SoundOnFinal60Countdown) == 0x0003F0, "Member 'UPapaya_ServerWarning_C::SoundOnFinal60Countdown' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, bCountdownStarted) == 0x0003F8, "Member 'UPapaya_ServerWarning_C::bCountdownStarted' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, SoundOnFinal10Countdown_Music) == 0x000400, "Member 'UPapaya_ServerWarning_C::SoundOnFinal10Countdown_Music' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, SoundOnFinal60Countdown_Music) == 0x000408, "Member 'UPapaya_ServerWarning_C::SoundOnFinal60Countdown_Music' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, SoundOnFinalCountdownWarning_Music) == 0x000410, "Member 'UPapaya_ServerWarning_C::SoundOnFinalCountdownWarning_Music' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, Final_60_Countdown_Music_Instance) == 0x000418, "Member 'UPapaya_ServerWarning_C::Final_60_Countdown_Music_Instance' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, Final_60_Countdown_Music_Fadeout) == 0x000420, "Member 'UPapaya_ServerWarning_C::Final_60_Countdown_Music_Fadeout' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, RelevantPlaylistTags) == 0x000428, "Member 'UPapaya_ServerWarning_C::RelevantPlaylistTags' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, VerticalOffset) == 0x000448, "Member 'UPapaya_ServerWarning_C::VerticalOffset' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, PlaylistOffsetMap) == 0x000458, "Member 'UPapaya_ServerWarning_C::PlaylistOffsetMap' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, TimerEnd) == 0x0004A8, "Member 'UPapaya_ServerWarning_C::TimerEnd' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, StartSeconds) == 0x0004B0, "Member 'UPapaya_ServerWarning_C::StartSeconds' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, FinalCountdownLoop) == 0x0004B8, "Member 'UPapaya_ServerWarning_C::FinalCountdownLoop' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, BorderColor) == 0x0004C0, "Member 'UPapaya_ServerWarning_C::BorderColor' has a wrong offset!");
static_assert(offsetof(UPapaya_ServerWarning_C, HideDiamondPulse) == 0x0004D0, "Member 'UPapaya_ServerWarning_C::HideDiamondPulse' has a wrong offset!");

}

