#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Papaya_ServerWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Papaya_ServerWarning.Papaya_ServerWarning_C.CheckTagsForWidgetOffset
// 0x0050 (0x0050 - 0x0000)
struct Papaya_ServerWarning_C_CheckTagsForWidgetOffset final
{
public:
	TArray<struct FGameplayTag>                   GameplayTags;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0024(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Map_Find_Value;                           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset) == 0x000008, "Wrong alignment on Papaya_ServerWarning_C_CheckTagsForWidgetOffset");
static_assert(sizeof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset) == 0x000050, "Wrong size on Papaya_ServerWarning_C_CheckTagsForWidgetOffset");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, GameplayTags) == 0x000000, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::GameplayTags' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, CallFunc_Array_Get_Item) == 0x000024, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, CallFunc_Map_Find_Value) == 0x000038, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_CheckTagsForWidgetOffset, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'Papaya_ServerWarning_C_CheckTagsForWidgetOffset::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function Papaya_ServerWarning.Papaya_ServerWarning_C.ExecuteUbergraph_Papaya_ServerWarning
// 0x0290 (0x0290 - 0x0000)
struct Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SecondsRemainingStart;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SecondsRemainingEnd;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_AlertText;                            // 0x0020(0x0018)(ConstParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0100(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0158(0x0010)(ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0170(0x0018)()
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x01B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01D8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0228(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0240(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0268(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning) == 0x000008, "Wrong alignment on Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning");
static_assert(sizeof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning) == 0x000290, "Wrong size on Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, EntryPoint) == 0x000000, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_int_Variable) == 0x000004, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Event_SecondsRemainingStart) == 0x000014, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Event_SecondsRemainingStart' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Event_SecondsRemainingEnd) == 0x000018, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Event_SecondsRemainingEnd' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Event_AlertText) == 0x000020, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Event_AlertText' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_byte_Variable) == 0x000038, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_byte_Variable_1) == 0x000039, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_bool_Variable) == 0x00003A, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Select_Default) == 0x000048, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_GetEndTime_ReturnValue) == 0x00004C, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_GetEndTime_ReturnValue_1) == 0x000060, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000068, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Greater_IntInt_ReturnValue) == 0x000070, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Divide_IntInt_ReturnValue) == 0x0000C8, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeArray_Array) == 0x0000D0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000E0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeStruct_FormatArgumentData_1) == 0x000100, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Subtract_IntInt_ReturnValue) == 0x000150, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeArray_Array_1) == 0x000158, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000168, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Format_ReturnValue_1) == 0x000170, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000188, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000190, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000198, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_SelectFloat_ReturnValue) == 0x00019C, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0001B0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x0001B8, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001BC, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_FTrunc_ReturnValue) == 0x0001C0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0001C4, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0001C8, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Less_IntInt_ReturnValue) == 0x0001D0, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001D8, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_MakeArray_Array_2) == 0x000228, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000238, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_Format_ReturnValue_2) == 0x000240, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_PlayAnimation_ReturnValue_3) == 0x000258, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, Temp_bool_Variable_1) == 0x000260, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Select_Default_1) == 0x000268, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, K2Node_Event_IsDesignTime) == 0x000280, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000288, "Member 'Papaya_ServerWarning_C_ExecuteUbergraph_Papaya_ServerWarning::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function Papaya_ServerWarning.Papaya_ServerWarning_C.OnAlertBegin
// 0x0020 (0x0020 - 0x0000)
struct Papaya_ServerWarning_C_OnAlertBegin final
{
public:
	int32                                         SecondsRemainingStart;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SecondsRemainingEnd;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   AlertText;                                         // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Papaya_ServerWarning_C_OnAlertBegin) == 0x000008, "Wrong alignment on Papaya_ServerWarning_C_OnAlertBegin");
static_assert(sizeof(Papaya_ServerWarning_C_OnAlertBegin) == 0x000020, "Wrong size on Papaya_ServerWarning_C_OnAlertBegin");
static_assert(offsetof(Papaya_ServerWarning_C_OnAlertBegin, SecondsRemainingStart) == 0x000000, "Member 'Papaya_ServerWarning_C_OnAlertBegin::SecondsRemainingStart' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_OnAlertBegin, SecondsRemainingEnd) == 0x000004, "Member 'Papaya_ServerWarning_C_OnAlertBegin::SecondsRemainingEnd' has a wrong offset!");
static_assert(offsetof(Papaya_ServerWarning_C_OnAlertBegin, AlertText) == 0x000008, "Member 'Papaya_ServerWarning_C_OnAlertBegin::AlertText' has a wrong offset!");

// Function Papaya_ServerWarning.Papaya_ServerWarning_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Papaya_ServerWarning_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Papaya_ServerWarning_C_PreConstruct) == 0x000001, "Wrong alignment on Papaya_ServerWarning_C_PreConstruct");
static_assert(sizeof(Papaya_ServerWarning_C_PreConstruct) == 0x000001, "Wrong size on Papaya_ServerWarning_C_PreConstruct");
static_assert(offsetof(Papaya_ServerWarning_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Papaya_ServerWarning_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

