#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartySuggestionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartySuggestionButton.PartySuggestionButton_C
// 0x0110 (0x1170 - 0x1060)
class UPartySuggestionButton_C final : public UFortPartySuggestionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RequestAccepted;                                   // 0x1068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MouseHovered;                                      // 0x1070(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x1078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x1088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x1090(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderOfDarkenedText;                              // 0x1098(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_ActionPrompt;                                   // 0x10A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_SquiglyTail;                                     // 0x10A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SparklyTraingles;                                  // 0x10B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_MainBorder_Normal;                             // 0x10B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_MainBorder_Normal_Tail;                        // 0x10C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      SpringState_ShapeChange;                           // 0x10C8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         SS_0_Stiffness;                                    // 0x10D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SS_0_Damping;                                      // 0x10D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SS_0_Mass;                                         // 0x10DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spring_ShapeChange_NewVal;                         // 0x10E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spring_ShapeChange_Target;                         // 0x10E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_ShapeParam;                                    // 0x10E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10EC[0x4];                                     // 0x10EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     M_MainBorder_Normal;                               // 0x10F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Normal_Tail;                          // 0x10F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Highlight;                            // 0x1100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Highlight_Tail;                       // 0x1108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_HighlightBorder;                               // 0x1110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_HighlightBorder_Tail;                          // 0x1118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Cur_Border;                                    // 0x1120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Cur_Tail;                                      // 0x1128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_SparkleTraingles;                              // 0x1130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_SparkleTriangles;                                // 0x1138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Color_R_Param;                                 // 0x1140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_InnerColorParam;                      // 0x1144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_OuterColorParam;                      // 0x1148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Color_L_Param;                                 // 0x114C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_TriangleColor_A;                      // 0x1150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      SpringState_Scale;                                 // 0x1154(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Spring_Scale_Target;                               // 0x1160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpringInterpAnims;                             // 0x1164(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInvited;                                         // 0x1165(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewSuggestionInQueue;                             // 0x1166(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_PartySuggestionButton(int32 EntryPoint);
	void HandleOutroAnimationFinished();
	void InitMIDs();
	void InitPhysAnim();
	void OnDismissSuggestion();
	void OnDisplayInfoUpdated(bool bIsInvited, bool bIsPlaying);
	void OnInitialized();
	void OnNewSuggestionAdded();
	void OnSuggestionAccepted();
	void OnSuggestionChanged();
	void PlayIntro();
	void PlayOutro();
	void SetMainMIDs(class UMaterialInstanceDynamic* BorderMID, class UMaterialInstanceDynamic* TailMID, class UMaterialInstanceDynamic* SparklesMID);
	void SetupMIDReferences();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartySuggestionButton_C">();
	}
	static class UPartySuggestionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartySuggestionButton_C>();
	}
};
static_assert(alignof(UPartySuggestionButton_C) == 0x000010, "Wrong alignment on UPartySuggestionButton_C");
static_assert(sizeof(UPartySuggestionButton_C) == 0x001170, "Wrong size on UPartySuggestionButton_C");
static_assert(offsetof(UPartySuggestionButton_C, UberGraphFrame) == 0x001060, "Member 'UPartySuggestionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, RequestAccepted) == 0x001068, "Member 'UPartySuggestionButton_C::RequestAccepted' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MouseHovered) == 0x001070, "Member 'UPartySuggestionButton_C::MouseHovered' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Outro) == 0x001078, "Member 'UPartySuggestionButton_C::Outro' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Hovered) == 0x001080, "Member 'UPartySuggestionButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Intro) == 0x001088, "Member 'UPartySuggestionButton_C::Intro' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Border_0) == 0x001090, "Member 'UPartySuggestionButton_C::Border_0' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, BorderOfDarkenedText) == 0x001098, "Member 'UPartySuggestionButton_C::BorderOfDarkenedText' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, HB_ActionPrompt) == 0x0010A0, "Member 'UPartySuggestionButton_C::HB_ActionPrompt' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, I_SquiglyTail) == 0x0010A8, "Member 'UPartySuggestionButton_C::I_SquiglyTail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SparklyTraingles) == 0x0010B0, "Member 'UPartySuggestionButton_C::SparklyTraingles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_MainBorder_Normal) == 0x0010B8, "Member 'UPartySuggestionButton_C::MID_MainBorder_Normal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_MainBorder_Normal_Tail) == 0x0010C0, "Member 'UPartySuggestionButton_C::MID_MainBorder_Normal_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SpringState_ShapeChange) == 0x0010C8, "Member 'UPartySuggestionButton_C::SpringState_ShapeChange' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Stiffness) == 0x0010D4, "Member 'UPartySuggestionButton_C::SS_0_Stiffness' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Damping) == 0x0010D8, "Member 'UPartySuggestionButton_C::SS_0_Damping' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Mass) == 0x0010DC, "Member 'UPartySuggestionButton_C::SS_0_Mass' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_ShapeChange_NewVal) == 0x0010E0, "Member 'UPartySuggestionButton_C::Spring_ShapeChange_NewVal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_ShapeChange_Target) == 0x0010E4, "Member 'UPartySuggestionButton_C::Spring_ShapeChange_Target' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_ShapeParam) == 0x0010E8, "Member 'UPartySuggestionButton_C::MID_ShapeParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Normal) == 0x0010F0, "Member 'UPartySuggestionButton_C::M_MainBorder_Normal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Normal_Tail) == 0x0010F8, "Member 'UPartySuggestionButton_C::M_MainBorder_Normal_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Highlight) == 0x001100, "Member 'UPartySuggestionButton_C::M_MainBorder_Highlight' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Highlight_Tail) == 0x001108, "Member 'UPartySuggestionButton_C::M_MainBorder_Highlight_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_HighlightBorder) == 0x001110, "Member 'UPartySuggestionButton_C::MID_HighlightBorder' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_HighlightBorder_Tail) == 0x001118, "Member 'UPartySuggestionButton_C::MID_HighlightBorder_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Cur_Border) == 0x001120, "Member 'UPartySuggestionButton_C::MID_Cur_Border' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Cur_Tail) == 0x001128, "Member 'UPartySuggestionButton_C::MID_Cur_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_SparkleTraingles) == 0x001130, "Member 'UPartySuggestionButton_C::MID_SparkleTraingles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_SparkleTriangles) == 0x001138, "Member 'UPartySuggestionButton_C::M_SparkleTriangles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Color_R_Param) == 0x001140, "Member 'UPartySuggestionButton_C::MID_Color_R_Param' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_InnerColorParam) == 0x001144, "Member 'UPartySuggestionButton_C::MID_Sparkles_InnerColorParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_OuterColorParam) == 0x001148, "Member 'UPartySuggestionButton_C::MID_Sparkles_OuterColorParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Color_L_Param) == 0x00114C, "Member 'UPartySuggestionButton_C::MID_Color_L_Param' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_TriangleColor_A) == 0x001150, "Member 'UPartySuggestionButton_C::MID_Sparkles_TriangleColor_A' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SpringState_Scale) == 0x001154, "Member 'UPartySuggestionButton_C::SpringState_Scale' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_Scale_Target) == 0x001160, "Member 'UPartySuggestionButton_C::Spring_Scale_Target' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, bUseSpringInterpAnims) == 0x001164, "Member 'UPartySuggestionButton_C::bUseSpringInterpAnims' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, IsInvited) == 0x001165, "Member 'UPartySuggestionButton_C::IsInvited' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, bNewSuggestionInQueue) == 0x001166, "Member 'UPartySuggestionButton_C::bNewSuggestionInQueue' has a wrong offset!");

}

