#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PawnHighlight_Interface

#include "Basic.hpp"

#include "PawnHighlight_structs.hpp"


namespace SDK::Params
{

// Function PawnHighlight_Interface.PawnHighlight_Interface_C.AddHighlightFromSource
// 0x0040 (0x0040 - 0x0000)
struct PawnHighlight_Interface_C_AddHighlightFromSource final
{
public:
	class UObject*                                Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPawnHighlight                         Highlight;                                         // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyUpdateIfCurrent;                               // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PawnHighlight_Interface_C_AddHighlightFromSource) == 0x000008, "Wrong alignment on PawnHighlight_Interface_C_AddHighlightFromSource");
static_assert(sizeof(PawnHighlight_Interface_C_AddHighlightFromSource) == 0x000040, "Wrong size on PawnHighlight_Interface_C_AddHighlightFromSource");
static_assert(offsetof(PawnHighlight_Interface_C_AddHighlightFromSource, Source) == 0x000000, "Member 'PawnHighlight_Interface_C_AddHighlightFromSource::Source' has a wrong offset!");
static_assert(offsetof(PawnHighlight_Interface_C_AddHighlightFromSource, Highlight) == 0x000008, "Member 'PawnHighlight_Interface_C_AddHighlightFromSource::Highlight' has a wrong offset!");
static_assert(offsetof(PawnHighlight_Interface_C_AddHighlightFromSource, OnlyUpdateIfCurrent) == 0x000038, "Member 'PawnHighlight_Interface_C_AddHighlightFromSource::OnlyUpdateIfCurrent' has a wrong offset!");

// Function PawnHighlight_Interface.PawnHighlight_Interface_C.RemoveHighlightFromSource
// 0x0008 (0x0008 - 0x0000)
struct PawnHighlight_Interface_C_RemoveHighlightFromSource final
{
public:
	class UObject*                                Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PawnHighlight_Interface_C_RemoveHighlightFromSource) == 0x000008, "Wrong alignment on PawnHighlight_Interface_C_RemoveHighlightFromSource");
static_assert(sizeof(PawnHighlight_Interface_C_RemoveHighlightFromSource) == 0x000008, "Wrong size on PawnHighlight_Interface_C_RemoveHighlightFromSource");
static_assert(offsetof(PawnHighlight_Interface_C_RemoveHighlightFromSource, Source) == 0x000000, "Member 'PawnHighlight_Interface_C_RemoveHighlightFromSource::Source' has a wrong offset!");

}

