#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PinCodeButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function PinCodeButton.PinCodeButton_C.ExecuteUbergraph_PinCodeButton
// 0x0008 (0x0008 - 0x0000)
struct PinCodeButton_C_ExecuteUbergraph_PinCodeButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PinCodeButton_C_ExecuteUbergraph_PinCodeButton) == 0x000004, "Wrong alignment on PinCodeButton_C_ExecuteUbergraph_PinCodeButton");
static_assert(sizeof(PinCodeButton_C_ExecuteUbergraph_PinCodeButton) == 0x000008, "Wrong size on PinCodeButton_C_ExecuteUbergraph_PinCodeButton");
static_assert(offsetof(PinCodeButton_C_ExecuteUbergraph_PinCodeButton, EntryPoint) == 0x000000, "Member 'PinCodeButton_C_ExecuteUbergraph_PinCodeButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PinCodeButton_C_ExecuteUbergraph_PinCodeButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'PinCodeButton_C_ExecuteUbergraph_PinCodeButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function PinCodeButton.PinCodeButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PinCodeButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PinCodeButton_C_PreConstruct) == 0x000001, "Wrong alignment on PinCodeButton_C_PreConstruct");
static_assert(sizeof(PinCodeButton_C_PreConstruct) == 0x000001, "Wrong size on PinCodeButton_C_PreConstruct");
static_assert(offsetof(PinCodeButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PinCodeButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PinCodeButton.PinCodeButton_C.Set Pin Number
// 0x0028 (0x0028 - 0x0000)
struct PinCodeButton_C_Set_Pin_Number final
{
public:
	class FString                                 Pin;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(PinCodeButton_C_Set_Pin_Number) == 0x000008, "Wrong alignment on PinCodeButton_C_Set_Pin_Number");
static_assert(sizeof(PinCodeButton_C_Set_Pin_Number) == 0x000028, "Wrong size on PinCodeButton_C_Set_Pin_Number");
static_assert(offsetof(PinCodeButton_C_Set_Pin_Number, Pin) == 0x000000, "Member 'PinCodeButton_C_Set_Pin_Number::Pin' has a wrong offset!");
static_assert(offsetof(PinCodeButton_C_Set_Pin_Number, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'PinCodeButton_C_Set_Pin_Number::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

