#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PinModal

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PinModal.PinModal_C.CollectPinButtons
// 0x0020 (0x0020 - 0x0000)
struct PinModal_C_CollectPinButtons final
{
public:
	TArray<class UFortPinButton*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UFortPinButton*>                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PinModal_C_CollectPinButtons) == 0x000008, "Wrong alignment on PinModal_C_CollectPinButtons");
static_assert(sizeof(PinModal_C_CollectPinButtons) == 0x000020, "Wrong size on PinModal_C_CollectPinButtons");
static_assert(offsetof(PinModal_C_CollectPinButtons, ReturnValue) == 0x000000, "Member 'PinModal_C_CollectPinButtons::ReturnValue' has a wrong offset!");
static_assert(offsetof(PinModal_C_CollectPinButtons, K2Node_MakeArray_Array) == 0x000010, "Member 'PinModal_C_CollectPinButtons::K2Node_MakeArray_Array' has a wrong offset!");

// Function PinModal.PinModal_C.ExecuteUbergraph_PinModal
// 0x0008 (0x0008 - 0x0000)
struct PinModal_C_ExecuteUbergraph_PinModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPinModalValidityState                        K2Node_Event_PinModalState;                        // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PinModal_C_ExecuteUbergraph_PinModal) == 0x000004, "Wrong alignment on PinModal_C_ExecuteUbergraph_PinModal");
static_assert(sizeof(PinModal_C_ExecuteUbergraph_PinModal) == 0x000008, "Wrong size on PinModal_C_ExecuteUbergraph_PinModal");
static_assert(offsetof(PinModal_C_ExecuteUbergraph_PinModal, EntryPoint) == 0x000000, "Member 'PinModal_C_ExecuteUbergraph_PinModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(PinModal_C_ExecuteUbergraph_PinModal, K2Node_Event_IsDesignTime) == 0x000004, "Member 'PinModal_C_ExecuteUbergraph_PinModal::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PinModal_C_ExecuteUbergraph_PinModal, K2Node_Event_PinModalState) == 0x000005, "Member 'PinModal_C_ExecuteUbergraph_PinModal::K2Node_Event_PinModalState' has a wrong offset!");

// Function PinModal.PinModal_C.OnSetPinState
// 0x0001 (0x0001 - 0x0000)
struct PinModal_C_OnSetPinState final
{
public:
	EPinModalValidityState                        PinModalState;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PinModal_C_OnSetPinState) == 0x000001, "Wrong alignment on PinModal_C_OnSetPinState");
static_assert(sizeof(PinModal_C_OnSetPinState) == 0x000001, "Wrong size on PinModal_C_OnSetPinState");
static_assert(offsetof(PinModal_C_OnSetPinState, PinModalState) == 0x000000, "Member 'PinModal_C_OnSetPinState::PinModalState' has a wrong offset!");

// Function PinModal.PinModal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PinModal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PinModal_C_PreConstruct) == 0x000001, "Wrong alignment on PinModal_C_PreConstruct");
static_assert(sizeof(PinModal_C_PreConstruct) == 0x000001, "Wrong size on PinModal_C_PreConstruct");
static_assert(offsetof(PinModal_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PinModal_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PinModal.PinModal_C.Set Visual States
// 0x0068 (0x0068 - 0x0000)
struct PinModal_C_Set_Visual_States final
{
public:
	EPinModalValidityState                        Pin_States;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPinModalValidityState                        Temp_byte_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPinModalValidityState                        Temp_byte_Variable_1;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPinModalValidityState                        Temp_byte_Variable_6;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          K2Node_Select_Default_2;                           // 0x0060(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PinModal_C_Set_Visual_States) == 0x000008, "Wrong alignment on PinModal_C_Set_Visual_States");
static_assert(sizeof(PinModal_C_Set_Visual_States) == 0x000068, "Wrong size on PinModal_C_Set_Visual_States");
static_assert(offsetof(PinModal_C_Set_Visual_States, Pin_States) == 0x000000, "Member 'PinModal_C_Set_Visual_States::Pin_States' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_struct_Variable) == 0x000004, "Member 'PinModal_C_Set_Visual_States::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_struct_Variable_1) == 0x000014, "Member 'PinModal_C_Set_Visual_States::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_struct_Variable_2) == 0x000024, "Member 'PinModal_C_Set_Visual_States::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_struct_Variable_3) == 0x000034, "Member 'PinModal_C_Set_Visual_States::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_byte_Variable) == 0x000044, "Member 'PinModal_C_Set_Visual_States::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_byte_Variable_1) == 0x000045, "Member 'PinModal_C_Set_Visual_States::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_byte_Variable_2) == 0x000046, "Member 'PinModal_C_Set_Visual_States::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_byte_Variable_3) == 0x000047, "Member 'PinModal_C_Set_Visual_States::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_byte_Variable_4) == 0x000048, "Member 'PinModal_C_Set_Visual_States::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_byte_Variable_5) == 0x000049, "Member 'PinModal_C_Set_Visual_States::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, Temp_byte_Variable_6) == 0x00004A, "Member 'PinModal_C_Set_Visual_States::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, K2Node_Select_Default) == 0x00004B, "Member 'PinModal_C_Set_Visual_States::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, K2Node_Select_Default_1) == 0x00004C, "Member 'PinModal_C_Set_Visual_States::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PinModal_C_Set_Visual_States, K2Node_Select_Default_2) == 0x000060, "Member 'PinModal_C_Set_Visual_States::K2Node_Select_Default_2' has a wrong offset!");

// Function PinModal.PinModal_C.SetPreviewData
// 0x0040 (0x0040 - 0x0000)
struct PinModal_C_SetPreviewData final
{
public:
	class UPinCodeButton_C*                       NewLocalVar_0;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPinCodeButton_C*>               K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPinCodeButton_C*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PinModal_C_SetPreviewData) == 0x000008, "Wrong alignment on PinModal_C_SetPreviewData");
static_assert(sizeof(PinModal_C_SetPreviewData) == 0x000040, "Wrong size on PinModal_C_SetPreviewData");
static_assert(offsetof(PinModal_C_SetPreviewData, NewLocalVar_0) == 0x000000, "Member 'PinModal_C_SetPreviewData::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(PinModal_C_SetPreviewData, Temp_int_Array_Index_Variable) == 0x000008, "Member 'PinModal_C_SetPreviewData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PinModal_C_SetPreviewData, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'PinModal_C_SetPreviewData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PinModal_C_SetPreviewData, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'PinModal_C_SetPreviewData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinModal_C_SetPreviewData, K2Node_MakeArray_Array) == 0x000018, "Member 'PinModal_C_SetPreviewData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PinModal_C_SetPreviewData, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'PinModal_C_SetPreviewData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinModal_C_SetPreviewData, CallFunc_Array_Get_Item) == 0x000030, "Member 'PinModal_C_SetPreviewData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PinModal_C_SetPreviewData, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'PinModal_C_SetPreviewData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

