#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PirateMap_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct PirateMap_AnimBP.PirateMap_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_7;                                  // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_8;                                  // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_9;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_10;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_7) == 0x000004, "Member 'PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_7' has a wrong offset!");
static_assert(offsetof(PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_8) == 0x000008, "Member 'PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_8' has a wrong offset!");
static_assert(offsetof(PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_9) == 0x00000C, "Member 'PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_9' has a wrong offset!");
static_assert(offsetof(PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_10) == 0x000010, "Member 'PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_10' has a wrong offset!");
static_assert(offsetof(PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'PirateMap_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

