#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pistol_Revolver_SideAction_AnimBP1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Pistol_Revolver_SideAction_AnimBP1.Pistol_Revolver_SideAction_AnimBP1_C.AnimBlueprintGeneratedConstantData
// 0x016F (0x0170 - 0x0001)
struct Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_146;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_147;                            // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_148;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_149;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_150;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_151;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_152;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_153;                            // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_154;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_155;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_156;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_157;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_158;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_159;                            // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_160;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_161;                                 // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_162;                            // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_163;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_164;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_165;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_166;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_167;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_168;                              // 0x0078(0x0018)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_169;                                // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_170;                               // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_171;                              // 0x0098(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_172;                               // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_173;                            // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_174;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_175;                                // 0x00D1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_176;                                // 0x00D2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_177;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0158(0x0018)()
};
static_assert(alignof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData) == 0x000170, "Wrong size on Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __NameProperty_146) == 0x000004, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__NameProperty_146' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_147) == 0x000008, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_147' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __NameProperty_148) == 0x000010, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__NameProperty_148' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __IntProperty_149) == 0x000014, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__IntProperty_149' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_150) == 0x000018, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_150' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __NameProperty_151) == 0x000020, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__NameProperty_151' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __IntProperty_152) == 0x000024, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__IntProperty_152' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_153) == 0x000028, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_153' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __NameProperty_154) == 0x000030, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__NameProperty_154' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __IntProperty_155) == 0x000034, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__IntProperty_155' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_156) == 0x000038, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_156' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __NameProperty_157) == 0x000040, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__NameProperty_157' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __IntProperty_158) == 0x000044, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__IntProperty_158' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_159) == 0x000048, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_159' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __NameProperty_160) == 0x000050, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__NameProperty_160' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __IntProperty_161) == 0x000054, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__IntProperty_161' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_162) == 0x000058, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_162' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __NameProperty_163) == 0x000060, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__NameProperty_163' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __IntProperty_164) == 0x000064, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__IntProperty_164' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __ByteProperty_165) == 0x000068, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__ByteProperty_165' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __NameProperty_166) == 0x00006C, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__NameProperty_166' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __IntProperty_167) == 0x000070, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__IntProperty_167' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __StructProperty_168) == 0x000078, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__StructProperty_168' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __BoolProperty_169) == 0x000090, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__BoolProperty_169' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __FloatProperty_170) == 0x000094, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__FloatProperty_170' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __StructProperty_171) == 0x000098, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__StructProperty_171' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __FloatProperty_172) == 0x0000C4, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__FloatProperty_172' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_173) == 0x0000C8, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_173' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __BoolProperty_174) == 0x0000D0, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__BoolProperty_174' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __EnumProperty_175) == 0x0000D1, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__EnumProperty_175' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __ByteProperty_176) == 0x0000D2, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__ByteProperty_176' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, __NameProperty_177) == 0x0000D4, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::__NameProperty_177' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D8, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000158, "Member 'Pistol_Revolver_SideAction_AnimBP1::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

