#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pistol_Core_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Pistol_Core_AnimBP.Pistol_Core_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00FF (0x0100 - 0x0001)
struct Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_10;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_11;                               // 0x0008(0x0018)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_12;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_13;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_14;                               // 0x0028(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_15;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_16;                             // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_18;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_19;                                 // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_20;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0068(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E8(0x0018)()
};
static_assert(alignof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000100, "Wrong size on Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_10) == 0x000004, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_10' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_11) == 0x000008, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_11' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_12) == 0x000020, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_13) == 0x000024, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_14) == 0x000028, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_14' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_15) == 0x000054, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_16) == 0x000058, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_16' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_17) == 0x000060, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_17' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_18) == 0x000061, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_18' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_19) == 0x000062, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_19' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_20) == 0x000064, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_20' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000068, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E8, "Member 'Pistol_Core_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

