#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyRatingResponse

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerSurveyRatingResponse.PlayerSurveyRatingResponse_C.ExecuteUbergraph_PlayerSurveyRatingResponse
// 0x0028 (0x0028 - 0x0000)
struct PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
	int32                                         CallFunc_GetNumEntries_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse) == 0x000008, "Wrong alignment on PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse");
static_assert(sizeof(PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse) == 0x000028, "Wrong size on PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse");
static_assert(offsetof(PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse, EntryPoint) == 0x000000, "Member 'PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse, K2Node_Event_InFocusEvent) == 0x000004, "Member 'PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse, CallFunc_GetNumEntries_ReturnValue) == 0x00000C, "Member 'PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse::CallFunc_GetNumEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse, CallFunc_SelectFloat_ReturnValue) == 0x000014, "Member 'PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'PlayerSurveyRatingResponse_C_ExecuteUbergraph_PlayerSurveyRatingResponse::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function PlayerSurveyRatingResponse.PlayerSurveyRatingResponse_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct PlayerSurveyRatingResponse_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(PlayerSurveyRatingResponse_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on PlayerSurveyRatingResponse_C_OnAddedToFocusPath");
static_assert(sizeof(PlayerSurveyRatingResponse_C_OnAddedToFocusPath) == 0x000008, "Wrong size on PlayerSurveyRatingResponse_C_OnAddedToFocusPath");
static_assert(offsetof(PlayerSurveyRatingResponse_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'PlayerSurveyRatingResponse_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

}

