#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerDiscovered

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PlayerDiscovered.PlayerDiscovered_C.OnNewDiscovery
// 0x0020 (0x0020 - 0x0000)
struct PlayerDiscovered_C_OnNewDiscovery final
{
public:
	class FText                                   LocalizedLocationName;                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bIsNamedLocation;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerDiscovered_C_OnNewDiscovery) == 0x000008, "Wrong alignment on PlayerDiscovered_C_OnNewDiscovery");
static_assert(sizeof(PlayerDiscovered_C_OnNewDiscovery) == 0x000020, "Wrong size on PlayerDiscovered_C_OnNewDiscovery");
static_assert(offsetof(PlayerDiscovered_C_OnNewDiscovery, LocalizedLocationName) == 0x000000, "Member 'PlayerDiscovered_C_OnNewDiscovery::LocalizedLocationName' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_OnNewDiscovery, bIsNamedLocation) == 0x000018, "Member 'PlayerDiscovered_C_OnNewDiscovery::bIsNamedLocation' has a wrong offset!");

// Function PlayerDiscovered.PlayerDiscovered_C.ExecuteUbergraph_PlayerDiscovered
// 0x00A8 (0x00A8 - 0x0000)
struct PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_LocalizedLocationName;                // 0x0038(0x0018)(ConstParm)
	bool                                          K2Node_Event_bIsNamedLocation;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0070(0x0038)(NoDestructor)
};
static_assert(alignof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered) == 0x000008, "Wrong alignment on PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered");
static_assert(sizeof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered) == 0x0000A8, "Wrong size on PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, EntryPoint) == 0x000000, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, Temp_int_Variable) == 0x000010, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000014, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, Temp_int_Variable_1) == 0x00002C, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_IsMobileGame_ReturnValue) == 0x000030, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000031, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, Temp_bool_Variable) == 0x000032, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_Event_LocalizedLocationName) == 0x000038, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_Event_LocalizedLocationName' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_Event_bIsNamedLocation) == 0x000050, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_Event_bIsNamedLocation' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_BreakVector2D_X) == 0x000054, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_BreakVector2D_Y) == 0x000058, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_Select_Default) == 0x00005C, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_MakeStruct_WidgetTransform) == 0x000070, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

}

