#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerRankEmblem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerRankEmblem.PlayerRankEmblem_C
// 0x0020 (0x0300 - 0x02E0)
class UPlayerRankEmblem_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UPlayerBanner_C*                        PlayerBanner;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          BindToLocalPlayerByDefault;                        // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_PlayerRankEmblem(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBannerInfo(const struct FPlayerBannerInfo& Banner);
	void SetBannerOwner(class AFortPlayerController* Target);
	void SetBannerSurroundLevel(int32 Level, bool Animate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerRankEmblem_C">();
	}
	static class UPlayerRankEmblem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerRankEmblem_C>();
	}
};
static_assert(alignof(UPlayerRankEmblem_C) == 0x000008, "Wrong alignment on UPlayerRankEmblem_C");
static_assert(sizeof(UPlayerRankEmblem_C) == 0x000300, "Wrong size on UPlayerRankEmblem_C");
static_assert(offsetof(UPlayerRankEmblem_C, UberGraphFrame) == 0x0002E0, "Member 'UPlayerRankEmblem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerRankEmblem_C, Flash) == 0x0002E8, "Member 'UPlayerRankEmblem_C::Flash' has a wrong offset!");
static_assert(offsetof(UPlayerRankEmblem_C, PlayerBanner) == 0x0002F0, "Member 'UPlayerRankEmblem_C::PlayerBanner' has a wrong offset!");
static_assert(offsetof(UPlayerRankEmblem_C, BindToLocalPlayerByDefault) == 0x0002F8, "Member 'UPlayerRankEmblem_C::BindToLocalPlayerByDefault' has a wrong offset!");

}

