#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerVisited

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerVisited.PlayerVisited_C.OnNewVisited
// 0x0020 (0x0020 - 0x0000)
struct PlayerVisited_C_OnNewVisited final
{
public:
	class FText                                   LocalizedLocationName;                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bIsNamedLocation;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerVisited_C_OnNewVisited) == 0x000008, "Wrong alignment on PlayerVisited_C_OnNewVisited");
static_assert(sizeof(PlayerVisited_C_OnNewVisited) == 0x000020, "Wrong size on PlayerVisited_C_OnNewVisited");
static_assert(offsetof(PlayerVisited_C_OnNewVisited, LocalizedLocationName) == 0x000000, "Member 'PlayerVisited_C_OnNewVisited::LocalizedLocationName' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_OnNewVisited, bIsNamedLocation) == 0x000018, "Member 'PlayerVisited_C_OnNewVisited::bIsNamedLocation' has a wrong offset!");

// Function PlayerVisited.PlayerVisited_C.ExecuteUbergraph_PlayerVisited
// 0x0078 (0x0078 - 0x0000)
struct PlayerVisited_C_ExecuteUbergraph_PlayerVisited final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_LocalizedLocationName;                // 0x0008(0x0018)(ConstParm)
	bool                                          K2Node_Event_bIsNamedLocation;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited) == 0x000008, "Wrong alignment on PlayerVisited_C_ExecuteUbergraph_PlayerVisited");
static_assert(sizeof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited) == 0x000078, "Wrong size on PlayerVisited_C_ExecuteUbergraph_PlayerVisited");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, EntryPoint) == 0x000000, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, Temp_int_Variable) == 0x000004, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, K2Node_Event_LocalizedLocationName) == 0x000008, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::K2Node_Event_LocalizedLocationName' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, K2Node_Event_bIsNamedLocation) == 0x000020, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::K2Node_Event_bIsNamedLocation' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00003C, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x00003D, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, Temp_int_Variable_1) == 0x000040, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_GetEndTime_ReturnValue) == 0x000050, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000060, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, Temp_bool_Variable) == 0x000064, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_NotEqual_TextText_ReturnValue) == 0x000065, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, K2Node_Select_Default) == 0x000068, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x00006C, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000070, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerVisited_C_ExecuteUbergraph_PlayerVisited, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000074, "Member 'PlayerVisited_C_ExecuteUbergraph_PlayerVisited::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

