#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PointLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum PointLight.EPointLightDeviceModes
// NumValues: 0x0008
enum class EPointLightDeviceModes : uint8
{
	Constant                                 = 0,
	Flicker                                  = 1,
	Wave                                     = 2,
	ShortCircuit                             = 3,
	Party                                    = 4,
	Windy                                    = 5,
	Flash                                    = 6,
	EPointLightDeviceModes_MAX               = 7,
};

// Enum PointLight.EPointLightDeviceLightType
// NumValues: 0x0003
enum class EPointLightDeviceLightType : uint8
{
	Point                                    = 0,
	Spot                                     = 1,
	EPointLightDeviceLightType_MAX           = 2,
};

// ScriptStruct PointLight.PointLightRhythmParameters
// 0x0038 (0x0038 - 0x0000)
struct FPointLightRhythmParameters final
{
public:
	struct FLinearColor                           LightColor;                                        // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULightComponent*                        ActiveLight;                                       // 0x0010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColorBands;                                        // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RhythmFrequencyValue;                              // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindAmplitudeSpotLight;                            // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlashFactor;                                       // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SizeBasedIntensity;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPointLightDeviceLightType                    LightType;                                         // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPointLightDeviceModes                        RhythmMode;                                        // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPointLightRhythmParameters) == 0x000008, "Wrong alignment on FPointLightRhythmParameters");
static_assert(sizeof(FPointLightRhythmParameters) == 0x000038, "Wrong size on FPointLightRhythmParameters");
static_assert(offsetof(FPointLightRhythmParameters, LightColor) == 0x000000, "Member 'FPointLightRhythmParameters::LightColor' has a wrong offset!");
static_assert(offsetof(FPointLightRhythmParameters, ActiveLight) == 0x000010, "Member 'FPointLightRhythmParameters::ActiveLight' has a wrong offset!");
static_assert(offsetof(FPointLightRhythmParameters, StaticMeshComponent) == 0x000018, "Member 'FPointLightRhythmParameters::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(FPointLightRhythmParameters, ColorBands) == 0x000020, "Member 'FPointLightRhythmParameters::ColorBands' has a wrong offset!");
static_assert(offsetof(FPointLightRhythmParameters, RhythmFrequencyValue) == 0x000024, "Member 'FPointLightRhythmParameters::RhythmFrequencyValue' has a wrong offset!");
static_assert(offsetof(FPointLightRhythmParameters, WindAmplitudeSpotLight) == 0x000028, "Member 'FPointLightRhythmParameters::WindAmplitudeSpotLight' has a wrong offset!");
static_assert(offsetof(FPointLightRhythmParameters, FlashFactor) == 0x00002C, "Member 'FPointLightRhythmParameters::FlashFactor' has a wrong offset!");
static_assert(offsetof(FPointLightRhythmParameters, SizeBasedIntensity) == 0x000030, "Member 'FPointLightRhythmParameters::SizeBasedIntensity' has a wrong offset!");
static_assert(offsetof(FPointLightRhythmParameters, LightType) == 0x000034, "Member 'FPointLightRhythmParameters::LightType' has a wrong offset!");
static_assert(offsetof(FPointLightRhythmParameters, RhythmMode) == 0x000035, "Member 'FPointLightRhythmParameters::RhythmMode' has a wrong offset!");

}

