#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PreviewUnbindAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PreviewUnbindAction.PreviewUnbindAction_C
// 0x0028 (0x02F8 - 0x02D0)
class UPreviewUnbindAction_C final : public UFortSettingsPreviewActionUnbind
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          BorderFrame;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_0;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PrimaryKeybindTextSizeBox;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SecondaryKeybindTextSizeBox;                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_PreviewUnbindAction(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PreviewUnbindAction_C">();
	}
	static class UPreviewUnbindAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreviewUnbindAction_C>();
	}
};
static_assert(alignof(UPreviewUnbindAction_C) == 0x000008, "Wrong alignment on UPreviewUnbindAction_C");
static_assert(sizeof(UPreviewUnbindAction_C) == 0x0002F8, "Wrong size on UPreviewUnbindAction_C");
static_assert(offsetof(UPreviewUnbindAction_C, UberGraphFrame) == 0x0002D0, "Member 'UPreviewUnbindAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPreviewUnbindAction_C, BorderFrame) == 0x0002D8, "Member 'UPreviewUnbindAction_C::BorderFrame' has a wrong offset!");
static_assert(offsetof(UPreviewUnbindAction_C, CommonBorder_0) == 0x0002E0, "Member 'UPreviewUnbindAction_C::CommonBorder_0' has a wrong offset!");
static_assert(offsetof(UPreviewUnbindAction_C, PrimaryKeybindTextSizeBox) == 0x0002E8, "Member 'UPreviewUnbindAction_C::PrimaryKeybindTextSizeBox' has a wrong offset!");
static_assert(offsetof(UPreviewUnbindAction_C, SecondaryKeybindTextSizeBox) == 0x0002F0, "Member 'UPreviewUnbindAction_C::SecondaryKeybindTextSizeBox' has a wrong offset!");

}

