#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimarySkewButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PrimarySkewButton.PrimarySkewButton_C
// 0x0050 (0x1080 - 0x1030)
class UPrimarySkewButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTop;                                   // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ToUpper;                                           // 0x1060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          XL;                                                // 0x1061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1062[0x6];                                     // 0x1062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonNameText;                                    // 0x1068(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_PrimarySkewButton(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void BP_OnClicked();
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PrimarySkewButton_C">();
	}
	static class UPrimarySkewButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimarySkewButton_C>();
	}
};
static_assert(alignof(UPrimarySkewButton_C) == 0x000010, "Wrong alignment on UPrimarySkewButton_C");
static_assert(sizeof(UPrimarySkewButton_C) == 0x001080, "Wrong size on UPrimarySkewButton_C");
static_assert(offsetof(UPrimarySkewButton_C, UberGraphFrame) == 0x001030, "Member 'UPrimarySkewButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_C, Pressed) == 0x001038, "Member 'UPrimarySkewButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_C, Hover) == 0x001040, "Member 'UPrimarySkewButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_C, CenterButtonTextWidget) == 0x001048, "Member 'UPrimarySkewButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_C, Image_ButtonTop) == 0x001050, "Member 'UPrimarySkewButton_C::Image_ButtonTop' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_C, Image_Shadow) == 0x001058, "Member 'UPrimarySkewButton_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_C, ToUpper) == 0x001060, "Member 'UPrimarySkewButton_C::ToUpper' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_C, XL) == 0x001061, "Member 'UPrimarySkewButton_C::XL' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_C, ButtonNameText) == 0x001068, "Member 'UPrimarySkewButton_C::ButtonNameText' has a wrong offset!");

}

