#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_HappyGhost

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Prj_Athena_HappyGhost.Prj_Athena_HappyGhost_C.CustomPickupAttach
// 0x0008 (0x0008 - 0x0000)
struct Prj_Athena_HappyGhost_C_CustomPickupAttach final
{
public:
	class AFortPickup*                            FortPickup;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_Athena_HappyGhost_C_CustomPickupAttach) == 0x000008, "Wrong alignment on Prj_Athena_HappyGhost_C_CustomPickupAttach");
static_assert(sizeof(Prj_Athena_HappyGhost_C_CustomPickupAttach) == 0x000008, "Wrong size on Prj_Athena_HappyGhost_C_CustomPickupAttach");
static_assert(offsetof(Prj_Athena_HappyGhost_C_CustomPickupAttach, FortPickup) == 0x000000, "Member 'Prj_Athena_HappyGhost_C_CustomPickupAttach::FortPickup' has a wrong offset!");

// Function Prj_Athena_HappyGhost.Prj_Athena_HappyGhost_C.ExecuteUbergraph_Prj_Athena_HappyGhost
// 0x07F0 (0x07F0 - 0x0000)
struct Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            K2Node_DynamicCast_AsFort_Pickup;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_FlopperSpawn_World_C*       K2Node_DynamicCast_AsBGA_Athena_Flopper_Spawn_World; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00E0(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3[0x1];                                      // 0x01C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_DynamicCast_AsFort_Water_Body_Actor;        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWaterSurfaceInfo                      CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo; // 0x02A0(0x0068)(NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp_1;                          // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0380(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0460(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0482(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_483[0x5];                                      // 0x0483(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0493(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_HappyGhost_Athena_C*                 K2Node_DynamicCast_AsB_Happy_Ghost_Athena;         // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x04D8(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bIsOverlap;                           // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA[0x6];                                      // 0x05BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation; // 0x05C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal; // 0x05D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition; // 0x05F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastWaterSurfaceInfo_WaterDepth;       // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx;     // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterVelocity;    // 0x0610(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x064A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B[0x1];                                      // 0x064B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0670(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0688(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x06A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x06C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0718(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            K2Node_CustomEvent_FortPickup;                     // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSquaredDistanceTo_ReturnValue;         // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_734[0x4];                                      // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0741(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0742(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0743(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSquaredDistanceTo_ReturnValue_1;       // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0754(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0755(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0756(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_757[0x1];                                      // 0x0757(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0758(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0770(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9[0x7];                                      // 0x07D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Athena_HappyGhost_Wire_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_3;                   // 0x07E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_4;                   // 0x07EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x07EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasInfiniteAmmo_ReturnValue;              // 0x07EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost) == 0x000010, "Wrong alignment on Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost");
static_assert(sizeof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost) == 0x0007F0, "Wrong size on Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, EntryPoint) == 0x000000, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_OtherActor_1) == 0x000008, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_AsFort_Pickup) == 0x000010, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_AsFort_Pickup' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_AsBGA_Athena_Flopper_Spawn_World) == 0x000020, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_AsBGA_Athena_Flopper_Spawn_World' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsServer_ReturnValue) == 0x000060, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetInstigator_ReturnValue) == 0x000068, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000070, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000088, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, Temp_object_Variable) == 0x0000D0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_LineTraceSingle_OutHit) == 0x0000E0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_LineTraceSingle_ReturnValue) == 0x0001C0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_bBlockingHit) == 0x0001C1, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001C2, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_Time) == 0x0001C4, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_Distance) == 0x0001C8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_Location) == 0x0001D0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_ImpactPoint) == 0x0001E8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_Normal) == 0x000200, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_ImpactNormal) == 0x000218, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_PhysMat) == 0x000230, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_HitActor) == 0x000238, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_HitComponent) == 0x000240, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_HitBoneName) == 0x000248, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_BoneName) == 0x00024C, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_HitItem) == 0x000250, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_ElementIndex) == 0x000254, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_FaceIndex) == 0x000258, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_TraceStart) == 0x000260, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_TraceEnd) == 0x000278, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_AsFort_Water_Body_Actor) == 0x000290, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_AsFort_Water_Body_Actor' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_bSuccess_2) == 0x000298, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo) == 0x0002A0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetWaterSurfaceInfoStruct_OutWaterSurfaceInfo' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000308, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000310, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_MyComp) == 0x000318, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_Other) == 0x000320, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_OtherComp_1) == 0x000328, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_bSelfMoved) == 0x000330, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_HitLocation) == 0x000338, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_HitNormal) == 0x000350, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_NormalImpulse) == 0x000368, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_Hit) == 0x000380, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000460, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_bSuccess_3) == 0x000470, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_AsPawn) == 0x000478, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_bSuccess_4) == 0x000480, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_Not_PreBool_ReturnValue) == 0x000481, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsValid_ReturnValue_2) == 0x000482, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_AsBuilding_Actor) == 0x000488, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_bSuccess_5) == 0x000490, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BooleanAND_ReturnValue) == 0x000491, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsValid_ReturnValue_3) == 0x000492, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BooleanAND_ReturnValue_1) == 0x000493, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsValid_ReturnValue_4) == 0x000494, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetInstigator_ReturnValue_1) == 0x000498, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetOwner_ReturnValue) == 0x0004A0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0004A8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_bSuccess_6) == 0x0004B0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_AsB_Happy_Ghost_Athena) == 0x0004B8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_AsB_Happy_Ghost_Athena' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_DynamicCast_bSuccess_7) == 0x0004C0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_OtherActor) == 0x0004C8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_OtherComp) == 0x0004D0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_HitResult) == 0x0004D8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_Event_bIsOverlap) == 0x0005B8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_Event_bIsOverlap' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsValid_ReturnValue_5) == 0x0005B9, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation) == 0x0005C0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal) == 0x0005D8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition) == 0x0005F0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetLastWaterSurfaceInfo_WaterDepth) == 0x000608, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetLastWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx) == 0x00060C, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetLastWaterSurfaceInfo_WaterVelocity) == 0x000610, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetLastWaterSurfaceInfo_WaterVelocity' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000628, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000630, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000648, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000649, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00064A, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_Time_1) == 0x00064C, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_Distance_1) == 0x000650, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_Location_1) == 0x000658, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000670, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_Normal_1) == 0x000688, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0006A0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_PhysMat_1) == 0x0006B8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_HitActor_1) == 0x0006C0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_HitComponent_1) == 0x0006C8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_HitBoneName_1) == 0x0006D0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_BoneName_1) == 0x0006D4, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_HitItem_1) == 0x0006D8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_ElementIndex_1) == 0x0006DC, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_FaceIndex_1) == 0x0006E0, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_TraceStart_1) == 0x0006E8, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BreakHitResult_TraceEnd_1) == 0x000700, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000718, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsServer_ReturnValue_1) == 0x000720, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, K2Node_CustomEvent_FortPickup) == 0x000728, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::K2Node_CustomEvent_FortPickup' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetSquaredDistanceTo_ReturnValue) == 0x000730, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetSquaredDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetAttachParentActor_ReturnValue) == 0x000738, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000740, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000741, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsServer_ReturnValue_2) == 0x000742, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BooleanAND_ReturnValue_2) == 0x000743, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetInstigator_ReturnValue_2) == 0x000748, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GetSquaredDistanceTo_ReturnValue_1) == 0x000750, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GetSquaredDistanceTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_IsDedicatedServer_ReturnValue) == 0x000754, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000755, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_BooleanAND_ReturnValue_3) == 0x000756, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000758, "Member 'Prj_Athena_HappyGhost_C_ExecuteUbergraph_Prj_Athena_HappyGhost::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
