#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_Consumable_Thrown_Cabbage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Prj_Athena_Consumable_Thrown_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_Athena_Consumable_Thrown_Cabbage.Prj_Athena_Consumable_Thrown_Cabbage_C
// 0x0038 (0x0AE0 - 0x0AA8)
class APrj_Athena_Consumable_Thrown_Cabbage_C final : public AB_Prj_Athena_Consumable_Thrown_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_Athena_Consumable_Thrown_Cabbage_C; // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                Initial_Loc;                                       // 0x0AB0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Landed_Loc;                                        // 0x0AC8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_Athena_Consumable_Thrown_Cabbage(int32 EntryPoint);
	void On_Pickup_Spawned(class AFortPickup* Spawned_Pickup);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_Athena_Consumable_Thrown_Cabbage_C">();
	}
	static class APrj_Athena_Consumable_Thrown_Cabbage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_Consumable_Thrown_Cabbage_C>();
	}
};
static_assert(alignof(APrj_Athena_Consumable_Thrown_Cabbage_C) == 0x000008, "Wrong alignment on APrj_Athena_Consumable_Thrown_Cabbage_C");
static_assert(sizeof(APrj_Athena_Consumable_Thrown_Cabbage_C) == 0x000AE0, "Wrong size on APrj_Athena_Consumable_Thrown_Cabbage_C");
static_assert(offsetof(APrj_Athena_Consumable_Thrown_Cabbage_C, UberGraphFrame_Prj_Athena_Consumable_Thrown_Cabbage_C) == 0x000AA8, "Member 'APrj_Athena_Consumable_Thrown_Cabbage_C::UberGraphFrame_Prj_Athena_Consumable_Thrown_Cabbage_C' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Consumable_Thrown_Cabbage_C, Initial_Loc) == 0x000AB0, "Member 'APrj_Athena_Consumable_Thrown_Cabbage_C::Initial_Loc' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Consumable_Thrown_Cabbage_C, Landed_Loc) == 0x000AC8, "Member 'APrj_Athena_Consumable_Thrown_Cabbage_C::Landed_Loc' has a wrong offset!");

}

