#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_WestSausage_PickUpTaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_WestSausage_PickUpTaker.Prj_WestSausage_PickUpTaker_C
// 0x0060 (0x0A50 - 0x09F0)
class APrj_WestSausage_PickUpTaker_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Done;                                              // 0x09F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F9[0x7];                                      // 0x09F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AttachedPickup;                                    // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Move;                                              // 0x0A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A09[0x7];                                      // 0x0A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OriginalVel;                                       // 0x0A10(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VecToPlayer;                                       // 0x0A28(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnDonePullingPickup;                               // 0x0A40(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_Prj_WestSausage_PickUpTaker(int32 EntryPoint);
	void Init(class AActor* AttachedPickup_0);
	void ReceiveTick(float DeltaSeconds);
	void StartMoving();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_WestSausage_PickUpTaker_C">();
	}
	static class APrj_WestSausage_PickUpTaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_WestSausage_PickUpTaker_C>();
	}
};
static_assert(alignof(APrj_WestSausage_PickUpTaker_C) == 0x000008, "Wrong alignment on APrj_WestSausage_PickUpTaker_C");
static_assert(sizeof(APrj_WestSausage_PickUpTaker_C) == 0x000A50, "Wrong size on APrj_WestSausage_PickUpTaker_C");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, UberGraphFrame) == 0x0009F0, "Member 'APrj_WestSausage_PickUpTaker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, Done) == 0x0009F8, "Member 'APrj_WestSausage_PickUpTaker_C::Done' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, AttachedPickup) == 0x000A00, "Member 'APrj_WestSausage_PickUpTaker_C::AttachedPickup' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, Move) == 0x000A08, "Member 'APrj_WestSausage_PickUpTaker_C::Move' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, OriginalVel) == 0x000A10, "Member 'APrj_WestSausage_PickUpTaker_C::OriginalVel' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, VecToPlayer) == 0x000A28, "Member 'APrj_WestSausage_PickUpTaker_C::VecToPlayer' has a wrong offset!");
static_assert(offsetof(APrj_WestSausage_PickUpTaker_C, OnDonePullingPickup) == 0x000A40, "Member 'APrj_WestSausage_PickUpTaker_C::OnDonePullingPickup' has a wrong offset!");

}

