#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveItemScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct ProgressiveItemScreen_C_CustomEvent final
{
public:
	class UFortTextButton*                        NewPipButton;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItemScreen_C_CustomEvent) == 0x000008, "Wrong alignment on ProgressiveItemScreen_C_CustomEvent");
static_assert(sizeof(ProgressiveItemScreen_C_CustomEvent) == 0x000008, "Wrong size on ProgressiveItemScreen_C_CustomEvent");
static_assert(offsetof(ProgressiveItemScreen_C_CustomEvent, NewPipButton) == 0x000000, "Member 'ProgressiveItemScreen_C_CustomEvent::NewPipButton' has a wrong offset!");

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.ExecuteUbergraph_ProgressiveItemScreen
// 0x00D8 (0x00D8 - 0x0000)
struct ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoloButton_C*                          K2Node_DynamicCast_AsSolo_Button;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoloButton_C*                          K2Node_DynamicCast_AsSolo_Button_1;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTextButton*                        K2Node_Event_NewPipButton;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_RowDisplayName;                       // 0x0068(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTabsVisible;                         // 0x0090(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_SpacingAdjustmentForTabs;             // 0x0094(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_ErrorStateText;                       // 0x00A0(0x0018)(ConstParm)
	bool                                          K2Node_Event_bInIsSoloScreen;                      // 0x00B8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x00C0(0x0018)()
};
static_assert(alignof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen) == 0x000008, "Wrong alignment on ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen");
static_assert(sizeof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen) == 0x0000D8, "Wrong size on ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, EntryPoint) == 0x000000, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, Temp_byte_Variable) == 0x000004, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_DynamicCast_AsSolo_Button) == 0x000008, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_DynamicCast_AsSolo_Button' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, Temp_byte_Variable_1) == 0x000011, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, Temp_bool_Variable) == 0x000012, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, Temp_text_Variable) == 0x000018, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, Temp_text_Variable_1) == 0x000030, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, Temp_bool_Variable_1) == 0x000048, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_DynamicCast_AsSolo_Button_1) == 0x000050, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_DynamicCast_AsSolo_Button_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Event_NewPipButton) == 0x000060, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Event_NewPipButton' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Event_RowDisplayName) == 0x000068, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Event_RowDisplayName' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, CallFunc_TextIsEmpty_ReturnValue) == 0x000080, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Select_Default) == 0x000081, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Event_bTabsVisible) == 0x000090, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Event_bTabsVisible' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Event_SpacingAdjustmentForTabs) == 0x000094, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Event_SpacingAdjustmentForTabs' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000098, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Event_ErrorStateText) == 0x0000A0, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Event_ErrorStateText' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Event_bInIsSoloScreen) == 0x0000B8, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Event_bInIsSoloScreen' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Select_Default_1) == 0x0000C0, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Select_Default_1' has a wrong offset!");

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.OnContainerTabVisibilityUpdated
// 0x0008 (0x0008 - 0x0000)
struct ProgressiveItemScreen_C_OnContainerTabVisibilityUpdated final
{
public:
	bool                                          bTabsVisible;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingAdjustmentForTabs;                          // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItemScreen_C_OnContainerTabVisibilityUpdated) == 0x000004, "Wrong alignment on ProgressiveItemScreen_C_OnContainerTabVisibilityUpdated");
static_assert(sizeof(ProgressiveItemScreen_C_OnContainerTabVisibilityUpdated) == 0x000008, "Wrong size on ProgressiveItemScreen_C_OnContainerTabVisibilityUpdated");
static_assert(offsetof(ProgressiveItemScreen_C_OnContainerTabVisibilityUpdated, bTabsVisible) == 0x000000, "Member 'ProgressiveItemScreen_C_OnContainerTabVisibilityUpdated::bTabsVisible' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_OnContainerTabVisibilityUpdated, SpacingAdjustmentForTabs) == 0x000004, "Member 'ProgressiveItemScreen_C_OnContainerTabVisibilityUpdated::SpacingAdjustmentForTabs' has a wrong offset!");

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.OnErrorStateTextUpdated
// 0x0018 (0x0018 - 0x0000)
struct ProgressiveItemScreen_C_OnErrorStateTextUpdated final
{
public:
	class FText                                   ErrorStateText;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ProgressiveItemScreen_C_OnErrorStateTextUpdated) == 0x000008, "Wrong alignment on ProgressiveItemScreen_C_OnErrorStateTextUpdated");
static_assert(sizeof(ProgressiveItemScreen_C_OnErrorStateTextUpdated) == 0x000018, "Wrong size on ProgressiveItemScreen_C_OnErrorStateTextUpdated");
static_assert(offsetof(ProgressiveItemScreen_C_OnErrorStateTextUpdated, ErrorStateText) == 0x000000, "Member 'ProgressiveItemScreen_C_OnErrorStateTextUpdated::ErrorStateText' has a wrong offset!");

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.OnPreviewActionButtonUpdated
// 0x0018 (0x0018 - 0x0000)
struct ProgressiveItemScreen_C_OnPreviewActionButtonUpdated final
{
public:
	class FText                                   RowDisplayName;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ProgressiveItemScreen_C_OnPreviewActionButtonUpdated) == 0x000008, "Wrong alignment on ProgressiveItemScreen_C_OnPreviewActionButtonUpdated");
static_assert(sizeof(ProgressiveItemScreen_C_OnPreviewActionButtonUpdated) == 0x000018, "Wrong size on ProgressiveItemScreen_C_OnPreviewActionButtonUpdated");
static_assert(offsetof(ProgressiveItemScreen_C_OnPreviewActionButtonUpdated, RowDisplayName) == 0x000000, "Member 'ProgressiveItemScreen_C_OnPreviewActionButtonUpdated::RowDisplayName' has a wrong offset!");

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.OnSetIsSoloScreen
// 0x0001 (0x0001 - 0x0000)
struct ProgressiveItemScreen_C_OnSetIsSoloScreen final
{
public:
	bool                                          bInIsSoloScreen;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItemScreen_C_OnSetIsSoloScreen) == 0x000001, "Wrong alignment on ProgressiveItemScreen_C_OnSetIsSoloScreen");
static_assert(sizeof(ProgressiveItemScreen_C_OnSetIsSoloScreen) == 0x000001, "Wrong size on ProgressiveItemScreen_C_OnSetIsSoloScreen");
static_assert(offsetof(ProgressiveItemScreen_C_OnSetIsSoloScreen, bInIsSoloScreen) == 0x000000, "Member 'ProgressiveItemScreen_C_OnSetIsSoloScreen::bInIsSoloScreen' has a wrong offset!");

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.UpdateLayoutForTabs
// 0x0058 (0x0058 - 0x0000)
struct ProgressiveItemScreen_C_UpdateLayoutForTabs final
{
public:
	bool                                          bTabsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingAdjustmentForTabs;                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgressiveItemScreen_C_UpdateLayoutForTabs) == 0x000008, "Wrong alignment on ProgressiveItemScreen_C_UpdateLayoutForTabs");
static_assert(sizeof(ProgressiveItemScreen_C_UpdateLayoutForTabs) == 0x000058, "Wrong size on ProgressiveItemScreen_C_UpdateLayoutForTabs");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, bTabsVisible) == 0x000000, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::bTabsVisible' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, SpacingAdjustmentForTabs) == 0x000004, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::SpacingAdjustmentForTabs' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, Temp_bool_Variable) == 0x000008, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, Temp_float_Variable) == 0x00000C, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, Temp_float_Variable_1) == 0x000014, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000018, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, K2Node_Select_Default) == 0x000020, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000028, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, K2Node_MakeStruct_Margin) == 0x00002C, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000040, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_UpdateLayoutForTabs, K2Node_MakeStruct_Margin_1) == 0x000048, "Member 'ProgressiveItemScreen_C_UpdateLayoutForTabs::K2Node_MakeStruct_Margin_1' has a wrong offset!");

}

