#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveTagsBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressiveTagsBase.ProgressiveTagsBase_C
// 0x0080 (0x0338 - 0x02B8)
class UProgressiveTagsBase_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Tag_Background;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tag_Image;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Tag_Text;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Background_Color;                                  // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            Text_Color;                                        // 0x02E8(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0300(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Image;                                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            Image_Tint;                                        // 0x0320(0x0014)(Edit, BlueprintVisible)
	float                                         Image_Rotation;                                    // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ProgressiveTagsBase(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateColor(const struct FLinearColor& Background_Color_0, const struct FSlateColor& Text_Color_0);
	void UpdateImage(class UTexture2D* Texture, const struct FSlateColor& TintColor, float Angle);
	void UpdateText(const class FText& Text_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressiveTagsBase_C">();
	}
	static class UProgressiveTagsBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressiveTagsBase_C>();
	}
};
static_assert(alignof(UProgressiveTagsBase_C) == 0x000008, "Wrong alignment on UProgressiveTagsBase_C");
static_assert(sizeof(UProgressiveTagsBase_C) == 0x000338, "Wrong size on UProgressiveTagsBase_C");
static_assert(offsetof(UProgressiveTagsBase_C, UberGraphFrame) == 0x0002B8, "Member 'UProgressiveTagsBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressiveTagsBase_C, Tag_Background) == 0x0002C0, "Member 'UProgressiveTagsBase_C::Tag_Background' has a wrong offset!");
static_assert(offsetof(UProgressiveTagsBase_C, Tag_Image) == 0x0002C8, "Member 'UProgressiveTagsBase_C::Tag_Image' has a wrong offset!");
static_assert(offsetof(UProgressiveTagsBase_C, Tag_Text) == 0x0002D0, "Member 'UProgressiveTagsBase_C::Tag_Text' has a wrong offset!");
static_assert(offsetof(UProgressiveTagsBase_C, Background_Color) == 0x0002D8, "Member 'UProgressiveTagsBase_C::Background_Color' has a wrong offset!");
static_assert(offsetof(UProgressiveTagsBase_C, Text_Color) == 0x0002E8, "Member 'UProgressiveTagsBase_C::Text_Color' has a wrong offset!");
static_assert(offsetof(UProgressiveTagsBase_C, Text) == 0x000300, "Member 'UProgressiveTagsBase_C::Text' has a wrong offset!");
static_assert(offsetof(UProgressiveTagsBase_C, Image) == 0x000318, "Member 'UProgressiveTagsBase_C::Image' has a wrong offset!");
static_assert(offsetof(UProgressiveTagsBase_C, Image_Tint) == 0x000320, "Member 'UProgressiveTagsBase_C::Image_Tint' has a wrong offset!");
static_assert(offsetof(UProgressiveTagsBase_C, Image_Rotation) == 0x000334, "Member 'UProgressiveTagsBase_C::Image_Rotation' has a wrong offset!");

}

