#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveHeaderBanner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressiveHeaderBanner.ProgressiveHeaderBanner_C
// 0x0058 (0x0310 - 0x02B8)
class UProgressiveHeaderBanner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Banner_Text;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Locked;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Debug_Text_Preview;                                // 0x02D8(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Completed;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Locked;                                            // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ProgressiveHeaderBanner(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update_Banner_State(bool Current_Sets_Complete, const class FText& Text);
	void Update_Text(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressiveHeaderBanner_C">();
	}
	static class UProgressiveHeaderBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressiveHeaderBanner_C>();
	}
};
static_assert(alignof(UProgressiveHeaderBanner_C) == 0x000008, "Wrong alignment on UProgressiveHeaderBanner_C");
static_assert(sizeof(UProgressiveHeaderBanner_C) == 0x000310, "Wrong size on UProgressiveHeaderBanner_C");
static_assert(offsetof(UProgressiveHeaderBanner_C, UberGraphFrame) == 0x0002B8, "Member 'UProgressiveHeaderBanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Banner_Text) == 0x0002C0, "Member 'UProgressiveHeaderBanner_C::Banner_Text' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Border_Locked) == 0x0002C8, "Member 'UProgressiveHeaderBanner_C::Border_Locked' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Image) == 0x0002D0, "Member 'UProgressiveHeaderBanner_C::Image' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Debug_Text_Preview) == 0x0002D8, "Member 'UProgressiveHeaderBanner_C::Debug_Text_Preview' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Completed) == 0x0002F0, "Member 'UProgressiveHeaderBanner_C::Completed' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Locked) == 0x000300, "Member 'UProgressiveHeaderBanner_C::Locked' has a wrong offset!");

}

