#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Rock_Parent

#include "Basic.hpp"


namespace SDK::Params
{

// Function Prop_Rock_Parent.Prop_Rock_Parent_C.ExecuteUbergraph_Prop_Rock_Parent
// 0x000C (0x000C - 0x0000)
struct Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent) == 0x000004, "Wrong alignment on Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent");
static_assert(sizeof(Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent) == 0x00000C, "Wrong size on Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent");
static_assert(offsetof(Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent, EntryPoint) == 0x000000, "Member 'Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Prop_Rock_Parent_C_ExecuteUbergraph_Prop_Rock_Parent::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Prop_Rock_Parent.Prop_Rock_Parent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_Rock_Parent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Rock_Parent_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_Rock_Parent_C_ReceiveTick");
static_assert(sizeof(Prop_Rock_Parent_C_ReceiveTick) == 0x000004, "Wrong size on Prop_Rock_Parent_C_ReceiveTick");
static_assert(offsetof(Prop_Rock_Parent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_Rock_Parent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Prop_Rock_Parent.Prop_Rock_Parent_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct Prop_Rock_Parent_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Rock_Parent_C_UserConstructionScript) == 0x000001, "Wrong alignment on Prop_Rock_Parent_C_UserConstructionScript");
static_assert(sizeof(Prop_Rock_Parent_C_UserConstructionScript) == 0x000001, "Wrong size on Prop_Rock_Parent_C_UserConstructionScript");
static_assert(offsetof(Prop_Rock_Parent_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'Prop_Rock_Parent_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

}

