#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_PhysicsFellable_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Prop_PhysicsFellable_Parent.Prop_PhysicsFellable_Parent_C.ExecuteUbergraph_Prop_PhysicsFellable_Parent
// 0x0AF0 (0x0AF0 - 0x0000)
struct Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0130(0x0060)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0190(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0240(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Fellable_Enabled_Enabled;             // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Fellable_Enabled_Enabled_1;           // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_316[0x2];                                      // 0x0316(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0340(0x0060)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0408(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Select_Default;                             // 0x0420(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0480(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x04A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x04F0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0528(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0618(0x0018)()
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0648(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0660(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0688(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue_1;        // 0x06AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD[0x3];                                      // 0x06AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x06D0(0x0060)(IsPlainOldData, NoDestructor)
	class ABuildingActor*                         CallFunc_K2_SpawnBuildingActor_ReturnValue;        // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPhysicsObjectComponent*            CallFunc_GetPhysicsObjectComponent_ReturnValue;    // 0x0738(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x0740(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x07A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x07B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x07D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable;                                // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x07F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_808[0x8];                                      // 0x0808(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0810(0x0060)(IsPlainOldData, NoDestructor)
	EDrawDebugTrace                               Temp_byte_Variable_1;                              // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               K2Node_Select_Default_1;                           // 0x0871(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_872[0x6];                                      // 0x0872(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0878(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0959(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x095A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95B[0x1];                                      // 0x095B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_964[0x4];                                      // 0x0964(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0968(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0980(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0998(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x09B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x09D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x09E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x09E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x09EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x09F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F4[0x4];                                      // 0x09F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x09F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0A10(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0A28(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetClosestFortPlayerPawnByTeamAffiliation_ReturnValue; // 0x0A40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x0A48(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0A58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Lerp_Vector_2D_ReturnValue;               // 0x0A70(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0A80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue_1;                   // 0x0A98(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x0AA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_3;      // 0x0AC0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceBetweenActors_Distance;        // 0x0AD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD4[0x4];                                      // 0x0AD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Normal2D_ReturnValue_2;                   // 0x0AD8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0AE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0AE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0AEA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent) == 0x000010, "Wrong alignment on Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent");
static_assert(sizeof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent) == 0x000AF0, "Wrong size on Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, EntryPoint) == 0x000000, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, Temp_bool_Variable) == 0x000004, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000020, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000038, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_RandomUnitVector_ReturnValue) == 0x000050, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000068, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000078, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000090, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000A8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_MakeArray_Array) == 0x0000D0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000E0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_RandomFloat_ReturnValue) == 0x0000E8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x0000F0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, Temp_bool_Variable_1) == 0x0000F9, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_DoesSocketExist_ReturnValue) == 0x0000FA, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_GetSocketLocation_ReturnValue) == 0x000100, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000118, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Less_FloatFloat_ReturnValue) == 0x00011C, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_IsValid_ReturnValue) == 0x00011D, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000120, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000128, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000130, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000190, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakTransform_Location) == 0x0001F0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakTransform_Rotation) == 0x000208, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakTransform_Scale) == 0x000220, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Vector_IsNearlyZero_ReturnValue) == 0x000238, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Vector_IsNearlyZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_IsServer_ReturnValue) == 0x000239, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_GetTransform_ReturnValue) == 0x000240, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakTransform_Location_1) == 0x0002A0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakTransform_Rotation_1) == 0x0002B8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakTransform_Scale_1) == 0x0002D0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector_X) == 0x0002E8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector_Y) == 0x0002EC, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector_Z) == 0x0002F0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_X) == 0x0002F4, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_Y) == 0x0002F8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_X_1) == 0x0002FC, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_Y_1) == 0x000300, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_RandomFloatInRange_ReturnValue) == 0x000304, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_X_2) == 0x000308, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_Y_2) == 0x00030C, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Add_FloatFloat_ReturnValue) == 0x000310, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Get_Fellable_Enabled_Enabled) == 0x000314, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Get_Fellable_Enabled_Enabled' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Get_Fellable_Enabled_Enabled_1) == 0x000315, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Get_Fellable_Enabled_Enabled_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_X_3) == 0x000318, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_Y_3) == 0x00031C, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000320, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_GetValueAsBool_ReturnValue) == 0x000324, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000328, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_MakeTransform_ReturnValue) == 0x000340, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003A0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_FinishSpawningActor_ReturnValue) == 0x0003A8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0003B0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_HasAnyTags_ReturnValue) == 0x0003B4, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x0003B8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_X_4) == 0x0003C8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_Y_4) == 0x0003CC, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_X_5) == 0x0003D0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector2D_Y_5) == 0x0003D4, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_MakeVector_ReturnValue) == 0x0003D8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_MakeVector_ReturnValue_1) == 0x0003F0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_MakeArray_Array_1) == 0x000408, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000418, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_Select_Default) == 0x000420, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_GetOwner_ReturnValue) == 0x000430, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000438, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000450, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000468, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000480, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector_X_1) == 0x000490, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector_Y_1) == 0x000494, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector_Z_1) == 0x000498, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Normal2D_ReturnValue) == 0x0004A0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0004B0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_IsValid_ReturnValue_2) == 0x0004B4, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0004B8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0004D0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_Event_Damage) == 0x0004E8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_Event_DamageTags) == 0x0004F0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_Event_Momentum) == 0x000510, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_Event_HitInfo) == 0x000528, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_Event_InstigatedBy) == 0x000608, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_Event_DamageCauser) == 0x000610, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, K2Node_Event_EffectContext) == 0x000618, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakTransform_Location_2) == 0x000630, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakTransform_Rotation_2) == 0x000648, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakTransform_Scale_2) == 0x000660, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector_X_2) == 0x000678, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector_Y_2) == 0x00067C, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_BreakVector_Z_2) == 0x000680, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Add_VectorVector_ReturnValue) == 0x000688, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Lerp_ReturnValue) == 0x0006A0, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Lerp_ReturnValue_1) == 0x0006A4, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Lerp_ReturnValue_2) == 0x0006A8, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent, CallFunc_Vector_IsNearlyZero_ReturnValue_1) == 0x0006AC, "Member 'Prop_PhysicsFellable_Parent_C_ExecuteUbergraph_Prop_PhysicsFellable_Parent::CallFunc_Vector_IsNearlyZero_ReturnValue_1' has a wrong offset!");
