#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Apollo_LilyPad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_Apollo_LilyPad.Prop_Apollo_LilyPad_C
// 0x0048 (0x0EB8 - 0x0E70)
class AProp_Apollo_LilyPad_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Jump_Collision;                                    // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BounceHeight;                                      // 0x0E80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpHeight;                                        // 0x0E84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinalBounceJumpHeight;                             // 0x0E88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8C[0x4];                                      // 0x0E8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   LaunchForceFeedback;                               // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              OverlapPawn;                                       // 0x0E98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  OverlapController;                                 // 0x0EA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_PlayerLaunched;                                 // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LilypadSound;                                      // 0x0EB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BounceAnim();
	void CeilingCheck(bool* Success);
	void CustomEvent();
	void ExecuteUbergraph_Prop_Apollo_LilyPad(int32 EntryPoint);
	void Reset_Bounce_Sound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_Apollo_LilyPad_C">();
	}
	static class AProp_Apollo_LilyPad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_Apollo_LilyPad_C>();
	}
};
static_assert(alignof(AProp_Apollo_LilyPad_C) == 0x000008, "Wrong alignment on AProp_Apollo_LilyPad_C");
static_assert(sizeof(AProp_Apollo_LilyPad_C) == 0x000EB8, "Wrong size on AProp_Apollo_LilyPad_C");
static_assert(offsetof(AProp_Apollo_LilyPad_C, UberGraphFrame) == 0x000E70, "Member 'AProp_Apollo_LilyPad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, Jump_Collision) == 0x000E78, "Member 'AProp_Apollo_LilyPad_C::Jump_Collision' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, BounceHeight) == 0x000E80, "Member 'AProp_Apollo_LilyPad_C::BounceHeight' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, JumpHeight) == 0x000E84, "Member 'AProp_Apollo_LilyPad_C::JumpHeight' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, FinalBounceJumpHeight) == 0x000E88, "Member 'AProp_Apollo_LilyPad_C::FinalBounceJumpHeight' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, LaunchForceFeedback) == 0x000E90, "Member 'AProp_Apollo_LilyPad_C::LaunchForceFeedback' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, OverlapPawn) == 0x000E98, "Member 'AProp_Apollo_LilyPad_C::OverlapPawn' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, OverlapController) == 0x000EA0, "Member 'AProp_Apollo_LilyPad_C::OverlapController' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, GE_PlayerLaunched) == 0x000EA8, "Member 'AProp_Apollo_LilyPad_C::GE_PlayerLaunched' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, LilypadSound) == 0x000EB0, "Member 'AProp_Apollo_LilyPad_C::LilypadSound' has a wrong offset!");

}

