#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_PhysicsBoulder_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Prop_PhysicsBoulder_Parent.Prop_PhysicsBoulder_Parent_C.ComponentHit
// 0x0110 (0x0110 - 0x0000)
struct Prop_PhysicsBoulder_Parent_C_ComponentHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_PhysicsBoulder_Parent_C_ComponentHit) == 0x000008, "Wrong alignment on Prop_PhysicsBoulder_Parent_C_ComponentHit");
static_assert(sizeof(Prop_PhysicsBoulder_Parent_C_ComponentHit) == 0x000110, "Wrong size on Prop_PhysicsBoulder_Parent_C_ComponentHit");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ComponentHit, HitComponent) == 0x000000, "Member 'Prop_PhysicsBoulder_Parent_C_ComponentHit::HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ComponentHit, OtherActor) == 0x000008, "Member 'Prop_PhysicsBoulder_Parent_C_ComponentHit::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ComponentHit, OtherComp) == 0x000010, "Member 'Prop_PhysicsBoulder_Parent_C_ComponentHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ComponentHit, NormalImpulse) == 0x000018, "Member 'Prop_PhysicsBoulder_Parent_C_ComponentHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ComponentHit, Hit) == 0x000030, "Member 'Prop_PhysicsBoulder_Parent_C_ComponentHit::Hit' has a wrong offset!");

// Function Prop_PhysicsBoulder_Parent.Prop_PhysicsBoulder_Parent_C.ExecuteUbergraph_Prop_PhysicsBoulder_Parent
// 0x02F0 (0x02F0 - 0x0000)
struct Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_HitComponent;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0040(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPhysicsObjectComponent*            CallFunc_GetPhysicsObjectComponent_ReturnValue;    // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetMovementBase_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerImpulseVelocityFromImpactVelocity_Minimum_Met; // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayerImpulseVelocityFromImpactVelocity_Impulse; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent) == 0x000008, "Wrong alignment on Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent");
static_assert(sizeof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent) == 0x0002F0, "Wrong size on Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, EntryPoint) == 0x000000, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, K2Node_CustomEvent_HitComponent) == 0x000010, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::K2Node_CustomEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, K2Node_CustomEvent_OtherActor) == 0x000018, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, K2Node_CustomEvent_OtherComp) == 0x000020, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, K2Node_CustomEvent_NormalImpulse) == 0x000028, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, K2Node_CustomEvent_Hit) == 0x000040, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_IsServer_ReturnValue) == 0x000120, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_bBlockingHit) == 0x000121, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_bInitialOverlap) == 0x000122, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_Time) == 0x000124, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_Distance) == 0x000128, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_Location) == 0x000130, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_ImpactPoint) == 0x000148, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_Normal) == 0x000160, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_ImpactNormal) == 0x000178, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_PhysMat) == 0x000190, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_HitActor) == 0x000198, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_HitComponent) == 0x0001A0, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_HitBoneName) == 0x0001A8, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_BoneName) == 0x0001AC, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_HitItem) == 0x0001B0, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_ElementIndex) == 0x0001B4, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_FaceIndex) == 0x0001B8, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_TraceStart) == 0x0001C0, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001F0, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_GetPhysicsObjectComponent_ReturnValue) == 0x000200, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_GetPhysicsObjectComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_GetMovementBase_ReturnValue) == 0x000208, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_GetMovementBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_IsActive_ReturnValue) == 0x000210, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_GetVelocity_ReturnValue) == 0x000218, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_VSize_ReturnValue) == 0x000230, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_GetPlayerImpulseVelocityFromImpactVelocity_Minimum_Met) == 0x000234, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_GetPlayerImpulseVelocityFromImpactVelocity_Minimum_Met' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_GetPlayerImpulseVelocityFromImpactVelocity_Impulse) == 0x000238, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_GetPlayerImpulseVelocityFromImpactVelocity_Impulse' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000240, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000258, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000270, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_MakeVector_ReturnValue) == 0x000278, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_Add_VectorVector_ReturnValue) == 0x000290, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002A8, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_Normal_ReturnValue) == 0x0002B0, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0002C8, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_GetTimeSeconds_ReturnValue) == 0x0002E0, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x0002E4, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002E8, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002EC, "Member 'Prop_PhysicsBoulder_Parent_C_ExecuteUbergraph_Prop_PhysicsBoulder_Parent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function Prop_PhysicsBoulder_Parent.Prop_PhysicsBoulder_Parent_C.GetPlayerImpulseVelocityFromImpactVelocity
// 0x0088 (0x0088 - 0x0000)
struct Prop_PhysicsBoulder_Parent_C_GetPlayerImpulseVelocityFromImpactVelocity final
{
public:
	float                                         Impact;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Minimum_Met;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Impulse;                                           // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CallFunc_Array_Get_Item;                           // 0x0020(0x0028)()
	struct FScalableFloat                         CallFunc_Array_Get_Item_1;                         // 0x0048(0x0028)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_PhysicsBoulder_Parent_C_GetPlayerImpulseVelocityFromImpactVelocity) == 0x000008, "Wrong alignment on Prop_PhysicsBoulder_Parent_C_GetPlayerImpulseVelocityFromImpactVelocity");
static_assert(sizeof(Prop_PhysicsBoulder_Parent_C_GetPlayerImpulseVelocityFromImpactVelocity) == 0x000088, "Wrong size on Prop_PhysicsBoulder_Parent_C_GetPlayerImpulseVelocityFromImpactVelocity");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_GetPlayerImpulseVelocityFromImpactVelocity, Impact) == 0x000000, "Member 'Prop_PhysicsBoulder_Parent_C_GetPlayerImpulseVelocityFromImpactVelocity::Impact' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Parent_C_GetPlayerImpulseVelocityFromImpactVelocity, Minimum_Met) == 0x000004, "Member 'Prop_PhysicsBoulder_Parent_C_GetPlayerImpulseVelocityFromImpactVelocity::Minimum_Met' has a wrong offset!");
