#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_SecurityCamera_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Prop_SecurityCamera_01.Prop_SecurityCamera_01_C.ExecuteUbergraph_Prop_SecurityCamera_01
// 0x0060 (0x0060 - 0x0000)
struct Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMoveComponentAction                          Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01) == 0x000008, "Wrong alignment on Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01");
static_assert(sizeof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01) == 0x000060, "Wrong size on Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, EntryPoint) == 0x000000, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_IsMobilePlatform_ReturnValue) == 0x000004, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000014, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_WasRecentlyRendered_ReturnValue_1) == 0x000015, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_WasRecentlyRendered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, Temp_float_Variable) == 0x000018, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000024, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, Temp_byte_Variable) == 0x000040, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_RandomFloatInRange_ReturnValue) == 0x000044, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000050, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000054, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000058, "Member 'Prop_SecurityCamera_01_C_ExecuteUbergraph_Prop_SecurityCamera_01::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");

}

