#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_SecurityCamera_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_SecurityCamera_01.Prop_SecurityCamera_01_C
// 0x0030 (0x0EA0 - 0x0E70)
class AProp_SecurityCamera_01_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Camera;                                            // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RotDuration;                                       // 0x0E80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotConeInDegrees;                                  // 0x0E84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomPitch;                                       // 0x0E88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8C[0x4];                                      // 0x0E8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle;                                       // 0x0E90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DirectionBias;                                     // 0x0E98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prop_SecurityCamera_01(int32 EntryPoint);
	void ReceiveBeginPlay();
	void StartRotating();
	void StartTickingIfRendered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_SecurityCamera_01_C">();
	}
	static class AProp_SecurityCamera_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_SecurityCamera_01_C>();
	}
};
static_assert(alignof(AProp_SecurityCamera_01_C) == 0x000008, "Wrong alignment on AProp_SecurityCamera_01_C");
static_assert(sizeof(AProp_SecurityCamera_01_C) == 0x000EA0, "Wrong size on AProp_SecurityCamera_01_C");
static_assert(offsetof(AProp_SecurityCamera_01_C, UberGraphFrame) == 0x000E70, "Member 'AProp_SecurityCamera_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_SecurityCamera_01_C, Camera) == 0x000E78, "Member 'AProp_SecurityCamera_01_C::Camera' has a wrong offset!");
static_assert(offsetof(AProp_SecurityCamera_01_C, RotDuration) == 0x000E80, "Member 'AProp_SecurityCamera_01_C::RotDuration' has a wrong offset!");
static_assert(offsetof(AProp_SecurityCamera_01_C, RotConeInDegrees) == 0x000E84, "Member 'AProp_SecurityCamera_01_C::RotConeInDegrees' has a wrong offset!");
static_assert(offsetof(AProp_SecurityCamera_01_C, RandomPitch) == 0x000E88, "Member 'AProp_SecurityCamera_01_C::RandomPitch' has a wrong offset!");
static_assert(offsetof(AProp_SecurityCamera_01_C, TimerHandle) == 0x000E90, "Member 'AProp_SecurityCamera_01_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(AProp_SecurityCamera_01_C, DirectionBias) == 0x000E98, "Member 'AProp_SecurityCamera_01_C::DirectionBias' has a wrong offset!");

}

