#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_QuestInteractable_DancingFish1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C
// 0x00A0 (0x0F10 - 0x0E70)
class AProp_QuestInteractable_DancingFish1_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box1;                                              // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DanceTriggerOverlap;                               // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         SK_Prop_Ranger_Fish_Budgeted;                      // 0x0E98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SingingBass_Music_Cue;                             // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DanceCheckTimer;                                   // 0x0EB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         DancerCandidatesAtFish;                            // 0x0EB8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          bPlayerDancing;                                    // 0x0EC8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCreativeMode;                                    // 0x0EC9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestLocallyActive;                                // 0x0ECA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ECB[0x5];                                      // 0x0ECB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectiveBackendName;                              // 0x0ED8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_EDC[0x4];                                      // 0x0EDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             QuestSuccessSound;                                 // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        QuestSuccessEmitter;                               // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ForceFeedback;                                     // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MusicAlreadyStarted;                               // 0x0EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF9[0x7];                                      // 0x0EF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          DancersForReward;                                  // 0x0F00(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void CheckForDancingAtFish();
	void DanceFishyDance();
	void ExecuteUbergraph_Prop_QuestInteractable_DancingFish1(int32 EntryPoint);
	void OnBlendOut_3661630A4F18274EB4211B8B151FD8BF(class FName NotifyName);
	void OnCompleted_3661630A4F18274EB4211B8B151FD8BF(class FName NotifyName);
	void OnInterrupted_3661630A4F18274EB4211B8B151FD8BF(class FName NotifyName);
	void OnNotifyBegin_3661630A4F18274EB4211B8B151FD8BF(class FName NotifyName);
	void OnNotifyEnd_3661630A4F18274EB4211B8B151FD8BF(class FName NotifyName);
	void OnRep_bPlayerDancing();
	void PawnLeftFishArea(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void PawnNearFish(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void PlayQuestRewardFX();
	void QuestUpdated();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_QuestInteractable_DancingFish1_C">();
	}
	static class AProp_QuestInteractable_DancingFish1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_QuestInteractable_DancingFish1_C>();
	}
};
static_assert(alignof(AProp_QuestInteractable_DancingFish1_C) == 0x000008, "Wrong alignment on AProp_QuestInteractable_DancingFish1_C");
static_assert(sizeof(AProp_QuestInteractable_DancingFish1_C) == 0x000F10, "Wrong size on AProp_QuestInteractable_DancingFish1_C");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, UberGraphFrame) == 0x000E70, "Member 'AProp_QuestInteractable_DancingFish1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, Box1) == 0x000E78, "Member 'AProp_QuestInteractable_DancingFish1_C::Box1' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, Capsule) == 0x000E80, "Member 'AProp_QuestInteractable_DancingFish1_C::Capsule' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, Box) == 0x000E88, "Member 'AProp_QuestInteractable_DancingFish1_C::Box' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, DanceTriggerOverlap) == 0x000E90, "Member 'AProp_QuestInteractable_DancingFish1_C::DanceTriggerOverlap' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, SK_Prop_Ranger_Fish_Budgeted) == 0x000E98, "Member 'AProp_QuestInteractable_DancingFish1_C::SK_Prop_Ranger_Fish_Budgeted' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, SingingBass_Music_Cue) == 0x000EA0, "Member 'AProp_QuestInteractable_DancingFish1_C::SingingBass_Music_Cue' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, Montage) == 0x000EA8, "Member 'AProp_QuestInteractable_DancingFish1_C::Montage' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, DanceCheckTimer) == 0x000EB0, "Member 'AProp_QuestInteractable_DancingFish1_C::DanceCheckTimer' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, DancerCandidatesAtFish) == 0x000EB8, "Member 'AProp_QuestInteractable_DancingFish1_C::DancerCandidatesAtFish' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, bPlayerDancing) == 0x000EC8, "Member 'AProp_QuestInteractable_DancingFish1_C::bPlayerDancing' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, IsCreativeMode) == 0x000EC9, "Member 'AProp_QuestInteractable_DancingFish1_C::IsCreativeMode' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, QuestLocallyActive) == 0x000ECA, "Member 'AProp_QuestInteractable_DancingFish1_C::QuestLocallyActive' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, QuestItem) == 0x000ED0, "Member 'AProp_QuestInteractable_DancingFish1_C::QuestItem' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, ObjectiveBackendName) == 0x000ED8, "Member 'AProp_QuestInteractable_DancingFish1_C::ObjectiveBackendName' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, QuestSuccessSound) == 0x000EE0, "Member 'AProp_QuestInteractable_DancingFish1_C::QuestSuccessSound' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, QuestSuccessEmitter) == 0x000EE8, "Member 'AProp_QuestInteractable_DancingFish1_C::QuestSuccessEmitter' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, ForceFeedback) == 0x000EF0, "Member 'AProp_QuestInteractable_DancingFish1_C::ForceFeedback' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, MusicAlreadyStarted) == 0x000EF8, "Member 'AProp_QuestInteractable_DancingFish1_C::MusicAlreadyStarted' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_DancingFish1_C, DancersForReward) == 0x000F00, "Member 'AProp_QuestInteractable_DancingFish1_C::DancersForReward' has a wrong offset!");

}

