#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropManipulation

#include "Basic.hpp"


namespace SDK::Params
{

// Function PropManipulation.PropManipulationNativeComponent.RefreshTrackedActors
// 0x0008 (0x0008 - 0x0000)
struct PropManipulationNativeComponent_RefreshTrackedActors final
{
public:
	class UPlayspaceComponent_SpatialActorTracker* InPlaySpaceComponent_SpatialActorTracker;          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropManipulationNativeComponent_RefreshTrackedActors) == 0x000008, "Wrong alignment on PropManipulationNativeComponent_RefreshTrackedActors");
static_assert(sizeof(PropManipulationNativeComponent_RefreshTrackedActors) == 0x000008, "Wrong size on PropManipulationNativeComponent_RefreshTrackedActors");
static_assert(offsetof(PropManipulationNativeComponent_RefreshTrackedActors, InPlaySpaceComponent_SpatialActorTracker) == 0x000000, "Member 'PropManipulationNativeComponent_RefreshTrackedActors::InPlaySpaceComponent_SpatialActorTracker' has a wrong offset!");

// Function PropManipulation.PropManipulationNativeComponent.SetControlledObjectsVisibilityAndCollision
// 0x0018 (0x0018 - 0x0000)
struct PropManipulationNativeComponent_SetControlledObjectsVisibilityAndCollision final
{
public:
	TArray<class ABuildingSMActor*>               InObjectsOfControl;                                // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          InNewVisibility;                                   // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PropManipulationNativeComponent_SetControlledObjectsVisibilityAndCollision) == 0x000008, "Wrong alignment on PropManipulationNativeComponent_SetControlledObjectsVisibilityAndCollision");
static_assert(sizeof(PropManipulationNativeComponent_SetControlledObjectsVisibilityAndCollision) == 0x000018, "Wrong size on PropManipulationNativeComponent_SetControlledObjectsVisibilityAndCollision");
static_assert(offsetof(PropManipulationNativeComponent_SetControlledObjectsVisibilityAndCollision, InObjectsOfControl) == 0x000000, "Member 'PropManipulationNativeComponent_SetControlledObjectsVisibilityAndCollision::InObjectsOfControl' has a wrong offset!");
static_assert(offsetof(PropManipulationNativeComponent_SetControlledObjectsVisibilityAndCollision, InNewVisibility) == 0x000010, "Member 'PropManipulationNativeComponent_SetControlledObjectsVisibilityAndCollision::InNewVisibility' has a wrong offset!");

}

