#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_PhysicsBoulder_Desert_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Prop_PhysicsBoulder_Desert_01.Prop_PhysicsBoulder_Desert_01_C.ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01
// 0x0318 (0x0318 - 0x0000)
struct Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0070(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue_1;       // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue_2;       // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x01D8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0210(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0300(0x0018)()
};
static_assert(alignof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01) == 0x000008, "Wrong alignment on Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01");
static_assert(sizeof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01) == 0x000318, "Wrong size on Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, EntryPoint) == 0x000000, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_MyComp) == 0x000008, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_Other) == 0x000010, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_OtherComp) == 0x000018, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_bSelfMoved) == 0x000020, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_HitLocation) == 0x000028, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_HitNormal) == 0x000040, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_NormalImpulse) == 0x000058, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_Hit) == 0x000070, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, CallFunc_IsServer_ReturnValue) == 0x000150, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000158, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, CallFunc_GetComponentVelocity_ReturnValue) == 0x000160, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, CallFunc_GetComponentVelocity_ReturnValue_1) == 0x000178, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::CallFunc_GetComponentVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000190, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0001A8, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, CallFunc_GetComponentVelocity_ReturnValue_2) == 0x0001B0, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::CallFunc_GetComponentVelocity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, CallFunc_VSize_ReturnValue) == 0x0001C8, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001CC, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_Damage) == 0x0001D0, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_DamageTags) == 0x0001D8, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_Momentum) == 0x0001F8, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_HitInfo) == 0x000210, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_InstigatedBy) == 0x0002F0, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_DamageCauser) == 0x0002F8, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01, K2Node_Event_EffectContext) == 0x000300, "Member 'Prop_PhysicsBoulder_Desert_01_C_ExecuteUbergraph_Prop_PhysicsBoulder_Desert_01::K2Node_Event_EffectContext' has a wrong offset!");

// Function Prop_PhysicsBoulder_Desert_01.Prop_PhysicsBoulder_Desert_01_C.OnDeathPlayEffects
// 0x0148 (0x0148 - 0x0000)
struct Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects");
static_assert(sizeof(Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects) == 0x000148, "Wrong size on Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects, HitInfo) == 0x000040, "Member 'Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects, InstigatedBy) == 0x000120, "Member 'Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects, DamageCauser) == 0x000128, "Member 'Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects, EffectContext) == 0x000130, "Member 'Prop_PhysicsBoulder_Desert_01_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Prop_PhysicsBoulder_Desert_01.Prop_PhysicsBoulder_Desert_01_C.ReceiveHit
// 0x0148 (0x0148 - 0x0000)
struct Prop_PhysicsBoulder_Desert_01_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0068(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit) == 0x000008, "Wrong alignment on Prop_PhysicsBoulder_Desert_01_C_ReceiveHit");
static_assert(sizeof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit) == 0x000148, "Wrong size on Prop_PhysicsBoulder_Desert_01_C_ReceiveHit");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit, MyComp) == 0x000000, "Member 'Prop_PhysicsBoulder_Desert_01_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit, Other) == 0x000008, "Member 'Prop_PhysicsBoulder_Desert_01_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Prop_PhysicsBoulder_Desert_01_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'Prop_PhysicsBoulder_Desert_01_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit, HitLocation) == 0x000020, "Member 'Prop_PhysicsBoulder_Desert_01_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit, HitNormal) == 0x000038, "Member 'Prop_PhysicsBoulder_Desert_01_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit, NormalImpulse) == 0x000050, "Member 'Prop_PhysicsBoulder_Desert_01_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_PhysicsBoulder_Desert_01_C_ReceiveHit, Hit) == 0x000068, "Member 'Prop_PhysicsBoulder_Desert_01_C_ReceiveHit::Hit' has a wrong offset!");

}

