#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_FireLight_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Curie_structs.hpp"


namespace SDK::Params
{

// Function Prop_FireLight_Parent.Prop_FireLight_Parent_C.BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0100 (0x0100 - 0x0000)
struct Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000100, "Wrong size on Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Prop_FireLight_Parent.Prop_FireLight_Parent_C.BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_FireLight_Parent_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Prop_FireLight_Parent.Prop_FireLight_Parent_C.ExecuteUbergraph_Prop_FireLight_Parent
// 0x0470 (0x0470 - 0x0000)
struct Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0018(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0050(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0140(0x0018)()
	bool                                          CallFunc_IsCurieActive_ReturnValue;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActive_ReturnValue_1;              // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0168(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01A0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x02C0(0x0020)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurieInteractHandle                   CallFunc_ExecuteBeginFireInteract_ReturnValue;     // 0x02E4(0x0004)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0310(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractHandle                   CallFunc_ExecuteBeginFireInteract_ReturnValue_1;   // 0x03F4(0x0004)(NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0400(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0408(0x0020)(ConstParm)
	bool                                          CallFunc_IsCurieActive_ReturnValue_2;              // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue_1;               // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x2];                                      // 0x042A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractHandle                   CallFunc_Map_Find_Value;                           // 0x042C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteEndFireInteract_ReturnValue;       // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0433(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys;                            // 0x0438(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractHandle                   CallFunc_Map_Find_Value_1;                         // 0x0458(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteEndFireInteract_ReturnValue_1;     // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45E[0x2];                                      // 0x045E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0460(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActive_ReturnValue_3;              // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent) == 0x000008, "Wrong alignment on Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent");
static_assert(sizeof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent) == 0x000470, "Wrong size on Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, EntryPoint) == 0x000000, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_Event_Damage) == 0x000014, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_Event_DamageTags) == 0x000018, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_Event_Momentum) == 0x000038, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_Event_HitInfo) == 0x000050, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_Event_InstigatedBy) == 0x000130, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_Event_DamageCauser) == 0x000138, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_Event_EffectContext) == 0x000140, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_IsCurieActive_ReturnValue) == 0x000158, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_IsCurieActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x000159, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_HasAuthority_ReturnValue_2) == 0x00015A, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, Temp_int_Loop_Counter_Variable_1) == 0x00015C, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000160, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_IsCurieActive_ReturnValue_1) == 0x000164, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_IsCurieActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000168, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Less_IntInt_ReturnValue) == 0x00017C, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000180, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000188, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000190, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000198, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_bFromSweep) == 0x00019C, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_SweepResult) == 0x0001A0, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000280, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_OtherActor) == 0x000288, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_OtherComp) == 0x000290, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000298, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0002A0, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, Temp_object_Variable) == 0x0002A8, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_IsValid_ReturnValue) == 0x0002B0, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, Temp_object_Variable_1) == 0x0002B8, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, Temp_struct_Variable) == 0x0002C0, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, Temp_int_Array_Index_Variable_1) == 0x0002E0, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_ExecuteBeginFireInteract_ReturnValue) == 0x0002E4, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_ExecuteBeginFireInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Array_Get_Item) == 0x0002E8, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002F0, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Map_Contains_ReturnValue) == 0x000308, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_MakeHitResult_ReturnValue) == 0x000310, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003F0, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_ExecuteBeginFireInteract_ReturnValue_1) == 0x0003F4, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_ExecuteBeginFireInteract_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_CustomEvent_GameState) == 0x0003F8, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_CustomEvent_Playlist) == 0x000400, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_CustomEvent_PlaylistContextTags) == 0x000408, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_IsCurieActive_ReturnValue_2) == 0x000428, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_IsCurieActive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Map_Contains_ReturnValue_1) == 0x000429, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Map_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Map_Find_Value) == 0x00042C, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Map_Find_ReturnValue) == 0x000430, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Not_PreBool_ReturnValue_2) == 0x000431, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_ExecuteEndFireInteract_ReturnValue) == 0x000432, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_ExecuteEndFireInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Map_Remove_ReturnValue) == 0x000433, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Map_Keys_Keys) == 0x000438, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Array_Get_Item_1) == 0x000448, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Array_Length_ReturnValue_1) == 0x000450, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000454, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Map_Find_Value_1) == 0x000458, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_Map_Find_ReturnValue_1) == 0x00045C, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_ExecuteEndFireInteract_ReturnValue_1) == 0x00045D, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_ExecuteEndFireInteract_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000460, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent, CallFunc_IsCurieActive_ReturnValue_3) == 0x00046C, "Member 'Prop_FireLight_Parent_C_ExecuteUbergraph_Prop_FireLight_Parent::CallFunc_IsCurieActive_ReturnValue_3' has a wrong offset!");

// Function Prop_FireLight_Parent.Prop_FireLight_Parent_C.OnDeathPlayEffects
// 0x0148 (0x0148 - 0x0000)
struct Prop_FireLight_Parent_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Prop_FireLight_Parent_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Prop_FireLight_Parent_C_OnDeathPlayEffects");
static_assert(sizeof(Prop_FireLight_Parent_C_OnDeathPlayEffects) == 0x000148, "Wrong size on Prop_FireLight_Parent_C_OnDeathPlayEffects");
static_assert(offsetof(Prop_FireLight_Parent_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Prop_FireLight_Parent_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Prop_FireLight_Parent_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Prop_FireLight_Parent_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_OnDeathPlayEffects, HitInfo) == 0x000040, "Member 'Prop_FireLight_Parent_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_OnDeathPlayEffects, InstigatedBy) == 0x000120, "Member 'Prop_FireLight_Parent_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_OnDeathPlayEffects, DamageCauser) == 0x000128, "Member 'Prop_FireLight_Parent_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_OnDeathPlayEffects, EffectContext) == 0x000130, "Member 'Prop_FireLight_Parent_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Prop_FireLight_Parent.Prop_FireLight_Parent_C.OnReady_F28DABB3426DBD6BC5FECD8F7077AF93
// 0x0030 (0x0030 - 0x0000)
struct Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93) == 0x000008, "Wrong alignment on Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93");
static_assert(sizeof(Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93) == 0x000030, "Wrong size on Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93");
static_assert(offsetof(Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93, GameState) == 0x000000, "Member 'Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93::GameState' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93, Playlist) == 0x000008, "Member 'Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93::Playlist' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93, PlaylistContextTags) == 0x000010, "Member 'Prop_FireLight_Parent_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93::PlaylistContextTags' has a wrong offset!");

// Function Prop_FireLight_Parent.Prop_FireLight_Parent_C.ShouldPlayNativeCurieFX
// 0x0014 (0x0014 - 0x0000)
struct Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX final
{
public:
	EFortCurieNativeFXType                        FXType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortNativeCurieFXResponse             OutResponse;                                       // 0x0004(0x0008)(Parm, OutParm, NoDestructor)
	struct FFortNativeCurieFXResponse             K2Node_MakeStruct_FortNativeCurieFXResponse;       // 0x000C(0x0008)(NoDestructor)
};
static_assert(alignof(Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX) == 0x000004, "Wrong alignment on Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX");
static_assert(sizeof(Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX) == 0x000014, "Wrong size on Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX");
static_assert(offsetof(Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX, FXType) == 0x000000, "Member 'Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX::FXType' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX, OutResponse) == 0x000004, "Member 'Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX::OutResponse' has a wrong offset!");
static_assert(offsetof(Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX, K2Node_MakeStruct_FortNativeCurieFXResponse) == 0x00000C, "Member 'Prop_FireLight_Parent_C_ShouldPlayNativeCurieFX::K2Node_MakeStruct_FortNativeCurieFXResponse' has a wrong offset!");

}

