#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_PhysicsFellable_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_PhysicsFellable_Parent.Prop_PhysicsFellable_Parent_C
// 0x0410 (0x1280 - 0x0E70)
#pragma pack(push, 0x1)
class alignas(0x10) AProp_PhysicsFellable_Parent_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        PhysicsObjectSpawnLocation;                        // 0x0E78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BreakLocation;                                     // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SpawnPreviewMesh;                                  // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  FallAwayDamageTagList;                             // 0x0E90(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FallingImpulseForce;                               // 0x0EB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlopeBlend;                                        // 0x0EB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReplacementDelay;                                  // 0x0EB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EBC[0x4];                                      // 0x0EBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReplacementScaleRangeMap;                          // 0x0EC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FallTargetingDistance;                             // 0x0ED0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED4[0x4];                                      // 0x0ED4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RandomFallDirection;                               // 0x0ED8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Tree_Feller;                                       // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FallVector;                                        // 0x0EF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawFellingDebug;                                  // 0x0F00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F01[0x7];                                      // 0x0F01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         SpawnedPhysicsObject;                              // 0x0F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         FellingAutoTargetChance;                           // 0x0F10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         FellingImpulseMagnitude;                           // 0x0F38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         FellingImpulseDisableTime;                         // 0x0F60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         FellableEnabled;                                   // 0x0F88(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         PhysicsSpawnEnabled;                               // 0x0FB0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABuildingActor*                         SpawnedStumpObject;                                // 0x0FD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             StartingWorldTransform;                            // 0x0FE0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 DisabledActorReplacementClass;                     // 0x1040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ReplacementDelayRange;                             // 0x1048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FallVector_FX;                                     // 0x1058(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class ABuildingActor>             SpawnedStumpActorClass;                            // 0x1070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class ABuildingActor>             SpawnedPhysicsObjectClass;                         // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                SpawnPhysicsObjectOffsetLocation;                  // 0x1080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnedObjectMatchScaleAxes;                       // 0x1098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StumpTraceStartOffset;                             // 0x10B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StumpTraceEndOffset;                               // 0x10C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             FellableHitInfo;                                   // 0x10E0(0x00E0)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayTagContainer                  FelledDamageTags;                                  // 0x11C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 FelledDamageCauser;                                // 0x11E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         FellingVFXAsset;                                   // 0x11E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             PhysicsObjectSpawnTransform;                       // 0x11F0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDoesSpawnStump;                                   // 0x1250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_1251[0x7];                                     // 0x1251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ABuildingActor* StumpObject)> OnSpawnedStumpObject;                              // 0x1258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class ABuildingActor* PhysicsObject)> OnSpawnedPhysicsObject;                            // 0x1268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_Prop_PhysicsFellable_Parent(int32 EntryPoint);
	void FellingVectorReplicated();
	void Get_Fellable_Enabled(bool* Enabled);
	void Object_Felled_on_Server();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnRep_FallVector_FX();
	void ReceiveBeginPlay();
	void Reenable_Impulse_via_damage();
	void SendFallenTreeStatEvent(class AActor* DamageCauser, bool* bWasEventSent);
	void ShouldDrawDebugFellingArrow();
	void TrySpawnStump();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_PhysicsFellable_Parent_C">();
	}
	static class AProp_PhysicsFellable_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_PhysicsFellable_Parent_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AProp_PhysicsFellable_Parent_C) == 0x000010, "Wrong alignment on AProp_PhysicsFellable_Parent_C");
static_assert(sizeof(AProp_PhysicsFellable_Parent_C) == 0x001280, "Wrong size on AProp_PhysicsFellable_Parent_C");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, UberGraphFrame) == 0x000E70, "Member 'AProp_PhysicsFellable_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, PhysicsObjectSpawnLocation) == 0x000E78, "Member 'AProp_PhysicsFellable_Parent_C::PhysicsObjectSpawnLocation' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, BreakLocation) == 0x000E80, "Member 'AProp_PhysicsFellable_Parent_C::BreakLocation' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, SpawnPreviewMesh) == 0x000E88, "Member 'AProp_PhysicsFellable_Parent_C::SpawnPreviewMesh' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FallAwayDamageTagList) == 0x000E90, "Member 'AProp_PhysicsFellable_Parent_C::FallAwayDamageTagList' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FallingImpulseForce) == 0x000EB0, "Member 'AProp_PhysicsFellable_Parent_C::FallingImpulseForce' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, SlopeBlend) == 0x000EB4, "Member 'AProp_PhysicsFellable_Parent_C::SlopeBlend' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, ReplacementDelay) == 0x000EB8, "Member 'AProp_PhysicsFellable_Parent_C::ReplacementDelay' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, ReplacementScaleRangeMap) == 0x000EC0, "Member 'AProp_PhysicsFellable_Parent_C::ReplacementScaleRangeMap' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FallTargetingDistance) == 0x000ED0, "Member 'AProp_PhysicsFellable_Parent_C::FallTargetingDistance' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, RandomFallDirection) == 0x000ED8, "Member 'AProp_PhysicsFellable_Parent_C::RandomFallDirection' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, Tree_Feller) == 0x000EE8, "Member 'AProp_PhysicsFellable_Parent_C::Tree_Feller' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FallVector) == 0x000EF0, "Member 'AProp_PhysicsFellable_Parent_C::FallVector' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, DrawFellingDebug) == 0x000F00, "Member 'AProp_PhysicsFellable_Parent_C::DrawFellingDebug' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, SpawnedPhysicsObject) == 0x000F08, "Member 'AProp_PhysicsFellable_Parent_C::SpawnedPhysicsObject' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FellingAutoTargetChance) == 0x000F10, "Member 'AProp_PhysicsFellable_Parent_C::FellingAutoTargetChance' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FellingImpulseMagnitude) == 0x000F38, "Member 'AProp_PhysicsFellable_Parent_C::FellingImpulseMagnitude' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FellingImpulseDisableTime) == 0x000F60, "Member 'AProp_PhysicsFellable_Parent_C::FellingImpulseDisableTime' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FellableEnabled) == 0x000F88, "Member 'AProp_PhysicsFellable_Parent_C::FellableEnabled' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, PhysicsSpawnEnabled) == 0x000FB0, "Member 'AProp_PhysicsFellable_Parent_C::PhysicsSpawnEnabled' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, SpawnedStumpObject) == 0x000FD8, "Member 'AProp_PhysicsFellable_Parent_C::SpawnedStumpObject' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, StartingWorldTransform) == 0x000FE0, "Member 'AProp_PhysicsFellable_Parent_C::StartingWorldTransform' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, DisabledActorReplacementClass) == 0x001040, "Member 'AProp_PhysicsFellable_Parent_C::DisabledActorReplacementClass' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, ReplacementDelayRange) == 0x001048, "Member 'AProp_PhysicsFellable_Parent_C::ReplacementDelayRange' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FallVector_FX) == 0x001058, "Member 'AProp_PhysicsFellable_Parent_C::FallVector_FX' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, SpawnedStumpActorClass) == 0x001070, "Member 'AProp_PhysicsFellable_Parent_C::SpawnedStumpActorClass' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, SpawnedPhysicsObjectClass) == 0x001078, "Member 'AProp_PhysicsFellable_Parent_C::SpawnedPhysicsObjectClass' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, SpawnPhysicsObjectOffsetLocation) == 0x001080, "Member 'AProp_PhysicsFellable_Parent_C::SpawnPhysicsObjectOffsetLocation' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, SpawnedObjectMatchScaleAxes) == 0x001098, "Member 'AProp_PhysicsFellable_Parent_C::SpawnedObjectMatchScaleAxes' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, StumpTraceStartOffset) == 0x0010B0, "Member 'AProp_PhysicsFellable_Parent_C::StumpTraceStartOffset' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, StumpTraceEndOffset) == 0x0010C8, "Member 'AProp_PhysicsFellable_Parent_C::StumpTraceEndOffset' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FellableHitInfo) == 0x0010E0, "Member 'AProp_PhysicsFellable_Parent_C::FellableHitInfo' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FelledDamageTags) == 0x0011C0, "Member 'AProp_PhysicsFellable_Parent_C::FelledDamageTags' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FelledDamageCauser) == 0x0011E0, "Member 'AProp_PhysicsFellable_Parent_C::FelledDamageCauser' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, FellingVFXAsset) == 0x0011E8, "Member 'AProp_PhysicsFellable_Parent_C::FellingVFXAsset' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, PhysicsObjectSpawnTransform) == 0x0011F0, "Member 'AProp_PhysicsFellable_Parent_C::PhysicsObjectSpawnTransform' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, bDoesSpawnStump) == 0x001250, "Member 'AProp_PhysicsFellable_Parent_C::bDoesSpawnStump' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, OnSpawnedStumpObject) == 0x001258, "Member 'AProp_PhysicsFellable_Parent_C::OnSpawnedStumpObject' has a wrong offset!");
static_assert(offsetof(AProp_PhysicsFellable_Parent_C, OnSpawnedPhysicsObject) == 0x001268, "Member 'AProp_PhysicsFellable_Parent_C::OnSpawnedPhysicsObject' has a wrong offset!");

}

