#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QualityLevelSelectTimer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function QualityLevelSelectTimer.QualityLevelSelectTimer_C.UpdateTextScale
// 0x0030 (0x0030 - 0x0000)
struct QualityLevelSelectTimer_C_UpdateTextScale final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QualityLevelSelectTimer_C_UpdateTextScale) == 0x000008, "Wrong alignment on QualityLevelSelectTimer_C_UpdateTextScale");
static_assert(sizeof(QualityLevelSelectTimer_C_UpdateTextScale) == 0x000030, "Wrong size on QualityLevelSelectTimer_C_UpdateTextScale");
static_assert(offsetof(QualityLevelSelectTimer_C_UpdateTextScale, TimeRemaining) == 0x000000, "Member 'QualityLevelSelectTimer_C_UpdateTextScale::TimeRemaining' has a wrong offset!");
static_assert(offsetof(QualityLevelSelectTimer_C_UpdateTextScale, Temp_bool_Variable) == 0x000004, "Member 'QualityLevelSelectTimer_C_UpdateTextScale::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QualityLevelSelectTimer_C_UpdateTextScale, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000005, "Member 'QualityLevelSelectTimer_C_UpdateTextScale::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityLevelSelectTimer_C_UpdateTextScale, K2Node_Select_Default) == 0x000008, "Member 'QualityLevelSelectTimer_C_UpdateTextScale::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QualityLevelSelectTimer_C_UpdateTextScale, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'QualityLevelSelectTimer_C_UpdateTextScale::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityLevelSelectTimer_C_UpdateTextScale, CallFunc_BreakVector2D_X) == 0x000020, "Member 'QualityLevelSelectTimer_C_UpdateTextScale::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(QualityLevelSelectTimer_C_UpdateTextScale, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'QualityLevelSelectTimer_C_UpdateTextScale::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(QualityLevelSelectTimer_C_UpdateTextScale, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'QualityLevelSelectTimer_C_UpdateTextScale::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function QualityLevelSelectTimer.QualityLevelSelectTimer_C.OnTimeRemainingChanged
// 0x0004 (0x0004 - 0x0000)
struct QualityLevelSelectTimer_C_OnTimeRemainingChanged final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QualityLevelSelectTimer_C_OnTimeRemainingChanged) == 0x000004, "Wrong alignment on QualityLevelSelectTimer_C_OnTimeRemainingChanged");
static_assert(sizeof(QualityLevelSelectTimer_C_OnTimeRemainingChanged) == 0x000004, "Wrong size on QualityLevelSelectTimer_C_OnTimeRemainingChanged");
static_assert(offsetof(QualityLevelSelectTimer_C_OnTimeRemainingChanged, TimeRemaining) == 0x000000, "Member 'QualityLevelSelectTimer_C_OnTimeRemainingChanged::TimeRemaining' has a wrong offset!");

// Function QualityLevelSelectTimer.QualityLevelSelectTimer_C.OnProgressStarted
// 0x0004 (0x0004 - 0x0000)
struct QualityLevelSelectTimer_C_OnProgressStarted final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QualityLevelSelectTimer_C_OnProgressStarted) == 0x000004, "Wrong alignment on QualityLevelSelectTimer_C_OnProgressStarted");
static_assert(sizeof(QualityLevelSelectTimer_C_OnProgressStarted) == 0x000004, "Wrong size on QualityLevelSelectTimer_C_OnProgressStarted");
static_assert(offsetof(QualityLevelSelectTimer_C_OnProgressStarted, Duration) == 0x000000, "Member 'QualityLevelSelectTimer_C_OnProgressStarted::Duration' has a wrong offset!");

// Function QualityLevelSelectTimer.QualityLevelSelectTimer_C.ExecuteUbergraph_QualityLevelSelectTimer
// 0x000C (0x000C - 0x0000)
struct QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Duration;                             // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TimeRemaining;                        // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer) == 0x000004, "Wrong alignment on QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer");
static_assert(sizeof(QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer) == 0x00000C, "Wrong size on QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer");
static_assert(offsetof(QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer, EntryPoint) == 0x000000, "Member 'QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer, K2Node_Event_Duration) == 0x000004, "Member 'QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer::K2Node_Event_Duration' has a wrong offset!");
static_assert(offsetof(QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer, K2Node_Event_TimeRemaining) == 0x000008, "Member 'QualityLevelSelectTimer_C_ExecuteUbergraph_QualityLevelSelectTimer::K2Node_Event_TimeRemaining' has a wrong offset!");

}

