#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestNotification

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function QuestNotification.QuestNotification_C.BP_OnRaritySet
// 0x0001 (0x0001 - 0x0000)
struct QuestNotification_C_BP_OnRaritySet final
{
public:
	EFortRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_BP_OnRaritySet) == 0x000001, "Wrong alignment on QuestNotification_C_BP_OnRaritySet");
static_assert(sizeof(QuestNotification_C_BP_OnRaritySet) == 0x000001, "Wrong size on QuestNotification_C_BP_OnRaritySet");
static_assert(offsetof(QuestNotification_C_BP_OnRaritySet, Rarity) == 0x000000, "Member 'QuestNotification_C_BP_OnRaritySet::Rarity' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.BP_OnTimerSet
// 0x0001 (0x0001 - 0x0000)
struct QuestNotification_C_BP_OnTimerSet final
{
public:
	EAthenaChallengeTimerState                    TimerState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_BP_OnTimerSet) == 0x000001, "Wrong alignment on QuestNotification_C_BP_OnTimerSet");
static_assert(sizeof(QuestNotification_C_BP_OnTimerSet) == 0x000001, "Wrong size on QuestNotification_C_BP_OnTimerSet");
static_assert(offsetof(QuestNotification_C_BP_OnTimerSet, TimerState) == 0x000000, "Member 'QuestNotification_C_BP_OnTimerSet::TimerState' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.ExecuteUbergraph_QuestNotification
// 0x02F0 (0x02F0 - 0x0000)
struct QuestNotification_C_ExecuteUbergraph_QuestNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortChallengeSetStyle                 K2Node_Event_DisplayStyle;                         // 0x0010(0x00A0)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasAssisted;                         // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_OtherPlayersName;                     // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0180(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0198(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	EAthenaChallengeTimerState                    K2Node_Event_TimerState;                           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0200(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x021C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x022C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   K2Node_Event_Rarity;                               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x024C(0x0008)(NoDestructor)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0254(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_4;                              // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_2;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_3;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsEnabled;                            // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Rate;                                 // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUseRarityContainer;                  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDailyPunchcardQuest;               // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x02C0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_4;                           // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_ExecuteUbergraph_QuestNotification) == 0x000008, "Wrong alignment on QuestNotification_C_ExecuteUbergraph_QuestNotification");
static_assert(sizeof(QuestNotification_C_ExecuteUbergraph_QuestNotification) == 0x0002F0, "Wrong size on QuestNotification_C_ExecuteUbergraph_QuestNotification");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, EntryPoint) == 0x000000, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable) == 0x000004, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable) == 0x000005, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_1) == 0x000006, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable_1) == 0x000007, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_2) == 0x000008, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_3) == 0x000009, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable_2) == 0x00000A, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_DisplayStyle) == 0x000010, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_DisplayStyle' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable_3) == 0x0000BC, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x0000D0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000EC, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue) == 0x0000F0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetEndTime_ReturnValue) == 0x0000F8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetEndTime_ReturnValue_1) == 0x0000FC, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_1) == 0x000100, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_2) == 0x000108, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable) == 0x000110, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_1) == 0x000120, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000130, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000138, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000140, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Max_ReturnValue) == 0x000144, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000148, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000150, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000158, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_bWasAssisted) == 0x00015C, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_bWasAssisted' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_OtherPlayersName) == 0x000160, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_OtherPlayersName' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_2) == 0x000170, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Conv_StringToText_ReturnValue) == 0x000180, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_MakeStruct_FormatArgumentData) == 0x000198, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_MakeArray_Array) == 0x0001E8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_TimerState) == 0x0001F8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_TimerState' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Format_ReturnValue) == 0x000200, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000218, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000219, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_3) == 0x00021C, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_4) == 0x00022C, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default) == 0x000240, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_Rarity) == 0x000248, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_Rarity' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_InFocusEvent) == 0x00024C, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_5) == 0x000254, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_3) == 0x000268, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_4) == 0x000270, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetEndTime_ReturnValue_2) == 0x000274, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetEndTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_1) == 0x000278, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x000288, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetEndTime_ReturnValue_3) == 0x00028C, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetEndTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_IsEnabled) == 0x000290, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_IsEnabled' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_Rate) == 0x000294, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_Rate' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_bUseRarityContainer) == 0x000298, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_bUseRarityContainer' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_bIsDailyPunchcardQuest) == 0x000299, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_bIsDailyPunchcardQuest' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_FMax_ReturnValue) == 0x00029C, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_4) == 0x0002A0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_5) == 0x0002A8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_2) == 0x0002B0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_3) == 0x0002B1, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_IsDesignTime) == 0x0002B2, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x0002B8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002C0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x0002D0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_4) == 0x0002D8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_5) == 0x0002E0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_6) == 0x0002E8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_6' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.OnEnableCompleteFlavorText
// 0x0001 (0x0001 - 0x0000)
struct QuestNotification_C_OnEnableCompleteFlavorText final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_OnEnableCompleteFlavorText) == 0x000001, "Wrong alignment on QuestNotification_C_OnEnableCompleteFlavorText");
static_assert(sizeof(QuestNotification_C_OnEnableCompleteFlavorText) == 0x000001, "Wrong size on QuestNotification_C_OnEnableCompleteFlavorText");
static_assert(offsetof(QuestNotification_C_OnEnableCompleteFlavorText, IsEnabled) == 0x000000, "Member 'QuestNotification_C_OnEnableCompleteFlavorText::IsEnabled' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct QuestNotification_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(QuestNotification_C_OnFocusLost) == 0x000004, "Wrong alignment on QuestNotification_C_OnFocusLost");
static_assert(sizeof(QuestNotification_C_OnFocusLost) == 0x000008, "Wrong size on QuestNotification_C_OnFocusLost");
static_assert(offsetof(QuestNotification_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'QuestNotification_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.OnPlayRushedNotificationIntro
// 0x0004 (0x0004 - 0x0000)
struct QuestNotification_C_OnPlayRushedNotificationIntro final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_OnPlayRushedNotificationIntro) == 0x000004, "Wrong alignment on QuestNotification_C_OnPlayRushedNotificationIntro");
static_assert(sizeof(QuestNotification_C_OnPlayRushedNotificationIntro) == 0x000004, "Wrong size on QuestNotification_C_OnPlayRushedNotificationIntro");
static_assert(offsetof(QuestNotification_C_OnPlayRushedNotificationIntro, Rate) == 0x000000, "Member 'QuestNotification_C_OnPlayRushedNotificationIntro::Rate' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.OnUpdateNotificationBackground
// 0x0002 (0x0002 - 0x0000)
struct QuestNotification_C_OnUpdateNotificationBackground final
{
public:
	bool                                          bUseRarityContainer;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDailyPunchcardQuest;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_OnUpdateNotificationBackground) == 0x000001, "Wrong alignment on QuestNotification_C_OnUpdateNotificationBackground");
static_assert(sizeof(QuestNotification_C_OnUpdateNotificationBackground) == 0x000002, "Wrong size on QuestNotification_C_OnUpdateNotificationBackground");
static_assert(offsetof(QuestNotification_C_OnUpdateNotificationBackground, bUseRarityContainer) == 0x000000, "Member 'QuestNotification_C_OnUpdateNotificationBackground::bUseRarityContainer' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_OnUpdateNotificationBackground, bIsDailyPunchcardQuest) == 0x000001, "Member 'QuestNotification_C_OnUpdateNotificationBackground::bIsDailyPunchcardQuest' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct QuestNotification_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_PreConstruct) == 0x000001, "Wrong alignment on QuestNotification_C_PreConstruct");
static_assert(sizeof(QuestNotification_C_PreConstruct) == 0x000001, "Wrong size on QuestNotification_C_PreConstruct");
static_assert(offsetof(QuestNotification_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'QuestNotification_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.SetAssistData
// 0x0018 (0x0018 - 0x0000)
struct QuestNotification_C_SetAssistData final
{
public:
	bool                                          bWasAssisted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OtherPlayersName;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_SetAssistData) == 0x000008, "Wrong alignment on QuestNotification_C_SetAssistData");
static_assert(sizeof(QuestNotification_C_SetAssistData) == 0x000018, "Wrong size on QuestNotification_C_SetAssistData");
static_assert(offsetof(QuestNotification_C_SetAssistData, bWasAssisted) == 0x000000, "Member 'QuestNotification_C_SetAssistData::bWasAssisted' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_SetAssistData, OtherPlayersName) == 0x000008, "Member 'QuestNotification_C_SetAssistData::OtherPlayersName' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.UpdateProgress
// 0x0030 (0x0030 - 0x0000)
struct QuestNotification_C_UpdateProgress final
{
public:
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_UpdateProgress) == 0x000008, "Wrong alignment on QuestNotification_C_UpdateProgress");
static_assert(sizeof(QuestNotification_C_UpdateProgress) == 0x000030, "Wrong size on QuestNotification_C_UpdateProgress");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Max_ReturnValue) == 0x000000, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Max_ReturnValue_1) == 0x000004, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00000C, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000010, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000014, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'QuestNotification_C_UpdateProgress::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'QuestNotification_C_UpdateProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.UpdateQuestVisuals
// 0x00A0 (0x00A0 - 0x0000)
struct QuestNotification_C_UpdateQuestVisuals final
{
public:
	struct FFortChallengeSetStyle                 DisplayStyle;                                      // 0x0000(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(QuestNotification_C_UpdateQuestVisuals) == 0x000008, "Wrong alignment on QuestNotification_C_UpdateQuestVisuals");
static_assert(sizeof(QuestNotification_C_UpdateQuestVisuals) == 0x0000A0, "Wrong size on QuestNotification_C_UpdateQuestVisuals");
static_assert(offsetof(QuestNotification_C_UpdateQuestVisuals, DisplayStyle) == 0x000000, "Member 'QuestNotification_C_UpdateQuestVisuals::DisplayStyle' has a wrong offset!");

}

