#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestUpdateEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function QuestUpdateEntry.QuestUpdateEntry_C.ExecuteUbergraph_QuestUpdateEntry
// 0x0068 (0x0068 - 0x0000)
struct QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_GetContentSlot_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            K2Node_DynamicCast_AsBorder_Slot;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         K2Node_Event_QuestItemToCheck;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0050(0x0018)()
};
static_assert(alignof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry");
static_assert(sizeof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry) == 0x000068, "Wrong size on QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, EntryPoint) == 0x000000, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_MakeStruct_Margin) == 0x000004, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000018, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x000020, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_GetContentSlot_ReturnValue) == 0x000028, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_GetContentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_DynamicCast_AsBorder_Slot) == 0x000030, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_DynamicCast_AsBorder_Slot' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_Event_QuestItemToCheck) == 0x000040, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_Event_QuestItemToCheck' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_GetQuestDefinitionBP_ReturnValue) == 0x000048, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_GetQuestDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_GetDisplayName_ReturnValue) == 0x000050, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.QuestItemSet
// 0x0008 (0x0008 - 0x0000)
struct QuestUpdateEntry_C_QuestItemSet final
{
public:
	class UFortQuestItem*                         QuestItemToCheck;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestUpdateEntry_C_QuestItemSet) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_QuestItemSet");
static_assert(sizeof(QuestUpdateEntry_C_QuestItemSet) == 0x000008, "Wrong size on QuestUpdateEntry_C_QuestItemSet");
static_assert(offsetof(QuestUpdateEntry_C_QuestItemSet, QuestItemToCheck) == 0x000000, "Member 'QuestUpdateEntry_C_QuestItemSet::QuestItemToCheck' has a wrong offset!");

}

