#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialBacchusButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RadialBacchusButton.RadialBacchusButton_C.ExecuteUbergraph_RadialBacchusButton
// 0x0220 (0x0220 - 0x0000)
struct RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCursorModeEnabled;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_CursorModeContentWidget;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListenedTag_Match;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListenedTag_Match_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_EventName;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0070(0x00D0)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0148(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0160(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0164(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0168(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0188(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Remaining;                            // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Duration;                             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton) == 0x000008, "Wrong alignment on RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton");
static_assert(sizeof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton) == 0x000220, "Wrong size on RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, EntryPoint) == 0x000000, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_CustomEvent_bCursorModeEnabled) == 0x000028, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_CustomEvent_bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_CustomEvent_ActionName) == 0x00002C, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_CustomEvent_CursorModeContentWidget) == 0x000030, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_CustomEvent_CursorModeContentWidget' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000044, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000050, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_GetContext_ReturnValue) == 0x000058, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_IsListenedTag_Match) == 0x000060, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_IsListenedTag_Match' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_IsListenedTag_Match_1) == 0x000061, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_IsListenedTag_Match_1' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_Event_EventName) == 0x000064, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_Event_EventName' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_Event_EventType) == 0x000068, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_Event_Parameters) == 0x000070, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000140, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000144, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000148, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000160, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000164, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000168, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000188, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_Location) == 0x0001A8, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001C0, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001D8, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001E0, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001E8, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001F0, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001F8, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001FC, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000200, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000208, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_SwitchEnum_CmpSuccess) == 0x000209, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00020A, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_SwitchName_CmpSuccess) == 0x00020B, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_Event_Remaining) == 0x00020C, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_Event_Remaining' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, K2Node_Event_Duration) == 0x000210, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::K2Node_Event_Duration' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000214, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_FMax_ReturnValue) == 0x000218, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton, CallFunc_FClamp_ReturnValue) == 0x00021C, "Member 'RadialBacchusButton_C_ExecuteUbergraph_RadialBacchusButton::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function RadialBacchusButton.RadialBacchusButton_C.IsListenedTag
// 0x0010 (0x0010 - 0x0000)
struct RadialBacchusButton_C_IsListenedTag final
{
public:
	struct FGameplayTag                           MatchedTag;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Match;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetListenedGameplayTag_ReturnValue;       // 0x0008(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialBacchusButton_C_IsListenedTag) == 0x000004, "Wrong alignment on RadialBacchusButton_C_IsListenedTag");
static_assert(sizeof(RadialBacchusButton_C_IsListenedTag) == 0x000010, "Wrong size on RadialBacchusButton_C_IsListenedTag");
static_assert(offsetof(RadialBacchusButton_C_IsListenedTag, MatchedTag) == 0x000000, "Member 'RadialBacchusButton_C_IsListenedTag::MatchedTag' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_IsListenedTag, Match) == 0x000004, "Member 'RadialBacchusButton_C_IsListenedTag::Match' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_IsListenedTag, CallFunc_GetListenedGameplayTag_ReturnValue) == 0x000008, "Member 'RadialBacchusButton_C_IsListenedTag::CallFunc_GetListenedGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_IsListenedTag, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x00000C, "Member 'RadialBacchusButton_C_IsListenedTag::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function RadialBacchusButton.RadialBacchusButton_C.OnCursorModeChanged
// 0x0010 (0x0010 - 0x0000)
struct RadialBacchusButton_C_OnCursorModeChanged final
{
public:
	bool                                          bCursorModeEnabled;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CursorModeContentWidget;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialBacchusButton_C_OnCursorModeChanged) == 0x000008, "Wrong alignment on RadialBacchusButton_C_OnCursorModeChanged");
static_assert(sizeof(RadialBacchusButton_C_OnCursorModeChanged) == 0x000010, "Wrong size on RadialBacchusButton_C_OnCursorModeChanged");
static_assert(offsetof(RadialBacchusButton_C_OnCursorModeChanged, bCursorModeEnabled) == 0x000000, "Member 'RadialBacchusButton_C_OnCursorModeChanged::bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_OnCursorModeChanged, ActionName) == 0x000004, "Member 'RadialBacchusButton_C_OnCursorModeChanged::ActionName' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_OnCursorModeChanged, CursorModeContentWidget) == 0x000008, "Member 'RadialBacchusButton_C_OnCursorModeChanged::CursorModeContentWidget' has a wrong offset!");

// Function RadialBacchusButton.RadialBacchusButton_C.ReceiveRadialProgressEvent_Blueprint
// 0x00D8 (0x00D8 - 0x0000)
struct RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint) == 0x000008, "Wrong alignment on RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint");
static_assert(sizeof(RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint) == 0x0000D8, "Wrong size on RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint");
static_assert(offsetof(RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint, EventName) == 0x000000, "Member 'RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint::EventName' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint, EventType) == 0x000004, "Member 'RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint::EventType' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint, Parameters) == 0x000008, "Member 'RadialBacchusButton_C_ReceiveRadialProgressEvent_Blueprint::Parameters' has a wrong offset!");

// Function RadialBacchusButton.RadialBacchusButton_C.UpdateDuration_Blueprint
// 0x0008 (0x0008 - 0x0000)
struct RadialBacchusButton_C_UpdateDuration_Blueprint final
{
public:
	float                                         Remaining;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialBacchusButton_C_UpdateDuration_Blueprint) == 0x000004, "Wrong alignment on RadialBacchusButton_C_UpdateDuration_Blueprint");
static_assert(sizeof(RadialBacchusButton_C_UpdateDuration_Blueprint) == 0x000008, "Wrong size on RadialBacchusButton_C_UpdateDuration_Blueprint");
static_assert(offsetof(RadialBacchusButton_C_UpdateDuration_Blueprint, Remaining) == 0x000000, "Member 'RadialBacchusButton_C_UpdateDuration_Blueprint::Remaining' has a wrong offset!");
static_assert(offsetof(RadialBacchusButton_C_UpdateDuration_Blueprint, Duration) == 0x000004, "Member 'RadialBacchusButton_C_UpdateDuration_Blueprint::Duration' has a wrong offset!");

}

