#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RE_WestSausage_Targeting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RE_WestSausage_Targeting.RE_WestSausage_Targeting_C.UpdateChargeCircle
// 0x0004 (0x0004 - 0x0000)
struct RE_WestSausage_Targeting_C_UpdateChargeCircle final
{
public:
	float                                         Scale_X;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RE_WestSausage_Targeting_C_UpdateChargeCircle) == 0x000004, "Wrong alignment on RE_WestSausage_Targeting_C_UpdateChargeCircle");
static_assert(sizeof(RE_WestSausage_Targeting_C_UpdateChargeCircle) == 0x000004, "Wrong size on RE_WestSausage_Targeting_C_UpdateChargeCircle");
static_assert(offsetof(RE_WestSausage_Targeting_C_UpdateChargeCircle, Scale_X) == 0x000000, "Member 'RE_WestSausage_Targeting_C_UpdateChargeCircle::Scale_X' has a wrong offset!");

// Function RE_WestSausage_Targeting.RE_WestSausage_Targeting_C.ExecuteUbergraph_RE_WestSausage_Targeting
// 0x0020 (0x0020 - 0x0000)
struct RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Scale_X;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting) == 0x000008, "Wrong alignment on RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting");
static_assert(sizeof(RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting) == 0x000020, "Wrong size on RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting");
static_assert(offsetof(RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting, EntryPoint) == 0x000000, "Member 'RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting::EntryPoint' has a wrong offset!");
static_assert(offsetof(RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting, K2Node_CustomEvent_Scale_X) == 0x000004, "Member 'RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting::K2Node_CustomEvent_Scale_X' has a wrong offset!");
static_assert(offsetof(RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'RE_WestSausage_Targeting_C_ExecuteUbergraph_RE_WestSausage_Targeting::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

