#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RealitySapling_Skybeam

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RealitySapling_Skybeam.RealitySapling_Skybeam_C.ExecuteUbergraph_RealitySapling_Skybeam
// 0x0018 (0x0018 - 0x0000)
struct RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam) == 0x000008, "Wrong alignment on RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam");
static_assert(sizeof(RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam) == 0x000018, "Wrong size on RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam");
static_assert(offsetof(RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam, EntryPoint) == 0x000000, "Member 'RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'RealitySapling_Skybeam_C_ExecuteUbergraph_RealitySapling_Skybeam::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

