#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RealitySaplingPingMarker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RealitySaplingPingMarker.RealitySaplingPingMarker_C
// 0x0078 (0x07D8 - 0x0760)
class URealitySaplingPingMarker_C final : public UAthenaSquadIndicator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0760(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   StatusText_Weeding;                                // 0x0768(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StatusText_None;                                   // 0x0780(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StatusText_Storm;                                  // 0x0798(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           DefaultColor;                                      // 0x07B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_SMA_Athena_RealitySapling_Parent_C*  CachedRealitySapling;                              // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 FruitStates;                                       // 0x07C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_RealitySaplingPingMarker(int32 EntryPoint);
	void OnSetMarkerData(const struct FFortWorldMarkerData& FortWorldMarkerData);
	void SaplingUpdateEvent(class AB_SMA_Athena_RealitySapling_Parent_C* Sapling);
	void UpdateColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RealitySaplingPingMarker_C">();
	}
	static class URealitySaplingPingMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URealitySaplingPingMarker_C>();
	}
};
static_assert(alignof(URealitySaplingPingMarker_C) == 0x000008, "Wrong alignment on URealitySaplingPingMarker_C");
static_assert(sizeof(URealitySaplingPingMarker_C) == 0x0007D8, "Wrong size on URealitySaplingPingMarker_C");
static_assert(offsetof(URealitySaplingPingMarker_C, UberGraphFrame) == 0x000760, "Member 'URealitySaplingPingMarker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URealitySaplingPingMarker_C, StatusText_Weeding) == 0x000768, "Member 'URealitySaplingPingMarker_C::StatusText_Weeding' has a wrong offset!");
static_assert(offsetof(URealitySaplingPingMarker_C, StatusText_None) == 0x000780, "Member 'URealitySaplingPingMarker_C::StatusText_None' has a wrong offset!");
static_assert(offsetof(URealitySaplingPingMarker_C, StatusText_Storm) == 0x000798, "Member 'URealitySaplingPingMarker_C::StatusText_Storm' has a wrong offset!");
static_assert(offsetof(URealitySaplingPingMarker_C, DefaultColor) == 0x0007B0, "Member 'URealitySaplingPingMarker_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(URealitySaplingPingMarker_C, CachedRealitySapling) == 0x0007C0, "Member 'URealitySaplingPingMarker_C::CachedRealitySapling' has a wrong offset!");
static_assert(offsetof(URealitySaplingPingMarker_C, FruitStates) == 0x0007C8, "Member 'URealitySaplingPingMarker_C::FruitStates' has a wrong offset!");

}

