#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RealitySapling_Skybeam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RealitySapling_Skybeam.RealitySapling_Skybeam_C
// 0x0018 (0x0288 - 0x0270)
class ARealitySapling_Skybeam_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               SkyBeam;                                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void DestroySelf();
	void ExecuteUbergraph_RealitySapling_Skybeam(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RealitySapling_Skybeam_C">();
	}
	static class ARealitySapling_Skybeam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARealitySapling_Skybeam_C>();
	}
};
static_assert(alignof(ARealitySapling_Skybeam_C) == 0x000008, "Wrong alignment on ARealitySapling_Skybeam_C");
static_assert(sizeof(ARealitySapling_Skybeam_C) == 0x000288, "Wrong size on ARealitySapling_Skybeam_C");
static_assert(offsetof(ARealitySapling_Skybeam_C, UberGraphFrame) == 0x000270, "Member 'ARealitySapling_Skybeam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARealitySapling_Skybeam_C, SkyBeam) == 0x000278, "Member 'ARealitySapling_Skybeam_C::SkyBeam' has a wrong offset!");
static_assert(offsetof(ARealitySapling_Skybeam_C, DefaultSceneRoot) == 0x000280, "Member 'ARealitySapling_Skybeam_C::DefaultSceneRoot' has a wrong offset!");

}

