#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReferAFriendActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReferAFriendActionMenu.ReferAFriendActionMenu_C
// 0x0060 (0x04A0 - 0x0440)
class UReferAFriendActionMenu_C final : public UFortReferFriendActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock;                               // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_143;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AddFriendsQR;                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PartyUpQR;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Platform;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_QR;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ReferAFriendActionMenu(int32 EntryPoint);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnOpened();
	void OnRequestOriginChanged(EReferFriendOrigin RequestOrigin);
	void Set_QRt_Image(EReferFriendOrigin Origin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReferAFriendActionMenu_C">();
	}
	static class UReferAFriendActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReferAFriendActionMenu_C>();
	}
};
static_assert(alignof(UReferAFriendActionMenu_C) == 0x000008, "Wrong alignment on UReferAFriendActionMenu_C");
static_assert(sizeof(UReferAFriendActionMenu_C) == 0x0004A0, "Wrong size on UReferAFriendActionMenu_C");
static_assert(offsetof(UReferAFriendActionMenu_C, UberGraphFrame) == 0x000440, "Member 'UReferAFriendActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, ConfirmationOpened) == 0x000448, "Member 'UReferAFriendActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Opened) == 0x000450, "Member 'UReferAFriendActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Border_OnlineStatusIndicator) == 0x000458, "Member 'UReferAFriendActionMenu_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, CommonRichTextBlock) == 0x000460, "Member 'UReferAFriendActionMenu_C::CommonRichTextBlock' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, CommonRichTextBlock_143) == 0x000468, "Member 'UReferAFriendActionMenu_C::CommonRichTextBlock_143' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, EntryBorder) == 0x000470, "Member 'UReferAFriendActionMenu_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Image_AddFriendsQR) == 0x000478, "Member 'UReferAFriendActionMenu_C::Image_AddFriendsQR' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Image_PartyUpQR) == 0x000480, "Member 'UReferAFriendActionMenu_C::Image_PartyUpQR' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Image_Platform) == 0x000488, "Member 'UReferAFriendActionMenu_C::Image_Platform' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, Text_DisplayName) == 0x000490, "Member 'UReferAFriendActionMenu_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(UReferAFriendActionMenu_C, WidgetSwitcher_QR) == 0x000498, "Member 'UReferAFriendActionMenu_C::WidgetSwitcher_QR' has a wrong offset!");

}

