#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RejoinWindow

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RejoinWindow.RejoinWindow_C
// 0x0038 (0x05E0 - 0x05A8)
class URejoinWindow_C final : public UFortRejoinWindowBase
{
public:
	class UCommonTextBlock*                       AutorejoinText;                                    // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonBox;                                         // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRequestAbandon;                                  // 0x05C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRequestRejoinRetry;                              // 0x05D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RejoinWindow_C">();
	}
	static class URejoinWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URejoinWindow_C>();
	}
};
static_assert(alignof(URejoinWindow_C) == 0x000008, "Wrong alignment on URejoinWindow_C");
static_assert(sizeof(URejoinWindow_C) == 0x0005E0, "Wrong size on URejoinWindow_C");
static_assert(offsetof(URejoinWindow_C, AutorejoinText) == 0x0005A8, "Member 'URejoinWindow_C::AutorejoinText' has a wrong offset!");
static_assert(offsetof(URejoinWindow_C, ButtonBox) == 0x0005B0, "Member 'URejoinWindow_C::ButtonBox' has a wrong offset!");
static_assert(offsetof(URejoinWindow_C, Title) == 0x0005B8, "Member 'URejoinWindow_C::Title' has a wrong offset!");
static_assert(offsetof(URejoinWindow_C, OnRequestAbandon) == 0x0005C0, "Member 'URejoinWindow_C::OnRequestAbandon' has a wrong offset!");
static_assert(offsetof(URejoinWindow_C, OnRequestRejoinRetry) == 0x0005D0, "Member 'URejoinWindow_C::OnRequestRejoinRetry' has a wrong offset!");

}

