#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RepairTool_Animbp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RepairTool_Animbp.RepairTool_Animbp_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct RepairTool_Animbp_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(RepairTool_Animbp_C_AnimGraph) == 0x000008, "Wrong alignment on RepairTool_Animbp_C_AnimGraph");
static_assert(sizeof(RepairTool_Animbp_C_AnimGraph) == 0x000010, "Wrong size on RepairTool_Animbp_C_AnimGraph");
static_assert(offsetof(RepairTool_Animbp_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'RepairTool_Animbp_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function RepairTool_Animbp.RepairTool_Animbp_C.ExecuteUbergraph_RepairTool_Animbp
// 0x0004 (0x0004 - 0x0000)
struct RepairTool_Animbp_C_ExecuteUbergraph_RepairTool_Animbp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RepairTool_Animbp_C_ExecuteUbergraph_RepairTool_Animbp) == 0x000004, "Wrong alignment on RepairTool_Animbp_C_ExecuteUbergraph_RepairTool_Animbp");
static_assert(sizeof(RepairTool_Animbp_C_ExecuteUbergraph_RepairTool_Animbp) == 0x000004, "Wrong size on RepairTool_Animbp_C_ExecuteUbergraph_RepairTool_Animbp");
static_assert(offsetof(RepairTool_Animbp_C_ExecuteUbergraph_RepairTool_Animbp, EntryPoint) == 0x000000, "Member 'RepairTool_Animbp_C_ExecuteUbergraph_RepairTool_Animbp::EntryPoint' has a wrong offset!");

}

