#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResourceFeedWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ResourceFeedWidget.ResourceFeedWidget_C
// 0x0018 (0x03A8 - 0x0390)
class UResourceFeedWidget_C final : public UFortResourceFeed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   FadeOutAnimation;                                  // 0x0398(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ResourceGainedAnimation;                           // 0x039C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   WeakpointHitAnimation;                             // 0x03A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ResourceFeedWidget(int32 EntryPoint);
	void OnAnimationsFinished(class FName Name_0);
	void OnCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, ESpectatorCameraType NewCameraType);
	void OnFadeOut();
	void OnFollowPlayerChanged(class AFortPlayerControllerSpectating* SpectatorPC, class AFortPlayerState* NewFollowedPlayer);
	void OnResourceGained();
	void OnWeakpointHit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ResourceFeedWidget_C">();
	}
	static class UResourceFeedWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceFeedWidget_C>();
	}
};
static_assert(alignof(UResourceFeedWidget_C) == 0x000008, "Wrong alignment on UResourceFeedWidget_C");
static_assert(sizeof(UResourceFeedWidget_C) == 0x0003A8, "Wrong size on UResourceFeedWidget_C");
static_assert(offsetof(UResourceFeedWidget_C, UberGraphFrame) == 0x000390, "Member 'UResourceFeedWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UResourceFeedWidget_C, FadeOutAnimation) == 0x000398, "Member 'UResourceFeedWidget_C::FadeOutAnimation' has a wrong offset!");
static_assert(offsetof(UResourceFeedWidget_C, ResourceGainedAnimation) == 0x00039C, "Member 'UResourceFeedWidget_C::ResourceGainedAnimation' has a wrong offset!");
static_assert(offsetof(UResourceFeedWidget_C, WeakpointHitAnimation) == 0x0003A0, "Member 'UResourceFeedWidget_C::WeakpointHitAnimation' has a wrong offset!");

}

