#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RestartClient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RestartClient.RestartClient_C
// 0x0018 (0x0588 - 0x0570)
class URestartClient_C final : public UFortRestartClientModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Confirm;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_Confirm_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ExecuteUbergraph_RestartClient(int32 EntryPoint);
	void OnButtonSet(bool InbShouldExit, bool bShouldShow);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RestartClient_C">();
	}
	static class URestartClient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URestartClient_C>();
	}
};
static_assert(alignof(URestartClient_C) == 0x000008, "Wrong alignment on URestartClient_C");
static_assert(sizeof(URestartClient_C) == 0x000588, "Wrong size on URestartClient_C");
static_assert(offsetof(URestartClient_C, UberGraphFrame) == 0x000570, "Member 'URestartClient_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URestartClient_C, Intro) == 0x000578, "Member 'URestartClient_C::Intro' has a wrong offset!");
static_assert(offsetof(URestartClient_C, Button_Confirm) == 0x000580, "Member 'URestartClient_C::Button_Confirm' has a wrong offset!");

}

