#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReticleStatusWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReticleStatusWidget.ReticleStatusWidget_C
// 0x0068 (0x0388 - 0x0320)
class UReticleStatusWidget_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         _Horizontal_Box__Edit;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_quickedit;                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_QuickEditPreview;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidgetDark_C*                   KeybindEdit;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ReticleStatusText;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_EditContext;                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         DefaultStatusDisplayDuration;                      // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PartyRiftTags;                                     // 0x0360(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PartyRiftStatusDisplayDuration;                    // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNoBuildMode;                                    // 0x0384(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ReticleStatusWidget(int32 EntryPoint);
	void GetStatusDisplayDurationFromFailureReason(const struct FGameplayTagContainer& FailureReason, float* StatusDisplayDuration);
	void OnReady_23885D3A4C287098F8536CB281CC33D6(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, const class FText& FailureText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReticleStatusWidget_C">();
	}
	static class UReticleStatusWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReticleStatusWidget_C>();
	}
};
static_assert(alignof(UReticleStatusWidget_C) == 0x000008, "Wrong alignment on UReticleStatusWidget_C");
static_assert(sizeof(UReticleStatusWidget_C) == 0x000388, "Wrong size on UReticleStatusWidget_C");
static_assert(offsetof(UReticleStatusWidget_C, UberGraphFrame) == 0x000320, "Member 'UReticleStatusWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, _Horizontal_Box__Edit) == 0x000328, "Member 'UReticleStatusWidget_C::_Horizontal_Box__Edit' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, CommonTextBlock_quickedit) == 0x000330, "Member 'UReticleStatusWidget_C::CommonTextBlock_quickedit' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, Image_QuickEditPreview) == 0x000338, "Member 'UReticleStatusWidget_C::Image_QuickEditPreview' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, KeybindEdit) == 0x000340, "Member 'UReticleStatusWidget_C::KeybindEdit' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, ReticleStatusText) == 0x000348, "Member 'UReticleStatusWidget_C::ReticleStatusText' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, WidgetSwitcher_EditContext) == 0x000350, "Member 'UReticleStatusWidget_C::WidgetSwitcher_EditContext' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, DefaultStatusDisplayDuration) == 0x000358, "Member 'UReticleStatusWidget_C::DefaultStatusDisplayDuration' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, PartyRiftTags) == 0x000360, "Member 'UReticleStatusWidget_C::PartyRiftTags' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, PartyRiftStatusDisplayDuration) == 0x000380, "Member 'UReticleStatusWidget_C::PartyRiftStatusDisplayDuration' has a wrong offset!");
static_assert(offsetof(UReticleStatusWidget_C, bIsNoBuildMode) == 0x000384, "Member 'UReticleStatusWidget_C::bIsNoBuildMode' has a wrong offset!");

}

