#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RiderUIDirector

#include "Basic.hpp"


namespace SDK::Params
{

// Function RiderUIDirector.RiderUIDirector_C.ExecuteUbergraph_RiderUIDirector
// 0x0008 (0x0008 - 0x0000)
struct RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector) == 0x000004, "Wrong alignment on RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector");
static_assert(sizeof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector) == 0x000008, "Wrong size on RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, EntryPoint) == 0x000000, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::EntryPoint' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_IsUsingTouch_ReturnValue) == 0x000005, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_Not_PreBool_ReturnValue) == 0x000007, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

