#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RVT_Decal_Actor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RVT_Decal_Actor.RVT_Decal_Actor_C
// 0x0078 (0x0330 - 0x02B8)
class ARVT_Decal_Actor_C final : public AFortStaticMeshActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_B;                                           // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorA;                                            // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleTextures;                                     // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaskDensity;                                       // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoughnessTweak;                                    // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         SpecularTweak;                                     // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Normal;                                            // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               SpecMask;                                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Diffuse;                                           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ColorTransition_;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         ColorContrast;                                     // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               DetailsNormal;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DetailsValue;                                      // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DetailsScale;                                      // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpecularTweakB;                                    // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoughnessTweakB;                                   // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Blend_In;                                          // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RVT_Decal_Actor_C">();
	}
	static class ARVT_Decal_Actor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARVT_Decal_Actor_C>();
	}
};
static_assert(alignof(ARVT_Decal_Actor_C) == 0x000008, "Wrong alignment on ARVT_Decal_Actor_C");
static_assert(sizeof(ARVT_Decal_Actor_C) == 0x000330, "Wrong size on ARVT_Decal_Actor_C");
static_assert(offsetof(ARVT_Decal_Actor_C, Billboard) == 0x0002B8, "Member 'ARVT_Decal_Actor_C::Billboard' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, Color_B) == 0x0002C0, "Member 'ARVT_Decal_Actor_C::Color_B' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, ColorA) == 0x0002D0, "Member 'ARVT_Decal_Actor_C::ColorA' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, ScaleTextures) == 0x0002E0, "Member 'ARVT_Decal_Actor_C::ScaleTextures' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, MaskDensity) == 0x0002E4, "Member 'ARVT_Decal_Actor_C::MaskDensity' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, RoughnessTweak) == 0x0002E8, "Member 'ARVT_Decal_Actor_C::RoughnessTweak' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, SpecularTweak) == 0x0002EC, "Member 'ARVT_Decal_Actor_C::SpecularTweak' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, Normal) == 0x0002F0, "Member 'ARVT_Decal_Actor_C::Normal' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, SpecMask) == 0x0002F8, "Member 'ARVT_Decal_Actor_C::SpecMask' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, Diffuse) == 0x000300, "Member 'ARVT_Decal_Actor_C::Diffuse' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, ColorTransition_) == 0x000308, "Member 'ARVT_Decal_Actor_C::ColorTransition_' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, ColorContrast) == 0x00030C, "Member 'ARVT_Decal_Actor_C::ColorContrast' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, DetailsNormal) == 0x000310, "Member 'ARVT_Decal_Actor_C::DetailsNormal' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, DetailsValue) == 0x000318, "Member 'ARVT_Decal_Actor_C::DetailsValue' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, DetailsScale) == 0x00031C, "Member 'ARVT_Decal_Actor_C::DetailsScale' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, SpecularTweakB) == 0x000320, "Member 'ARVT_Decal_Actor_C::SpecularTweakB' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, RoughnessTweakB) == 0x000324, "Member 'ARVT_Decal_Actor_C::RoughnessTweakB' has a wrong offset!");
static_assert(offsetof(ARVT_Decal_Actor_C, Blend_In) == 0x000328, "Member 'ARVT_Decal_Actor_C::Blend_In' has a wrong offset!");

}

