#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S18_PlayerBattlePassXpAndReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass S18_PlayerBattlePassXpAndReward.S18_PlayerBattlePassXpAndReward_C
// 0x0028 (0x0308 - 0x02E0)
class US18_PlayerBattlePassXpAndReward_C final : public UFortSeasonDataWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_RaceTrack;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_CurrentLevel;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Level;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Max_BPLevel_for_Rewards;                           // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_S18_PlayerBattlePassXpAndReward(int32 EntryPoint);
	void OnLevelChanged();
	void OnProgressUpdated();
	void OnSuperCharged();
	void Update_Text();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"S18_PlayerBattlePassXpAndReward_C">();
	}
	static class US18_PlayerBattlePassXpAndReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<US18_PlayerBattlePassXpAndReward_C>();
	}
};
static_assert(alignof(US18_PlayerBattlePassXpAndReward_C) == 0x000008, "Wrong alignment on US18_PlayerBattlePassXpAndReward_C");
static_assert(sizeof(US18_PlayerBattlePassXpAndReward_C) == 0x000308, "Wrong size on US18_PlayerBattlePassXpAndReward_C");
static_assert(offsetof(US18_PlayerBattlePassXpAndReward_C, UberGraphFrame) == 0x0002E0, "Member 'US18_PlayerBattlePassXpAndReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(US18_PlayerBattlePassXpAndReward_C, Image_RaceTrack) == 0x0002E8, "Member 'US18_PlayerBattlePassXpAndReward_C::Image_RaceTrack' has a wrong offset!");
static_assert(offsetof(US18_PlayerBattlePassXpAndReward_C, RichText_CurrentLevel) == 0x0002F0, "Member 'US18_PlayerBattlePassXpAndReward_C::RichText_CurrentLevel' has a wrong offset!");
static_assert(offsetof(US18_PlayerBattlePassXpAndReward_C, RichText_Level) == 0x0002F8, "Member 'US18_PlayerBattlePassXpAndReward_C::RichText_Level' has a wrong offset!");
static_assert(offsetof(US18_PlayerBattlePassXpAndReward_C, Max_BPLevel_for_Rewards) == 0x000300, "Member 'US18_PlayerBattlePassXpAndReward_C::Max_BPLevel_for_Rewards' has a wrong offset!");

}

