#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SafeZoneIndicator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SafeZoneIndicator.SafeZoneIndicator_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct SafeZoneIndicator_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_UserConstructionScript) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_UserConstructionScript");
static_assert(sizeof(SafeZoneIndicator_C_UserConstructionScript) == 0x000010, "Wrong size on SafeZoneIndicator_C_UserConstructionScript");
static_assert(offsetof(SafeZoneIndicator_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'SafeZoneIndicator_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'SafeZoneIndicator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.stormy
// 0x0004 (0x0004 - 0x0000)
struct SafeZoneIndicator_C_stormy final
{
public:
	float                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_stormy) == 0x000004, "Wrong alignment on SafeZoneIndicator_C_stormy");
static_assert(sizeof(SafeZoneIndicator_C_stormy) == 0x000004, "Wrong size on SafeZoneIndicator_C_stormy");
static_assert(offsetof(SafeZoneIndicator_C_stormy, NewParam) == 0x000000, "Member 'SafeZoneIndicator_C_stormy::NewParam' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.OnSafeZoneStateChange
// 0x0002 (0x0002 - 0x0000)
struct SafeZoneIndicator_C_OnSafeZoneStateChange final
{
public:
	EFortSafeZoneState                            NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitial;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_OnSafeZoneStateChange) == 0x000001, "Wrong alignment on SafeZoneIndicator_C_OnSafeZoneStateChange");
static_assert(sizeof(SafeZoneIndicator_C_OnSafeZoneStateChange) == 0x000002, "Wrong size on SafeZoneIndicator_C_OnSafeZoneStateChange");
static_assert(offsetof(SafeZoneIndicator_C_OnSafeZoneStateChange, NewState) == 0x000000, "Member 'SafeZoneIndicator_C_OnSafeZoneStateChange::NewState' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_OnSafeZoneStateChange, bInitial) == 0x000001, "Member 'SafeZoneIndicator_C_OnSafeZoneStateChange::bInitial' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.InitClosestPointAudio
// 0x0038 (0x0038 - 0x0000)
struct SafeZoneIndicator_C_InitClosestPointAudio final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_InitClosestPointAudio) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_InitClosestPointAudio");
static_assert(sizeof(SafeZoneIndicator_C_InitClosestPointAudio) == 0x000038, "Wrong size on SafeZoneIndicator_C_InitClosestPointAudio");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000010, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_InitClosestPointAudio, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000030, "Member 'SafeZoneIndicator_C_InitClosestPointAudio::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.GetSafeZoneIndicatorMID
// 0x0008 (0x0008 - 0x0000)
struct SafeZoneIndicator_C_GetSafeZoneIndicatorMID final
{
public:
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_GetSafeZoneIndicatorMID) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_GetSafeZoneIndicatorMID");
static_assert(sizeof(SafeZoneIndicator_C_GetSafeZoneIndicatorMID) == 0x000008, "Wrong size on SafeZoneIndicator_C_GetSafeZoneIndicatorMID");
static_assert(offsetof(SafeZoneIndicator_C_GetSafeZoneIndicatorMID, Mid) == 0x000000, "Member 'SafeZoneIndicator_C_GetSafeZoneIndicatorMID::Mid' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.GetRandomPointOnBoundary
// 0x0080 (0x0080 - 0x0000)
struct SafeZoneIndicator_C_GetRandomPointOnBoundary final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSafeZoneRadius_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_GetRandomPointOnBoundary) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_GetRandomPointOnBoundary");
static_assert(sizeof(SafeZoneIndicator_C_GetRandomPointOnBoundary) == 0x000080, "Wrong size on SafeZoneIndicator_C_GetRandomPointOnBoundary");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointOnBoundary, Position) == 0x000000, "Member 'SafeZoneIndicator_C_GetRandomPointOnBoundary::Position' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointOnBoundary, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'SafeZoneIndicator_C_GetRandomPointOnBoundary::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointOnBoundary, CallFunc_GetSafeZoneRadius_ReturnValue) == 0x000030, "Member 'SafeZoneIndicator_C_GetRandomPointOnBoundary::CallFunc_GetSafeZoneRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointOnBoundary, CallFunc_RandomFloatInRange_ReturnValue) == 0x000034, "Member 'SafeZoneIndicator_C_GetRandomPointOnBoundary::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointOnBoundary, CallFunc_RotateAngleAxis_ReturnValue) == 0x000038, "Member 'SafeZoneIndicator_C_GetRandomPointOnBoundary::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointOnBoundary, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'SafeZoneIndicator_C_GetRandomPointOnBoundary::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointOnBoundary, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'SafeZoneIndicator_C_GetRandomPointOnBoundary::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.GetRandomPointInPlayerDir
// 0x00F0 (0x00F0 - 0x0000)
struct SafeZoneIndicator_C_GetRandomPointInPlayerDir final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRandomPointOnBoundary_Position;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_GetRandomPointInPlayerDir) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_GetRandomPointInPlayerDir");
static_assert(sizeof(SafeZoneIndicator_C_GetRandomPointInPlayerDir) == 0x0000F0, "Wrong size on SafeZoneIndicator_C_GetRandomPointInPlayerDir");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, Position) == 0x000000, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::Position' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_BreakVector_X) == 0x000050, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_BreakVector_Y) == 0x000054, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_BreakVector_Z) == 0x000058, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_RandomFloatInRange_ReturnValue) == 0x000078, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_GetRandomPointOnBoundary_Position) == 0x000080, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_GetRandomPointOnBoundary_Position' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_RotateAngleAxis_ReturnValue) == 0x000098, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_BreakVector_X_1) == 0x0000C8, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_BreakVector_Y_1) == 0x0000CC, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_BreakVector_Z_1) == 0x0000D0, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetRandomPointInPlayerDir, CallFunc_MakeVector_ReturnValue) == 0x0000D8, "Member 'SafeZoneIndicator_C_GetRandomPointInPlayerDir::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.GetAthenaGameState
// 0x0020 (0x0020 - 0x0000)
struct SafeZoneIndicator_C_GetAthenaGameState final
{
public:
	class AAthena_GameState_C*                    AthenaGS;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameState_C*                    K2Node_DynamicCast_AsAthena_Game_State;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_GetAthenaGameState) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_GetAthenaGameState");
static_assert(sizeof(SafeZoneIndicator_C_GetAthenaGameState) == 0x000020, "Wrong size on SafeZoneIndicator_C_GetAthenaGameState");
static_assert(offsetof(SafeZoneIndicator_C_GetAthenaGameState, AthenaGS) == 0x000000, "Member 'SafeZoneIndicator_C_GetAthenaGameState::AthenaGS' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetAthenaGameState, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'SafeZoneIndicator_C_GetAthenaGameState::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetAthenaGameState, K2Node_DynamicCast_AsAthena_Game_State) == 0x000010, "Member 'SafeZoneIndicator_C_GetAthenaGameState::K2Node_DynamicCast_AsAthena_Game_State' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_GetAthenaGameState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SafeZoneIndicator_C_GetAthenaGameState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SafeZoneIndicator.SafeZoneIndicator_C.ExecuteUbergraph_SafeZoneIndicator
// 0x0178 (0x0178 - 0x0000)
struct SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSafeZoneFinishShrinkTime_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSafeZoneStartShrinkTime_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewParam;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameState_C*                    CallFunc_GetAthenaGameState_AthenaGS;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSinceSafeZonesStart_ReturnValue;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRandomPointInPlayerDir_Position;       // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Map_Find_Value;                           // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRandomPointOnBoundary_Position;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSafeZoneState                            K2Node_Event_NewState;                             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInitial;                             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Map_Find_Value_1;                         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPlayingReplay_ReturnValue;           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SafeZoneStorm_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator) == 0x000008, "Wrong alignment on SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator");
static_assert(sizeof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator) == 0x000178, "Wrong size on SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, EntryPoint) == 0x000000, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator, CallFunc_GetSafeZoneFinishShrinkTime_ReturnValue) == 0x000004, "Member 'SafeZoneIndicator_C_ExecuteUbergraph_SafeZoneIndicator::CallFunc_GetSafeZoneFinishShrinkTime_ReturnValue' has a wrong offset!");
