#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SafeZoneEditor

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SafeZoneEditor.SafeZoneEditor_C
// 0x0038 (0x05B0 - 0x0578)
class USafeZoneEditor_C final : public UFortSafeZoneEditor
{
public:
	class UVerticalBox*                           Default;                                           // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_156;                                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LowerLeftCorner;                                   // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LowerRightCorner;                                  // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperLeftCorner;                                   // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperRightCorner;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SafeZoneEditor_C">();
	}
	static class USafeZoneEditor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USafeZoneEditor_C>();
	}
};
static_assert(alignof(USafeZoneEditor_C) == 0x000008, "Wrong alignment on USafeZoneEditor_C");
static_assert(sizeof(USafeZoneEditor_C) == 0x0005B0, "Wrong size on USafeZoneEditor_C");
static_assert(offsetof(USafeZoneEditor_C, Default) == 0x000578, "Member 'USafeZoneEditor_C::Default' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, Image_156) == 0x000580, "Member 'USafeZoneEditor_C::Image_156' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, LowerLeftCorner) == 0x000588, "Member 'USafeZoneEditor_C::LowerLeftCorner' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, LowerRightCorner) == 0x000590, "Member 'USafeZoneEditor_C::LowerRightCorner' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, SafeZone_0) == 0x000598, "Member 'USafeZoneEditor_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, UpperLeftCorner) == 0x0005A0, "Member 'USafeZoneEditor_C::UpperLeftCorner' has a wrong offset!");
static_assert(offsetof(USafeZoneEditor_C, UpperRightCorner) == 0x0005A8, "Member 'USafeZoneEditor_C::UpperRightCorner' has a wrong offset!");

}

