#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveTheWorldUI

#include "Basic.hpp"

#include "BlueprintContext_classes.hpp"
#include "CommonUILegacy_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SaveTheWorldUI_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class SaveTheWorldUI.FortQuestExpiresWidget
// 0x0010 (0x02F0 - 0x02E0)
class UFortQuestExpiresWidget final : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UFortQuestItem>          Item;                                              // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQuestExpirationUpdated();
	void SetData(class UFortQuestItem* InItem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestExpiresWidget">();
	}
	static class UFortQuestExpiresWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestExpiresWidget>();
	}
};
static_assert(alignof(UFortQuestExpiresWidget) == 0x000008, "Wrong alignment on UFortQuestExpiresWidget");
static_assert(sizeof(UFortQuestExpiresWidget) == 0x0002F0, "Wrong size on UFortQuestExpiresWidget");
static_assert(offsetof(UFortQuestExpiresWidget, Item) == 0x0002E0, "Member 'UFortQuestExpiresWidget::Item' has a wrong offset!");

// Class SaveTheWorldUI.FortAbilitySystemContext
// 0x0050 (0x0080 - 0x0030)
class UFortAbilitySystemContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RegisterForAttributeChanged(class UWidget* Widget, class UAbilitySystemComponent* ASC, const struct FGameplayAttribute& Attribute, TDelegate<void()> Callback);
	void RemoveDelegatesFromWidget(class UWidget* Widget);

	bool HasMatchingGameplayTag(const struct FGameplayTag& TagToCheck) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAbilitySystemContext">();
	}
	static class UFortAbilitySystemContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAbilitySystemContext>();
	}
};
static_assert(alignof(UFortAbilitySystemContext) == 0x000008, "Wrong alignment on UFortAbilitySystemContext");
static_assert(sizeof(UFortAbilitySystemContext) == 0x000080, "Wrong size on UFortAbilitySystemContext");

// Class SaveTheWorldUI.FortQuestMapCosmeticListWidget
// 0x0010 (0x02F0 - 0x02E0)
class UFortQuestMapCosmeticListWidget final : public UCommonUserWidget
{
public:
	uint8                                         Pad_2E0[0x10];                                     // 0x02E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateCosmeticListDisplay();

	TArray<class UFortItemDefinition*> GetDisplayItemDefs() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestMapCosmeticListWidget">();
	}
	static class UFortQuestMapCosmeticListWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestMapCosmeticListWidget>();
	}
};
static_assert(alignof(UFortQuestMapCosmeticListWidget) == 0x000008, "Wrong alignment on UFortQuestMapCosmeticListWidget");
static_assert(sizeof(UFortQuestMapCosmeticListWidget) == 0x0002F0, "Wrong size on UFortQuestMapCosmeticListWidget");

// Class SaveTheWorldUI.FortAlterationModOptinScreenBase
// 0x0018 (0x0548 - 0x0530)
class UFortAlterationModOptinScreenBase final : public UCommonActivatablePanelLegacy
{
public:
	class UFortItem*                              ItemToOptin;                                       // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_538[0x10];                                     // 0x0538(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConvertItemAlterations();
	void OnItemConversionComplete();
	void OnSetupItem();
	void RequestClose(bool bCancelled);
	void SetupItem(class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAlterationModOptinScreenBase">();
	}
	static class UFortAlterationModOptinScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAlterationModOptinScreenBase>();
	}
};
static_assert(alignof(UFortAlterationModOptinScreenBase) == 0x000008, "Wrong alignment on UFortAlterationModOptinScreenBase");
static_assert(sizeof(UFortAlterationModOptinScreenBase) == 0x000548, "Wrong size on UFortAlterationModOptinScreenBase");
static_assert(offsetof(UFortAlterationModOptinScreenBase, ItemToOptin) == 0x000530, "Member 'UFortAlterationModOptinScreenBase::ItemToOptin' has a wrong offset!");

// Class SaveTheWorldUI.FortQuestMapDetailsPanelBase
// 0x0018 (0x02F8 - 0x02E0)
class UFortQuestMapDetailsPanelBase : public UCommonUserWidget
{
public:
	TSubclassOf<class AFortClientAnnouncement_Conversation> QuestConversationClass;                            // 0x02E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         QuestUpdateDelayTime;                              // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           QuestUpdateTimerHandle;                            // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleQuestsUpdatedInternal();
	void SetQuestToDisplay(class UFortQuestItemDefinition* QuestDef);
	void SetScrollWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestMapDetailsPanelBase">();
	}
	static class UFortQuestMapDetailsPanelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestMapDetailsPanelBase>();
	}
};
static_assert(alignof(UFortQuestMapDetailsPanelBase) == 0x000008, "Wrong alignment on UFortQuestMapDetailsPanelBase");
static_assert(sizeof(UFortQuestMapDetailsPanelBase) == 0x0002F8, "Wrong size on UFortQuestMapDetailsPanelBase");
static_assert(offsetof(UFortQuestMapDetailsPanelBase, QuestConversationClass) == 0x0002E0, "Member 'UFortQuestMapDetailsPanelBase::QuestConversationClass' has a wrong offset!");
static_assert(offsetof(UFortQuestMapDetailsPanelBase, QuestUpdateDelayTime) == 0x0002E8, "Member 'UFortQuestMapDetailsPanelBase::QuestUpdateDelayTime' has a wrong offset!");
static_assert(offsetof(UFortQuestMapDetailsPanelBase, QuestUpdateTimerHandle) == 0x0002F0, "Member 'UFortQuestMapDetailsPanelBase::QuestUpdateTimerHandle' has a wrong offset!");

// Class SaveTheWorldUI.FortAlterationModScreenBase
// 0x0060 (0x05C8 - 0x0568)
class UFortAlterationModScreenBase final : public UFortActivatablePanel
{
public:
	class UFortAlterationsWidget*                 AlterationsToEdit;                                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAlterationOptionsBase*             AlterationSlotOptions;                             // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDetailsHostPanel*              ItemInspectionMainItemDetailsHostPanel;            // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDetailsHostPanel*              AlterationsExtraDetailsPanel;                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortAlterationModOptinScreenBase> AlterationModOptinScreenClass;                     // 0x0588(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    BackInputAction;                                   // 0x0590(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortAlterableItem>      AlterableItem;                                     // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAlterationOption*                  CurrentAlterationOptionInternal;                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B0[0x18];                                     // 0x05B0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AreIngredientRequirementsMent(const TArray<struct FFortItemQuantityPair>& RequiredIngredients);
	void CancelSelection();
	void ConfirmSelection();
	void HandleBackAction(bool* bPassThrough);
	void OnAlterationModificationCompleted();
	void OnAlterationModificationStarted();
	void OnAlterationModificationSucess(int32 ModifiedSlotIndex);
	void OnAlterationOptionChanged(class UFortAlterationOption* CurrentAlterationOption);
	void OnItemSlotChanged(bool SelectedSlot);
	void RefreshItemAndAlterationsBP();
	void SetItemForAlterationsModding(class UFortAlterableItem* InAlterableItem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAlterationModScreenBase">();
	}
	static class UFortAlterationModScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAlterationModScreenBase>();
	}
};
static_assert(alignof(UFortAlterationModScreenBase) == 0x000008, "Wrong alignment on UFortAlterationModScreenBase");
static_assert(sizeof(UFortAlterationModScreenBase) == 0x0005C8, "Wrong size on UFortAlterationModScreenBase");
static_assert(offsetof(UFortAlterationModScreenBase, AlterationsToEdit) == 0x000568, "Member 'UFortAlterationModScreenBase::AlterationsToEdit' has a wrong offset!");
static_assert(offsetof(UFortAlterationModScreenBase, AlterationSlotOptions) == 0x000570, "Member 'UFortAlterationModScreenBase::AlterationSlotOptions' has a wrong offset!");
static_assert(offsetof(UFortAlterationModScreenBase, ItemInspectionMainItemDetailsHostPanel) == 0x000578, "Member 'UFortAlterationModScreenBase::ItemInspectionMainItemDetailsHostPanel' has a wrong offset!");
static_assert(offsetof(UFortAlterationModScreenBase, AlterationsExtraDetailsPanel) == 0x000580, "Member 'UFortAlterationModScreenBase::AlterationsExtraDetailsPanel' has a wrong offset!");
static_assert(offsetof(UFortAlterationModScreenBase, AlterationModOptinScreenClass) == 0x000588, "Member 'UFortAlterationModScreenBase::AlterationModOptinScreenClass' has a wrong offset!");
static_assert(offsetof(UFortAlterationModScreenBase, BackInputAction) == 0x000590, "Member 'UFortAlterationModScreenBase::BackInputAction' has a wrong offset!");
static_assert(offsetof(UFortAlterationModScreenBase, AlterableItem) == 0x0005A0, "Member 'UFortAlterationModScreenBase::AlterableItem' has a wrong offset!");
static_assert(offsetof(UFortAlterationModScreenBase, CurrentAlterationOptionInternal) == 0x0005A8, "Member 'UFortAlterationModScreenBase::CurrentAlterationOptionInternal' has a wrong offset!");

// Class SaveTheWorldUI.FortAlterationOption
// 0x0040 (0x1070 - 0x1030)
class UFortAlterationOption final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAlterationOption                      AlterationOption;                                  // 0x1030(0x0038)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_1068[0x8];                                     // 0x1068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSetup();
	void Setup(struct FAlterationOption* InAlterationOption, EFortAlterationOptionType InAlterationOptionType);

	class UFortAlterationItemDefinition* GetAlterationDefinition() const;
	EFortAlterationOptionType GetAlterationOptionType() const;
	float GetCurrentPipCount(float MaxPipCount) const;
	float GetNextPipCount(float MaxPipCount) const;
	TArray<struct FFortItemQuantityPair> GetRequiredIngredients() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAlterationOption">();
	}
	static class UFortAlterationOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAlterationOption>();
	}
};
static_assert(alignof(UFortAlterationOption) == 0x000010, "Wrong alignment on UFortAlterationOption");
static_assert(sizeof(UFortAlterationOption) == 0x001070, "Wrong size on UFortAlterationOption");
static_assert(offsetof(UFortAlterationOption, AlterationOption) == 0x001030, "Member 'UFortAlterationOption::AlterationOption' has a wrong offset!");

// Class SaveTheWorldUI.FortAlterationOptionsBase
// 0x00A8 (0x0388 - 0x02E0)
class UFortAlterationOptionsBase final : public UCommonUserWidget
{
public:
	uint8                                         Pad_2E0[0x10];                                     // 0x02E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortAlterationOption>      AlterationOptionClass;                             // 0x02F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroupLegacy*               AlterationOptionButtons;                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x20];                                     // 0x0300(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAlterableItem*                     Item;                                              // 0x0320(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SlotIndex;                                         // 0x0328(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUpgradeOptionExists;                              // 0x032C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAlterationOption                      UpgradeOption;                                     // 0x0330(0x0038)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FAlterationOption>              RespecOptions;                                     // 0x0368(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_378[0x10];                                     // 0x0378(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAlterationsOptionHovered(class UCommonButtonLegacy* AlterationOptionButton, int32 GroupIndex);
	void HandleAlterationsOptionSelected(class UCommonButtonLegacy* AlterationOptionButton, int32 GroupIndex);
	void OnGenerateOption(EFortAlterationOptionType OptionType, class UFortAlterationOption* OptionWidget);
	void OnItemChanged(bool bIntroAlterations);
	void ProcessAlterationOptions(bool bIntroAlterations);

	bool DoAlterationOptionsExist(EFortAlterationOptionType OptionType) const;
	bool IsValidAlterationSlot() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAlterationOptionsBase">();
	}
	static class UFortAlterationOptionsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAlterationOptionsBase>();
	}
};
static_assert(alignof(UFortAlterationOptionsBase) == 0x000008, "Wrong alignment on UFortAlterationOptionsBase");
static_assert(sizeof(UFortAlterationOptionsBase) == 0x000388, "Wrong size on UFortAlterationOptionsBase");
static_assert(offsetof(UFortAlterationOptionsBase, AlterationOptionClass) == 0x0002F0, "Member 'UFortAlterationOptionsBase::AlterationOptionClass' has a wrong offset!");
static_assert(offsetof(UFortAlterationOptionsBase, AlterationOptionButtons) == 0x0002F8, "Member 'UFortAlterationOptionsBase::AlterationOptionButtons' has a wrong offset!");
static_assert(offsetof(UFortAlterationOptionsBase, Item) == 0x000320, "Member 'UFortAlterationOptionsBase::Item' has a wrong offset!");
static_assert(offsetof(UFortAlterationOptionsBase, SlotIndex) == 0x000328, "Member 'UFortAlterationOptionsBase::SlotIndex' has a wrong offset!");
static_assert(offsetof(UFortAlterationOptionsBase, bUpgradeOptionExists) == 0x00032C, "Member 'UFortAlterationOptionsBase::bUpgradeOptionExists' has a wrong offset!");
static_assert(offsetof(UFortAlterationOptionsBase, UpgradeOption) == 0x000330, "Member 'UFortAlterationOptionsBase::UpgradeOption' has a wrong offset!");
static_assert(offsetof(UFortAlterationOptionsBase, RespecOptions) == 0x000368, "Member 'UFortAlterationOptionsBase::RespecOptions' has a wrong offset!");

// Class SaveTheWorldUI.FortArmoryScreen
// 0x0000 (0x0568 - 0x0568)
class UFortArmoryScreen final : public UFortActivatablePanel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortArmoryScreen">();
	}
	static class UFortArmoryScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortArmoryScreen>();
	}
};
static_assert(alignof(UFortArmoryScreen) == 0x000008, "Wrong alignment on UFortArmoryScreen");
static_assert(sizeof(UFortArmoryScreen) == 0x000568, "Wrong size on UFortArmoryScreen");

// Class SaveTheWorldUI.FortBannerSelectorBase
// 0x0040 (0x0570 - 0x0530)
class UFortBannerSelectorBase final : public UCommonActivatablePanelLegacy
{
public:
	class UEditableText*                          BannerName;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BannerNameMaxLength;                               // 0x0538(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorder*                                ErrorBorder;                                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       ErrorText;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFilterHomeBaseNameWithOSS;                        // 0x0550(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_551[0x1F];                                     // 0x0551(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CompleteHomebaseBannerSelection();
	void CompleteHomebaseName();
	void HandleBannerNameChanged(const class FText& Text);
	void OnHomebaseNameCommitFailed();
	void OnHomebaseNameCommitSucceeded();
	void UpdateErrorText(const class FText& ErrorMessageText);

	bool HasIllegalChars(const class FString& NewBannerName) const;
	void IsPlayerNameValid(const class FText& PlayerName, bool* OutIsValid, class FText* OutErrorText) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBannerSelectorBase">();
	}
	static class UFortBannerSelectorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBannerSelectorBase>();
	}
};
static_assert(alignof(UFortBannerSelectorBase) == 0x000008, "Wrong alignment on UFortBannerSelectorBase");
static_assert(sizeof(UFortBannerSelectorBase) == 0x000570, "Wrong size on UFortBannerSelectorBase");
static_assert(offsetof(UFortBannerSelectorBase, BannerName) == 0x000530, "Member 'UFortBannerSelectorBase::BannerName' has a wrong offset!");
static_assert(offsetof(UFortBannerSelectorBase, BannerNameMaxLength) == 0x000538, "Member 'UFortBannerSelectorBase::BannerNameMaxLength' has a wrong offset!");
static_assert(offsetof(UFortBannerSelectorBase, ErrorBorder) == 0x000540, "Member 'UFortBannerSelectorBase::ErrorBorder' has a wrong offset!");
static_assert(offsetof(UFortBannerSelectorBase, ErrorText) == 0x000548, "Member 'UFortBannerSelectorBase::ErrorText' has a wrong offset!");
static_assert(offsetof(UFortBannerSelectorBase, bFilterHomeBaseNameWithOSS) == 0x000550, "Member 'UFortBannerSelectorBase::bFilterHomeBaseNameWithOSS' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookGenericRewardWidget
// 0x0018 (0x02F8 - 0x02E0)
class UFortCollectionBookGenericRewardWidget : public UCommonUserWidget
{
public:
	uint8                                         bUpdateVisibilityBasedOnRewardExistence : 1;       // 0x02E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ESlateVisibility                              VisibilityWhenNoRewardSpecified;                   // 0x02E4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              VisibilityWhenRewardSpecified;                     // 0x02E5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollectionBookRewardCardWidget*    RewardCardWidget;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollectionBookRewardStatus                   RewardStatus;                                      // 0x02F0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearRewards();
	void OnRewardStatusChanged(ECollectionBookRewardStatus NewStatus);
	void SetCurrentItemToDisplay(class UFortItem* ItemToDisplay);
	void SetRewards(const struct FFortRewardInfo& Rewards);
	void SetRewardStatus(ECollectionBookRewardStatus Status);

	ECollectionBookRewardStatus GetRewardStatus() const;
	bool HasRewards() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookGenericRewardWidget">();
	}
	static class UFortCollectionBookGenericRewardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookGenericRewardWidget>();
	}
};
static_assert(alignof(UFortCollectionBookGenericRewardWidget) == 0x000008, "Wrong alignment on UFortCollectionBookGenericRewardWidget");
static_assert(sizeof(UFortCollectionBookGenericRewardWidget) == 0x0002F8, "Wrong size on UFortCollectionBookGenericRewardWidget");
static_assert(offsetof(UFortCollectionBookGenericRewardWidget, VisibilityWhenNoRewardSpecified) == 0x0002E4, "Member 'UFortCollectionBookGenericRewardWidget::VisibilityWhenNoRewardSpecified' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookGenericRewardWidget, VisibilityWhenRewardSpecified) == 0x0002E5, "Member 'UFortCollectionBookGenericRewardWidget::VisibilityWhenRewardSpecified' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookGenericRewardWidget, RewardCardWidget) == 0x0002E8, "Member 'UFortCollectionBookGenericRewardWidget::RewardCardWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookGenericRewardWidget, RewardStatus) == 0x0002F0, "Member 'UFortCollectionBookGenericRewardWidget::RewardStatus' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookHelpWidget
// 0x0000 (0x0568 - 0x0568)
class UFortCollectionBookHelpWidget final : public UFortActivatablePanel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookHelpWidget">();
	}
	static class UFortCollectionBookHelpWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookHelpWidget>();
	}
};
static_assert(alignof(UFortCollectionBookHelpWidget) == 0x000008, "Wrong alignment on UFortCollectionBookHelpWidget");
static_assert(sizeof(UFortCollectionBookHelpWidget) == 0x000568, "Wrong size on UFortCollectionBookHelpWidget");

// Class SaveTheWorldUI.FortCollectionBookItemPopupMenu
// 0x0008 (0x0558 - 0x0550)
class UFortCollectionBookItemPopupMenu final : public UFortPopupMenu
{
public:
	uint8                                         Pad_550[0x8];                                      // 0x0550(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanItemBePurchased();
	bool CanItemBeUnslotted();
	void HandleItemChanged(bool bItemChanged, bool bAmmoChanged, bool bIngredientsChanged);
	void HandleItemUpdated();

	class UFortCollectionBookSlotButton* GetHostButton() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookItemPopupMenu">();
	}
	static class UFortCollectionBookItemPopupMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookItemPopupMenu>();
	}
};
static_assert(alignof(UFortCollectionBookItemPopupMenu) == 0x000008, "Wrong alignment on UFortCollectionBookItemPopupMenu");
static_assert(sizeof(UFortCollectionBookItemPopupMenu) == 0x000558, "Wrong size on UFortCollectionBookItemPopupMenu");

// Class SaveTheWorldUI.FortCollectionBookOverviewWidget
// 0x0048 (0x0328 - 0x02E0)
class UFortCollectionBookOverviewWidget final : public UCommonUserWidget
{
public:
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* SelectedPage)> OnCollectionBookPageSelected;                      // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* ClickedPage)> OnCollectionBookPageClicked;                       // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortCollectionBookPage*                LastSelectedPage;                                  // 0x0300(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCollectionBookCategory*            LastSelectedCategory;                              // 0x0308(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortCollectionBookCategory*>    CategoryObjectPool;                                // 0x0310(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UCommonTreeView*                        PageTreeViewWidget;                                // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandlePagesChanged(class UFortCollectionBookManager* CBManager);
	void OnActivated();
	void OnDeactivated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookOverviewWidget">();
	}
	static class UFortCollectionBookOverviewWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookOverviewWidget>();
	}
};
static_assert(alignof(UFortCollectionBookOverviewWidget) == 0x000008, "Wrong alignment on UFortCollectionBookOverviewWidget");
static_assert(sizeof(UFortCollectionBookOverviewWidget) == 0x000328, "Wrong size on UFortCollectionBookOverviewWidget");
static_assert(offsetof(UFortCollectionBookOverviewWidget, OnCollectionBookPageSelected) == 0x0002E0, "Member 'UFortCollectionBookOverviewWidget::OnCollectionBookPageSelected' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookOverviewWidget, OnCollectionBookPageClicked) == 0x0002F0, "Member 'UFortCollectionBookOverviewWidget::OnCollectionBookPageClicked' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookOverviewWidget, LastSelectedPage) == 0x000300, "Member 'UFortCollectionBookOverviewWidget::LastSelectedPage' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookOverviewWidget, LastSelectedCategory) == 0x000308, "Member 'UFortCollectionBookOverviewWidget::LastSelectedCategory' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookOverviewWidget, CategoryObjectPool) == 0x000310, "Member 'UFortCollectionBookOverviewWidget::CategoryObjectPool' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookOverviewWidget, PageTreeViewWidget) == 0x000320, "Member 'UFortCollectionBookOverviewWidget::PageTreeViewWidget' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookPageCompletionRewardWidget
// 0x0000 (0x02F8 - 0x02F8)
class UFortCollectionBookPageCompletionRewardWidget final : public UFortCollectionBookGenericRewardWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPageCompletionRewardWidget">();
	}
	static class UFortCollectionBookPageCompletionRewardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPageCompletionRewardWidget>();
	}
};
static_assert(alignof(UFortCollectionBookPageCompletionRewardWidget) == 0x000008, "Wrong alignment on UFortCollectionBookPageCompletionRewardWidget");
static_assert(sizeof(UFortCollectionBookPageCompletionRewardWidget) == 0x0002F8, "Wrong size on UFortCollectionBookPageCompletionRewardWidget");

// Class SaveTheWorldUI.FortCollectionBookPageDetailsWidget
// 0x0070 (0x0350 - 0x02E0)
class UFortCollectionBookPageDetailsWidget final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       PageCompletionText;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMaterialProgressBar*               ProgressBar;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookPageCompletionRewardWidget* PageRewardWidget;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    RewardDetailsButton;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookPage*                DetailsPage;                                       // 0x0300(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   RewardDetailsModalWidgetClass;                     // 0x0308(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ModalTitle;                                        // 0x0330(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class UFortCollectionBookRewardModalWidget*   RewardDetailsModalWidget;                          // 0x0348(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleRewardDetailsModalWidgetDeactivated(class UCommonActivatablePanelLegacy* DeactivatedPanel);
	void OnDetailsPageChanged(const class UFortCollectionBookPage* InNewDetailsPage);
	void OnPageProgressionUpdated(int32 TotalFilledSlots, int32 TotalSlots, EFortCollectionBookState State);
	void OnSlotItemComplete(const class UFortAccountItem* SlottedItem, class FName SlotId);
	void OnUnslotItemComplete(const class UFortAccountItem* SlottedItem, const class UFortAccountItem* OldItem, class FName SlotId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPageDetailsWidget">();
	}
	static class UFortCollectionBookPageDetailsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPageDetailsWidget>();
	}
};
static_assert(alignof(UFortCollectionBookPageDetailsWidget) == 0x000008, "Wrong alignment on UFortCollectionBookPageDetailsWidget");
static_assert(sizeof(UFortCollectionBookPageDetailsWidget) == 0x000350, "Wrong size on UFortCollectionBookPageDetailsWidget");
static_assert(offsetof(UFortCollectionBookPageDetailsWidget, PageCompletionText) == 0x0002E0, "Member 'UFortCollectionBookPageDetailsWidget::PageCompletionText' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageDetailsWidget, ProgressBar) == 0x0002E8, "Member 'UFortCollectionBookPageDetailsWidget::ProgressBar' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageDetailsWidget, PageRewardWidget) == 0x0002F0, "Member 'UFortCollectionBookPageDetailsWidget::PageRewardWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageDetailsWidget, RewardDetailsButton) == 0x0002F8, "Member 'UFortCollectionBookPageDetailsWidget::RewardDetailsButton' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageDetailsWidget, DetailsPage) == 0x000300, "Member 'UFortCollectionBookPageDetailsWidget::DetailsPage' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageDetailsWidget, RewardDetailsModalWidgetClass) == 0x000308, "Member 'UFortCollectionBookPageDetailsWidget::RewardDetailsModalWidgetClass' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageDetailsWidget, ModalTitle) == 0x000330, "Member 'UFortCollectionBookPageDetailsWidget::ModalTitle' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageDetailsWidget, RewardDetailsModalWidget) == 0x000348, "Member 'UFortCollectionBookPageDetailsWidget::RewardDetailsModalWidget' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookPageListWidget
// 0x0030 (0x1060 - 0x1030)
class UFortCollectionBookPageListWidget final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       PageNameWidget;                                    // 0x1030(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonNumericTextBlock*                AvailableSlotsWidget;                              // 0x1038(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PageCompletionWidget;                              // 0x1040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UObject>                 AssociatedPageOrCategory;                          // 0x1048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsExpanded;                                       // 0x1050(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1051[0xF];                                     // 0x1051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCategoryDetailsUpdated(int32 AvailableSlots, int32 FilledSlots, int32 TotalSlots);
	void OnPageDetailsUpdated(int32 AvailableSlots, int32 FilledSlots, int32 TotalSlots, EFortCollectionBookState State);
	void OnSlottedItemOperationComplete(const class UFortAccountItem* SlottedItem, class FName SlotId);
	void SetupAsCategory(class UFortCollectionBookCategory* category);
	void SetupAsPage(class UFortCollectionBookPage* Page);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPageListWidget">();
	}
	static class UFortCollectionBookPageListWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPageListWidget>();
	}
};
static_assert(alignof(UFortCollectionBookPageListWidget) == 0x000010, "Wrong alignment on UFortCollectionBookPageListWidget");
static_assert(sizeof(UFortCollectionBookPageListWidget) == 0x001060, "Wrong size on UFortCollectionBookPageListWidget");
static_assert(offsetof(UFortCollectionBookPageListWidget, PageNameWidget) == 0x001030, "Member 'UFortCollectionBookPageListWidget::PageNameWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageListWidget, AvailableSlotsWidget) == 0x001038, "Member 'UFortCollectionBookPageListWidget::AvailableSlotsWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageListWidget, PageCompletionWidget) == 0x001040, "Member 'UFortCollectionBookPageListWidget::PageCompletionWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageListWidget, AssociatedPageOrCategory) == 0x001048, "Member 'UFortCollectionBookPageListWidget::AssociatedPageOrCategory' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPageListWidget, bIsExpanded) == 0x001050, "Member 'UFortCollectionBookPageListWidget::bIsExpanded' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookPicker
// 0x0028 (0x0448 - 0x0420)
class UFortCollectionBookPicker final : public UFortItemPickerBase
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortMulchConfirmationModalWidget> MulchConfirmationModalClass;                       // 0x0428(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_430[0x8];                                      // 0x0430(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       CurrentSlottedItem;                                // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMulchConfirmationModalWidget*      MulchConfirmationModal;                            // 0x0440(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HideMulchConfirmationModal();
	void NotifyPanelActivated();
	void NotifyPanelDeactivated();
	void OnCollectComplete();
	void ShowMulchConfirmationModal();
	void ShowMulchDialogForItem(class UFortItem* ItemToMulch);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPicker">();
	}
	static class UFortCollectionBookPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPicker>();
	}
};
static_assert(alignof(UFortCollectionBookPicker) == 0x000008, "Wrong alignment on UFortCollectionBookPicker");
static_assert(sizeof(UFortCollectionBookPicker) == 0x000448, "Wrong size on UFortCollectionBookPicker");
static_assert(offsetof(UFortCollectionBookPicker, MulchConfirmationModalClass) == 0x000428, "Member 'UFortCollectionBookPicker::MulchConfirmationModalClass' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPicker, CurrentSlottedItem) == 0x000438, "Member 'UFortCollectionBookPicker::CurrentSlottedItem' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPicker, MulchConfirmationModal) == 0x000440, "Member 'UFortCollectionBookPicker::MulchConfirmationModal' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookPrimaryPanel
// 0x00C0 (0x05F0 - 0x0530)
class UFortCollectionBookPrimaryPanel final : public UCommonActivatablePanelLegacy
{
public:
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* SelectedPage)> OnCollectionBookPageSelectedDelegate;              // 0x0530(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* ClickedPage)> OnCollectionBookPageClickedDelegate;               // 0x0540(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFortCollectionBookSection* ClickedSection)> OnCollectionBookSectionClickedDelegate;            // 0x0550(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    BackActionRowHandle;                               // 0x0560(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    SummonInfoPanelActionRowHandle;                    // 0x0570(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UFortCollectionBookOverviewWidget*      OverviewWidget;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTileView*                        SectionTileViewWidget;                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollectionBookPrimaryNavTarget               CurrentNavTarget;                                  // 0x0590(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollectionBookSection*             LastClickedSection;                                // 0x0598(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A0[0x50];                                     // 0x05A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBackActionExecuted(bool* bPassThrough);
	void OnCollectionBookPageClicked(const class UFortCollectionBookPage* ClickedPage);
	void OnCollectionBookPageSelected(const class UFortCollectionBookPage* SelectedPage);
	void OnCollectionBookSectionClicked(const class UFortCollectionBookSection* ClickedSection);
	void OnInputMethodChanged(ECommonInputType CurrentInputType);
	void OnSummonInfoPanelExecuted(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPrimaryPanel">();
	}
	static class UFortCollectionBookPrimaryPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPrimaryPanel>();
	}
};
static_assert(alignof(UFortCollectionBookPrimaryPanel) == 0x000008, "Wrong alignment on UFortCollectionBookPrimaryPanel");
static_assert(sizeof(UFortCollectionBookPrimaryPanel) == 0x0005F0, "Wrong size on UFortCollectionBookPrimaryPanel");
static_assert(offsetof(UFortCollectionBookPrimaryPanel, OnCollectionBookPageSelectedDelegate) == 0x000530, "Member 'UFortCollectionBookPrimaryPanel::OnCollectionBookPageSelectedDelegate' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPrimaryPanel, OnCollectionBookPageClickedDelegate) == 0x000540, "Member 'UFortCollectionBookPrimaryPanel::OnCollectionBookPageClickedDelegate' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPrimaryPanel, OnCollectionBookSectionClickedDelegate) == 0x000550, "Member 'UFortCollectionBookPrimaryPanel::OnCollectionBookSectionClickedDelegate' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPrimaryPanel, BackActionRowHandle) == 0x000560, "Member 'UFortCollectionBookPrimaryPanel::BackActionRowHandle' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPrimaryPanel, SummonInfoPanelActionRowHandle) == 0x000570, "Member 'UFortCollectionBookPrimaryPanel::SummonInfoPanelActionRowHandle' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPrimaryPanel, OverviewWidget) == 0x000580, "Member 'UFortCollectionBookPrimaryPanel::OverviewWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPrimaryPanel, SectionTileViewWidget) == 0x000588, "Member 'UFortCollectionBookPrimaryPanel::SectionTileViewWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPrimaryPanel, CurrentNavTarget) == 0x000590, "Member 'UFortCollectionBookPrimaryPanel::CurrentNavTarget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookPrimaryPanel, LastClickedSection) == 0x000598, "Member 'UFortCollectionBookPrimaryPanel::LastClickedSection' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookProgressionRewardDetailInspectWidget
// 0x0020 (0x0300 - 0x02E0)
class UFortCollectionBookProgressionRewardDetailInspectWidget final : public UCommonUserWidget
{
public:
	class UCommonNumericTextBlock*                LevelTextWidget;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortRewardInfoWidget*                  RewardWidget;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                CheckmarkImage;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnXPRequiredChanged(int32 NewXPRequired);
	void SetAssociatedLevel(int32 Level);

	int32 GetXPRequired() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardDetailInspectWidget">();
	}
	static class UFortCollectionBookProgressionRewardDetailInspectWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardDetailInspectWidget>();
	}
};
static_assert(alignof(UFortCollectionBookProgressionRewardDetailInspectWidget) == 0x000008, "Wrong alignment on UFortCollectionBookProgressionRewardDetailInspectWidget");
static_assert(sizeof(UFortCollectionBookProgressionRewardDetailInspectWidget) == 0x000300, "Wrong size on UFortCollectionBookProgressionRewardDetailInspectWidget");
static_assert(offsetof(UFortCollectionBookProgressionRewardDetailInspectWidget, LevelTextWidget) == 0x0002E0, "Member 'UFortCollectionBookProgressionRewardDetailInspectWidget::LevelTextWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardDetailInspectWidget, RewardWidget) == 0x0002E8, "Member 'UFortCollectionBookProgressionRewardDetailInspectWidget::RewardWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardDetailInspectWidget, CheckmarkImage) == 0x0002F0, "Member 'UFortCollectionBookProgressionRewardDetailInspectWidget::CheckmarkImage' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookProgressionRewardsModalWidget
// 0x0068 (0x05D0 - 0x0568)
class UFortCollectionBookProgressionRewardsModalWidget final : public UFortActivatablePanel
{
public:
	TSoftClassPtr<class UClass>                   RewardWidgetClass;                                 // 0x0568(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                RewardWidgetPadding;                               // 0x0590(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         NumRewardsToShow;                                  // 0x05A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           RewardBoxWidget;                                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           MajorRewardBoxWidget;                              // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       XPTextWidget;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonNumericTextBlock*                LevelTextWidget;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroupLegacy*               ButtonGroup;                                       // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void InspectItemBP(class UFortItem* Item);
	void OnLevelProgressionSet(int32 CurrentLevel, float NextLvlPct, int32 MaxAchievedLevel);
	void OnSelectedButtonChanged(class UCommonButtonLegacy* SelectedButton, int32 ButtonIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardsModalWidget">();
	}
	static class UFortCollectionBookProgressionRewardsModalWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardsModalWidget>();
	}
};
static_assert(alignof(UFortCollectionBookProgressionRewardsModalWidget) == 0x000008, "Wrong alignment on UFortCollectionBookProgressionRewardsModalWidget");
static_assert(sizeof(UFortCollectionBookProgressionRewardsModalWidget) == 0x0005D0, "Wrong size on UFortCollectionBookProgressionRewardsModalWidget");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, RewardWidgetClass) == 0x000568, "Member 'UFortCollectionBookProgressionRewardsModalWidget::RewardWidgetClass' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, RewardWidgetPadding) == 0x000590, "Member 'UFortCollectionBookProgressionRewardsModalWidget::RewardWidgetPadding' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, NumRewardsToShow) == 0x0005A0, "Member 'UFortCollectionBookProgressionRewardsModalWidget::NumRewardsToShow' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, RewardBoxWidget) == 0x0005A8, "Member 'UFortCollectionBookProgressionRewardsModalWidget::RewardBoxWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, MajorRewardBoxWidget) == 0x0005B0, "Member 'UFortCollectionBookProgressionRewardsModalWidget::MajorRewardBoxWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, XPTextWidget) == 0x0005B8, "Member 'UFortCollectionBookProgressionRewardsModalWidget::XPTextWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, LevelTextWidget) == 0x0005C0, "Member 'UFortCollectionBookProgressionRewardsModalWidget::LevelTextWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardsModalWidget, ButtonGroup) == 0x0005C8, "Member 'UFortCollectionBookProgressionRewardsModalWidget::ButtonGroup' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookProgressionRewardsPreviewWidget
// 0x0010 (0x02F0 - 0x02E0)
class UFortCollectionBookProgressionRewardsPreviewWidget final : public UCommonUserWidget
{
public:
	class UFortCollectionBookProgressionRewardWidget* NextRewardWidget;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookProgressionRewardWidget* NextMajorRewardWidget;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardsPreviewWidget">();
	}
	static class UFortCollectionBookProgressionRewardsPreviewWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardsPreviewWidget>();
	}
};
static_assert(alignof(UFortCollectionBookProgressionRewardsPreviewWidget) == 0x000008, "Wrong alignment on UFortCollectionBookProgressionRewardsPreviewWidget");
static_assert(sizeof(UFortCollectionBookProgressionRewardsPreviewWidget) == 0x0002F0, "Wrong size on UFortCollectionBookProgressionRewardsPreviewWidget");
static_assert(offsetof(UFortCollectionBookProgressionRewardsPreviewWidget, NextRewardWidget) == 0x0002E0, "Member 'UFortCollectionBookProgressionRewardsPreviewWidget::NextRewardWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardsPreviewWidget, NextMajorRewardWidget) == 0x0002E8, "Member 'UFortCollectionBookProgressionRewardsPreviewWidget::NextMajorRewardWidget' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookProgressionRewardWidget
// 0x0010 (0x0308 - 0x02F8)
class UFortCollectionBookProgressionRewardWidget final : public UFortCollectionBookGenericRewardWidget
{
public:
	class UCommonNumericTextBlock*                LevelTextWidget;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       DisplayNameWidget;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetAssociatedLevel(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardWidget">();
	}
	static class UFortCollectionBookProgressionRewardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardWidget>();
	}
};
static_assert(alignof(UFortCollectionBookProgressionRewardWidget) == 0x000008, "Wrong alignment on UFortCollectionBookProgressionRewardWidget");
static_assert(sizeof(UFortCollectionBookProgressionRewardWidget) == 0x000308, "Wrong size on UFortCollectionBookProgressionRewardWidget");
static_assert(offsetof(UFortCollectionBookProgressionRewardWidget, LevelTextWidget) == 0x0002F8, "Member 'UFortCollectionBookProgressionRewardWidget::LevelTextWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookProgressionRewardWidget, DisplayNameWidget) == 0x000300, "Member 'UFortCollectionBookProgressionRewardWidget::DisplayNameWidget' has a wrong offset!");

// Class SaveTheWorldUI.FortCollectionBookProgressWidget
// 0x0060 (0x0340 - 0x02E0)
class UFortCollectionBookProgressWidget final : public UCommonUserWidget
{
public:
