#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveTheWorldUI

#include "Basic.hpp"

#include "SaveTheWorldUI_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SaveTheWorldUI.FortQuestExpiresWidget.SetData
// 0x0008 (0x0008 - 0x0000)
struct FortQuestExpiresWidget_SetData final
{
public:
	class UFortQuestItem*                         InItem;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortQuestExpiresWidget_SetData) == 0x000008, "Wrong alignment on FortQuestExpiresWidget_SetData");
static_assert(sizeof(FortQuestExpiresWidget_SetData) == 0x000008, "Wrong size on FortQuestExpiresWidget_SetData");
static_assert(offsetof(FortQuestExpiresWidget_SetData, InItem) == 0x000000, "Member 'FortQuestExpiresWidget_SetData::InItem' has a wrong offset!");

// Function SaveTheWorldUI.FortAbilitySystemContext.RegisterForAttributeChanged
// 0x0058 (0x0058 - 0x0000)
struct FortAbilitySystemContext_RegisterForAttributeChanged final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                ASC;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     Attribute;                                         // 0x0010(0x0038)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             Callback;                                          // 0x0048(0x000C)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAbilitySystemContext_RegisterForAttributeChanged) == 0x000008, "Wrong alignment on FortAbilitySystemContext_RegisterForAttributeChanged");
static_assert(sizeof(FortAbilitySystemContext_RegisterForAttributeChanged) == 0x000058, "Wrong size on FortAbilitySystemContext_RegisterForAttributeChanged");
static_assert(offsetof(FortAbilitySystemContext_RegisterForAttributeChanged, Widget) == 0x000000, "Member 'FortAbilitySystemContext_RegisterForAttributeChanged::Widget' has a wrong offset!");
static_assert(offsetof(FortAbilitySystemContext_RegisterForAttributeChanged, ASC) == 0x000008, "Member 'FortAbilitySystemContext_RegisterForAttributeChanged::ASC' has a wrong offset!");
static_assert(offsetof(FortAbilitySystemContext_RegisterForAttributeChanged, Attribute) == 0x000010, "Member 'FortAbilitySystemContext_RegisterForAttributeChanged::Attribute' has a wrong offset!");
static_assert(offsetof(FortAbilitySystemContext_RegisterForAttributeChanged, Callback) == 0x000048, "Member 'FortAbilitySystemContext_RegisterForAttributeChanged::Callback' has a wrong offset!");

// Function SaveTheWorldUI.FortAbilitySystemContext.RemoveDelegatesFromWidget
// 0x0008 (0x0008 - 0x0000)
struct FortAbilitySystemContext_RemoveDelegatesFromWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAbilitySystemContext_RemoveDelegatesFromWidget) == 0x000008, "Wrong alignment on FortAbilitySystemContext_RemoveDelegatesFromWidget");
static_assert(sizeof(FortAbilitySystemContext_RemoveDelegatesFromWidget) == 0x000008, "Wrong size on FortAbilitySystemContext_RemoveDelegatesFromWidget");
static_assert(offsetof(FortAbilitySystemContext_RemoveDelegatesFromWidget, Widget) == 0x000000, "Member 'FortAbilitySystemContext_RemoveDelegatesFromWidget::Widget' has a wrong offset!");

// Function SaveTheWorldUI.FortAbilitySystemContext.HasMatchingGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct FortAbilitySystemContext_HasMatchingGameplayTag final
{
public:
	struct FGameplayTag                           TagToCheck;                                        // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAbilitySystemContext_HasMatchingGameplayTag) == 0x000004, "Wrong alignment on FortAbilitySystemContext_HasMatchingGameplayTag");
static_assert(sizeof(FortAbilitySystemContext_HasMatchingGameplayTag) == 0x000008, "Wrong size on FortAbilitySystemContext_HasMatchingGameplayTag");
static_assert(offsetof(FortAbilitySystemContext_HasMatchingGameplayTag, TagToCheck) == 0x000000, "Member 'FortAbilitySystemContext_HasMatchingGameplayTag::TagToCheck' has a wrong offset!");
static_assert(offsetof(FortAbilitySystemContext_HasMatchingGameplayTag, ReturnValue) == 0x000004, "Member 'FortAbilitySystemContext_HasMatchingGameplayTag::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortQuestMapCosmeticListWidget.GetDisplayItemDefs
// 0x0010 (0x0010 - 0x0000)
struct FortQuestMapCosmeticListWidget_GetDisplayItemDefs final
{
public:
	TArray<class UFortItemDefinition*>            ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortQuestMapCosmeticListWidget_GetDisplayItemDefs) == 0x000008, "Wrong alignment on FortQuestMapCosmeticListWidget_GetDisplayItemDefs");
static_assert(sizeof(FortQuestMapCosmeticListWidget_GetDisplayItemDefs) == 0x000010, "Wrong size on FortQuestMapCosmeticListWidget_GetDisplayItemDefs");
static_assert(offsetof(FortQuestMapCosmeticListWidget_GetDisplayItemDefs, ReturnValue) == 0x000000, "Member 'FortQuestMapCosmeticListWidget_GetDisplayItemDefs::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationModOptinScreenBase.RequestClose
// 0x0001 (0x0001 - 0x0000)
struct FortAlterationModOptinScreenBase_RequestClose final
{
public:
	bool                                          bCancelled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationModOptinScreenBase_RequestClose) == 0x000001, "Wrong alignment on FortAlterationModOptinScreenBase_RequestClose");
static_assert(sizeof(FortAlterationModOptinScreenBase_RequestClose) == 0x000001, "Wrong size on FortAlterationModOptinScreenBase_RequestClose");
static_assert(offsetof(FortAlterationModOptinScreenBase_RequestClose, bCancelled) == 0x000000, "Member 'FortAlterationModOptinScreenBase_RequestClose::bCancelled' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationModOptinScreenBase.SetupItem
// 0x0008 (0x0008 - 0x0000)
struct FortAlterationModOptinScreenBase_SetupItem final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationModOptinScreenBase_SetupItem) == 0x000008, "Wrong alignment on FortAlterationModOptinScreenBase_SetupItem");
static_assert(sizeof(FortAlterationModOptinScreenBase_SetupItem) == 0x000008, "Wrong size on FortAlterationModOptinScreenBase_SetupItem");
static_assert(offsetof(FortAlterationModOptinScreenBase_SetupItem, Item) == 0x000000, "Member 'FortAlterationModOptinScreenBase_SetupItem::Item' has a wrong offset!");

// Function SaveTheWorldUI.FortQuestMapDetailsPanelBase.SetQuestToDisplay
// 0x0008 (0x0008 - 0x0000)
struct FortQuestMapDetailsPanelBase_SetQuestToDisplay final
{
public:
	class UFortQuestItemDefinition*               QuestDef;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortQuestMapDetailsPanelBase_SetQuestToDisplay) == 0x000008, "Wrong alignment on FortQuestMapDetailsPanelBase_SetQuestToDisplay");
static_assert(sizeof(FortQuestMapDetailsPanelBase_SetQuestToDisplay) == 0x000008, "Wrong size on FortQuestMapDetailsPanelBase_SetQuestToDisplay");
static_assert(offsetof(FortQuestMapDetailsPanelBase_SetQuestToDisplay, QuestDef) == 0x000000, "Member 'FortQuestMapDetailsPanelBase_SetQuestToDisplay::QuestDef' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationModScreenBase.AreIngredientRequirementsMent
// 0x0018 (0x0018 - 0x0000)
struct FortAlterationModScreenBase_AreIngredientRequirementsMent final
{
public:
	TArray<struct FFortItemQuantityPair>          RequiredIngredients;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAlterationModScreenBase_AreIngredientRequirementsMent) == 0x000008, "Wrong alignment on FortAlterationModScreenBase_AreIngredientRequirementsMent");
static_assert(sizeof(FortAlterationModScreenBase_AreIngredientRequirementsMent) == 0x000018, "Wrong size on FortAlterationModScreenBase_AreIngredientRequirementsMent");
static_assert(offsetof(FortAlterationModScreenBase_AreIngredientRequirementsMent, RequiredIngredients) == 0x000000, "Member 'FortAlterationModScreenBase_AreIngredientRequirementsMent::RequiredIngredients' has a wrong offset!");
static_assert(offsetof(FortAlterationModScreenBase_AreIngredientRequirementsMent, ReturnValue) == 0x000010, "Member 'FortAlterationModScreenBase_AreIngredientRequirementsMent::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationModScreenBase.HandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct FortAlterationModScreenBase_HandleBackAction final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationModScreenBase_HandleBackAction) == 0x000001, "Wrong alignment on FortAlterationModScreenBase_HandleBackAction");
static_assert(sizeof(FortAlterationModScreenBase_HandleBackAction) == 0x000001, "Wrong size on FortAlterationModScreenBase_HandleBackAction");
static_assert(offsetof(FortAlterationModScreenBase_HandleBackAction, bPassThrough) == 0x000000, "Member 'FortAlterationModScreenBase_HandleBackAction::bPassThrough' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationModScreenBase.OnAlterationModificationSucess
// 0x0004 (0x0004 - 0x0000)
struct FortAlterationModScreenBase_OnAlterationModificationSucess final
{
public:
	int32                                         ModifiedSlotIndex;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationModScreenBase_OnAlterationModificationSucess) == 0x000004, "Wrong alignment on FortAlterationModScreenBase_OnAlterationModificationSucess");
static_assert(sizeof(FortAlterationModScreenBase_OnAlterationModificationSucess) == 0x000004, "Wrong size on FortAlterationModScreenBase_OnAlterationModificationSucess");
static_assert(offsetof(FortAlterationModScreenBase_OnAlterationModificationSucess, ModifiedSlotIndex) == 0x000000, "Member 'FortAlterationModScreenBase_OnAlterationModificationSucess::ModifiedSlotIndex' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationModScreenBase.OnAlterationOptionChanged
// 0x0008 (0x0008 - 0x0000)
struct FortAlterationModScreenBase_OnAlterationOptionChanged final
{
public:
	class UFortAlterationOption*                  CurrentAlterationOption;                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationModScreenBase_OnAlterationOptionChanged) == 0x000008, "Wrong alignment on FortAlterationModScreenBase_OnAlterationOptionChanged");
static_assert(sizeof(FortAlterationModScreenBase_OnAlterationOptionChanged) == 0x000008, "Wrong size on FortAlterationModScreenBase_OnAlterationOptionChanged");
static_assert(offsetof(FortAlterationModScreenBase_OnAlterationOptionChanged, CurrentAlterationOption) == 0x000000, "Member 'FortAlterationModScreenBase_OnAlterationOptionChanged::CurrentAlterationOption' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationModScreenBase.OnItemSlotChanged
// 0x0001 (0x0001 - 0x0000)
struct FortAlterationModScreenBase_OnItemSlotChanged final
{
public:
	bool                                          SelectedSlot;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationModScreenBase_OnItemSlotChanged) == 0x000001, "Wrong alignment on FortAlterationModScreenBase_OnItemSlotChanged");
static_assert(sizeof(FortAlterationModScreenBase_OnItemSlotChanged) == 0x000001, "Wrong size on FortAlterationModScreenBase_OnItemSlotChanged");
static_assert(offsetof(FortAlterationModScreenBase_OnItemSlotChanged, SelectedSlot) == 0x000000, "Member 'FortAlterationModScreenBase_OnItemSlotChanged::SelectedSlot' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationModScreenBase.SetItemForAlterationsModding
// 0x0008 (0x0008 - 0x0000)
struct FortAlterationModScreenBase_SetItemForAlterationsModding final
{
public:
	class UFortAlterableItem*                     InAlterableItem;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationModScreenBase_SetItemForAlterationsModding) == 0x000008, "Wrong alignment on FortAlterationModScreenBase_SetItemForAlterationsModding");
static_assert(sizeof(FortAlterationModScreenBase_SetItemForAlterationsModding) == 0x000008, "Wrong size on FortAlterationModScreenBase_SetItemForAlterationsModding");
static_assert(offsetof(FortAlterationModScreenBase_SetItemForAlterationsModding, InAlterableItem) == 0x000000, "Member 'FortAlterationModScreenBase_SetItemForAlterationsModding::InAlterableItem' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOption.Setup
// 0x0040 (0x0040 - 0x0000)
struct FortAlterationOption_Setup final
{
public:
	struct FAlterationOption                      InAlterationOption;                                // 0x0000(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
	EFortAlterationOptionType                     InAlterationOptionType;                            // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAlterationOption_Setup) == 0x000008, "Wrong alignment on FortAlterationOption_Setup");
static_assert(sizeof(FortAlterationOption_Setup) == 0x000040, "Wrong size on FortAlterationOption_Setup");
static_assert(offsetof(FortAlterationOption_Setup, InAlterationOption) == 0x000000, "Member 'FortAlterationOption_Setup::InAlterationOption' has a wrong offset!");
static_assert(offsetof(FortAlterationOption_Setup, InAlterationOptionType) == 0x000038, "Member 'FortAlterationOption_Setup::InAlterationOptionType' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOption.GetAlterationDefinition
// 0x0008 (0x0008 - 0x0000)
struct FortAlterationOption_GetAlterationDefinition final
{
public:
	class UFortAlterationItemDefinition*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOption_GetAlterationDefinition) == 0x000008, "Wrong alignment on FortAlterationOption_GetAlterationDefinition");
static_assert(sizeof(FortAlterationOption_GetAlterationDefinition) == 0x000008, "Wrong size on FortAlterationOption_GetAlterationDefinition");
static_assert(offsetof(FortAlterationOption_GetAlterationDefinition, ReturnValue) == 0x000000, "Member 'FortAlterationOption_GetAlterationDefinition::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOption.GetAlterationOptionType
// 0x0001 (0x0001 - 0x0000)
struct FortAlterationOption_GetAlterationOptionType final
{
public:
	EFortAlterationOptionType                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOption_GetAlterationOptionType) == 0x000001, "Wrong alignment on FortAlterationOption_GetAlterationOptionType");
static_assert(sizeof(FortAlterationOption_GetAlterationOptionType) == 0x000001, "Wrong size on FortAlterationOption_GetAlterationOptionType");
static_assert(offsetof(FortAlterationOption_GetAlterationOptionType, ReturnValue) == 0x000000, "Member 'FortAlterationOption_GetAlterationOptionType::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOption.GetCurrentPipCount
// 0x0008 (0x0008 - 0x0000)
struct FortAlterationOption_GetCurrentPipCount final
{
public:
	float                                         MaxPipCount;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOption_GetCurrentPipCount) == 0x000004, "Wrong alignment on FortAlterationOption_GetCurrentPipCount");
static_assert(sizeof(FortAlterationOption_GetCurrentPipCount) == 0x000008, "Wrong size on FortAlterationOption_GetCurrentPipCount");
static_assert(offsetof(FortAlterationOption_GetCurrentPipCount, MaxPipCount) == 0x000000, "Member 'FortAlterationOption_GetCurrentPipCount::MaxPipCount' has a wrong offset!");
static_assert(offsetof(FortAlterationOption_GetCurrentPipCount, ReturnValue) == 0x000004, "Member 'FortAlterationOption_GetCurrentPipCount::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOption.GetNextPipCount
// 0x0008 (0x0008 - 0x0000)
struct FortAlterationOption_GetNextPipCount final
{
public:
	float                                         MaxPipCount;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOption_GetNextPipCount) == 0x000004, "Wrong alignment on FortAlterationOption_GetNextPipCount");
static_assert(sizeof(FortAlterationOption_GetNextPipCount) == 0x000008, "Wrong size on FortAlterationOption_GetNextPipCount");
static_assert(offsetof(FortAlterationOption_GetNextPipCount, MaxPipCount) == 0x000000, "Member 'FortAlterationOption_GetNextPipCount::MaxPipCount' has a wrong offset!");
static_assert(offsetof(FortAlterationOption_GetNextPipCount, ReturnValue) == 0x000004, "Member 'FortAlterationOption_GetNextPipCount::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOption.GetRequiredIngredients
// 0x0010 (0x0010 - 0x0000)
struct FortAlterationOption_GetRequiredIngredients final
{
public:
	TArray<struct FFortItemQuantityPair>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOption_GetRequiredIngredients) == 0x000008, "Wrong alignment on FortAlterationOption_GetRequiredIngredients");
static_assert(sizeof(FortAlterationOption_GetRequiredIngredients) == 0x000010, "Wrong size on FortAlterationOption_GetRequiredIngredients");
static_assert(offsetof(FortAlterationOption_GetRequiredIngredients, ReturnValue) == 0x000000, "Member 'FortAlterationOption_GetRequiredIngredients::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOptionsBase.HandleAlterationsOptionHovered
// 0x0010 (0x0010 - 0x0000)
struct FortAlterationOptionsBase_HandleAlterationsOptionHovered final
{
public:
	class UCommonButtonLegacy*                    AlterationOptionButton;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAlterationOptionsBase_HandleAlterationsOptionHovered) == 0x000008, "Wrong alignment on FortAlterationOptionsBase_HandleAlterationsOptionHovered");
static_assert(sizeof(FortAlterationOptionsBase_HandleAlterationsOptionHovered) == 0x000010, "Wrong size on FortAlterationOptionsBase_HandleAlterationsOptionHovered");
static_assert(offsetof(FortAlterationOptionsBase_HandleAlterationsOptionHovered, AlterationOptionButton) == 0x000000, "Member 'FortAlterationOptionsBase_HandleAlterationsOptionHovered::AlterationOptionButton' has a wrong offset!");
static_assert(offsetof(FortAlterationOptionsBase_HandleAlterationsOptionHovered, GroupIndex) == 0x000008, "Member 'FortAlterationOptionsBase_HandleAlterationsOptionHovered::GroupIndex' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOptionsBase.HandleAlterationsOptionSelected
// 0x0010 (0x0010 - 0x0000)
struct FortAlterationOptionsBase_HandleAlterationsOptionSelected final
{
public:
	class UCommonButtonLegacy*                    AlterationOptionButton;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAlterationOptionsBase_HandleAlterationsOptionSelected) == 0x000008, "Wrong alignment on FortAlterationOptionsBase_HandleAlterationsOptionSelected");
static_assert(sizeof(FortAlterationOptionsBase_HandleAlterationsOptionSelected) == 0x000010, "Wrong size on FortAlterationOptionsBase_HandleAlterationsOptionSelected");
static_assert(offsetof(FortAlterationOptionsBase_HandleAlterationsOptionSelected, AlterationOptionButton) == 0x000000, "Member 'FortAlterationOptionsBase_HandleAlterationsOptionSelected::AlterationOptionButton' has a wrong offset!");
static_assert(offsetof(FortAlterationOptionsBase_HandleAlterationsOptionSelected, GroupIndex) == 0x000008, "Member 'FortAlterationOptionsBase_HandleAlterationsOptionSelected::GroupIndex' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOptionsBase.OnGenerateOption
// 0x0010 (0x0010 - 0x0000)
struct FortAlterationOptionsBase_OnGenerateOption final
{
public:
	EFortAlterationOptionType                     OptionType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAlterationOption*                  OptionWidget;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOptionsBase_OnGenerateOption) == 0x000008, "Wrong alignment on FortAlterationOptionsBase_OnGenerateOption");
static_assert(sizeof(FortAlterationOptionsBase_OnGenerateOption) == 0x000010, "Wrong size on FortAlterationOptionsBase_OnGenerateOption");
static_assert(offsetof(FortAlterationOptionsBase_OnGenerateOption, OptionType) == 0x000000, "Member 'FortAlterationOptionsBase_OnGenerateOption::OptionType' has a wrong offset!");
static_assert(offsetof(FortAlterationOptionsBase_OnGenerateOption, OptionWidget) == 0x000008, "Member 'FortAlterationOptionsBase_OnGenerateOption::OptionWidget' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOptionsBase.OnItemChanged
// 0x0001 (0x0001 - 0x0000)
struct FortAlterationOptionsBase_OnItemChanged final
{
public:
	bool                                          bIntroAlterations;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOptionsBase_OnItemChanged) == 0x000001, "Wrong alignment on FortAlterationOptionsBase_OnItemChanged");
static_assert(sizeof(FortAlterationOptionsBase_OnItemChanged) == 0x000001, "Wrong size on FortAlterationOptionsBase_OnItemChanged");
static_assert(offsetof(FortAlterationOptionsBase_OnItemChanged, bIntroAlterations) == 0x000000, "Member 'FortAlterationOptionsBase_OnItemChanged::bIntroAlterations' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOptionsBase.ProcessAlterationOptions
// 0x0001 (0x0001 - 0x0000)
struct FortAlterationOptionsBase_ProcessAlterationOptions final
{
public:
	bool                                          bIntroAlterations;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOptionsBase_ProcessAlterationOptions) == 0x000001, "Wrong alignment on FortAlterationOptionsBase_ProcessAlterationOptions");
static_assert(sizeof(FortAlterationOptionsBase_ProcessAlterationOptions) == 0x000001, "Wrong size on FortAlterationOptionsBase_ProcessAlterationOptions");
static_assert(offsetof(FortAlterationOptionsBase_ProcessAlterationOptions, bIntroAlterations) == 0x000000, "Member 'FortAlterationOptionsBase_ProcessAlterationOptions::bIntroAlterations' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOptionsBase.DoAlterationOptionsExist
// 0x0002 (0x0002 - 0x0000)
struct FortAlterationOptionsBase_DoAlterationOptionsExist final
{
public:
	EFortAlterationOptionType                     OptionType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOptionsBase_DoAlterationOptionsExist) == 0x000001, "Wrong alignment on FortAlterationOptionsBase_DoAlterationOptionsExist");
static_assert(sizeof(FortAlterationOptionsBase_DoAlterationOptionsExist) == 0x000002, "Wrong size on FortAlterationOptionsBase_DoAlterationOptionsExist");
static_assert(offsetof(FortAlterationOptionsBase_DoAlterationOptionsExist, OptionType) == 0x000000, "Member 'FortAlterationOptionsBase_DoAlterationOptionsExist::OptionType' has a wrong offset!");
static_assert(offsetof(FortAlterationOptionsBase_DoAlterationOptionsExist, ReturnValue) == 0x000001, "Member 'FortAlterationOptionsBase_DoAlterationOptionsExist::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortAlterationOptionsBase.IsValidAlterationSlot
// 0x0001 (0x0001 - 0x0000)
struct FortAlterationOptionsBase_IsValidAlterationSlot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAlterationOptionsBase_IsValidAlterationSlot) == 0x000001, "Wrong alignment on FortAlterationOptionsBase_IsValidAlterationSlot");
static_assert(sizeof(FortAlterationOptionsBase_IsValidAlterationSlot) == 0x000001, "Wrong size on FortAlterationOptionsBase_IsValidAlterationSlot");
static_assert(offsetof(FortAlterationOptionsBase_IsValidAlterationSlot, ReturnValue) == 0x000000, "Member 'FortAlterationOptionsBase_IsValidAlterationSlot::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortBannerSelectorBase.HandleBannerNameChanged
// 0x0018 (0x0018 - 0x0000)
struct FortBannerSelectorBase_HandleBannerNameChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortBannerSelectorBase_HandleBannerNameChanged) == 0x000008, "Wrong alignment on FortBannerSelectorBase_HandleBannerNameChanged");
static_assert(sizeof(FortBannerSelectorBase_HandleBannerNameChanged) == 0x000018, "Wrong size on FortBannerSelectorBase_HandleBannerNameChanged");
static_assert(offsetof(FortBannerSelectorBase_HandleBannerNameChanged, Text) == 0x000000, "Member 'FortBannerSelectorBase_HandleBannerNameChanged::Text' has a wrong offset!");

// Function SaveTheWorldUI.FortBannerSelectorBase.UpdateErrorText
// 0x0018 (0x0018 - 0x0000)
struct FortBannerSelectorBase_UpdateErrorText final
{
public:
	class FText                                   ErrorMessageText;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortBannerSelectorBase_UpdateErrorText) == 0x000008, "Wrong alignment on FortBannerSelectorBase_UpdateErrorText");
static_assert(sizeof(FortBannerSelectorBase_UpdateErrorText) == 0x000018, "Wrong size on FortBannerSelectorBase_UpdateErrorText");
static_assert(offsetof(FortBannerSelectorBase_UpdateErrorText, ErrorMessageText) == 0x000000, "Member 'FortBannerSelectorBase_UpdateErrorText::ErrorMessageText' has a wrong offset!");

// Function SaveTheWorldUI.FortBannerSelectorBase.HasIllegalChars
// 0x0018 (0x0018 - 0x0000)
struct FortBannerSelectorBase_HasIllegalChars final
{
public:
	class FString                                 NewBannerName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortBannerSelectorBase_HasIllegalChars) == 0x000008, "Wrong alignment on FortBannerSelectorBase_HasIllegalChars");
static_assert(sizeof(FortBannerSelectorBase_HasIllegalChars) == 0x000018, "Wrong size on FortBannerSelectorBase_HasIllegalChars");
static_assert(offsetof(FortBannerSelectorBase_HasIllegalChars, NewBannerName) == 0x000000, "Member 'FortBannerSelectorBase_HasIllegalChars::NewBannerName' has a wrong offset!");
static_assert(offsetof(FortBannerSelectorBase_HasIllegalChars, ReturnValue) == 0x000010, "Member 'FortBannerSelectorBase_HasIllegalChars::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortBannerSelectorBase.IsPlayerNameValid
// 0x0038 (0x0038 - 0x0000)
struct FortBannerSelectorBase_IsPlayerNameValid final
{
public:
	class FText                                   PlayerName;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          OutIsValid;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutErrorText;                                      // 0x0020(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortBannerSelectorBase_IsPlayerNameValid) == 0x000008, "Wrong alignment on FortBannerSelectorBase_IsPlayerNameValid");
static_assert(sizeof(FortBannerSelectorBase_IsPlayerNameValid) == 0x000038, "Wrong size on FortBannerSelectorBase_IsPlayerNameValid");
static_assert(offsetof(FortBannerSelectorBase_IsPlayerNameValid, PlayerName) == 0x000000, "Member 'FortBannerSelectorBase_IsPlayerNameValid::PlayerName' has a wrong offset!");
static_assert(offsetof(FortBannerSelectorBase_IsPlayerNameValid, OutIsValid) == 0x000018, "Member 'FortBannerSelectorBase_IsPlayerNameValid::OutIsValid' has a wrong offset!");
static_assert(offsetof(FortBannerSelectorBase_IsPlayerNameValid, OutErrorText) == 0x000020, "Member 'FortBannerSelectorBase_IsPlayerNameValid::OutErrorText' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.OnRewardStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookGenericRewardWidget_OnRewardStatusChanged final
{
public:
	ECollectionBookRewardStatus                   NewStatus;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_OnRewardStatusChanged) == 0x000001, "Wrong alignment on FortCollectionBookGenericRewardWidget_OnRewardStatusChanged");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_OnRewardStatusChanged) == 0x000001, "Wrong size on FortCollectionBookGenericRewardWidget_OnRewardStatusChanged");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_OnRewardStatusChanged, NewStatus) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_OnRewardStatusChanged::NewStatus' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.SetCurrentItemToDisplay
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay final
{
public:
	class UFortItem*                              ItemToDisplay;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay) == 0x000008, "Wrong alignment on FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay) == 0x000008, "Wrong size on FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay, ItemToDisplay) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_SetCurrentItemToDisplay::ItemToDisplay' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.SetRewards
// 0x0030 (0x0030 - 0x0000)
struct FortCollectionBookGenericRewardWidget_SetRewards final
{
public:
	struct FFortRewardInfo                        Rewards;                                           // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_SetRewards) == 0x000008, "Wrong alignment on FortCollectionBookGenericRewardWidget_SetRewards");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_SetRewards) == 0x000030, "Wrong size on FortCollectionBookGenericRewardWidget_SetRewards");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_SetRewards, Rewards) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_SetRewards::Rewards' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.SetRewardStatus
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookGenericRewardWidget_SetRewardStatus final
{
public:
	ECollectionBookRewardStatus                   Status;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_SetRewardStatus) == 0x000001, "Wrong alignment on FortCollectionBookGenericRewardWidget_SetRewardStatus");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_SetRewardStatus) == 0x000001, "Wrong size on FortCollectionBookGenericRewardWidget_SetRewardStatus");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_SetRewardStatus, Status) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_SetRewardStatus::Status' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.GetRewardStatus
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookGenericRewardWidget_GetRewardStatus final
{
public:
	ECollectionBookRewardStatus                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_GetRewardStatus) == 0x000001, "Wrong alignment on FortCollectionBookGenericRewardWidget_GetRewardStatus");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_GetRewardStatus) == 0x000001, "Wrong size on FortCollectionBookGenericRewardWidget_GetRewardStatus");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_GetRewardStatus, ReturnValue) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_GetRewardStatus::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookGenericRewardWidget.HasRewards
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookGenericRewardWidget_HasRewards final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookGenericRewardWidget_HasRewards) == 0x000001, "Wrong alignment on FortCollectionBookGenericRewardWidget_HasRewards");
static_assert(sizeof(FortCollectionBookGenericRewardWidget_HasRewards) == 0x000001, "Wrong size on FortCollectionBookGenericRewardWidget_HasRewards");
static_assert(offsetof(FortCollectionBookGenericRewardWidget_HasRewards, ReturnValue) == 0x000000, "Member 'FortCollectionBookGenericRewardWidget_HasRewards::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookItemPopupMenu.CanItemBePurchased
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookItemPopupMenu_CanItemBePurchased final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookItemPopupMenu_CanItemBePurchased) == 0x000001, "Wrong alignment on FortCollectionBookItemPopupMenu_CanItemBePurchased");
static_assert(sizeof(FortCollectionBookItemPopupMenu_CanItemBePurchased) == 0x000001, "Wrong size on FortCollectionBookItemPopupMenu_CanItemBePurchased");
static_assert(offsetof(FortCollectionBookItemPopupMenu_CanItemBePurchased, ReturnValue) == 0x000000, "Member 'FortCollectionBookItemPopupMenu_CanItemBePurchased::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookItemPopupMenu.CanItemBeUnslotted
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookItemPopupMenu_CanItemBeUnslotted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookItemPopupMenu_CanItemBeUnslotted) == 0x000001, "Wrong alignment on FortCollectionBookItemPopupMenu_CanItemBeUnslotted");
static_assert(sizeof(FortCollectionBookItemPopupMenu_CanItemBeUnslotted) == 0x000001, "Wrong size on FortCollectionBookItemPopupMenu_CanItemBeUnslotted");
static_assert(offsetof(FortCollectionBookItemPopupMenu_CanItemBeUnslotted, ReturnValue) == 0x000000, "Member 'FortCollectionBookItemPopupMenu_CanItemBeUnslotted::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookItemPopupMenu.HandleItemChanged
// 0x0003 (0x0003 - 0x0000)
struct FortCollectionBookItemPopupMenu_HandleItemChanged final
{
public:
	bool                                          bItemChanged;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAmmoChanged;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIngredientsChanged;                               // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookItemPopupMenu_HandleItemChanged) == 0x000001, "Wrong alignment on FortCollectionBookItemPopupMenu_HandleItemChanged");
static_assert(sizeof(FortCollectionBookItemPopupMenu_HandleItemChanged) == 0x000003, "Wrong size on FortCollectionBookItemPopupMenu_HandleItemChanged");
static_assert(offsetof(FortCollectionBookItemPopupMenu_HandleItemChanged, bItemChanged) == 0x000000, "Member 'FortCollectionBookItemPopupMenu_HandleItemChanged::bItemChanged' has a wrong offset!");
static_assert(offsetof(FortCollectionBookItemPopupMenu_HandleItemChanged, bAmmoChanged) == 0x000001, "Member 'FortCollectionBookItemPopupMenu_HandleItemChanged::bAmmoChanged' has a wrong offset!");
static_assert(offsetof(FortCollectionBookItemPopupMenu_HandleItemChanged, bIngredientsChanged) == 0x000002, "Member 'FortCollectionBookItemPopupMenu_HandleItemChanged::bIngredientsChanged' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookItemPopupMenu.GetHostButton
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookItemPopupMenu_GetHostButton final
{
public:
	class UFortCollectionBookSlotButton*          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookItemPopupMenu_GetHostButton) == 0x000008, "Wrong alignment on FortCollectionBookItemPopupMenu_GetHostButton");
static_assert(sizeof(FortCollectionBookItemPopupMenu_GetHostButton) == 0x000008, "Wrong size on FortCollectionBookItemPopupMenu_GetHostButton");
static_assert(offsetof(FortCollectionBookItemPopupMenu_GetHostButton, ReturnValue) == 0x000000, "Member 'FortCollectionBookItemPopupMenu_GetHostButton::ReturnValue' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookOverviewWidget.HandlePagesChanged
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookOverviewWidget_HandlePagesChanged final
{
public:
	class UFortCollectionBookManager*             CBManager;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookOverviewWidget_HandlePagesChanged) == 0x000008, "Wrong alignment on FortCollectionBookOverviewWidget_HandlePagesChanged");
static_assert(sizeof(FortCollectionBookOverviewWidget_HandlePagesChanged) == 0x000008, "Wrong size on FortCollectionBookOverviewWidget_HandlePagesChanged");
static_assert(offsetof(FortCollectionBookOverviewWidget_HandlePagesChanged, CBManager) == 0x000000, "Member 'FortCollectionBookOverviewWidget_HandlePagesChanged::CBManager' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.HandleRewardDetailsModalWidgetDeactivated
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated final
{
public:
	class UCommonActivatablePanelLegacy*          DeactivatedPanel;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated) == 0x000008, "Wrong alignment on FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated) == 0x000008, "Wrong size on FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated, DeactivatedPanel) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_HandleRewardDetailsModalWidgetDeactivated::DeactivatedPanel' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.OnDetailsPageChanged
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookPageDetailsWidget_OnDetailsPageChanged final
{
public:
	const class UFortCollectionBookPage*          InNewDetailsPage;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_OnDetailsPageChanged) == 0x000008, "Wrong alignment on FortCollectionBookPageDetailsWidget_OnDetailsPageChanged");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_OnDetailsPageChanged) == 0x000008, "Wrong size on FortCollectionBookPageDetailsWidget_OnDetailsPageChanged");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnDetailsPageChanged, InNewDetailsPage) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_OnDetailsPageChanged::InNewDetailsPage' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.OnPageProgressionUpdated
// 0x000C (0x000C - 0x0000)
struct FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated final
{
public:
	int32                                         TotalFilledSlots;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSlots;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortCollectionBookState                      State;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated) == 0x000004, "Wrong alignment on FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated) == 0x00000C, "Wrong size on FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated, TotalFilledSlots) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated::TotalFilledSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated, TotalSlots) == 0x000004, "Member 'FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated::TotalSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated, State) == 0x000008, "Member 'FortCollectionBookPageDetailsWidget_OnPageProgressionUpdated::State' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.OnSlotItemComplete
// 0x0010 (0x0010 - 0x0000)
struct FortCollectionBookPageDetailsWidget_OnSlotItemComplete final
{
public:
	const class UFortAccountItem*                 SlottedItem;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotId;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_OnSlotItemComplete) == 0x000008, "Wrong alignment on FortCollectionBookPageDetailsWidget_OnSlotItemComplete");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_OnSlotItemComplete) == 0x000010, "Wrong size on FortCollectionBookPageDetailsWidget_OnSlotItemComplete");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnSlotItemComplete, SlottedItem) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_OnSlotItemComplete::SlottedItem' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnSlotItemComplete, SlotId) == 0x000008, "Member 'FortCollectionBookPageDetailsWidget_OnSlotItemComplete::SlotId' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageDetailsWidget.OnUnslotItemComplete
// 0x0018 (0x0018 - 0x0000)
struct FortCollectionBookPageDetailsWidget_OnUnslotItemComplete final
{
public:
	const class UFortAccountItem*                 SlottedItem;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortAccountItem*                 OldItem;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotId;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete) == 0x000008, "Wrong alignment on FortCollectionBookPageDetailsWidget_OnUnslotItemComplete");
static_assert(sizeof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete) == 0x000018, "Wrong size on FortCollectionBookPageDetailsWidget_OnUnslotItemComplete");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete, SlottedItem) == 0x000000, "Member 'FortCollectionBookPageDetailsWidget_OnUnslotItemComplete::SlottedItem' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete, OldItem) == 0x000008, "Member 'FortCollectionBookPageDetailsWidget_OnUnslotItemComplete::OldItem' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageDetailsWidget_OnUnslotItemComplete, SlotId) == 0x000010, "Member 'FortCollectionBookPageDetailsWidget_OnUnslotItemComplete::SlotId' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageListWidget.OnCategoryDetailsUpdated
// 0x000C (0x000C - 0x0000)
struct FortCollectionBookPageListWidget_OnCategoryDetailsUpdated final
{
public:
	int32                                         AvailableSlots;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FilledSlots;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSlots;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated) == 0x000004, "Wrong alignment on FortCollectionBookPageListWidget_OnCategoryDetailsUpdated");
static_assert(sizeof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated) == 0x00000C, "Wrong size on FortCollectionBookPageListWidget_OnCategoryDetailsUpdated");
static_assert(offsetof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated, AvailableSlots) == 0x000000, "Member 'FortCollectionBookPageListWidget_OnCategoryDetailsUpdated::AvailableSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated, FilledSlots) == 0x000004, "Member 'FortCollectionBookPageListWidget_OnCategoryDetailsUpdated::FilledSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnCategoryDetailsUpdated, TotalSlots) == 0x000008, "Member 'FortCollectionBookPageListWidget_OnCategoryDetailsUpdated::TotalSlots' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageListWidget.OnPageDetailsUpdated
// 0x0010 (0x0010 - 0x0000)
struct FortCollectionBookPageListWidget_OnPageDetailsUpdated final
{
public:
	int32                                         AvailableSlots;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FilledSlots;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSlots;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortCollectionBookState                      State;                                             // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageListWidget_OnPageDetailsUpdated) == 0x000004, "Wrong alignment on FortCollectionBookPageListWidget_OnPageDetailsUpdated");
static_assert(sizeof(FortCollectionBookPageListWidget_OnPageDetailsUpdated) == 0x000010, "Wrong size on FortCollectionBookPageListWidget_OnPageDetailsUpdated");
static_assert(offsetof(FortCollectionBookPageListWidget_OnPageDetailsUpdated, AvailableSlots) == 0x000000, "Member 'FortCollectionBookPageListWidget_OnPageDetailsUpdated::AvailableSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnPageDetailsUpdated, FilledSlots) == 0x000004, "Member 'FortCollectionBookPageListWidget_OnPageDetailsUpdated::FilledSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnPageDetailsUpdated, TotalSlots) == 0x000008, "Member 'FortCollectionBookPageListWidget_OnPageDetailsUpdated::TotalSlots' has a wrong offset!");
static_assert(offsetof(FortCollectionBookPageListWidget_OnPageDetailsUpdated, State) == 0x00000C, "Member 'FortCollectionBookPageListWidget_OnPageDetailsUpdated::State' has a wrong offset!");

// Function SaveTheWorldUI.FortCollectionBookPageListWidget.OnSlottedItemOperationComplete
// 0x0010 (0x0010 - 0x0000)
struct FortCollectionBookPageListWidget_OnSlottedItemOperationComplete final
{
public:
	const class UFortAccountItem*                 SlottedItem;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotId;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortCollectionBookPageListWidget_OnSlottedItemOperationComplete) == 0x000008, "Wrong alignment on FortCollectionBookPageListWidget_OnSlottedItemOperationComplete");
static_assert(sizeof(FortCollectionBookPageListWidget_OnSlottedItemOperationComplete) == 0x000010, "Wrong size on FortCollectionBookPageListWidget_OnSlottedItemOperationComplete");
static_assert(offsetof(FortCollectionBookPageListWidget_OnSlottedItemOperationComplete, SlottedItem) == 0x000000, "Member 'FortCollectionBookPageListWidget_OnSlottedItemOperationComplete::SlottedItem' has a wrong offset!");
