#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scoreboard_MapWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function Scoreboard_MapWidget.Scoreboard_MapWidget_C.ExecuteUbergraph_Scoreboard_MapWidget
// 0x0048 (0x0048 - 0x0000)
struct Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortHideShowInterface> CallFunc_DoShowUI_self_CastInput;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortHideShowInterface> CallFunc_DoHideUI_self_CastInput;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScoreboardEnabled_bIsEnabled;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScoreboardEnabled_bIsEnabled_1;         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget) == 0x000008, "Wrong alignment on Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget");
static_assert(sizeof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget) == 0x000048, "Wrong size on Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget");
static_assert(offsetof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget, EntryPoint) == 0x000000, "Member 'Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget, CallFunc_DoShowUI_self_CastInput) == 0x000008, "Member 'Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget::CallFunc_DoShowUI_self_CastInput' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget, CallFunc_DoHideUI_self_CastInput) == 0x000018, "Member 'Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget::CallFunc_DoHideUI_self_CastInput' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000038, "Member 'Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget, CallFunc_IsInZone_ReturnValue) == 0x000040, "Member 'Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget, CallFunc_IsScoreboardEnabled_bIsEnabled) == 0x000041, "Member 'Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget::CallFunc_IsScoreboardEnabled_bIsEnabled' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget, CallFunc_IsScoreboardEnabled_bIsEnabled_1) == 0x000042, "Member 'Scoreboard_MapWidget_C_ExecuteUbergraph_Scoreboard_MapWidget::CallFunc_IsScoreboardEnabled_bIsEnabled_1' has a wrong offset!");

// Function Scoreboard_MapWidget.Scoreboard_MapWidget_C.IsScoreboardEnabled
// 0x0030 (0x0030 - 0x0000)
struct Scoreboard_MapWidget_C_IsScoreboardEnabled final
{
public:
	bool                                          bIsEnabled_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          CallFunc_GetMinigame_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scoreboard_MapWidget_C_IsScoreboardEnabled) == 0x000008, "Wrong alignment on Scoreboard_MapWidget_C_IsScoreboardEnabled");
static_assert(sizeof(Scoreboard_MapWidget_C_IsScoreboardEnabled) == 0x000030, "Wrong size on Scoreboard_MapWidget_C_IsScoreboardEnabled");
static_assert(offsetof(Scoreboard_MapWidget_C_IsScoreboardEnabled, bIsEnabled_0) == 0x000000, "Member 'Scoreboard_MapWidget_C_IsScoreboardEnabled::bIsEnabled_0' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_IsScoreboardEnabled, Temp_bool_Variable) == 0x000001, "Member 'Scoreboard_MapWidget_C_IsScoreboardEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_IsScoreboardEnabled, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'Scoreboard_MapWidget_C_IsScoreboardEnabled::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_IsScoreboardEnabled, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000010, "Member 'Scoreboard_MapWidget_C_IsScoreboardEnabled::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_IsScoreboardEnabled, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Scoreboard_MapWidget_C_IsScoreboardEnabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_IsScoreboardEnabled, CallFunc_GetMinigame_ReturnValue) == 0x000020, "Member 'Scoreboard_MapWidget_C_IsScoreboardEnabled::CallFunc_GetMinigame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_IsScoreboardEnabled, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Scoreboard_MapWidget_C_IsScoreboardEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_MapWidget_C_IsScoreboardEnabled, K2Node_Select_Default) == 0x000029, "Member 'Scoreboard_MapWidget_C_IsScoreboardEnabled::K2Node_Select_Default' has a wrong offset!");

// Function Scoreboard_MapWidget.Scoreboard_MapWidget_C.SetIsCareerScoreboard
// 0x0001 (0x0001 - 0x0000)
struct Scoreboard_MapWidget_C_SetIsCareerScoreboard final
{
public:
	bool                                          bIsCareerScoreboard;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scoreboard_MapWidget_C_SetIsCareerScoreboard) == 0x000001, "Wrong alignment on Scoreboard_MapWidget_C_SetIsCareerScoreboard");
static_assert(sizeof(Scoreboard_MapWidget_C_SetIsCareerScoreboard) == 0x000001, "Wrong size on Scoreboard_MapWidget_C_SetIsCareerScoreboard");
static_assert(offsetof(Scoreboard_MapWidget_C_SetIsCareerScoreboard, bIsCareerScoreboard) == 0x000000, "Member 'Scoreboard_MapWidget_C_SetIsCareerScoreboard::bIsCareerScoreboard' has a wrong offset!");

}

