#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListEntry_Missing

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SettingsListEntry_Missing.SettingsListEntry_Missing_C.ExecuteUbergraph_SettingsListEntry_Missing
// 0x0178 (0x0178 - 0x0000)
struct SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0048(0x0090)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E8(0x0090)(ConstParm)
};
static_assert(alignof(SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing) == 0x000008, "Wrong alignment on SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing");
static_assert(sizeof(SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing) == 0x000178, "Wrong size on SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing");
static_assert(offsetof(SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing, EntryPoint) == 0x000000, "Member 'SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing, K2Node_Event_MyGeometry) == 0x000008, "Member 'SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing, K2Node_Event_MouseEvent_1) == 0x000048, "Member 'SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000D8, "Member 'SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000E0, "Member 'SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing, K2Node_Event_MouseEvent) == 0x0000E8, "Member 'SettingsListEntry_Missing_C_ExecuteUbergraph_SettingsListEntry_Missing::K2Node_Event_MouseEvent' has a wrong offset!");

// Function SettingsListEntry_Missing.SettingsListEntry_Missing_C.OnMouseEnter
// 0x00D0 (0x00D0 - 0x0000)
struct SettingsListEntry_Missing_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_Missing_C_OnMouseEnter) == 0x000008, "Wrong alignment on SettingsListEntry_Missing_C_OnMouseEnter");
static_assert(sizeof(SettingsListEntry_Missing_C_OnMouseEnter) == 0x0000D0, "Wrong size on SettingsListEntry_Missing_C_OnMouseEnter");
static_assert(offsetof(SettingsListEntry_Missing_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'SettingsListEntry_Missing_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Missing_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'SettingsListEntry_Missing_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function SettingsListEntry_Missing.SettingsListEntry_Missing_C.OnMouseLeave
// 0x0090 (0x0090 - 0x0000)
struct SettingsListEntry_Missing_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_Missing_C_OnMouseLeave) == 0x000008, "Wrong alignment on SettingsListEntry_Missing_C_OnMouseLeave");
static_assert(sizeof(SettingsListEntry_Missing_C_OnMouseLeave) == 0x000090, "Wrong size on SettingsListEntry_Missing_C_OnMouseLeave");
static_assert(offsetof(SettingsListEntry_Missing_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'SettingsListEntry_Missing_C_OnMouseLeave::MouseEvent' has a wrong offset!");

}

