#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListEntry_SubCollection

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.ExecuteUbergraph_SettingsListEntry_SubCollection
// 0x01A0 (0x01A0 - 0x0000)
struct SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_ActionText;                           // 0x0018(0x0018)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0070(0x0090)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0110(0x0090)(ConstParm)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection");
static_assert(sizeof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection) == 0x0001A0, "Wrong size on SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, EntryPoint) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000008, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_Event_ActionText) == 0x000018, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_Event_ActionText' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_Event_MyGeometry) == 0x000030, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_Event_MouseEvent_1) == 0x000070, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000100, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, CallFunc_PlayAnimationForward_ReturnValue) == 0x000108, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection, K2Node_Event_MouseEvent) == 0x000110, "Member 'SettingsListEntry_SubCollection_C_ExecuteUbergraph_SettingsListEntry_SubCollection::K2Node_Event_MouseEvent' has a wrong offset!");

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.OnMouseEnter
// 0x00D0 (0x00D0 - 0x0000)
struct SettingsListEntry_SubCollection_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_OnMouseEnter) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_OnMouseEnter");
static_assert(sizeof(SettingsListEntry_SubCollection_C_OnMouseEnter) == 0x0000D0, "Wrong size on SettingsListEntry_SubCollection_C_OnMouseEnter");
static_assert(offsetof(SettingsListEntry_SubCollection_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_SubCollection_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'SettingsListEntry_SubCollection_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.OnMouseLeave
// 0x0090 (0x0090 - 0x0000)
struct SettingsListEntry_SubCollection_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_OnMouseLeave) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_OnMouseLeave");
static_assert(sizeof(SettingsListEntry_SubCollection_C_OnMouseLeave) == 0x000090, "Wrong size on SettingsListEntry_SubCollection_C_OnMouseLeave");
static_assert(offsetof(SettingsListEntry_SubCollection_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function SettingsListEntry_SubCollection.SettingsListEntry_SubCollection_C.OnSettingAssigned
// 0x0018 (0x0018 - 0x0000)
struct SettingsListEntry_SubCollection_C_OnSettingAssigned final
{
public:
	class FText                                   ActionText;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_SubCollection_C_OnSettingAssigned) == 0x000008, "Wrong alignment on SettingsListEntry_SubCollection_C_OnSettingAssigned");
static_assert(sizeof(SettingsListEntry_SubCollection_C_OnSettingAssigned) == 0x000018, "Wrong size on SettingsListEntry_SubCollection_C_OnSettingAssigned");
static_assert(offsetof(SettingsListEntry_SubCollection_C_OnSettingAssigned, ActionText) == 0x000000, "Member 'SettingsListEntry_SubCollection_C_OnSettingAssigned::ActionText' has a wrong offset!");

}

