#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShadowProxyMeshComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function ShadowProxyMeshComponent.ShadowProxyMeshComponent_C.validateShadowSettings
// 0x0020 (0x0020 - 0x0000)
struct ShadowProxyMeshComponent_C_validateShadowSettings final
{
public:
	class UMeshComponent*                         l_comp;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_getProxyVisibility_ReturnValue;           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_getParentComponent_AsMesh_Component;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShadowProxyMeshComponent_C_validateShadowSettings) == 0x000008, "Wrong alignment on ShadowProxyMeshComponent_C_validateShadowSettings");
static_assert(sizeof(ShadowProxyMeshComponent_C_validateShadowSettings) == 0x000020, "Wrong size on ShadowProxyMeshComponent_C_validateShadowSettings");
static_assert(offsetof(ShadowProxyMeshComponent_C_validateShadowSettings, l_comp) == 0x000000, "Member 'ShadowProxyMeshComponent_C_validateShadowSettings::l_comp' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_validateShadowSettings, Temp_bool_Variable) == 0x000008, "Member 'ShadowProxyMeshComponent_C_validateShadowSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_validateShadowSettings, Temp_bool_Variable_1) == 0x000009, "Member 'ShadowProxyMeshComponent_C_validateShadowSettings::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_validateShadowSettings, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'ShadowProxyMeshComponent_C_validateShadowSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_validateShadowSettings, CallFunc_getProxyVisibility_ReturnValue) == 0x00000B, "Member 'ShadowProxyMeshComponent_C_validateShadowSettings::CallFunc_getProxyVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_validateShadowSettings, CallFunc_getParentComponent_AsMesh_Component) == 0x000010, "Member 'ShadowProxyMeshComponent_C_validateShadowSettings::CallFunc_getParentComponent_AsMesh_Component' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_validateShadowSettings, K2Node_Select_Default) == 0x000018, "Member 'ShadowProxyMeshComponent_C_validateShadowSettings::K2Node_Select_Default' has a wrong offset!");

// Function ShadowProxyMeshComponent.ShadowProxyMeshComponent_C.setProxyShadowForceDisabled
// 0x0001 (0x0001 - 0x0000)
struct ShadowProxyMeshComponent_C_setProxyShadowForceDisabled final
{
public:
	bool                                          forceShadowDisabled_0;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShadowProxyMeshComponent_C_setProxyShadowForceDisabled) == 0x000001, "Wrong alignment on ShadowProxyMeshComponent_C_setProxyShadowForceDisabled");
static_assert(sizeof(ShadowProxyMeshComponent_C_setProxyShadowForceDisabled) == 0x000001, "Wrong size on ShadowProxyMeshComponent_C_setProxyShadowForceDisabled");
static_assert(offsetof(ShadowProxyMeshComponent_C_setProxyShadowForceDisabled, forceShadowDisabled_0) == 0x000000, "Member 'ShadowProxyMeshComponent_C_setProxyShadowForceDisabled::forceShadowDisabled_0' has a wrong offset!");

// Function ShadowProxyMeshComponent.ShadowProxyMeshComponent_C.handleOwnerDamaged
// 0x0048 (0x0048 - 0x0000)
struct ShadowProxyMeshComponent_C_handleOwnerDamaged final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_Static_Mesh;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShadowProxyMeshComponent_C_handleOwnerDamaged) == 0x000008, "Wrong alignment on ShadowProxyMeshComponent_C_handleOwnerDamaged");
static_assert(sizeof(ShadowProxyMeshComponent_C_handleOwnerDamaged) == 0x000048, "Wrong size on ShadowProxyMeshComponent_C_handleOwnerDamaged");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleOwnerDamaged, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ShadowProxyMeshComponent_C_handleOwnerDamaged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleOwnerDamaged, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'ShadowProxyMeshComponent_C_handleOwnerDamaged::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleOwnerDamaged, K2Node_DynamicCast_AsBuilding_Static_Mesh) == 0x000018, "Member 'ShadowProxyMeshComponent_C_handleOwnerDamaged::K2Node_DynamicCast_AsBuilding_Static_Mesh' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleOwnerDamaged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ShadowProxyMeshComponent_C_handleOwnerDamaged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleOwnerDamaged, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'ShadowProxyMeshComponent_C_handleOwnerDamaged::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleOwnerDamaged, K2Node_DynamicCast_AsBuilding_Actor) == 0x000030, "Member 'ShadowProxyMeshComponent_C_handleOwnerDamaged::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleOwnerDamaged, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'ShadowProxyMeshComponent_C_handleOwnerDamaged::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleOwnerDamaged, CallFunc_GetHealthPercent_ReturnValue) == 0x00003C, "Member 'ShadowProxyMeshComponent_C_handleOwnerDamaged::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleOwnerDamaged, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'ShadowProxyMeshComponent_C_handleOwnerDamaged::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function ShadowProxyMeshComponent.ShadowProxyMeshComponent_C.handleCvarChanged
// 0x0018 (0x0018 - 0x0000)
struct ShadowProxyMeshComponent_C_handleCvarChanged final
{
public:
	class FString                                 CVarName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShadowProxyMeshComponent_C_handleCvarChanged) == 0x000008, "Wrong alignment on ShadowProxyMeshComponent_C_handleCvarChanged");
static_assert(sizeof(ShadowProxyMeshComponent_C_handleCvarChanged) == 0x000018, "Wrong size on ShadowProxyMeshComponent_C_handleCvarChanged");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleCvarChanged, CVarName) == 0x000000, "Member 'ShadowProxyMeshComponent_C_handleCvarChanged::CVarName' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleCvarChanged, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000010, "Member 'ShadowProxyMeshComponent_C_handleCvarChanged::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleCvarChanged, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000011, "Member 'ShadowProxyMeshComponent_C_handleCvarChanged::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_handleCvarChanged, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000012, "Member 'ShadowProxyMeshComponent_C_handleCvarChanged::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function ShadowProxyMeshComponent.ShadowProxyMeshComponent_C.getProxyVisibility
// 0x0028 (0x0028 - 0x0000)
struct ShadowProxyMeshComponent_C_getProxyVisibility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          l_enabled;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_Static_Mesh;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShadowProxyMeshComponent_C_getProxyVisibility) == 0x000008, "Wrong alignment on ShadowProxyMeshComponent_C_getProxyVisibility");
static_assert(sizeof(ShadowProxyMeshComponent_C_getProxyVisibility) == 0x000028, "Wrong size on ShadowProxyMeshComponent_C_getProxyVisibility");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, ReturnValue) == 0x000000, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, l_enabled) == 0x000001, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::l_enabled' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, K2Node_DynamicCast_AsBuilding_Static_Mesh) == 0x000010, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::K2Node_DynamicCast_AsBuilding_Static_Mesh' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, CallFunc_GetHealthPercent_ReturnValue) == 0x00001C, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000021, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_getProxyVisibility, CallFunc_BooleanAND_ReturnValue_1) == 0x000023, "Member 'ShadowProxyMeshComponent_C_getProxyVisibility::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function ShadowProxyMeshComponent.ShadowProxyMeshComponent_C.GetParentComponent
// 0x0050 (0x0050 - 0x0000)
struct ShadowProxyMeshComponent_C_GetParentComponent final
{
public:
	class UMeshComponent*                         AsMesh_Component;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMeshComponent*                         l_comp;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetParentComponents_Parents;              // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_DynamicCast_AsMesh_Component;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShadowProxyMeshComponent_C_GetParentComponent) == 0x000008, "Wrong alignment on ShadowProxyMeshComponent_C_GetParentComponent");
static_assert(sizeof(ShadowProxyMeshComponent_C_GetParentComponent) == 0x000050, "Wrong size on ShadowProxyMeshComponent_C_GetParentComponent");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, AsMesh_Component) == 0x000000, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::AsMesh_Component' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, l_comp) == 0x000008, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::l_comp' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, Temp_int_Array_Index_Variable) == 0x000014, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, CallFunc_GetParentComponents_Parents) == 0x000020, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::CallFunc_GetParentComponents_Parents' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, CallFunc_Array_Get_Item) == 0x000030, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, K2Node_DynamicCast_AsMesh_Component) == 0x000040, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::K2Node_DynamicCast_AsMesh_Component' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowProxyMeshComponent_C_GetParentComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'ShadowProxyMeshComponent_C_GetParentComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ShadowProxyMeshComponent.ShadowProxyMeshComponent_C.ExecuteUbergraph_ShadowProxyMeshComponent
// 0x0058 (0x0058 - 0x0000)
struct ShadowProxyMeshComponent_C_ExecuteUbergraph_ShadowProxyMeshComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_getProxyVisibility_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& CVarName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_Static_Mesh;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_forceShadowDisabled;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataDrivenCVarEngineSubsystem*         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_getParentComponent_AsMesh_Component;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(ShadowProxyMeshComponent_C_ExecuteUbergraph_ShadowProxyMeshComponent) == 0x000008, "Wrong alignment on ShadowProxyMeshComponent_C_ExecuteUbergraph_ShadowProxyMeshComponent");
static_assert(sizeof(ShadowProxyMeshComponent_C_ExecuteUbergraph_ShadowProxyMeshComponent) == 0x000058, "Wrong size on ShadowProxyMeshComponent_C_ExecuteUbergraph_ShadowProxyMeshComponent");
static_assert(offsetof(ShadowProxyMeshComponent_C_ExecuteUbergraph_ShadowProxyMeshComponent, EntryPoint) == 0x000000, "Member 'ShadowProxyMeshComponent_C_ExecuteUbergraph_ShadowProxyMeshComponent::EntryPoint' has a wrong offset!");
