#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shotgun_Core_RapidFire_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Shotgun_Core_RapidFire_AnimBP.Shotgun_Core_RapidFire_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00C7 (0x00C8 - 0x0001)
struct Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_7;                                  // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_8;                                  // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_9;                                // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_10;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0030(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B0(0x0018)()
};
static_assert(alignof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000C8, "Wrong size on Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_7) == 0x000004, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_7' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_8) == 0x000008, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_8' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_9) == 0x000010, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_9' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_10) == 0x000028, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_10' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000030, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B0, "Member 'Shotgun_Core_RapidFire_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

