#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarTagsNoFriendsWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarTagsNoFriendsWidget.SidebarTagsNoFriendsWidget_C
// 0x0020 (0x1060 - 0x1040)
class USidebarTagsNoFriendsWidget_C final : public UFortSidebarTagsNoFriendsEntry
{
public:
	class UImage*                                 Image_LFPIcon;                                     // 0x1040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RText_LFPText;                                     // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarTagsNoFriends_C*                SidebarTagsNoFriends;                              // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarTagsNoFriendsWidget_C">();
	}
	static class USidebarTagsNoFriendsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarTagsNoFriendsWidget_C>();
	}
};
static_assert(alignof(USidebarTagsNoFriendsWidget_C) == 0x000010, "Wrong alignment on USidebarTagsNoFriendsWidget_C");
static_assert(sizeof(USidebarTagsNoFriendsWidget_C) == 0x001060, "Wrong size on USidebarTagsNoFriendsWidget_C");
static_assert(offsetof(USidebarTagsNoFriendsWidget_C, Image_LFPIcon) == 0x001040, "Member 'USidebarTagsNoFriendsWidget_C::Image_LFPIcon' has a wrong offset!");
static_assert(offsetof(USidebarTagsNoFriendsWidget_C, RText_LFPText) == 0x001048, "Member 'USidebarTagsNoFriendsWidget_C::RText_LFPText' has a wrong offset!");
static_assert(offsetof(USidebarTagsNoFriendsWidget_C, SidebarTagsNoFriends) == 0x001050, "Member 'USidebarTagsNoFriendsWidget_C::SidebarTagsNoFriends' has a wrong offset!");

}

