#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgStateActionButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarLfgStateActionButton.SidebarLfgStateActionButton_C.ExecuteUbergraph_SidebarLfgStateActionButton
// 0x0018 (0x0018 - 0x0000)
struct SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton) == 0x000008, "Wrong alignment on SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton");
static_assert(sizeof(SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton) == 0x000018, "Wrong size on SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton");
static_assert(offsetof(SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton, EntryPoint) == 0x000000, "Member 'SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'SidebarLfgStateActionButton_C_ExecuteUbergraph_SidebarLfgStateActionButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function SidebarLfgStateActionButton.SidebarLfgStateActionButton_C.SetText
// 0x0028 (0x0028 - 0x0000)
struct SidebarLfgStateActionButton_C_SetText final
{
public:
	class FString                                 NewLabel;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(SidebarLfgStateActionButton_C_SetText) == 0x000008, "Wrong alignment on SidebarLfgStateActionButton_C_SetText");
static_assert(sizeof(SidebarLfgStateActionButton_C_SetText) == 0x000028, "Wrong size on SidebarLfgStateActionButton_C_SetText");
static_assert(offsetof(SidebarLfgStateActionButton_C_SetText, NewLabel) == 0x000000, "Member 'SidebarLfgStateActionButton_C_SetText::NewLabel' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateActionButton_C_SetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'SidebarLfgStateActionButton_C_SetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

