#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SidebarButton.SidebarButton_C.ExecuteUbergraph_SidebarButton
// 0x0118 (0x0118 - 0x0000)
struct SidebarButton_C_ExecuteUbergraph_SidebarButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue_1;                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0080(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0094(0x0014)()
	float                                         Temp_float_Variable_2;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00AC(0x0014)()
	float                                         Temp_float_Variable_3;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_4;                // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00D8(0x0014)()
	float                                         K2Node_Select_Default_1;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_5;                // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0100(0x0014)()
};
static_assert(alignof(SidebarButton_C_ExecuteUbergraph_SidebarButton) == 0x000008, "Wrong alignment on SidebarButton_C_ExecuteUbergraph_SidebarButton");
static_assert(sizeof(SidebarButton_C_ExecuteUbergraph_SidebarButton) == 0x000118, "Wrong size on SidebarButton_C_ExecuteUbergraph_SidebarButton");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, EntryPoint) == 0x000000, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_float_Variable) == 0x000004, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_IsUsingTouch_ReturnValue) == 0x000020, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_IsMobileGame_ReturnValue) == 0x000022, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_float_Variable_1) == 0x000024, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_bool_Variable) == 0x000028, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_Select_Default) == 0x00002C, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_PlayAnimation_ReturnValue_3) == 0x000030, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_Event_IsDesignTime) == 0x000038, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_GetSelected_ReturnValue) == 0x000039, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue) == 0x00003C, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_IsHovered_ReturnValue) == 0x00004C, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_GetSelected_ReturnValue_1) == 0x00004D, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_GetSelected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_1) == 0x000050, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_2) == 0x000060, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_3) == 0x000070, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor) == 0x000080, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor_1) == 0x000094, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_float_Variable_2) == 0x0000A8, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor_2) == 0x0000AC, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_float_Variable_3) == 0x0000C0, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_4) == 0x0000C4, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_bool_Variable_1) == 0x0000D4, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor_3) == 0x0000D8, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_Select_Default_1) == 0x0000EC, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_5) == 0x0000F0, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor_4) == 0x000100, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");

// Function SidebarButton.SidebarButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SidebarButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarButton_C_PreConstruct) == 0x000001, "Wrong alignment on SidebarButton_C_PreConstruct");
static_assert(sizeof(SidebarButton_C_PreConstruct) == 0x000001, "Wrong size on SidebarButton_C_PreConstruct");
static_assert(offsetof(SidebarButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SidebarButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SidebarButton.SidebarButton_C.SetSkewBoxColor
// 0x0018 (0x0018 - 0x0000)
struct SidebarButton_C_SetSkewBoxColor final
{
public:
	struct FLinearColor                           InputPin;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarButton_C_SetSkewBoxColor) == 0x000008, "Wrong alignment on SidebarButton_C_SetSkewBoxColor");
static_assert(sizeof(SidebarButton_C_SetSkewBoxColor) == 0x000018, "Wrong size on SidebarButton_C_SetSkewBoxColor");
static_assert(offsetof(SidebarButton_C_SetSkewBoxColor, InputPin) == 0x000000, "Member 'SidebarButton_C_SetSkewBoxColor::InputPin' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_SetSkewBoxColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'SidebarButton_C_SetSkewBoxColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

