#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSocialTagFilterCheckboxListEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarSocialTagFilterCheckboxListEntry.SidebarSocialTagFilterCheckboxListEntry_C
// 0x0050 (0x10B0 - 0x1060)
class USidebarSocialTagFilterCheckboxListEntry_C final : public UFortLFGFilterCheckboxEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x1068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1070(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Background;                                 // 0x1078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBox_Checkbox;                                     // 0x1080(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1088(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x1090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x10A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarSocialTagFilterCheckboxListEntry_C">();
	}
	static class USidebarSocialTagFilterCheckboxListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarSocialTagFilterCheckboxListEntry_C>();
	}
};
static_assert(alignof(USidebarSocialTagFilterCheckboxListEntry_C) == 0x000010, "Wrong alignment on USidebarSocialTagFilterCheckboxListEntry_C");
static_assert(sizeof(USidebarSocialTagFilterCheckboxListEntry_C) == 0x0010B0, "Wrong size on USidebarSocialTagFilterCheckboxListEntry_C");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, UberGraphFrame) == 0x001060, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, Unhovered) == 0x001068, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, Hovered) == 0x001070, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, Border_Background) == 0x001078, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::Border_Background' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, SBox_Checkbox) == 0x001080, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::SBox_Checkbox' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, SizeBox_0) == 0x001088, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, EncourageEpicFriend_IdleColor) == 0x001090, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, EncourageEpicFriend_HoveredColor) == 0x0010A0, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

