#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLFGToggleListEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLFGToggleListEntry.SidebarLFGToggleListEntry_C
// 0x0050 (0x10A0 - 0x1050)
class USidebarLFGToggleListEntry_C final : public USidebarLFGToggleListEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x1058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Background;                                 // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextToggle_C*                          SidebarSocialTagsLFPToggle;                        // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x1080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x1090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarLFGToggleListEntry(int32 EntryPoint);
	void OnInitialized();
	void OnLfgSettingChanged(const bool bIsLfgEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLFGToggleListEntry_C">();
	}
	static class USidebarLFGToggleListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLFGToggleListEntry_C>();
	}
};
static_assert(alignof(USidebarLFGToggleListEntry_C) == 0x000010, "Wrong alignment on USidebarLFGToggleListEntry_C");
static_assert(sizeof(USidebarLFGToggleListEntry_C) == 0x0010A0, "Wrong size on USidebarLFGToggleListEntry_C");
static_assert(offsetof(USidebarLFGToggleListEntry_C, UberGraphFrame) == 0x001050, "Member 'USidebarLFGToggleListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLFGToggleListEntry_C, Unhovered) == 0x001058, "Member 'USidebarLFGToggleListEntry_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarLFGToggleListEntry_C, Hovered) == 0x001060, "Member 'USidebarLFGToggleListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarLFGToggleListEntry_C, Border_Background) == 0x001068, "Member 'USidebarLFGToggleListEntry_C::Border_Background' has a wrong offset!");
static_assert(offsetof(USidebarLFGToggleListEntry_C, SidebarSocialTagsLFPToggle) == 0x001070, "Member 'USidebarLFGToggleListEntry_C::SidebarSocialTagsLFPToggle' has a wrong offset!");
static_assert(offsetof(USidebarLFGToggleListEntry_C, SizeBox_0) == 0x001078, "Member 'USidebarLFGToggleListEntry_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(USidebarLFGToggleListEntry_C, EncourageEpicFriend_IdleColor) == 0x001080, "Member 'USidebarLFGToggleListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarLFGToggleListEntry_C, EncourageEpicFriend_HoveredColor) == 0x001090, "Member 'USidebarLFGToggleListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

