#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarUserListHeaderEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SidebarUserListHeaderEntry.SidebarUserListHeaderEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct SidebarUserListHeaderEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarUserListHeaderEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on SidebarUserListHeaderEntry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(SidebarUserListHeaderEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on SidebarUserListHeaderEntry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(SidebarUserListHeaderEntry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'SidebarUserListHeaderEntry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function SidebarUserListHeaderEntry.SidebarUserListHeaderEntry_C.ExecuteUbergraph_SidebarUserListHeaderEntry
// 0x0050 (0x0050 - 0x0000)
struct SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListItemExpanded_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0048(0x0008)(NoDestructor)
};
static_assert(alignof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry) == 0x000008, "Wrong alignment on SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry");
static_assert(sizeof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry) == 0x000050, "Wrong size on SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, EntryPoint) == 0x000000, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, Temp_bool_Variable) == 0x000004, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, Temp_byte_Variable) == 0x000005, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, Temp_byte_Variable_1) == 0x000006, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, K2Node_Event_bIsExpanded) == 0x000018, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, K2Node_Select_Default) == 0x000019, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, CallFunc_GetEndTime_ReturnValue) == 0x000028, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, CallFunc_PlayAnimation_ReturnValue_3) == 0x000030, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, CallFunc_IsListItemExpanded_ReturnValue) == 0x000038, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::CallFunc_IsListItemExpanded_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, K2Node_Event_ListItemObject) == 0x000040, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry, K2Node_Event_InFocusEvent) == 0x000048, "Member 'SidebarUserListHeaderEntry_C_ExecuteUbergraph_SidebarUserListHeaderEntry::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function SidebarUserListHeaderEntry.SidebarUserListHeaderEntry_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct SidebarUserListHeaderEntry_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(SidebarUserListHeaderEntry_C_OnFocusLost) == 0x000004, "Wrong alignment on SidebarUserListHeaderEntry_C_OnFocusLost");
static_assert(sizeof(SidebarUserListHeaderEntry_C_OnFocusLost) == 0x000008, "Wrong size on SidebarUserListHeaderEntry_C_OnFocusLost");
static_assert(offsetof(SidebarUserListHeaderEntry_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'SidebarUserListHeaderEntry_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function SidebarUserListHeaderEntry.SidebarUserListHeaderEntry_C.OnListItemObjectSet_1
// 0x0008 (0x0008 - 0x0000)
struct SidebarUserListHeaderEntry_C_OnListItemObjectSet_1 final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarUserListHeaderEntry_C_OnListItemObjectSet_1) == 0x000008, "Wrong alignment on SidebarUserListHeaderEntry_C_OnListItemObjectSet_1");
static_assert(sizeof(SidebarUserListHeaderEntry_C_OnListItemObjectSet_1) == 0x000008, "Wrong size on SidebarUserListHeaderEntry_C_OnListItemObjectSet_1");
static_assert(offsetof(SidebarUserListHeaderEntry_C_OnListItemObjectSet_1, ListItemObject) == 0x000000, "Member 'SidebarUserListHeaderEntry_C_OnListItemObjectSet_1::ListItemObject' has a wrong offset!");

}

