#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sidebar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Sidebar.Sidebar_C
// 0x0080 (0x0690 - 0x0610)
class USidebar_C final : public UFortSocialPanelView_Sidebar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USidebarProfile_C*                      Panel_Profile;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              Safezone_OnboardingTooltip;                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_SideBar;                                  // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_PartyUp;                                      // 0x0630(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_FindFriends;                                  // 0x0648(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_VoiceChat;                                    // 0x0660(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_UserSettings;                                 // 0x0678(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_Sidebar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sidebar_C">();
	}
	static class USidebar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebar_C>();
	}
};
static_assert(alignof(USidebar_C) == 0x000008, "Wrong alignment on USidebar_C");
static_assert(sizeof(USidebar_C) == 0x000690, "Wrong size on USidebar_C");
static_assert(offsetof(USidebar_C, UberGraphFrame) == 0x000610, "Member 'USidebar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebar_C, Panel_Profile) == 0x000618, "Member 'USidebar_C::Panel_Profile' has a wrong offset!");
static_assert(offsetof(USidebar_C, Safezone_OnboardingTooltip) == 0x000620, "Member 'USidebar_C::Safezone_OnboardingTooltip' has a wrong offset!");
static_assert(offsetof(USidebar_C, SafeZone_SideBar) == 0x000628, "Member 'USidebar_C::SafeZone_SideBar' has a wrong offset!");
static_assert(offsetof(USidebar_C, Text_PartyUp) == 0x000630, "Member 'USidebar_C::Text_PartyUp' has a wrong offset!");
static_assert(offsetof(USidebar_C, Text_FindFriends) == 0x000648, "Member 'USidebar_C::Text_FindFriends' has a wrong offset!");
static_assert(offsetof(USidebar_C, Text_VoiceChat) == 0x000660, "Member 'USidebar_C::Text_VoiceChat' has a wrong offset!");
static_assert(offsetof(USidebar_C, Text_UserSettings) == 0x000678, "Member 'USidebar_C::Text_UserSettings' has a wrong offset!");

}

