#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarVoiceChannelSettings

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarVoiceChannelSettings.SidebarVoiceChannelSettings_C.BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarVoiceChannelSettings.SidebarVoiceChannelSettings_C.BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarVoiceChannelSettings_C_BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarVoiceChannelSettings.SidebarVoiceChannelSettings_C.BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarVoiceChannelSettings_C_BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelSettings_C_BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarVoiceChannelSettings_C_BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SidebarVoiceChannelSettings_C_BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarVoiceChannelSettings_C_BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SidebarVoiceChannelSettings_C_BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarVoiceChannelSettings_C_BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarVoiceChannelSettings.SidebarVoiceChannelSettings_C.ExecuteUbergraph_SidebarVoiceChannelSettings
// 0x0030 (0x0030 - 0x0000)
struct SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings) == 0x000008, "Wrong alignment on SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings");
static_assert(sizeof(SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings) == 0x000030, "Wrong size on SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings");
static_assert(offsetof(SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings, EntryPoint) == 0x000000, "Member 'SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings, K2Node_ComponentBoundEvent_Button_2) == 0x000010, "Member 'SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'SidebarVoiceChannelSettings_C_ExecuteUbergraph_SidebarVoiceChannelSettings::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

