#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarJoinablePartyEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarJoinablePartyEntry.SidebarJoinablePartyEntry_C.BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SidebarJoinablePartyEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarJoinablePartyEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on SidebarJoinablePartyEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(SidebarJoinablePartyEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on SidebarJoinablePartyEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(SidebarJoinablePartyEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'SidebarJoinablePartyEntry_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function SidebarJoinablePartyEntry.SidebarJoinablePartyEntry_C.ExecuteUbergraph_SidebarJoinablePartyEntry
// 0x0090 (0x0090 - 0x0000)
struct SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0040(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0058(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry) == 0x000008, "Wrong alignment on SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry");
static_assert(sizeof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry) == 0x000090, "Wrong size on SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, EntryPoint) == 0x000000, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, Temp_bool_Variable) == 0x000004, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, Temp_int_Variable) == 0x000008, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, Temp_int_Variable_1) == 0x00000C, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, K2Node_ComponentBoundEvent_bIsOpen) == 0x000010, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000030, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_PlayAnimation_ReturnValue_3) == 0x000038, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_GetText_ReturnValue) == 0x000040, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_GetText_ReturnValue_1) == 0x000058, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_Conv_TextToString_ReturnValue) == 0x000070, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_Len_ReturnValue) == 0x000080, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000084, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry, K2Node_Select_Default) == 0x000088, "Member 'SidebarJoinablePartyEntry_C_ExecuteUbergraph_SidebarJoinablePartyEntry::K2Node_Select_Default' has a wrong offset!");

}

