#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgState2ListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLfgState2ListEntry.SidebarLfgState2ListEntry_C
// 0x0080 (0x10D0 - 0x1050)
class USidebarLfgState2ListEntry_C final : public UFortSidebarLfgState2ListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimatedInputBorder;                               // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ButtonSizeBox;                                     // 0x1078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x1080(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x1088(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x1090(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LFGIcon;                                     // 0x1098(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RText_LFGText;                                     // 0x10A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_StateAction;                                  // 0x10A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x10B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     LfgStateTextureArray;                              // 0x10B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarLfgState2ListEntry(int32 EntryPoint);
	void GetIcon(ELfgState LfgState);
	void OnInitialized();
	void OnStateChanged(const ELfgState NewLfgState, const class FText& StateText, const class FText& StateButton);
	void UpdateButtonVisibility(ELfgState LfgState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLfgState2ListEntry_C">();
	}
	static class USidebarLfgState2ListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLfgState2ListEntry_C>();
	}
};
static_assert(alignof(USidebarLfgState2ListEntry_C) == 0x000010, "Wrong alignment on USidebarLfgState2ListEntry_C");
static_assert(sizeof(USidebarLfgState2ListEntry_C) == 0x0010D0, "Wrong size on USidebarLfgState2ListEntry_C");
static_assert(offsetof(USidebarLfgState2ListEntry_C, UberGraphFrame) == 0x001050, "Member 'USidebarLfgState2ListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, Selected) == 0x001058, "Member 'USidebarLfgState2ListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, Hovered) == 0x001060, "Member 'USidebarLfgState2ListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, AnimatedInputBorder) == 0x001068, "Member 'USidebarLfgState2ListEntry_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, Arrow) == 0x001070, "Member 'USidebarLfgState2ListEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, ButtonSizeBox) == 0x001078, "Member 'USidebarLfgState2ListEntry_C::ButtonSizeBox' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x001080, "Member 'USidebarLfgState2ListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, EntryBorder) == 0x001088, "Member 'USidebarLfgState2ListEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, HorizontalBox_0) == 0x001090, "Member 'USidebarLfgState2ListEntry_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, Image_LFGIcon) == 0x001098, "Member 'USidebarLfgState2ListEntry_C::Image_LFGIcon' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, RText_LFGText) == 0x0010A0, "Member 'USidebarLfgState2ListEntry_C::RText_LFGText' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, Text_StateAction) == 0x0010A8, "Member 'USidebarLfgState2ListEntry_C::Text_StateAction' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, UserActionMenuInputButton) == 0x0010B0, "Member 'USidebarLfgState2ListEntry_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2ListEntry_C, LfgStateTextureArray) == 0x0010B8, "Member 'USidebarLfgState2ListEntry_C::LfgStateTextureArray' has a wrong offset!");

}

