#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgStateWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SidebarLfgStateWidget.SidebarLfgStateWidget_C.BndEvt__SidebarLfgStateWidget_StateActionButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SidebarLfgStateWidget_C_BndEvt__SidebarLfgStateWidget_StateActionButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgStateWidget_C_BndEvt__SidebarLfgStateWidget_StateActionButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SidebarLfgStateWidget_C_BndEvt__SidebarLfgStateWidget_StateActionButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SidebarLfgStateWidget_C_BndEvt__SidebarLfgStateWidget_StateActionButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SidebarLfgStateWidget_C_BndEvt__SidebarLfgStateWidget_StateActionButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SidebarLfgStateWidget_C_BndEvt__SidebarLfgStateWidget_StateActionButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SidebarLfgStateWidget_C_BndEvt__SidebarLfgStateWidget_StateActionButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SidebarLfgStateWidget.SidebarLfgStateWidget_C.ChangeIcon
// 0x0020 (0x0020 - 0x0000)
struct SidebarLfgStateWidget_C_ChangeIcon final
{
public:
	ELfgState                                     LfgState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgStateWidget_C_ChangeIcon) == 0x000008, "Wrong alignment on SidebarLfgStateWidget_C_ChangeIcon");
static_assert(sizeof(SidebarLfgStateWidget_C_ChangeIcon) == 0x000020, "Wrong size on SidebarLfgStateWidget_C_ChangeIcon");
static_assert(offsetof(SidebarLfgStateWidget_C_ChangeIcon, LfgState) == 0x000000, "Member 'SidebarLfgStateWidget_C_ChangeIcon::LfgState' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ChangeIcon, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'SidebarLfgStateWidget_C_ChangeIcon::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ChangeIcon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'SidebarLfgStateWidget_C_ChangeIcon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ChangeIcon, CallFunc_Array_Get_Item) == 0x000008, "Member 'SidebarLfgStateWidget_C_ChangeIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ChangeIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'SidebarLfgStateWidget_C_ChangeIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ChangeIcon, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'SidebarLfgStateWidget_C_ChangeIcon::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function SidebarLfgStateWidget.SidebarLfgStateWidget_C.ExecuteUbergraph_SidebarLfgStateWidget
// 0x0030 (0x0030 - 0x0000)
struct SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELfgState                                     K2Node_Event_CurrState;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget) == 0x000008, "Wrong alignment on SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget");
static_assert(sizeof(SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget) == 0x000030, "Wrong size on SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget");
static_assert(offsetof(SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget, EntryPoint) == 0x000000, "Member 'SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget, K2Node_Event_CurrState) == 0x000004, "Member 'SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget::K2Node_Event_CurrState' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'SidebarLfgStateWidget_C_ExecuteUbergraph_SidebarLfgStateWidget::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function SidebarLfgStateWidget.SidebarLfgStateWidget_C.UpdateButtonInteractability
// 0x0002 (0x0002 - 0x0000)
struct SidebarLfgStateWidget_C_UpdateButtonInteractability final
{
public:
	ELfgState                                     ELfgState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgStateWidget_C_UpdateButtonInteractability) == 0x000001, "Wrong alignment on SidebarLfgStateWidget_C_UpdateButtonInteractability");
static_assert(sizeof(SidebarLfgStateWidget_C_UpdateButtonInteractability) == 0x000002, "Wrong size on SidebarLfgStateWidget_C_UpdateButtonInteractability");
static_assert(offsetof(SidebarLfgStateWidget_C_UpdateButtonInteractability, ELfgState) == 0x000000, "Member 'SidebarLfgStateWidget_C_UpdateButtonInteractability::ELfgState' has a wrong offset!");
static_assert(offsetof(SidebarLfgStateWidget_C_UpdateButtonInteractability, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'SidebarLfgStateWidget_C_UpdateButtonInteractability::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SidebarLfgStateWidget.SidebarLfgStateWidget_C.UpdateStateData
// 0x0001 (0x0001 - 0x0000)
struct SidebarLfgStateWidget_C_UpdateStateData final
{
public:
	ELfgState                                     CurrState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgStateWidget_C_UpdateStateData) == 0x000001, "Wrong alignment on SidebarLfgStateWidget_C_UpdateStateData");
static_assert(sizeof(SidebarLfgStateWidget_C_UpdateStateData) == 0x000001, "Wrong size on SidebarLfgStateWidget_C_UpdateStateData");
static_assert(offsetof(SidebarLfgStateWidget_C_UpdateStateData, CurrState) == 0x000000, "Member 'SidebarLfgStateWidget_C_UpdateStateData::CurrState' has a wrong offset!");

}

