#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSocialAddTagWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SidebarSocialTagCategoryStructure_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarSocialAddTagWidget.SidebarSocialAddTagWidget_C
// 0x01F0 (0x11D0 - 0x0FE0)
class USidebarSocialAddTagWidget_C final : public UCommonButtonBase
{
public:
	uint8                                         Pad_FD8[0x8];                                      // 0x0FD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x0FE8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_AddTagBorder;                               // 0x0FF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_AddTag;                                // 0x0FF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarSocialAddingTagWidget_C*        SidebarSocialAddingTagWidget;                      // 0x1000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_Tag;                                      // 0x1008(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_AddTagName;                                   // 0x1010(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           StateChangeLerpTimerHandle;                        // 0x1018(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         StateChangeLerpAlpha;                              // 0x1020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         StateChangeLerpTimeStep;                           // 0x1024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagContentColorWhite;                              // 0x1028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagContentColorBlack;                              // 0x1038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnabledTagOpacity;                                 // 0x1048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisabledTagOpacity;                                // 0x104C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_InnerColor;                                   // 0x1050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_OuterColor;                                   // 0x1054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_TagOpacity;                                   // 0x1058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105C[0x4];                                     // 0x105C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TagCategory_AddTag;                                // 0x1060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 TagCategory_Disabled;                              // 0x1070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FLinearColor                           CurrentInnerColorReference;                        // 0x1080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentOuterColorReference;                        // 0x1090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetInnerColorReference;                         // 0x10A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetOuterColorReference;                         // 0x10B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentTagContentColorReference;                   // 0x10C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetTagContentColorReference;                    // 0x10D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSidebarSocialTagCategoryStructure     TagCategoryStructureReference;                     // 0x10E0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSidebarSocialTagCategoryStructure     DisabledTagCategoryStructureReference;             // 0x1150(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TagBorderMaterialReference;                        // 0x11C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void EventSetTag();
	void ExecuteUbergraph_SidebarSocialAddTagWidget(int32 EntryPoint);
	void FunctionOnHovered();
	void FunctionOnUnhovered();
	void FunctionSetCategoryCustomizationVisibility(ESlateVisibility CategoryCustomizationVisibility);
	void GetCurrentTagBorderColors();
	void InterpolateTagColors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarSocialAddTagWidget_C">();
	}
	static class USidebarSocialAddTagWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarSocialAddTagWidget_C>();
	}
};
static_assert(alignof(USidebarSocialAddTagWidget_C) == 0x000010, "Wrong alignment on USidebarSocialAddTagWidget_C");
static_assert(sizeof(USidebarSocialAddTagWidget_C) == 0x0011D0, "Wrong size on USidebarSocialAddTagWidget_C");
static_assert(offsetof(USidebarSocialAddTagWidget_C, UberGraphFrame) == 0x000FE0, "Member 'USidebarSocialAddTagWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, Hovered) == 0x000FE8, "Member 'USidebarSocialAddTagWidget_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, Border_AddTagBorder) == 0x000FF0, "Member 'USidebarSocialAddTagWidget_C::Border_AddTagBorder' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, RetainerBox_AddTag) == 0x000FF8, "Member 'USidebarSocialAddTagWidget_C::RetainerBox_AddTag' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, SidebarSocialAddingTagWidget) == 0x001000, "Member 'USidebarSocialAddTagWidget_C::SidebarSocialAddingTagWidget' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, Switcher_Tag) == 0x001008, "Member 'USidebarSocialAddTagWidget_C::Switcher_Tag' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, Text_AddTagName) == 0x001010, "Member 'USidebarSocialAddTagWidget_C::Text_AddTagName' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, StateChangeLerpTimerHandle) == 0x001018, "Member 'USidebarSocialAddTagWidget_C::StateChangeLerpTimerHandle' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, StateChangeLerpAlpha) == 0x001020, "Member 'USidebarSocialAddTagWidget_C::StateChangeLerpAlpha' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, StateChangeLerpTimeStep) == 0x001024, "Member 'USidebarSocialAddTagWidget_C::StateChangeLerpTimeStep' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, TagContentColorWhite) == 0x001028, "Member 'USidebarSocialAddTagWidget_C::TagContentColorWhite' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, TagContentColorBlack) == 0x001038, "Member 'USidebarSocialAddTagWidget_C::TagContentColorBlack' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, EnabledTagOpacity) == 0x001048, "Member 'USidebarSocialAddTagWidget_C::EnabledTagOpacity' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, DisabledTagOpacity) == 0x00104C, "Member 'USidebarSocialAddTagWidget_C::DisabledTagOpacity' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, Name_InnerColor) == 0x001050, "Member 'USidebarSocialAddTagWidget_C::Name_InnerColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, Name_OuterColor) == 0x001054, "Member 'USidebarSocialAddTagWidget_C::Name_OuterColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, Name_TagOpacity) == 0x001058, "Member 'USidebarSocialAddTagWidget_C::Name_TagOpacity' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, TagCategory_AddTag) == 0x001060, "Member 'USidebarSocialAddTagWidget_C::TagCategory_AddTag' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, TagCategory_Disabled) == 0x001070, "Member 'USidebarSocialAddTagWidget_C::TagCategory_Disabled' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, CurrentInnerColorReference) == 0x001080, "Member 'USidebarSocialAddTagWidget_C::CurrentInnerColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, CurrentOuterColorReference) == 0x001090, "Member 'USidebarSocialAddTagWidget_C::CurrentOuterColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, TargetInnerColorReference) == 0x0010A0, "Member 'USidebarSocialAddTagWidget_C::TargetInnerColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, TargetOuterColorReference) == 0x0010B0, "Member 'USidebarSocialAddTagWidget_C::TargetOuterColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, CurrentTagContentColorReference) == 0x0010C0, "Member 'USidebarSocialAddTagWidget_C::CurrentTagContentColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, TargetTagContentColorReference) == 0x0010D0, "Member 'USidebarSocialAddTagWidget_C::TargetTagContentColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, TagCategoryStructureReference) == 0x0010E0, "Member 'USidebarSocialAddTagWidget_C::TagCategoryStructureReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, DisabledTagCategoryStructureReference) == 0x001150, "Member 'USidebarSocialAddTagWidget_C::DisabledTagCategoryStructureReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialAddTagWidget_C, TagBorderMaterialReference) == 0x0011C0, "Member 'USidebarSocialAddTagWidget_C::TagBorderMaterialReference' has a wrong offset!");

}

