#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarPanelExit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarPanelExit.SidebarPanelExit_C
// 0x0050 (0x0488 - 0x0438)
class USidebarPanelExit_C final : public UFortSidebarPanelExit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   LogoutAllowedNoButtonsText;                        // 0x0440(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LogoutAndQuitNotAllowedNoButtonsText;              // 0x0458(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuitAllowedNoButtonsText;                          // 0x0470(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__SidebarPanelExit_Button_ExitGame_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SidebarPanelExit_Button_Logout_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void DialogResult_72E03FD949433FCC7FD537BE143F3FA1(EFortDialogResult Result, class FName ResultName);
	void DialogResult_D6C37C7D45574B8D0C2F22B5DE53C01B(EFortDialogResult Result, class FName ResultName);
	void ExecuteUbergraph_SidebarPanelExit(int32 EntryPoint);
	void UpdateNoEnabledButtonsText(const bool bAllowLogout, const bool bAllowQuit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarPanelExit_C">();
	}
	static class USidebarPanelExit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarPanelExit_C>();
	}
};
static_assert(alignof(USidebarPanelExit_C) == 0x000008, "Wrong alignment on USidebarPanelExit_C");
static_assert(sizeof(USidebarPanelExit_C) == 0x000488, "Wrong size on USidebarPanelExit_C");
static_assert(offsetof(USidebarPanelExit_C, UberGraphFrame) == 0x000438, "Member 'USidebarPanelExit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarPanelExit_C, LogoutAllowedNoButtonsText) == 0x000440, "Member 'USidebarPanelExit_C::LogoutAllowedNoButtonsText' has a wrong offset!");
static_assert(offsetof(USidebarPanelExit_C, LogoutAndQuitNotAllowedNoButtonsText) == 0x000458, "Member 'USidebarPanelExit_C::LogoutAndQuitNotAllowedNoButtonsText' has a wrong offset!");
static_assert(offsetof(USidebarPanelExit_C, QuitAllowedNoButtonsText) == 0x000470, "Member 'USidebarPanelExit_C::QuitAllowedNoButtonsText' has a wrong offset!");

}

