#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarUserActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarUserActionMenu.SidebarUserActionMenu_C
// 0x0030 (0x0570 - 0x0540)
class USidebarUserActionMenu_C final : public UFortSidebarSocialInteractionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Platform;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarUserActionMenu(int32 EntryPoint);
	void OnOpened();
	void OnToggleConfirmation(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarUserActionMenu_C">();
	}
	static class USidebarUserActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarUserActionMenu_C>();
	}
};
static_assert(alignof(USidebarUserActionMenu_C) == 0x000008, "Wrong alignment on USidebarUserActionMenu_C");
static_assert(sizeof(USidebarUserActionMenu_C) == 0x000570, "Wrong size on USidebarUserActionMenu_C");
static_assert(offsetof(USidebarUserActionMenu_C, UberGraphFrame) == 0x000540, "Member 'USidebarUserActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarUserActionMenu_C, ConfirmationOpened) == 0x000548, "Member 'USidebarUserActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(USidebarUserActionMenu_C, Opened) == 0x000550, "Member 'USidebarUserActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(USidebarUserActionMenu_C, Border_OnlineStatusIndicator) == 0x000558, "Member 'USidebarUserActionMenu_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(USidebarUserActionMenu_C, EntryBorder) == 0x000560, "Member 'USidebarUserActionMenu_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarUserActionMenu_C, Image_Platform) == 0x000568, "Member 'USidebarUserActionMenu_C::Image_Platform' has a wrong offset!");

}

