#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarVoiceChannelHeaderButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_BP_OnItemExpansionChanged");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on SidebarVoiceChannelHeaderButton_C_BP_OnItemExpansionChanged");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.ExecuteUbergraph_SidebarVoiceChannelHeaderButton
// 0x0070 (0x0070 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveChannel_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveChannel_ReturnValue_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanJoinChannel_ReturnValue;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanJoinChannel_ReturnValue_1;             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListItemExpanded_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActiveAndListening;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActiveOrAvailable;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsAvailableAndNotActive;             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsListening;                         // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowingRestriction;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton) == 0x000008, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton) == 0x000070, "Wrong size on SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, EntryPoint) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, Temp_byte_Variable) == 0x000004, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_IsActiveChannel_ReturnValue) == 0x000018, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_IsActiveChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_IsActiveChannel_ReturnValue_1) == 0x000019, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_IsActiveChannel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_CanJoinChannel_ReturnValue) == 0x00001A, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_CanJoinChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_CanJoinChannel_ReturnValue_1) == 0x00001B, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_CanJoinChannel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_IsListItemExpanded_ReturnValue) == 0x00001C, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_IsListItemExpanded_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_GetEndTime_ReturnValue) == 0x000020, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, K2Node_Event_ListItemObject) == 0x000030, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, K2Node_Event_bIsExpanded) == 0x000038, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000040, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_SelectInt_ReturnValue) == 0x000048, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, Temp_byte_Variable_1) == 0x00004C, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, Temp_bool_Variable) == 0x00004D, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, K2Node_Event_IsDesignTime) == 0x00004E, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, K2Node_Select_Default) == 0x00004F, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000050, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000060, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, K2Node_Event_bIsActiveAndListening) == 0x000068, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::K2Node_Event_bIsActiveAndListening' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, K2Node_Event_bIsActiveOrAvailable) == 0x000069, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::K2Node_Event_bIsActiveOrAvailable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, K2Node_Event_bIsAvailableAndNotActive) == 0x00006A, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::K2Node_Event_bIsAvailableAndNotActive' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, K2Node_Event_bIsListening) == 0x00006B, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::K2Node_Event_bIsListening' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton, K2Node_Event_bShowingRestriction) == 0x00006C, "Member 'SidebarVoiceChannelHeaderButton_C_ExecuteUbergraph_SidebarVoiceChannelHeaderButton::K2Node_Event_bShowingRestriction' has a wrong offset!");

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.OnListItemObjectSet_1
// 0x0008 (0x0008 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_OnListItemObjectSet_1 final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_OnListItemObjectSet_1) == 0x000008, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_OnListItemObjectSet_1");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_OnListItemObjectSet_1) == 0x000008, "Wrong size on SidebarVoiceChannelHeaderButton_C_OnListItemObjectSet_1");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_OnListItemObjectSet_1, ListItemObject) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_OnListItemObjectSet_1::ListItemObject' has a wrong offset!");

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.OnUpdateVisuals
// 0x0005 (0x0005 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals final
{
public:
	bool                                          bIsActiveAndListening;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsActiveOrAvailable;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAvailableAndNotActive;                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsListening;                                      // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowingRestriction;                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals) == 0x000001, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals) == 0x000005, "Wrong size on SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals, bIsActiveAndListening) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals::bIsActiveAndListening' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals, bIsActiveOrAvailable) == 0x000001, "Member 'SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals::bIsActiveOrAvailable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals, bIsAvailableAndNotActive) == 0x000002, "Member 'SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals::bIsAvailableAndNotActive' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals, bIsListening) == 0x000003, "Member 'SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals::bIsListening' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals, bShowingRestriction) == 0x000004, "Member 'SidebarVoiceChannelHeaderButton_C_OnUpdateVisuals::bShowingRestriction' has a wrong offset!");

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_PreConstruct) == 0x000001, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_PreConstruct");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_PreConstruct) == 0x000001, "Wrong size on SidebarVoiceChannelHeaderButton_C_PreConstruct");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.SetActiveAndListeningVisuals
// 0x0054 (0x0054 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals final
{
public:
	bool                                          IsActiveAndListening;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRestricted_0;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x003C(0x0014)()
	bool                                          Temp_bool_Variable_3;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals) == 0x000004, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals) == 0x000054, "Wrong size on SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, IsActiveAndListening) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::IsActiveAndListening' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, IsRestricted_0) == 0x000001, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::IsRestricted_0' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_byte_Variable) == 0x000002, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, CallFunc_SelectFloat_ReturnValue_1) == 0x000008, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_byte_Variable_1) == 0x00000C, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_bool_Variable) == 0x00000D, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_byte_Variable_2) == 0x00000E, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_byte_Variable_3) == 0x00000F, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_bool_Variable_1) == 0x000010, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, K2Node_Select_Default) == 0x000011, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_byte_Variable_4) == 0x000012, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_byte_Variable_5) == 0x000013, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_bool_Variable_2) == 0x000014, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, K2Node_Select_Default_1) == 0x000015, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, K2Node_Select_Default_2) == 0x000016, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_byte_Variable_6) == 0x000017, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_byte_Variable_7) == 0x000018, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, CallFunc_SelectColor_ReturnValue) == 0x00001C, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, CallFunc_SelectColor_ReturnValue_1) == 0x00002C, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, K2Node_MakeStruct_SlateColor) == 0x00003C, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, Temp_bool_Variable_3) == 0x000050, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals, K2Node_Select_Default_3) == 0x000051, "Member 'SidebarVoiceChannelHeaderButton_C_SetActiveAndListeningVisuals::K2Node_Select_Default_3' has a wrong offset!");

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.SetIsActiveOrAvailableVisuals
// 0x0040 (0x0040 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals final
{
public:
	bool                                          IsActiveOrAvailable;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals) == 0x000008, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals) == 0x000040, "Wrong size on SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals, IsActiveOrAvailable) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals::IsActiveOrAvailable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals, Temp_struct_Variable) == 0x000008, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals, Temp_struct_Variable_1) == 0x000018, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals, Temp_bool_Variable) == 0x000028, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals, Temp_byte_Variable) == 0x000029, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals, Temp_byte_Variable_1) == 0x00002A, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals, Temp_bool_Variable_1) == 0x00002B, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals, K2Node_Select_Default) == 0x00002C, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals, K2Node_Select_Default_1) == 0x000030, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsActiveOrAvailableVisuals::K2Node_Select_Default_1' has a wrong offset!");

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.SetIsAvaliableAndNotActiveVisuals
// 0x0005 (0x0005 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals final
{
public:
	bool                                          IsAvaliableAndNotActive;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals) == 0x000001, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals) == 0x000005, "Wrong size on SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals, IsAvaliableAndNotActive) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals::IsAvaliableAndNotActive' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals, Temp_bool_Variable) == 0x000001, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals, Temp_byte_Variable) == 0x000002, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals, Temp_byte_Variable_1) == 0x000003, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals, K2Node_Select_Default) == 0x000004, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsAvaliableAndNotActiveVisuals::K2Node_Select_Default' has a wrong offset!");

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.SetIsListeningVisuals
// 0x0008 (0x0008 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_SetIsListeningVisuals final
{
public:
	bool                                          IsListening;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_SetIsListeningVisuals) == 0x000004, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_SetIsListeningVisuals");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_SetIsListeningVisuals) == 0x000008, "Wrong size on SidebarVoiceChannelHeaderButton_C_SetIsListeningVisuals");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsListeningVisuals, IsListening) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsListeningVisuals::IsListening' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetIsListeningVisuals, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'SidebarVoiceChannelHeaderButton_C_SetIsListeningVisuals::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function SidebarVoiceChannelHeaderButton.SidebarVoiceChannelHeaderButton_C.SetRestrictedVisuals
// 0x0088 (0x0088 - 0x0000)
struct SidebarVoiceChannelHeaderButton_C_SetRestrictedVisuals final
{
public:
	bool                                          IsRestricted_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0014)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarVoiceChannelHeaderButton_C_SetRestrictedVisuals) == 0x000004, "Wrong alignment on SidebarVoiceChannelHeaderButton_C_SetRestrictedVisuals");
static_assert(sizeof(SidebarVoiceChannelHeaderButton_C_SetRestrictedVisuals) == 0x000088, "Wrong size on SidebarVoiceChannelHeaderButton_C_SetRestrictedVisuals");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetRestrictedVisuals, IsRestricted_0) == 0x000000, "Member 'SidebarVoiceChannelHeaderButton_C_SetRestrictedVisuals::IsRestricted_0' has a wrong offset!");
static_assert(offsetof(SidebarVoiceChannelHeaderButton_C_SetRestrictedVisuals, Temp_struct_Variable) == 0x000004, "Member 'SidebarVoiceChannelHeaderButton_C_SetRestrictedVisuals::Temp_struct_Variable' has a wrong offset!");
