#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarEmptyPanelButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarEmptyPanelButton.SidebarEmptyPanelButton_C.ExecuteUbergraph_SidebarEmptyPanelButton
// 0x0018 (0x0018 - 0x0000)
struct SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton) == 0x000008, "Wrong alignment on SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton");
static_assert(sizeof(SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton) == 0x000018, "Wrong size on SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton");
static_assert(offsetof(SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton, EntryPoint) == 0x000000, "Member 'SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'SidebarEmptyPanelButton_C_ExecuteUbergraph_SidebarEmptyPanelButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

