#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgStateWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLfgStateWidget.SidebarLfgStateWidget_C
// 0x0050 (0x10B0 - 0x1060)
class USidebarLfgStateWidget_C final : public UFortSidebarLfgStateEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_LFGIcon;                                     // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RText_LFGText;                                     // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarLfgStateActionButton_C*         StateActionButton;                                 // 0x1078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     LfgStateTextureArray;                              // 0x1080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           LfgStateBodyStringArray;                           // 0x1090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           LfgStateButtonStringArray;                         // 0x10A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__SidebarLfgStateWidget_StateActionButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void ChangeIcon(ELfgState LfgState);
	void ExecuteUbergraph_SidebarLfgStateWidget(int32 EntryPoint);
	void UpdateButtonInteractability(ELfgState ELfgState);
	void UpdateStateData(ELfgState CurrState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLfgStateWidget_C">();
	}
	static class USidebarLfgStateWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLfgStateWidget_C>();
	}
};
static_assert(alignof(USidebarLfgStateWidget_C) == 0x000010, "Wrong alignment on USidebarLfgStateWidget_C");
static_assert(sizeof(USidebarLfgStateWidget_C) == 0x0010B0, "Wrong size on USidebarLfgStateWidget_C");
static_assert(offsetof(USidebarLfgStateWidget_C, UberGraphFrame) == 0x001060, "Member 'USidebarLfgStateWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateWidget_C, Image_LFGIcon) == 0x001068, "Member 'USidebarLfgStateWidget_C::Image_LFGIcon' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateWidget_C, RText_LFGText) == 0x001070, "Member 'USidebarLfgStateWidget_C::RText_LFGText' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateWidget_C, StateActionButton) == 0x001078, "Member 'USidebarLfgStateWidget_C::StateActionButton' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateWidget_C, LfgStateTextureArray) == 0x001080, "Member 'USidebarLfgStateWidget_C::LfgStateTextureArray' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateWidget_C, LfgStateBodyStringArray) == 0x001090, "Member 'USidebarLfgStateWidget_C::LfgStateBodyStringArray' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateWidget_C, LfgStateButtonStringArray) == 0x0010A0, "Member 'USidebarLfgStateWidget_C::LfgStateButtonStringArray' has a wrong offset!");

}

