#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLFGChangeTagsButtonListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SocialUMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLFGChangeTagsButtonListEntry.SidebarLFGChangeTagsButtonListEntry_C
// 0x0060 (0x10B0 - 0x1050)
class USidebarLFGChangeTagsButtonListEntry_C final : public USocialListInteractableEntryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimatedInputBorder;                               // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x1078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x1080(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x1088(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1090(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_ChangeTagsText;                               // 0x1098(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x10A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarLFGChangeTagsButtonListEntry(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLFGChangeTagsButtonListEntry_C">();
	}
	static class USidebarLFGChangeTagsButtonListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLFGChangeTagsButtonListEntry_C>();
	}
};
static_assert(alignof(USidebarLFGChangeTagsButtonListEntry_C) == 0x000010, "Wrong alignment on USidebarLFGChangeTagsButtonListEntry_C");
static_assert(sizeof(USidebarLFGChangeTagsButtonListEntry_C) == 0x0010B0, "Wrong size on USidebarLFGChangeTagsButtonListEntry_C");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, UberGraphFrame) == 0x001050, "Member 'USidebarLFGChangeTagsButtonListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, Selected) == 0x001058, "Member 'USidebarLFGChangeTagsButtonListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, Hovered) == 0x001060, "Member 'USidebarLFGChangeTagsButtonListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, AnimatedInputBorder) == 0x001068, "Member 'USidebarLFGChangeTagsButtonListEntry_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, Arrow) == 0x001070, "Member 'USidebarLFGChangeTagsButtonListEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x001078, "Member 'USidebarLFGChangeTagsButtonListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, EntryBorder) == 0x001080, "Member 'USidebarLFGChangeTagsButtonListEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, HorizontalBox_0) == 0x001088, "Member 'USidebarLFGChangeTagsButtonListEntry_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, SizeBox_0) == 0x001090, "Member 'USidebarLFGChangeTagsButtonListEntry_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, Text_ChangeTagsText) == 0x001098, "Member 'USidebarLFGChangeTagsButtonListEntry_C::Text_ChangeTagsText' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, UserActionMenuInputButton) == 0x0010A0, "Member 'USidebarLFGChangeTagsButtonListEntry_C::UserActionMenuInputButton' has a wrong offset!");

}

