#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarTagsNoFriends

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarTagsNoFriends.SidebarTagsNoFriends_C
// 0x0040 (0x1080 - 0x1040)
class USidebarTagsNoFriends_C final : public UFortSidebarTagsNoFriendsEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoadingEnd;                                        // 0x1048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoadingStart;                                      // 0x1050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unhovered;                                         // 0x1058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Throbber;                                    // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_Button;                                   // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarTagsNoFriends(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarTagsNoFriends_C">();
	}
	static class USidebarTagsNoFriends_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarTagsNoFriends_C>();
	}
};
static_assert(alignof(USidebarTagsNoFriends_C) == 0x000010, "Wrong alignment on USidebarTagsNoFriends_C");
static_assert(sizeof(USidebarTagsNoFriends_C) == 0x001080, "Wrong size on USidebarTagsNoFriends_C");
static_assert(offsetof(USidebarTagsNoFriends_C, UberGraphFrame) == 0x001040, "Member 'USidebarTagsNoFriends_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarTagsNoFriends_C, LoadingEnd) == 0x001048, "Member 'USidebarTagsNoFriends_C::LoadingEnd' has a wrong offset!");
static_assert(offsetof(USidebarTagsNoFriends_C, LoadingStart) == 0x001050, "Member 'USidebarTagsNoFriends_C::LoadingStart' has a wrong offset!");
static_assert(offsetof(USidebarTagsNoFriends_C, Unhovered) == 0x001058, "Member 'USidebarTagsNoFriends_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarTagsNoFriends_C, Hovered) == 0x001060, "Member 'USidebarTagsNoFriends_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarTagsNoFriends_C, Image_Throbber) == 0x001068, "Member 'USidebarTagsNoFriends_C::Image_Throbber' has a wrong offset!");
static_assert(offsetof(USidebarTagsNoFriends_C, Switcher_Button) == 0x001070, "Member 'USidebarTagsNoFriends_C::Switcher_Button' has a wrong offset!");

}

