#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgStateActionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SocialUMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLfgStateActionButton.SidebarLfgStateActionButton_C
// 0x0040 (0x1080 - 0x1040)
class USidebarLfgStateActionButton_C final : public USocialListEntryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoadingEnd;                                        // 0x1048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoadingStart;                                      // 0x1050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unhovered;                                         // 0x1058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonLabel;                                       // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Throbber;                                    // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_Button;                                   // 0x1078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarLfgStateActionButton(int32 EntryPoint);
	void SetText(const class FString& NewLabel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLfgStateActionButton_C">();
	}
	static class USidebarLfgStateActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLfgStateActionButton_C>();
	}
};
static_assert(alignof(USidebarLfgStateActionButton_C) == 0x000010, "Wrong alignment on USidebarLfgStateActionButton_C");
static_assert(sizeof(USidebarLfgStateActionButton_C) == 0x001080, "Wrong size on USidebarLfgStateActionButton_C");
static_assert(offsetof(USidebarLfgStateActionButton_C, UberGraphFrame) == 0x001040, "Member 'USidebarLfgStateActionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateActionButton_C, LoadingEnd) == 0x001048, "Member 'USidebarLfgStateActionButton_C::LoadingEnd' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateActionButton_C, LoadingStart) == 0x001050, "Member 'USidebarLfgStateActionButton_C::LoadingStart' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateActionButton_C, Unhovered) == 0x001058, "Member 'USidebarLfgStateActionButton_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateActionButton_C, Hovered) == 0x001060, "Member 'USidebarLfgStateActionButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateActionButton_C, ButtonLabel) == 0x001068, "Member 'USidebarLfgStateActionButton_C::ButtonLabel' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateActionButton_C, Image_Throbber) == 0x001070, "Member 'USidebarLfgStateActionButton_C::Image_Throbber' has a wrong offset!");
static_assert(offsetof(USidebarLfgStateActionButton_C, Switcher_Button) == 0x001078, "Member 'USidebarLfgStateActionButton_C::Switcher_Button' has a wrong offset!");

}

