#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarJoinablePartyEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarJoinablePartyEntry.SidebarJoinablePartyEntry_C
// 0x0090 (0x1140 - 0x10B0)
class USidebarJoinablePartyEntry_C final : public UFortJoinablePartyListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x10B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x10C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x10C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x10D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_DisplayNames;                             // 0x10D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_PartyPresence;                            // 0x10E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_PartyPresence_Hover;                      // 0x10E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_PartyPresenceText;                        // 0x10F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_PartyPresence_Hover_Marquee;                  // 0x10F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_PartyPresence_Marquee;                        // 0x1100(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x1108(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            InviteFontColor;                                   // 0x1110(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DefaultFontColor;                                  // 0x1124(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarJoinablePartyEntry(int32 EntryPoint);
	void OnPartyPresenceTextUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarJoinablePartyEntry_C">();
	}
	static class USidebarJoinablePartyEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarJoinablePartyEntry_C>();
	}
};
static_assert(alignof(USidebarJoinablePartyEntry_C) == 0x000010, "Wrong alignment on USidebarJoinablePartyEntry_C");
static_assert(sizeof(USidebarJoinablePartyEntry_C) == 0x001140, "Wrong size on USidebarJoinablePartyEntry_C");
static_assert(offsetof(USidebarJoinablePartyEntry_C, UberGraphFrame) == 0x0010B0, "Member 'USidebarJoinablePartyEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, Selected) == 0x0010B8, "Member 'USidebarJoinablePartyEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, Hovered) == 0x0010C0, "Member 'USidebarJoinablePartyEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x0010C8, "Member 'USidebarJoinablePartyEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, EntryBorder) == 0x0010D0, "Member 'USidebarJoinablePartyEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, Switcher_DisplayNames) == 0x0010D8, "Member 'USidebarJoinablePartyEntry_C::Switcher_DisplayNames' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, Switcher_PartyPresence) == 0x0010E0, "Member 'USidebarJoinablePartyEntry_C::Switcher_PartyPresence' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, Switcher_PartyPresence_Hover) == 0x0010E8, "Member 'USidebarJoinablePartyEntry_C::Switcher_PartyPresence_Hover' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, Switcher_PartyPresenceText) == 0x0010F0, "Member 'USidebarJoinablePartyEntry_C::Switcher_PartyPresenceText' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, Text_PartyPresence_Hover_Marquee) == 0x0010F8, "Member 'USidebarJoinablePartyEntry_C::Text_PartyPresence_Hover_Marquee' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, Text_PartyPresence_Marquee) == 0x001100, "Member 'USidebarJoinablePartyEntry_C::Text_PartyPresence_Marquee' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, UserActionMenuInputButton) == 0x001108, "Member 'USidebarJoinablePartyEntry_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, InviteFontColor) == 0x001110, "Member 'USidebarJoinablePartyEntry_C::InviteFontColor' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyEntry_C, DefaultFontColor) == 0x001124, "Member 'USidebarJoinablePartyEntry_C::DefaultFontColor' has a wrong offset!");

}

