#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSettingsListEntry_Scalar_Narrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarSettingsListEntry_Scalar_Narrow.SidebarSettingsListEntry_Scalar_Narrow_C
// 0x0028 (0x0368 - 0x0340)
class USidebarSettingsListEntry_Scalar_Narrow_C final : public UFortSettingsListEntrySetting_Scalar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DefaultValueLayer;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           Progress;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarSettingEntryBackground_C*       SidebarSettingEntryBackground;                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarSettingsListEntry_Scalar_Narrow(int32 EntryPoint);
	class UWidget* GetPrimaryGamepadFocusWidget();
	void OnDefaultValueChanged(float DefaultValue);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnValueChanged(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarSettingsListEntry_Scalar_Narrow_C">();
	}
	static class USidebarSettingsListEntry_Scalar_Narrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarSettingsListEntry_Scalar_Narrow_C>();
	}
};
static_assert(alignof(USidebarSettingsListEntry_Scalar_Narrow_C) == 0x000008, "Wrong alignment on USidebarSettingsListEntry_Scalar_Narrow_C");
static_assert(sizeof(USidebarSettingsListEntry_Scalar_Narrow_C) == 0x000368, "Wrong size on USidebarSettingsListEntry_Scalar_Narrow_C");
static_assert(offsetof(USidebarSettingsListEntry_Scalar_Narrow_C, UberGraphFrame) == 0x000340, "Member 'USidebarSettingsListEntry_Scalar_Narrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Scalar_Narrow_C, OnHover) == 0x000348, "Member 'USidebarSettingsListEntry_Scalar_Narrow_C::OnHover' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Scalar_Narrow_C, DefaultValueLayer) == 0x000350, "Member 'USidebarSettingsListEntry_Scalar_Narrow_C::DefaultValueLayer' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Scalar_Narrow_C, Progress) == 0x000358, "Member 'USidebarSettingsListEntry_Scalar_Narrow_C::Progress' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Scalar_Narrow_C, SidebarSettingEntryBackground) == 0x000360, "Member 'USidebarSettingsListEntry_Scalar_Narrow_C::SidebarSettingEntryBackground' has a wrong offset!");

}

