#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSocialTagWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SidebarSocialTagCategoryStructure_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarSocialTagWidget.SidebarSocialTagWidget_C
// 0x0210 (0x1240 - 0x1030)
class USidebarSocialTagWidget_C final : public USocialTagWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_TagBorder;                                  // 0x1040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SidebarCollectionScreenContainerTabButtonEditTags_C* BP_SidebarCollectionScreenContainerTabButtonEditTags; // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel_TagWidget;                               // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_TagWidget;                             // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_TagCategoryIcon;                          // 0x1060(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarSocialAddingTagWidget_C*        SidebarSocialAddingTagWidget;                      // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_TagCategoryIcon;                            // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_SelectedState;                            // 0x1078(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TagName;                                      // 0x1080(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Name_InnerColor;                                   // 0x1088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_OuterColor;                                   // 0x108C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_TagOpacity;                                   // 0x1090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1094[0x4];                                     // 0x1094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TagCategory_Disabled;                              // 0x1098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FTimerHandle                           StateChangeLerpTimerHandle;                        // 0x10A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         StateChangeLerpAlpha;                              // 0x10B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B4[0x4];                                     // 0x10B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSidebarSocialTagCategoryStructure     TagCategoryStructureReference;                     // 0x10B8(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSidebarSocialTagCategoryStructure     DisabledTagCategoryStructureReference;             // 0x1128(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         StateChangeLerpTimeStep;                           // 0x1198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119C[0x4];                                     // 0x119C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               TagBorderMaterialReference;                        // 0x11A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentInnerColorReference;                        // 0x11A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentOuterColorReference;                        // 0x11B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetInnerColorReference;                         // 0x11C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetOuterColorReference;                         // 0x11D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagContentColorWhite;                              // 0x11E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TagContentColorBlack;                              // 0x11F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentTagContentColorReference;                   // 0x1208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TargetTagContentColorReference;                    // 0x1218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnabledTagOpacity;                                 // 0x1228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisabledTagOpacity;                                // 0x122C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Highlighted;                                       // 0x1230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SidebarSocialTagWidget(int32 EntryPoint);
	void FunctionOnHovered();
	void FunctionOnUnhovered();
	void FunctionSetCategoryCustomizationVisibility(ESlateVisibility CategoryCustomizationVisibility);
	void FunctionSetTag(const class FText& InTagName, ESocialTagCategory InTagCategory, bool InIsSystemTag);
	void FunctionSetTagBorderColors(const struct FLinearColor& InnerColor, const struct FLinearColor& OuterColor);
	void GetCurrentTagBorderColors();
	void InterpolateTagColors();
	void OnTagListEntryHovered();
	void OnTagListEntryUnhovered();
	void SetCategoryCustomizationVisibility(ESlateVisibility CategoryCustomizationVisibility);
	void SetHighlightState(bool bHighlighted);
	void SetTag(const class FText& InTagName, const ESocialTagCategory InTagCategory, const bool bInIsSystemTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarSocialTagWidget_C">();
	}
	static class USidebarSocialTagWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarSocialTagWidget_C>();
	}
};
static_assert(alignof(USidebarSocialTagWidget_C) == 0x000010, "Wrong alignment on USidebarSocialTagWidget_C");
static_assert(sizeof(USidebarSocialTagWidget_C) == 0x001240, "Wrong size on USidebarSocialTagWidget_C");
static_assert(offsetof(USidebarSocialTagWidget_C, UberGraphFrame) == 0x001030, "Member 'USidebarSocialTagWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Hovered) == 0x001038, "Member 'USidebarSocialTagWidget_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Border_TagBorder) == 0x001040, "Member 'USidebarSocialTagWidget_C::Border_TagBorder' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, BP_SidebarCollectionScreenContainerTabButtonEditTags) == 0x001048, "Member 'USidebarSocialTagWidget_C::BP_SidebarCollectionScreenContainerTabButtonEditTags' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, GridPanel_TagWidget) == 0x001050, "Member 'USidebarSocialTagWidget_C::GridPanel_TagWidget' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, RetainerBox_TagWidget) == 0x001058, "Member 'USidebarSocialTagWidget_C::RetainerBox_TagWidget' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, ScaleBox_TagCategoryIcon) == 0x001060, "Member 'USidebarSocialTagWidget_C::ScaleBox_TagCategoryIcon' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, SidebarSocialAddingTagWidget) == 0x001068, "Member 'USidebarSocialTagWidget_C::SidebarSocialAddingTagWidget' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Spacer_TagCategoryIcon) == 0x001070, "Member 'USidebarSocialTagWidget_C::Spacer_TagCategoryIcon' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Switcher_SelectedState) == 0x001078, "Member 'USidebarSocialTagWidget_C::Switcher_SelectedState' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Text_TagName) == 0x001080, "Member 'USidebarSocialTagWidget_C::Text_TagName' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_InnerColor) == 0x001088, "Member 'USidebarSocialTagWidget_C::Name_InnerColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_OuterColor) == 0x00108C, "Member 'USidebarSocialTagWidget_C::Name_OuterColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Name_TagOpacity) == 0x001090, "Member 'USidebarSocialTagWidget_C::Name_TagOpacity' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagCategory_Disabled) == 0x001098, "Member 'USidebarSocialTagWidget_C::TagCategory_Disabled' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, StateChangeLerpTimerHandle) == 0x0010A8, "Member 'USidebarSocialTagWidget_C::StateChangeLerpTimerHandle' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, StateChangeLerpAlpha) == 0x0010B0, "Member 'USidebarSocialTagWidget_C::StateChangeLerpAlpha' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagCategoryStructureReference) == 0x0010B8, "Member 'USidebarSocialTagWidget_C::TagCategoryStructureReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, DisabledTagCategoryStructureReference) == 0x001128, "Member 'USidebarSocialTagWidget_C::DisabledTagCategoryStructureReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, StateChangeLerpTimeStep) == 0x001198, "Member 'USidebarSocialTagWidget_C::StateChangeLerpTimeStep' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagBorderMaterialReference) == 0x0011A0, "Member 'USidebarSocialTagWidget_C::TagBorderMaterialReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, CurrentInnerColorReference) == 0x0011A8, "Member 'USidebarSocialTagWidget_C::CurrentInnerColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, CurrentOuterColorReference) == 0x0011B8, "Member 'USidebarSocialTagWidget_C::CurrentOuterColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TargetInnerColorReference) == 0x0011C8, "Member 'USidebarSocialTagWidget_C::TargetInnerColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TargetOuterColorReference) == 0x0011D8, "Member 'USidebarSocialTagWidget_C::TargetOuterColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagContentColorWhite) == 0x0011E8, "Member 'USidebarSocialTagWidget_C::TagContentColorWhite' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TagContentColorBlack) == 0x0011F8, "Member 'USidebarSocialTagWidget_C::TagContentColorBlack' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, CurrentTagContentColorReference) == 0x001208, "Member 'USidebarSocialTagWidget_C::CurrentTagContentColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, TargetTagContentColorReference) == 0x001218, "Member 'USidebarSocialTagWidget_C::TargetTagContentColorReference' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, EnabledTagOpacity) == 0x001228, "Member 'USidebarSocialTagWidget_C::EnabledTagOpacity' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, DisabledTagOpacity) == 0x00122C, "Member 'USidebarSocialTagWidget_C::DisabledTagOpacity' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagWidget_C, Highlighted) == 0x001230, "Member 'USidebarSocialTagWidget_C::Highlighted' has a wrong offset!");

}

