#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSocialTagFilterCheckboxListEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarSocialTagFilterCheckboxListEntry.SidebarSocialTagFilterCheckboxListEntry_C.ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry
// 0x0040 (0x0040 - 0x0000)
struct SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USidebarSocialTagWidget_C*              K2Node_DynamicCast_AsSidebar_Social_Tag_Widget;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USidebarSocialTagWidget_C*              K2Node_DynamicCast_AsSidebar_Social_Tag_Widget_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry) == 0x000008, "Wrong alignment on SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry");
static_assert(sizeof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry) == 0x000040, "Wrong size on SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry");
static_assert(offsetof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry, EntryPoint) == 0x000000, "Member 'SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry, K2Node_DynamicCast_AsSidebar_Social_Tag_Widget) == 0x000008, "Member 'SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry::K2Node_DynamicCast_AsSidebar_Social_Tag_Widget' has a wrong offset!");
static_assert(offsetof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry, K2Node_DynamicCast_AsSidebar_Social_Tag_Widget_1) == 0x000020, "Member 'SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry::K2Node_DynamicCast_AsSidebar_Social_Tag_Widget_1' has a wrong offset!");
static_assert(offsetof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry, CallFunc_IsMobileGame_ReturnValue) == 0x000038, "Member 'SidebarSocialTagFilterCheckboxListEntry_C_ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");

}

