#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgState2Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLfgState2Widget.SidebarLfgState2Widget_C
// 0x0060 (0x0480 - 0x0420)
class USidebarLfgState2Widget_C final : public UFortSidebarLfgState2Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                AnimatedInputBorder;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ButtonSizeBox;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LFGIcon;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RText_LFGText;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_StateAction;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     LfgStateTextureArray;                              // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SidebarLfgState2Widget(int32 EntryPoint);
	void GetIcon(ELfgState LfgState);
	void OnInitialized();
	void OnStateChanged(const ELfgState NewLfgState, const class FText& StateText, const class FText& StateButton);
	void UpdateButtonVisibility(ELfgState LfgState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLfgState2Widget_C">();
	}
	static class USidebarLfgState2Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLfgState2Widget_C>();
	}
};
static_assert(alignof(USidebarLfgState2Widget_C) == 0x000008, "Wrong alignment on USidebarLfgState2Widget_C");
static_assert(sizeof(USidebarLfgState2Widget_C) == 0x000480, "Wrong size on USidebarLfgState2Widget_C");
static_assert(offsetof(USidebarLfgState2Widget_C, UberGraphFrame) == 0x000420, "Member 'USidebarLfgState2Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, AnimatedInputBorder) == 0x000428, "Member 'USidebarLfgState2Widget_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, Arrow) == 0x000430, "Member 'USidebarLfgState2Widget_C::Arrow' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, ButtonSizeBox) == 0x000438, "Member 'USidebarLfgState2Widget_C::ButtonSizeBox' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, EntryBorder) == 0x000440, "Member 'USidebarLfgState2Widget_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, HorizontalBox_0) == 0x000448, "Member 'USidebarLfgState2Widget_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, Image_LFGIcon) == 0x000450, "Member 'USidebarLfgState2Widget_C::Image_LFGIcon' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, RText_LFGText) == 0x000458, "Member 'USidebarLfgState2Widget_C::RText_LFGText' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, Text_StateAction) == 0x000460, "Member 'USidebarLfgState2Widget_C::Text_StateAction' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, UserActionMenuInputButton) == 0x000468, "Member 'USidebarLfgState2Widget_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(USidebarLfgState2Widget_C, LfgStateTextureArray) == 0x000470, "Member 'USidebarLfgState2Widget_C::LfgStateTextureArray' has a wrong offset!");

}

