#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSocialAddTagWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SidebarSocialTagCategoryStructure_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SidebarSocialAddTagWidget.SidebarSocialAddTagWidget_C.EventSetTag
// 0x0120 (0x0120 - 0x0000)
struct SidebarSocialAddTagWidget_C_EventSetTag final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSidebarSocialTagCategoryStructure     CallFunc_Get_Sidebar_Social_Tag_Category_Structure_SidebarSocialTagCategoryStructure; // 0x0018(0x0070)(HasGetValueTypeHash)
	struct FSidebarSocialTagCategoryStructure     CallFunc_Get_Sidebar_Social_Tag_Category_Structure_SidebarSocialTagCategoryStructure_1; // 0x0088(0x0070)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSocialAddTagWidget_C_EventSetTag) == 0x000008, "Wrong alignment on SidebarSocialAddTagWidget_C_EventSetTag");
static_assert(sizeof(SidebarSocialAddTagWidget_C_EventSetTag) == 0x000120, "Wrong size on SidebarSocialAddTagWidget_C_EventSetTag");
static_assert(offsetof(SidebarSocialAddTagWidget_C_EventSetTag, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'SidebarSocialAddTagWidget_C_EventSetTag::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_EventSetTag, CallFunc_Get_Sidebar_Social_Tag_Category_Structure_SidebarSocialTagCategoryStructure) == 0x000018, "Member 'SidebarSocialAddTagWidget_C_EventSetTag::CallFunc_Get_Sidebar_Social_Tag_Category_Structure_SidebarSocialTagCategoryStructure' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_EventSetTag, CallFunc_Get_Sidebar_Social_Tag_Category_Structure_SidebarSocialTagCategoryStructure_1) == 0x000088, "Member 'SidebarSocialAddTagWidget_C_EventSetTag::CallFunc_Get_Sidebar_Social_Tag_Category_Structure_SidebarSocialTagCategoryStructure_1' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_EventSetTag, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000F8, "Member 'SidebarSocialAddTagWidget_C_EventSetTag::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_EventSetTag, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'SidebarSocialAddTagWidget_C_EventSetTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_EventSetTag, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000108, "Member 'SidebarSocialAddTagWidget_C_EventSetTag::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_EventSetTag, CallFunc_GetEffectMaterial_ReturnValue) == 0x000110, "Member 'SidebarSocialAddTagWidget_C_EventSetTag::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_EventSetTag, CallFunc_IsValid_ReturnValue_1) == 0x000118, "Member 'SidebarSocialAddTagWidget_C_EventSetTag::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function SidebarSocialAddTagWidget.SidebarSocialAddTagWidget_C.ExecuteUbergraph_SidebarSocialAddTagWidget
// 0x0008 (0x0008 - 0x0000)
struct SidebarSocialAddTagWidget_C_ExecuteUbergraph_SidebarSocialAddTagWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSocialAddTagWidget_C_ExecuteUbergraph_SidebarSocialAddTagWidget) == 0x000004, "Wrong alignment on SidebarSocialAddTagWidget_C_ExecuteUbergraph_SidebarSocialAddTagWidget");
static_assert(sizeof(SidebarSocialAddTagWidget_C_ExecuteUbergraph_SidebarSocialAddTagWidget) == 0x000008, "Wrong size on SidebarSocialAddTagWidget_C_ExecuteUbergraph_SidebarSocialAddTagWidget");
static_assert(offsetof(SidebarSocialAddTagWidget_C_ExecuteUbergraph_SidebarSocialAddTagWidget, EntryPoint) == 0x000000, "Member 'SidebarSocialAddTagWidget_C_ExecuteUbergraph_SidebarSocialAddTagWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_ExecuteUbergraph_SidebarSocialAddTagWidget, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'SidebarSocialAddTagWidget_C_ExecuteUbergraph_SidebarSocialAddTagWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SidebarSocialAddTagWidget.SidebarSocialAddTagWidget_C.FunctionOnHovered
// 0x0020 (0x0020 - 0x0000)
struct SidebarSocialAddTagWidget_C_FunctionOnHovered final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSocialAddTagWidget_C_FunctionOnHovered) == 0x000008, "Wrong alignment on SidebarSocialAddTagWidget_C_FunctionOnHovered");
static_assert(sizeof(SidebarSocialAddTagWidget_C_FunctionOnHovered) == 0x000020, "Wrong size on SidebarSocialAddTagWidget_C_FunctionOnHovered");
static_assert(offsetof(SidebarSocialAddTagWidget_C_FunctionOnHovered, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'SidebarSocialAddTagWidget_C_FunctionOnHovered::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_FunctionOnHovered, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'SidebarSocialAddTagWidget_C_FunctionOnHovered::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_FunctionOnHovered, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'SidebarSocialAddTagWidget_C_FunctionOnHovered::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SidebarSocialAddTagWidget.SidebarSocialAddTagWidget_C.FunctionOnUnhovered
// 0x0020 (0x0020 - 0x0000)
struct SidebarSocialAddTagWidget_C_FunctionOnUnhovered final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSocialAddTagWidget_C_FunctionOnUnhovered) == 0x000008, "Wrong alignment on SidebarSocialAddTagWidget_C_FunctionOnUnhovered");
static_assert(sizeof(SidebarSocialAddTagWidget_C_FunctionOnUnhovered) == 0x000020, "Wrong size on SidebarSocialAddTagWidget_C_FunctionOnUnhovered");
static_assert(offsetof(SidebarSocialAddTagWidget_C_FunctionOnUnhovered, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'SidebarSocialAddTagWidget_C_FunctionOnUnhovered::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_FunctionOnUnhovered, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'SidebarSocialAddTagWidget_C_FunctionOnUnhovered::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_FunctionOnUnhovered, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'SidebarSocialAddTagWidget_C_FunctionOnUnhovered::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SidebarSocialAddTagWidget.SidebarSocialAddTagWidget_C.FunctionSetCategoryCustomizationVisibility
// 0x0001 (0x0001 - 0x0000)
struct SidebarSocialAddTagWidget_C_FunctionSetCategoryCustomizationVisibility final
{
public:
	ESlateVisibility                              CategoryCustomizationVisibility;                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSocialAddTagWidget_C_FunctionSetCategoryCustomizationVisibility) == 0x000001, "Wrong alignment on SidebarSocialAddTagWidget_C_FunctionSetCategoryCustomizationVisibility");
static_assert(sizeof(SidebarSocialAddTagWidget_C_FunctionSetCategoryCustomizationVisibility) == 0x000001, "Wrong size on SidebarSocialAddTagWidget_C_FunctionSetCategoryCustomizationVisibility");
static_assert(offsetof(SidebarSocialAddTagWidget_C_FunctionSetCategoryCustomizationVisibility, CategoryCustomizationVisibility) == 0x000000, "Member 'SidebarSocialAddTagWidget_C_FunctionSetCategoryCustomizationVisibility::CategoryCustomizationVisibility' has a wrong offset!");

// Function SidebarSocialAddTagWidget.SidebarSocialAddTagWidget_C.GetCurrentTagBorderColors
// 0x0024 (0x0024 - 0x0000)
struct SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue_1; // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors) == 0x000004, "Wrong alignment on SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors");
static_assert(sizeof(SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors) == 0x000024, "Wrong size on SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors");
static_assert(offsetof(SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000004, "Member 'SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors, CallFunc_K2_GetVectorParameterValue_ReturnValue_1) == 0x000014, "Member 'SidebarSocialAddTagWidget_C_GetCurrentTagBorderColors::CallFunc_K2_GetVectorParameterValue_ReturnValue_1' has a wrong offset!");

}

