#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLocalUserButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SidebarLocalUserButton.SidebarLocalUserButton_C.ExecuteUbergraph_SidebarLocalUserButton
// 0x0098 (0x0098 - 0x0000)
struct SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELocalUserOnlineStatus                        Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELocalUserOnlineStatus                        K2Node_Event_OnlineStatus;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton) == 0x000008, "Wrong alignment on SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton");
static_assert(sizeof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton) == 0x000098, "Wrong size on SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, EntryPoint) == 0x000000, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, Temp_byte_Variable) == 0x000004, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_PlayAnimation_ReturnValue_3) == 0x000020, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_IsUsingTouch_ReturnValue) == 0x000028, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, K2Node_Event_OnlineStatus) == 0x000038, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::K2Node_Event_OnlineStatus' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, K2Node_Select_Default) == 0x00003C, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_IsHovered_ReturnValue) == 0x00004C, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_SelectColor_ReturnValue) == 0x000050, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_GetSelected_ReturnValue) == 0x000060, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, K2Node_Event_IsDesignTime) == 0x000061, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_SelectColor_ReturnValue_1) == 0x000064, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_GetSelected_ReturnValue_1) == 0x000074, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_GetSelected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_SelectColor_ReturnValue_2) == 0x000078, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton, CallFunc_SelectColor_ReturnValue_3) == 0x000088, "Member 'SidebarLocalUserButton_C_ExecuteUbergraph_SidebarLocalUserButton::CallFunc_SelectColor_ReturnValue_3' has a wrong offset!");

// Function SidebarLocalUserButton.SidebarLocalUserButton_C.OnOnlineStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct SidebarLocalUserButton_C_OnOnlineStatusChanged final
{
public:
	ELocalUserOnlineStatus                        OnlineStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLocalUserButton_C_OnOnlineStatusChanged) == 0x000001, "Wrong alignment on SidebarLocalUserButton_C_OnOnlineStatusChanged");
static_assert(sizeof(SidebarLocalUserButton_C_OnOnlineStatusChanged) == 0x000001, "Wrong size on SidebarLocalUserButton_C_OnOnlineStatusChanged");
static_assert(offsetof(SidebarLocalUserButton_C_OnOnlineStatusChanged, OnlineStatus) == 0x000000, "Member 'SidebarLocalUserButton_C_OnOnlineStatusChanged::OnlineStatus' has a wrong offset!");

// Function SidebarLocalUserButton.SidebarLocalUserButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SidebarLocalUserButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLocalUserButton_C_PreConstruct) == 0x000001, "Wrong alignment on SidebarLocalUserButton_C_PreConstruct");
static_assert(sizeof(SidebarLocalUserButton_C_PreConstruct) == 0x000001, "Wrong size on SidebarLocalUserButton_C_PreConstruct");
static_assert(offsetof(SidebarLocalUserButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SidebarLocalUserButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SidebarLocalUserButton.SidebarLocalUserButton_C.SetPresenceIndicatorOutlineColor
// 0x0018 (0x0018 - 0x0000)
struct SidebarLocalUserButton_C_SetPresenceIndicatorOutlineColor final
{
public:
	struct FLinearColor                           Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLocalUserButton_C_SetPresenceIndicatorOutlineColor) == 0x000008, "Wrong alignment on SidebarLocalUserButton_C_SetPresenceIndicatorOutlineColor");
static_assert(sizeof(SidebarLocalUserButton_C_SetPresenceIndicatorOutlineColor) == 0x000018, "Wrong size on SidebarLocalUserButton_C_SetPresenceIndicatorOutlineColor");
static_assert(offsetof(SidebarLocalUserButton_C_SetPresenceIndicatorOutlineColor, Value) == 0x000000, "Member 'SidebarLocalUserButton_C_SetPresenceIndicatorOutlineColor::Value' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_SetPresenceIndicatorOutlineColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'SidebarLocalUserButton_C_SetPresenceIndicatorOutlineColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function SidebarLocalUserButton.SidebarLocalUserButton_C.SetSkewBoxColor
// 0x0018 (0x0018 - 0x0000)
struct SidebarLocalUserButton_C_SetSkewBoxColor final
{
public:
	struct FLinearColor                           InputPin;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLocalUserButton_C_SetSkewBoxColor) == 0x000008, "Wrong alignment on SidebarLocalUserButton_C_SetSkewBoxColor");
static_assert(sizeof(SidebarLocalUserButton_C_SetSkewBoxColor) == 0x000018, "Wrong size on SidebarLocalUserButton_C_SetSkewBoxColor");
static_assert(offsetof(SidebarLocalUserButton_C_SetSkewBoxColor, InputPin) == 0x000000, "Member 'SidebarLocalUserButton_C_SetSkewBoxColor::InputPin' has a wrong offset!");
static_assert(offsetof(SidebarLocalUserButton_C_SetSkewBoxColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'SidebarLocalUserButton_C_SetSkewBoxColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

