#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarOnboardingTagsEditTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarOnboardingTagsEditTooltip.SidebarOnboardingTagsEditTooltip_C
// 0x0038 (0x0490 - 0x0458)
class USidebarOnboardingTagsEditTooltip_C final : public UFortSidebarOnboardTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pulse;                                             // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_106;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_140;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBurst;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarOnboardingTagsEditTooltip(int32 EntryPoint);
	void Finished_00D30FD74E4AD96827646281D0AF44AF();
	void Finished_AC6DBEA34771A9CA6E4921A9C0BEA216();
	void OnEndTooltip();
	void OnShowTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarOnboardingTagsEditTooltip_C">();
	}
	static class USidebarOnboardingTagsEditTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarOnboardingTagsEditTooltip_C>();
	}
};
static_assert(alignof(USidebarOnboardingTagsEditTooltip_C) == 0x000008, "Wrong alignment on USidebarOnboardingTagsEditTooltip_C");
static_assert(sizeof(USidebarOnboardingTagsEditTooltip_C) == 0x000490, "Wrong size on USidebarOnboardingTagsEditTooltip_C");
static_assert(offsetof(USidebarOnboardingTagsEditTooltip_C, UberGraphFrame) == 0x000458, "Member 'USidebarOnboardingTagsEditTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTagsEditTooltip_C, Outro) == 0x000460, "Member 'USidebarOnboardingTagsEditTooltip_C::Outro' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTagsEditTooltip_C, Pulse) == 0x000468, "Member 'USidebarOnboardingTagsEditTooltip_C::Pulse' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTagsEditTooltip_C, CommonRichTextBlock_106) == 0x000470, "Member 'USidebarOnboardingTagsEditTooltip_C::CommonRichTextBlock_106' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTagsEditTooltip_C, CommonRichTextBlock_140) == 0x000478, "Member 'USidebarOnboardingTagsEditTooltip_C::CommonRichTextBlock_140' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTagsEditTooltip_C, Image_Arrow) == 0x000480, "Member 'USidebarOnboardingTagsEditTooltip_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(USidebarOnboardingTagsEditTooltip_C, ImageBurst) == 0x000488, "Member 'USidebarOnboardingTagsEditTooltip_C::ImageBurst' has a wrong offset!");

}

