#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLfgState2Widget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SidebarLfgState2Widget.SidebarLfgState2Widget_C.ExecuteUbergraph_SidebarLfgState2Widget
// 0x0058 (0x0058 - 0x0000)
struct SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELfgState                                     K2Node_Event_NewLfgState;                          // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_StateText;                            // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_StateButton;                          // 0x0020(0x0018)(ConstParm)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget) == 0x000008, "Wrong alignment on SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget");
static_assert(sizeof(SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget) == 0x000058, "Wrong size on SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget");
static_assert(offsetof(SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget, EntryPoint) == 0x000000, "Member 'SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget, K2Node_Event_NewLfgState) == 0x000004, "Member 'SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget::K2Node_Event_NewLfgState' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget, K2Node_Event_StateText) == 0x000008, "Member 'SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget::K2Node_Event_StateText' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget, K2Node_Event_StateButton) == 0x000020, "Member 'SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget::K2Node_Event_StateButton' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget, K2Node_MakeStruct_Margin) == 0x000038, "Member 'SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget, CallFunc_IsMobileGame_ReturnValue) == 0x000048, "Member 'SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000050, "Member 'SidebarLfgState2Widget_C_ExecuteUbergraph_SidebarLfgState2Widget::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");

// Function SidebarLfgState2Widget.SidebarLfgState2Widget_C.GetIcon
// 0x0020 (0x0020 - 0x0000)
struct SidebarLfgState2Widget_C_GetIcon final
{
public:
	ELfgState                                     LfgState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgState2Widget_C_GetIcon) == 0x000008, "Wrong alignment on SidebarLfgState2Widget_C_GetIcon");
static_assert(sizeof(SidebarLfgState2Widget_C_GetIcon) == 0x000020, "Wrong size on SidebarLfgState2Widget_C_GetIcon");
static_assert(offsetof(SidebarLfgState2Widget_C_GetIcon, LfgState) == 0x000000, "Member 'SidebarLfgState2Widget_C_GetIcon::LfgState' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_GetIcon, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'SidebarLfgState2Widget_C_GetIcon::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_GetIcon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'SidebarLfgState2Widget_C_GetIcon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_GetIcon, CallFunc_Array_Get_Item) == 0x000008, "Member 'SidebarLfgState2Widget_C_GetIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_GetIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'SidebarLfgState2Widget_C_GetIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_GetIcon, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'SidebarLfgState2Widget_C_GetIcon::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function SidebarLfgState2Widget.SidebarLfgState2Widget_C.OnStateChanged
// 0x0038 (0x0038 - 0x0000)
struct SidebarLfgState2Widget_C_OnStateChanged final
{
public:
	ELfgState                                     NewLfgState;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   StateText;                                         // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   StateButton;                                       // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SidebarLfgState2Widget_C_OnStateChanged) == 0x000008, "Wrong alignment on SidebarLfgState2Widget_C_OnStateChanged");
static_assert(sizeof(SidebarLfgState2Widget_C_OnStateChanged) == 0x000038, "Wrong size on SidebarLfgState2Widget_C_OnStateChanged");
static_assert(offsetof(SidebarLfgState2Widget_C_OnStateChanged, NewLfgState) == 0x000000, "Member 'SidebarLfgState2Widget_C_OnStateChanged::NewLfgState' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_OnStateChanged, StateText) == 0x000008, "Member 'SidebarLfgState2Widget_C_OnStateChanged::StateText' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_OnStateChanged, StateButton) == 0x000020, "Member 'SidebarLfgState2Widget_C_OnStateChanged::StateButton' has a wrong offset!");

// Function SidebarLfgState2Widget.SidebarLfgState2Widget_C.UpdateButtonVisibility
// 0x0002 (0x0002 - 0x0000)
struct SidebarLfgState2Widget_C_UpdateButtonVisibility final
{
public:
	ELfgState                                     LfgState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarLfgState2Widget_C_UpdateButtonVisibility) == 0x000001, "Wrong alignment on SidebarLfgState2Widget_C_UpdateButtonVisibility");
static_assert(sizeof(SidebarLfgState2Widget_C_UpdateButtonVisibility) == 0x000002, "Wrong size on SidebarLfgState2Widget_C_UpdateButtonVisibility");
static_assert(offsetof(SidebarLfgState2Widget_C_UpdateButtonVisibility, LfgState) == 0x000000, "Member 'SidebarLfgState2Widget_C_UpdateButtonVisibility::LfgState' has a wrong offset!");
static_assert(offsetof(SidebarLfgState2Widget_C_UpdateButtonVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'SidebarLfgState2Widget_C_UpdateButtonVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

