#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarEditNicknameButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarEditNicknameButton.SidebarEditNicknameButton_C.ExecuteUbergraph_SidebarEditNicknameButton
// 0x0018 (0x0018 - 0x0000)
struct SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton) == 0x000008, "Wrong alignment on SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton");
static_assert(sizeof(SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton) == 0x000018, "Wrong size on SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton");
static_assert(offsetof(SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton, EntryPoint) == 0x000000, "Member 'SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'SidebarEditNicknameButton_C_ExecuteUbergraph_SidebarEditNicknameButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

