#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SignInWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SignInWidget.SignInWidget_C
// 0x0018 (0x05B8 - 0x05A0)
class USignInWidget_C final : public UFortSignInWidget
{
public:
	class UNamedSlot*                             ButtonSlot;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CommonLazyImage_0;                                 // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ContentBox;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SignInWidget_C">();
	}
	static class USignInWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInWidget_C>();
	}
};
static_assert(alignof(USignInWidget_C) == 0x000008, "Wrong alignment on USignInWidget_C");
static_assert(sizeof(USignInWidget_C) == 0x0005B8, "Wrong size on USignInWidget_C");
static_assert(offsetof(USignInWidget_C, ButtonSlot) == 0x0005A0, "Member 'USignInWidget_C::ButtonSlot' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, CommonLazyImage_0) == 0x0005A8, "Member 'USignInWidget_C::CommonLazyImage_0' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, ContentBox) == 0x0005B0, "Member 'USignInWidget_C::ContentBox' has a wrong offset!");

}

