#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkewButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SkewButton.SkewButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SkewButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkewButton_C_PreConstruct) == 0x000001, "Wrong alignment on SkewButton_C_PreConstruct");
static_assert(sizeof(SkewButton_C_PreConstruct) == 0x000001, "Wrong size on SkewButton_C_PreConstruct");
static_assert(offsetof(SkewButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SkewButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SkewButton.SkewButton_C.OnTouchStarted
// 0x0248 (0x0248 - 0x0000)
struct SkewButton_C_OnTouchStarted final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0188(0x00B8)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkewButton_C_OnTouchStarted) == 0x000008, "Wrong alignment on SkewButton_C_OnTouchStarted");
static_assert(sizeof(SkewButton_C_OnTouchStarted) == 0x000248, "Wrong size on SkewButton_C_OnTouchStarted");
static_assert(offsetof(SkewButton_C_OnTouchStarted, MyGeometry) == 0x000000, "Member 'SkewButton_C_OnTouchStarted::MyGeometry' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnTouchStarted, InTouchEvent) == 0x000040, "Member 'SkewButton_C_OnTouchStarted::InTouchEvent' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnTouchStarted, ReturnValue) == 0x0000D0, "Member 'SkewButton_C_OnTouchStarted::ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnTouchStarted, CallFunc_Unhandled_ReturnValue) == 0x000188, "Member 'SkewButton_C_OnTouchStarted::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnTouchStarted, CallFunc_PlayAnimation_ReturnValue) == 0x000240, "Member 'SkewButton_C_OnTouchStarted::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SkewButton.SkewButton_C.OnTouchEnded
// 0x0248 (0x0248 - 0x0000)
struct SkewButton_C_OnTouchEnded final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0188(0x00B8)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkewButton_C_OnTouchEnded) == 0x000008, "Wrong alignment on SkewButton_C_OnTouchEnded");
static_assert(sizeof(SkewButton_C_OnTouchEnded) == 0x000248, "Wrong size on SkewButton_C_OnTouchEnded");
static_assert(offsetof(SkewButton_C_OnTouchEnded, MyGeometry) == 0x000000, "Member 'SkewButton_C_OnTouchEnded::MyGeometry' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnTouchEnded, InTouchEvent) == 0x000040, "Member 'SkewButton_C_OnTouchEnded::InTouchEvent' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnTouchEnded, ReturnValue) == 0x0000D0, "Member 'SkewButton_C_OnTouchEnded::ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnTouchEnded, CallFunc_Unhandled_ReturnValue) == 0x000188, "Member 'SkewButton_C_OnTouchEnded::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnTouchEnded, CallFunc_PlayAnimation_ReturnValue) == 0x000240, "Member 'SkewButton_C_OnTouchEnded::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SkewButton.SkewButton_C.OnMouseLeave
// 0x0090 (0x0090 - 0x0000)
struct SkewButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SkewButton_C_OnMouseLeave) == 0x000008, "Wrong alignment on SkewButton_C_OnMouseLeave");
static_assert(sizeof(SkewButton_C_OnMouseLeave) == 0x000090, "Wrong size on SkewButton_C_OnMouseLeave");
static_assert(offsetof(SkewButton_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'SkewButton_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function SkewButton.SkewButton_C.OnMouseEnter
// 0x00D0 (0x00D0 - 0x0000)
struct SkewButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SkewButton_C_OnMouseEnter) == 0x000008, "Wrong alignment on SkewButton_C_OnMouseEnter");
static_assert(sizeof(SkewButton_C_OnMouseEnter) == 0x0000D0, "Wrong size on SkewButton_C_OnMouseEnter");
static_assert(offsetof(SkewButton_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'SkewButton_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'SkewButton_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function SkewButton.SkewButton_C.OnMouseButtonUp
// 0x0248 (0x0248 - 0x0000)
struct SkewButton_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0188(0x00B8)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkewButton_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on SkewButton_C_OnMouseButtonUp");
static_assert(sizeof(SkewButton_C_OnMouseButtonUp) == 0x000248, "Wrong size on SkewButton_C_OnMouseButtonUp");
static_assert(offsetof(SkewButton_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'SkewButton_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnMouseButtonUp, MouseEvent) == 0x000040, "Member 'SkewButton_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnMouseButtonUp, ReturnValue) == 0x0000D0, "Member 'SkewButton_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnMouseButtonUp, CallFunc_Unhandled_ReturnValue) == 0x000188, "Member 'SkewButton_C_OnMouseButtonUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnMouseButtonUp, CallFunc_PlayAnimation_ReturnValue) == 0x000240, "Member 'SkewButton_C_OnMouseButtonUp::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SkewButton.SkewButton_C.OnMouseButtonDown
// 0x0248 (0x0248 - 0x0000)
struct SkewButton_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0188(0x00B8)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkewButton_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on SkewButton_C_OnMouseButtonDown");
static_assert(sizeof(SkewButton_C_OnMouseButtonDown) == 0x000248, "Wrong size on SkewButton_C_OnMouseButtonDown");
static_assert(offsetof(SkewButton_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'SkewButton_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnMouseButtonDown, MouseEvent) == 0x000040, "Member 'SkewButton_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnMouseButtonDown, ReturnValue) == 0x0000D0, "Member 'SkewButton_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000188, "Member 'SkewButton_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_OnMouseButtonDown, CallFunc_PlayAnimation_ReturnValue) == 0x000240, "Member 'SkewButton_C_OnMouseButtonDown::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SkewButton.SkewButton_C.ExecuteUbergraph_SkewButton
// 0x0208 (0x0208 - 0x0000)
struct SkewButton_C_ExecuteUbergraph_SkewButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_H;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_S;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_V;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_A;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0068(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00A8(0x0090)(ConstParm)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0150(0x0090)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkewButton_C_ExecuteUbergraph_SkewButton) == 0x000008, "Wrong alignment on SkewButton_C_ExecuteUbergraph_SkewButton");
static_assert(sizeof(SkewButton_C_ExecuteUbergraph_SkewButton) == 0x000208, "Wrong size on SkewButton_C_ExecuteUbergraph_SkewButton");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, EntryPoint) == 0x000000, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, Temp_bool_Variable) == 0x000004, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00000C, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_RGBToHSV_H) == 0x000020, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_RGBToHSV_H' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_RGBToHSV_S) == 0x000024, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_RGBToHSV_S' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_RGBToHSV_V) == 0x000028, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_RGBToHSV_V' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_RGBToHSV_A) == 0x00002C, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_RGBToHSV_A' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_HSVToRGB_ReturnValue) == 0x000040, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_HSVToRGB_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, Temp_bool_Variable_1) == 0x000050, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, Temp_object_Variable) == 0x000058, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, Temp_object_Variable_1) == 0x000060, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, K2Node_Event_MyGeometry) == 0x000068, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, K2Node_Event_MouseEvent_1) == 0x0000A8, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, K2Node_Select_Default) == 0x000138, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_PlayAnimation_ReturnValue) == 0x000140, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000148, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, K2Node_Event_MouseEvent) == 0x000150, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, K2Node_Event_IsDesignTime) == 0x0001E0, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_BreakColor_R) == 0x0001E4, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_BreakColor_G) == 0x0001E8, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_BreakColor_B) == 0x0001EC, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_BreakColor_A) == 0x0001F0, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0001F4, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkewButton_C_ExecuteUbergraph_SkewButton, K2Node_Select_Default_1) == 0x0001F8, "Member 'SkewButton_C_ExecuteUbergraph_SkewButton::K2Node_Select_Default_1' has a wrong offset!");

}

