#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SleepyTimePrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SleepyTimePrompt.SleepyTimePrompt_C
// 0x0048 (0x0378 - 0x0330)
class USleepyTimePrompt_C final : public UFortHUDTagPromptWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeLeft;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeRight;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIEmitter_C*                           UIEmitter;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void CloseWidget();
	void ExecuteUbergraph_SleepyTimePrompt(int32 EntryPoint);
	void OpenWidget(const struct FFortHUDTagPromptData& PrompData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SleepyTimePrompt_C">();
	}
	static class USleepyTimePrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USleepyTimePrompt_C>();
	}
};
static_assert(alignof(USleepyTimePrompt_C) == 0x000008, "Wrong alignment on USleepyTimePrompt_C");
static_assert(sizeof(USleepyTimePrompt_C) == 0x000378, "Wrong size on USleepyTimePrompt_C");
static_assert(offsetof(USleepyTimePrompt_C, UberGraphFrame) == 0x000330, "Member 'USleepyTimePrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USleepyTimePrompt_C, Outro) == 0x000338, "Member 'USleepyTimePrompt_C::Outro' has a wrong offset!");
static_assert(offsetof(USleepyTimePrompt_C, Intro) == 0x000340, "Member 'USleepyTimePrompt_C::Intro' has a wrong offset!");
static_assert(offsetof(USleepyTimePrompt_C, Image_FiligreeLeft) == 0x000348, "Member 'USleepyTimePrompt_C::Image_FiligreeLeft' has a wrong offset!");
static_assert(offsetof(USleepyTimePrompt_C, Image_FiligreeRight) == 0x000350, "Member 'USleepyTimePrompt_C::Image_FiligreeRight' has a wrong offset!");
static_assert(offsetof(USleepyTimePrompt_C, Image_Shadow) == 0x000358, "Member 'USleepyTimePrompt_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(USleepyTimePrompt_C, Text_Description) == 0x000360, "Member 'USleepyTimePrompt_C::Text_Description' has a wrong offset!");
static_assert(offsetof(USleepyTimePrompt_C, Text_Title) == 0x000368, "Member 'USleepyTimePrompt_C::Text_Title' has a wrong offset!");
static_assert(offsetof(USleepyTimePrompt_C, UIEmitter) == 0x000370, "Member 'USleepyTimePrompt_C::UIEmitter' has a wrong offset!");

}

