#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlidingLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SlidingLayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SlidingLayerAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on SlidingLayerAnimBP_C_AnimGraph");
static_assert(sizeof(SlidingLayerAnimBP_C_AnimGraph) == 0x000010, "Wrong size on SlidingLayerAnimBP_C_AnimGraph");
static_assert(offsetof(SlidingLayerAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'SlidingLayerAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct SlidingLayerAnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlidingLayerAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on SlidingLayerAnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(SlidingLayerAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on SlidingLayerAnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(SlidingLayerAnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'SlidingLayerAnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.ExecuteUbergraph_SlidingLayerAnimBP
// 0x0008 (0x0008 - 0x0000)
struct SlidingLayerAnimBP_C_ExecuteUbergraph_SlidingLayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlidingLayerAnimBP_C_ExecuteUbergraph_SlidingLayerAnimBP) == 0x000004, "Wrong alignment on SlidingLayerAnimBP_C_ExecuteUbergraph_SlidingLayerAnimBP");
static_assert(sizeof(SlidingLayerAnimBP_C_ExecuteUbergraph_SlidingLayerAnimBP) == 0x000008, "Wrong size on SlidingLayerAnimBP_C_ExecuteUbergraph_SlidingLayerAnimBP");
static_assert(offsetof(SlidingLayerAnimBP_C_ExecuteUbergraph_SlidingLayerAnimBP, EntryPoint) == 0x000000, "Member 'SlidingLayerAnimBP_C_ExecuteUbergraph_SlidingLayerAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP_C_ExecuteUbergraph_SlidingLayerAnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'SlidingLayerAnimBP_C_ExecuteUbergraph_SlidingLayerAnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_LocomotionUpperBodyAdditive
// 0x0020 (0x0020 - 0x0000)
struct SlidingLayerAnimBP_C_MovementMode_LocomotionUpperBodyAdditive final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MovementMode_LocomotionUpperBodyAdditive_0;        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SlidingLayerAnimBP_C_MovementMode_LocomotionUpperBodyAdditive) == 0x000008, "Wrong alignment on SlidingLayerAnimBP_C_MovementMode_LocomotionUpperBodyAdditive");
static_assert(sizeof(SlidingLayerAnimBP_C_MovementMode_LocomotionUpperBodyAdditive) == 0x000020, "Wrong size on SlidingLayerAnimBP_C_MovementMode_LocomotionUpperBodyAdditive");
static_assert(offsetof(SlidingLayerAnimBP_C_MovementMode_LocomotionUpperBodyAdditive, InPose_0) == 0x000000, "Member 'SlidingLayerAnimBP_C_MovementMode_LocomotionUpperBodyAdditive::InPose_0' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP_C_MovementMode_LocomotionUpperBodyAdditive, MovementMode_LocomotionUpperBodyAdditive_0) == 0x000010, "Member 'SlidingLayerAnimBP_C_MovementMode_LocomotionUpperBodyAdditive::MovementMode_LocomotionUpperBodyAdditive_0' has a wrong offset!");

// Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_LowerBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct SlidingLayerAnimBP_C_MovementMode_LowerBodyOverride final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MovementMode_LowerBodyOverride_0;                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SlidingLayerAnimBP_C_MovementMode_LowerBodyOverride) == 0x000008, "Wrong alignment on SlidingLayerAnimBP_C_MovementMode_LowerBodyOverride");
static_assert(sizeof(SlidingLayerAnimBP_C_MovementMode_LowerBodyOverride) == 0x000020, "Wrong size on SlidingLayerAnimBP_C_MovementMode_LowerBodyOverride");
static_assert(offsetof(SlidingLayerAnimBP_C_MovementMode_LowerBodyOverride, InPose) == 0x000000, "Member 'SlidingLayerAnimBP_C_MovementMode_LowerBodyOverride::InPose' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP_C_MovementMode_LowerBodyOverride, MovementMode_LowerBodyOverride_0) == 0x000010, "Member 'SlidingLayerAnimBP_C_MovementMode_LowerBodyOverride::MovementMode_LowerBodyOverride_0' has a wrong offset!");

// Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_UpperBodyPose
// 0x0020 (0x0020 - 0x0000)
struct SlidingLayerAnimBP_C_MovementMode_UpperBodyPose final
{
public:
	struct FPoseLink                              UppperBodyPose_BasePose;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MovementMode_UpperBodyPose_0;                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SlidingLayerAnimBP_C_MovementMode_UpperBodyPose) == 0x000008, "Wrong alignment on SlidingLayerAnimBP_C_MovementMode_UpperBodyPose");
static_assert(sizeof(SlidingLayerAnimBP_C_MovementMode_UpperBodyPose) == 0x000020, "Wrong size on SlidingLayerAnimBP_C_MovementMode_UpperBodyPose");
static_assert(offsetof(SlidingLayerAnimBP_C_MovementMode_UpperBodyPose, UppperBodyPose_BasePose) == 0x000000, "Member 'SlidingLayerAnimBP_C_MovementMode_UpperBodyPose::UppperBodyPose_BasePose' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP_C_MovementMode_UpperBodyPose, MovementMode_UpperBodyPose_0) == 0x000010, "Member 'SlidingLayerAnimBP_C_MovementMode_UpperBodyPose::MovementMode_UpperBodyPose_0' has a wrong offset!");

}

