#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlidingLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01C7 (0x01C8 - 0x0001)
struct SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_260;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_261;                                  // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_262;                                // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_263;                                  // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_264;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_265;                               // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_266;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_267;                            // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_268;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_269;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_270;                                  // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_271;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_272;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_273;                            // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_274;                                  // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_275;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_276;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_277;                            // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_278;                                  // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_279;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_280;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_281;                                 // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_282;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_283;                                  // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_284;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_285;                                // 0x00A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_286;                               // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_287;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_288;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_289;                               // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_290;                              // 0x00CC(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_291;                               // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_292;                            // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_293;                                // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_294;                                // 0x0109(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_295;                                // 0x010A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_296;                              // 0x0110(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_297;                                // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_298;                                // 0x012C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0130(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01B0(0x0018)()
};
static_assert(alignof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001C8, "Wrong size on SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_260) == 0x000004, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_260' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_261) == 0x000008, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_261' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_262) == 0x000010, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_262' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_263) == 0x000018, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_263' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_264) == 0x000020, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_264' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_265) == 0x000028, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_265' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_266) == 0x000038, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_266' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_267) == 0x000040, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_267' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_268) == 0x000048, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_268' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_269) == 0x00004C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_269' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_270) == 0x000050, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_270' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_271) == 0x000058, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_271' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_272) == 0x00005C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_272' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_273) == 0x000060, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_273' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_274) == 0x000068, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_274' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_275) == 0x000070, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_275' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_276) == 0x000074, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_276' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_277) == 0x000078, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_277' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_278) == 0x000080, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_278' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_279) == 0x000088, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_279' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_280) == 0x00008C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_280' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_281) == 0x000090, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_281' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_282) == 0x000098, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_282' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_283) == 0x0000A0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_283' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_284) == 0x0000A8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_284' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_285) == 0x0000A9, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_285' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_286) == 0x0000B0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_286' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_287) == 0x0000C0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_287' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_288) == 0x0000C4, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_288' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_289) == 0x0000C8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_289' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_290) == 0x0000CC, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_290' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_291) == 0x0000F8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_291' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_292) == 0x000100, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_292' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_293) == 0x000108, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_293' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_294) == 0x000109, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_294' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_295) == 0x00010A, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_295' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_296) == 0x000110, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_296' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_297) == 0x000128, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_297' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_298) == 0x00012C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_298' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000130, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001B0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x003F (0x0040 - 0x0001)
struct SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000040, "Wrong size on SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000010, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00001C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000020, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000024, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000028, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x00002C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000030, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000034, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x000038, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_13) == 0x00003C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_13' has a wrong offset!");

}

