#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Slurp_Jellyfish_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Slurp_Jellyfish_AnimBP.Slurp_Jellyfish_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	ERefPoseType                                  __ByteProperty_13;                                 // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_14;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_15;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_16;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_13) == 0x000001, "Member 'Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_13' has a wrong offset!");
static_assert(offsetof(Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_14) == 0x000004, "Member 'Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_14' has a wrong offset!");
static_assert(offsetof(Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_15) == 0x000008, "Member 'Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_15' has a wrong offset!");
static_assert(offsetof(Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_16) == 0x000010, "Member 'Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_16' has a wrong offset!");
static_assert(offsetof(Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'Slurp_Jellyfish_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

