#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlurpSoldierHelpers

#include "Basic.hpp"


namespace SDK::Params
{

// Function SlurpSoldierHelpers.SlurpSoldierHelpers_C.GetShieldPercentageFromOwnerMeshComponent
// 0x0060 (0x0060 - 0x0000)
struct SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent final
{
public:
	class USkeletalMeshComponent*                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShieldPercentage;                                  // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerAnimInstance*                K2Node_DynamicCast_AsFort_Player_Anim_Instance;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateZone*                   K2Node_DynamicCast_AsFort_Player_State_Zone;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthAndShields_Health;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthAndShields_HealthMax;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthAndShields_Shield;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthAndShields_ShieldMax;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent) == 0x000008, "Wrong alignment on SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent");
static_assert(sizeof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent) == 0x000060, "Wrong size on SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, Owner) == 0x000000, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::Owner' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, __WorldContext) == 0x000008, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::__WorldContext' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, ShieldPercentage) == 0x000010, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::ShieldPercentage' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_GetCurveValue_ReturnValue) == 0x000020, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, K2Node_DynamicCast_AsFort_Player_Anim_Instance) == 0x000028, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::K2Node_DynamicCast_AsFort_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, K2Node_DynamicCast_AsFort_Player_State_Zone) == 0x000038, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::K2Node_DynamicCast_AsFort_Player_State_Zone' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_GetHealthAndShields_Health) == 0x000044, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_GetHealthAndShields_Health' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_GetHealthAndShields_HealthMax) == 0x000048, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_GetHealthAndShields_HealthMax' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_GetHealthAndShields_Shield) == 0x00004C, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_GetHealthAndShields_Shield' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_GetHealthAndShields_ShieldMax) == 0x000050, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_GetHealthAndShields_ShieldMax' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_FMax_ReturnValue) == 0x000054, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromOwnerMeshComponent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function SlurpSoldierHelpers.SlurpSoldierHelpers_C.GetShieldPercentageFromPawn
// 0x0060 (0x0060 - 0x0000)
struct SlurpSoldierHelpers_C_GetShieldPercentageFromPawn final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShieldPercentage;                                  // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerAnimInstance*                K2Node_DynamicCast_AsFort_Player_Anim_Instance;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateZone*                   K2Node_DynamicCast_AsFort_Player_State_Zone;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthAndShields_Health;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthAndShields_HealthMax;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthAndShields_Shield;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthAndShields_ShieldMax;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn) == 0x000008, "Wrong alignment on SlurpSoldierHelpers_C_GetShieldPercentageFromPawn");
static_assert(sizeof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn) == 0x000060, "Wrong size on SlurpSoldierHelpers_C_GetShieldPercentageFromPawn");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, Pawn) == 0x000000, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::Pawn' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, __WorldContext) == 0x000008, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::__WorldContext' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, ShieldPercentage) == 0x000010, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::ShieldPercentage' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, K2Node_DynamicCast_AsFort_Player_Anim_Instance) == 0x000020, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::K2Node_DynamicCast_AsFort_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_GetCurveValue_ReturnValue) == 0x00002C, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, K2Node_DynamicCast_AsFort_Player_State_Zone) == 0x000038, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::K2Node_DynamicCast_AsFort_Player_State_Zone' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_GetHealthAndShields_Health) == 0x000044, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_GetHealthAndShields_Health' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_GetHealthAndShields_HealthMax) == 0x000048, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_GetHealthAndShields_HealthMax' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_GetHealthAndShields_Shield) == 0x00004C, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_GetHealthAndShields_Shield' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_GetHealthAndShields_ShieldMax) == 0x000050, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_GetHealthAndShields_ShieldMax' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_FMax_ReturnValue) == 0x000054, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlurpSoldierHelpers_C_GetShieldPercentageFromPawn, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'SlurpSoldierHelpers_C_GetShieldPercentageFromPawn::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

