#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmartObject_NoMesh_Actor

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SmartObject_NoMesh_Actor.SmartObject_NoMesh_Actor_C
// 0x0018 (0x0288 - 0x0270)
class ASmartObject_NoMesh_Actor_C final : public AActor
{
public:
	class UTextRenderComponent*                   TextRender;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USmartObjectComponent*                  SmartObject;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SmartObject_NoMesh_Actor_C">();
	}
	static class ASmartObject_NoMesh_Actor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASmartObject_NoMesh_Actor_C>();
	}
};
static_assert(alignof(ASmartObject_NoMesh_Actor_C) == 0x000008, "Wrong alignment on ASmartObject_NoMesh_Actor_C");
static_assert(sizeof(ASmartObject_NoMesh_Actor_C) == 0x000288, "Wrong size on ASmartObject_NoMesh_Actor_C");
static_assert(offsetof(ASmartObject_NoMesh_Actor_C, TextRender) == 0x000270, "Member 'ASmartObject_NoMesh_Actor_C::TextRender' has a wrong offset!");
static_assert(offsetof(ASmartObject_NoMesh_Actor_C, SmartObject) == 0x000278, "Member 'ASmartObject_NoMesh_Actor_C::SmartObject' has a wrong offset!");
static_assert(offsetof(ASmartObject_NoMesh_Actor_C, DefaultSceneRoot) == 0x000280, "Member 'ASmartObject_NoMesh_Actor_C::DefaultSceneRoot' has a wrong offset!");

}

