#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel_FriendSearchBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanel_FriendSearchBar.SocialPanel_FriendSearchBar_C
// 0x0050 (0x1110 - 0x10C0)
class USocialPanel_FriendSearchBar_C final : public UFortFriendSearchButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x10C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AddFriendBanIcon;                                  // 0x10D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ClickCapture;                                      // 0x10D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_CannotAddFriends;                         // 0x10E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_SocialBan;                                // 0x10E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       SharingIcon;                                       // 0x10F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSimpleWidgetAnimationsPanel*       SimpleWidgetAnimationsPanel;                       // 0x10F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ShakeAnimation;                                    // 0x1100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShakeAnimationIsPlaying;                          // 0x1104(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SocialPanel_FriendSearchBar(int32 EntryPoint);
	struct FEventReply On_ClickCapture_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanel_FriendSearchBar_C">();
	}
	static class USocialPanel_FriendSearchBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanel_FriendSearchBar_C>();
	}
};
static_assert(alignof(USocialPanel_FriendSearchBar_C) == 0x000010, "Wrong alignment on USocialPanel_FriendSearchBar_C");
static_assert(sizeof(USocialPanel_FriendSearchBar_C) == 0x001110, "Wrong size on USocialPanel_FriendSearchBar_C");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, UberGraphFrame) == 0x0010C0, "Member 'USocialPanel_FriendSearchBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, OnHovered) == 0x0010C8, "Member 'USocialPanel_FriendSearchBar_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, AddFriendBanIcon) == 0x0010D0, "Member 'USocialPanel_FriendSearchBar_C::AddFriendBanIcon' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, ClickCapture) == 0x0010D8, "Member 'USocialPanel_FriendSearchBar_C::ClickCapture' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, RichText_CannotAddFriends) == 0x0010E0, "Member 'USocialPanel_FriendSearchBar_C::RichText_CannotAddFriends' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, RichText_SocialBan) == 0x0010E8, "Member 'USocialPanel_FriendSearchBar_C::RichText_SocialBan' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, SharingIcon) == 0x0010F0, "Member 'USocialPanel_FriendSearchBar_C::SharingIcon' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, SimpleWidgetAnimationsPanel) == 0x0010F8, "Member 'USocialPanel_FriendSearchBar_C::SimpleWidgetAnimationsPanel' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, ShakeAnimation) == 0x001100, "Member 'USocialPanel_FriendSearchBar_C::ShakeAnimation' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, bShakeAnimationIsPlaying) == 0x001104, "Member 'USocialPanel_FriendSearchBar_C::bShakeAnimationIsPlaying' has a wrong offset!");

}

