#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel_FriendSearchBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SocialPanel_FriendSearchBar.SocialPanel_FriendSearchBar_C.BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct SocialPanel_FriendSearchBar_C_BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SocialPanel_FriendSearchBar_C_BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on SocialPanel_FriendSearchBar_C_BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(SocialPanel_FriendSearchBar_C_BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on SocialPanel_FriendSearchBar_C_BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'SocialPanel_FriendSearchBar_C_BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function SocialPanel_FriendSearchBar.SocialPanel_FriendSearchBar_C.ExecuteUbergraph_SocialPanel_FriendSearchBar
// 0x0040 (0x0040 - 0x0000)
struct SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0020(0x0018)(ConstParm)
	bool                                          CallFunc_LimitTextLength_WasTrimmed;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar) == 0x000008, "Wrong alignment on SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar");
static_assert(sizeof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar) == 0x000040, "Wrong size on SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar, EntryPoint) == 0x000000, "Member 'SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000008, "Member 'SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar, K2Node_ComponentBoundEvent_Text) == 0x000020, "Member 'SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar, CallFunc_LimitTextLength_WasTrimmed) == 0x000038, "Member 'SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar::CallFunc_LimitTextLength_WasTrimmed' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar, CallFunc_PlayAnimationByName_ReturnValue) == 0x000039, "Member 'SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'SocialPanel_FriendSearchBar_C_ExecuteUbergraph_SocialPanel_FriendSearchBar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SocialPanel_FriendSearchBar.SocialPanel_FriendSearchBar_C.On_ClickCapture_MouseButtonDown_0
// 0x0240 (0x0240 - 0x0000)
struct SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0188(0x00B8)()
};
static_assert(alignof(SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0) == 0x000008, "Wrong alignment on SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0");
static_assert(sizeof(SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0) == 0x000240, "Wrong size on SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0, MyGeometry) == 0x000000, "Member 'SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0, MouseEvent) == 0x000040, "Member 'SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0, ReturnValue) == 0x0000D0, "Member 'SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000188, "Member 'SocialPanel_FriendSearchBar_C_On_ClickCapture_MouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

