#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SocialPanel.SocialPanel_C.BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SocialPanel_C_BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialPanel_C_BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SocialPanel_C_BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SocialPanel_C_BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SocialPanel_C_BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SocialPanel_C_BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SocialPanel_C_BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SocialPanel.SocialPanel_C.ExecuteUbergraph_SocialPanel
// 0x0048 (0x0048 - 0x0000)
struct SocialPanel_C_ExecuteUbergraph_SocialPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnySlideOutMenuOpen_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialPanel_C_ExecuteUbergraph_SocialPanel) == 0x000008, "Wrong alignment on SocialPanel_C_ExecuteUbergraph_SocialPanel");
static_assert(sizeof(SocialPanel_C_ExecuteUbergraph_SocialPanel) == 0x000048, "Wrong size on SocialPanel_C_ExecuteUbergraph_SocialPanel");
static_assert(offsetof(SocialPanel_C_ExecuteUbergraph_SocialPanel, EntryPoint) == 0x000000, "Member 'SocialPanel_C_ExecuteUbergraph_SocialPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_ExecuteUbergraph_SocialPanel, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'SocialPanel_C_ExecuteUbergraph_SocialPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_ExecuteUbergraph_SocialPanel, CallFunc_IsAnySlideOutMenuOpen_ReturnValue) == 0x000010, "Member 'SocialPanel_C_ExecuteUbergraph_SocialPanel::CallFunc_IsAnySlideOutMenuOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_ExecuteUbergraph_SocialPanel, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'SocialPanel_C_ExecuteUbergraph_SocialPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_ExecuteUbergraph_SocialPanel, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'SocialPanel_C_ExecuteUbergraph_SocialPanel::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_ExecuteUbergraph_SocialPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'SocialPanel_C_ExecuteUbergraph_SocialPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_ExecuteUbergraph_SocialPanel, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000034, "Member 'SocialPanel_C_ExecuteUbergraph_SocialPanel::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_ExecuteUbergraph_SocialPanel, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000035, "Member 'SocialPanel_C_ExecuteUbergraph_SocialPanel::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_ExecuteUbergraph_SocialPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'SocialPanel_C_ExecuteUbergraph_SocialPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function SocialPanel.SocialPanel_C.OnMouseButtonDown_0
// 0x0310 (0x0310 - 0x0000)
struct SocialPanel_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0190(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnySlideOutMenuOpen_ReturnValue;        // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0250(0x00B8)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialPanel_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on SocialPanel_C_OnMouseButtonDown_0");
static_assert(sizeof(SocialPanel_C_OnMouseButtonDown_0) == 0x000310, "Wrong size on SocialPanel_C_OnMouseButtonDown_0");
static_assert(offsetof(SocialPanel_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'SocialPanel_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_OnMouseButtonDown_0, MouseEvent) == 0x000040, "Member 'SocialPanel_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_OnMouseButtonDown_0, ReturnValue) == 0x0000D0, "Member 'SocialPanel_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_OnMouseButtonDown_0, CallFunc_IsActivated_ReturnValue) == 0x000188, "Member 'SocialPanel_C_OnMouseButtonDown_0::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_OnMouseButtonDown_0, CallFunc_Unhandled_ReturnValue) == 0x000190, "Member 'SocialPanel_C_OnMouseButtonDown_0::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_OnMouseButtonDown_0, CallFunc_Not_PreBool_ReturnValue) == 0x000248, "Member 'SocialPanel_C_OnMouseButtonDown_0::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_OnMouseButtonDown_0, CallFunc_IsAnySlideOutMenuOpen_ReturnValue) == 0x000249, "Member 'SocialPanel_C_OnMouseButtonDown_0::CallFunc_IsAnySlideOutMenuOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_OnMouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000250, "Member 'SocialPanel_C_OnMouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialPanel_C_OnMouseButtonDown_0, CallFunc_BooleanOR_ReturnValue) == 0x000308, "Member 'SocialPanel_C_OnMouseButtonDown_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function SocialPanel.SocialPanel_C.Play Panel Animation Sound
// 0x0001 (0x0001 - 0x0000)
struct SocialPanel_C_Play_Panel_Animation_Sound final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialPanel_C_Play_Panel_Animation_Sound) == 0x000001, "Wrong alignment on SocialPanel_C_Play_Panel_Animation_Sound");
static_assert(sizeof(SocialPanel_C_Play_Panel_Animation_Sound) == 0x000001, "Wrong size on SocialPanel_C_Play_Panel_Animation_Sound");
static_assert(offsetof(SocialPanel_C_Play_Panel_Animation_Sound, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'SocialPanel_C_Play_Panel_Animation_Sound::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

}

