#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel_FriendLinkButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanel_FriendLinkButton.SocialPanel_FriendLinkButton_C
// 0x0050 (0x1080 - 0x1030)
class USocialPanel_FriendLinkButton_C final : public UFortSocialPanelView_FriendLinkButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnCopied;                                          // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x1040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       SharingIcon;                                       // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_CopyState;                                // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CopyConfirmed;                                // 0x1060(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FriendLinkInstructions;                       // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LinkPrompt;                                   // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SocialPanel_FriendLinkButton(int32 EntryPoint);
	void OnCopiedToClipboard();
	void OnShareButtonTypeSet(EFriendLinkShareButtonType Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanel_FriendLinkButton_C">();
	}
	static class USocialPanel_FriendLinkButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanel_FriendLinkButton_C>();
	}
};
static_assert(alignof(USocialPanel_FriendLinkButton_C) == 0x000010, "Wrong alignment on USocialPanel_FriendLinkButton_C");
static_assert(sizeof(USocialPanel_FriendLinkButton_C) == 0x001080, "Wrong size on USocialPanel_FriendLinkButton_C");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, UberGraphFrame) == 0x001030, "Member 'USocialPanel_FriendLinkButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, OnCopied) == 0x001038, "Member 'USocialPanel_FriendLinkButton_C::OnCopied' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, OnHovered) == 0x001040, "Member 'USocialPanel_FriendLinkButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, MenuAnchor_Actions) == 0x001048, "Member 'USocialPanel_FriendLinkButton_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, SharingIcon) == 0x001050, "Member 'USocialPanel_FriendLinkButton_C::SharingIcon' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Switcher_CopyState) == 0x001058, "Member 'USocialPanel_FriendLinkButton_C::Switcher_CopyState' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Text_CopyConfirmed) == 0x001060, "Member 'USocialPanel_FriendLinkButton_C::Text_CopyConfirmed' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Text_FriendLinkInstructions) == 0x001068, "Member 'USocialPanel_FriendLinkButton_C::Text_FriendLinkInstructions' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Text_LinkPrompt) == 0x001070, "Member 'USocialPanel_FriendLinkButton_C::Text_LinkPrompt' has a wrong offset!");

}

