#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialConfirmationButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialConfirmationButton.SocialConfirmationButton_C
// 0x0050 (0x1080 - 0x1030)
class USocialConfirmationButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_InteractionIndicator;                       // 0x1040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractionIcon;                                   // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_InteractionName;                              // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsAccept;                                         // 0x1060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1061[0x7];                                     // 0x1061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayText;                                       // 0x1068(0x0018)(Edit, BlueprintVisible)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SocialConfirmationButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialConfirmationButton_C">();
	}
	static class USocialConfirmationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialConfirmationButton_C>();
	}
};
static_assert(alignof(USocialConfirmationButton_C) == 0x000010, "Wrong alignment on USocialConfirmationButton_C");
static_assert(sizeof(USocialConfirmationButton_C) == 0x001080, "Wrong size on USocialConfirmationButton_C");
static_assert(offsetof(USocialConfirmationButton_C, UberGraphFrame) == 0x001030, "Member 'USocialConfirmationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, OnHover) == 0x001038, "Member 'USocialConfirmationButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, Border_InteractionIndicator) == 0x001040, "Member 'USocialConfirmationButton_C::Border_InteractionIndicator' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, InteractionIcon) == 0x001048, "Member 'USocialConfirmationButton_C::InteractionIcon' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, MenuAnchor_Actions) == 0x001050, "Member 'USocialConfirmationButton_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, Text_InteractionName) == 0x001058, "Member 'USocialConfirmationButton_C::Text_InteractionName' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, bIsAccept) == 0x001060, "Member 'USocialConfirmationButton_C::bIsAccept' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, DisplayText) == 0x001068, "Member 'USocialConfirmationButton_C::DisplayText' has a wrong offset!");

}

