#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SolarisInterop

#include "Basic.hpp"


namespace SDK
{

// Enum SolarisInterop.EVerseFalse
// NumValues: 0x0002
enum class EVerseFalse : uint8
{
	Value                                    = 0,
	EVerseFalse_MAX                          = 1,
};

// Enum SolarisInterop.EVerseTrue
// NumValues: 0x0002
enum class EVerseTrue : uint8
{
	Value                                    = 0,
	EVerseTrue_MAX                           = 1,
};

// ScriptStruct SolarisInterop.VerseIntRange
// 0x0010 (0x0010 - 0x0000)
struct FVerseIntRange final
{
public:
	int64                                         Left;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Right;                                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseIntRange) == 0x000008, "Wrong alignment on FVerseIntRange");
static_assert(sizeof(FVerseIntRange) == 0x000010, "Wrong size on FVerseIntRange");
static_assert(offsetof(FVerseIntRange, Left) == 0x000000, "Member 'FVerseIntRange::Left' has a wrong offset!");
static_assert(offsetof(FVerseIntRange, Right) == 0x000008, "Member 'FVerseIntRange::Right' has a wrong offset!");

// ScriptStruct SolarisInterop.VerseRational
// 0x0010 (0x0010 - 0x0000)
struct FVerseRational final
{
public:
	int64                                         Numerator;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Denominator;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseRational) == 0x000008, "Wrong alignment on FVerseRational");
static_assert(sizeof(FVerseRational) == 0x000010, "Wrong size on FVerseRational");
static_assert(offsetof(FVerseRational, Numerator) == 0x000000, "Member 'FVerseRational::Numerator' has a wrong offset!");
static_assert(offsetof(FVerseRational, Denominator) == 0x000008, "Member 'FVerseRational::Denominator' has a wrong offset!");

}

