#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SolarisInterop_0

#include "Basic.hpp"

#include "SolarisInterop_0_structs.hpp"


namespace SDK::Params
{

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RActive
// 0x0003 (0x0003 - 0x0000)
struct task__L_2fVerse_2eorg_2fInterop_2ftask_N_RActive final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RActive) == 0x000001, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RActive");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RActive) == 0x000003, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RActive");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RActive, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RActive::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RActive, RetVal) == 0x000001, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RActive::RetVal' has a wrong offset!");

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) task__L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString) == 0x000008, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString) == 0x000018, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString, RetVal) == 0x000008, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RAsString::RetVal' has a wrong offset!");

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RCancel
// 0x0001 (0x0001 - 0x0000)
struct task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancel final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancel) == 0x000001, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancel");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancel) == 0x000001, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancel");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancel, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancel::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled
// 0x0003 (0x0003 - 0x0000)
struct task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled) == 0x000001, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled) == 0x000003, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled, RetVal) == 0x000001, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelled::RetVal' has a wrong offset!");

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling
// 0x0003 (0x0003 - 0x0000)
struct task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling) == 0x000001, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling) == 0x000003, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling, RetVal) == 0x000001, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCancelling::RetVal' has a wrong offset!");

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted
// 0x0003 (0x0003 - 0x0000)
struct task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted) == 0x000001, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted) == 0x000003, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted, RetVal) == 0x000001, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RCompleted::RetVal' has a wrong offset!");

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted
// 0x0003 (0x0003 - 0x0000)
struct task__L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted) == 0x000001, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted) == 0x000003, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted, RetVal) == 0x000001, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RInterrupted::RetVal' has a wrong offset!");

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled
// 0x0003 (0x0003 - 0x0000)
struct task__L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled) == 0x000001, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled) == 0x000003, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled, RetVal) == 0x000001, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RSettled::RetVal' has a wrong offset!");

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted
// 0x0003 (0x0003 - 0x0000)
struct task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted) == 0x000001, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted) == 0x000003, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted, RetVal) == 0x000001, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUninterrupted::RetVal' has a wrong offset!");

// Function SolarisInterop.task._L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled
// 0x0003 (0x0003 - 0x0000)
struct task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled) == 0x000001, "Wrong alignment on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled");
static_assert(sizeof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled) == 0x000003, "Wrong size on task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled, RetVal) == 0x000001, "Member 'task__L_2fVerse_2eorg_2fInterop_2ftask_N_RUnsettled::RetVal' has a wrong offset!");

// Function SolarisInterop.task.Await
// 0x0028 (0x0028 - 0x0000)
struct task_Await final
{
public:
	class UObject*                                __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_Await) == 0x000008, "Wrong alignment on task_Await");
static_assert(sizeof(task_Await) == 0x000028, "Wrong size on task_Await");
static_assert(offsetof(task_Await, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'task_Await::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(task_Await, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'task_Await::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(task_Await, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'task_Await::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(task_Await, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'task_Await::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(task_Await, RetVal) == 0x000020, "Member 'task_Await::RetVal' has a wrong offset!");

// Function SolarisInterop.Context_task$Await.Update
// 0x0008 (0x0008 - 0x0000)
struct Context_task_Await_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Context_task_Await_Update) == 0x000008, "Wrong alignment on Context_task_Await_Update");
static_assert(sizeof(Context_task_Await_Update) == 0x000008, "Wrong size on Context_task_Await_Update");
static_assert(offsetof(Context_task_Await_Update, RetVal) == 0x000000, "Member 'Context_task_Await_Update::RetVal' has a wrong offset!");

// Function SolarisInterop.mind._L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString) == 0x000008, "Wrong alignment on mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString");
static_assert(sizeof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString) == 0x000018, "Wrong size on mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString");
static_assert(offsetof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString, RetVal) == 0x000008, "Member 'mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RAsString::RetVal' has a wrong offset!");

// Function SolarisInterop.mind._L_2fVerse_2eorg_2fInterop_2fmind_N_RCancelAll
// 0x0001 (0x0001 - 0x0000)
struct mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RCancelAll final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RCancelAll) == 0x000001, "Wrong alignment on mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RCancelAll");
static_assert(sizeof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RCancelAll) == 0x000001, "Wrong size on mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RCancelAll");
static_assert(offsetof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RCancelAll, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RCancelAll::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function SolarisInterop.mind._L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive
// 0x0010 (0x0010 - 0x0000)
struct mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive final
{
public:
	struct SolarisInterop_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive) == 0x000008, "Wrong alignment on mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive");
static_assert(sizeof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive) == 0x000010, "Wrong size on mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive");
static_assert(offsetof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive, RetVal) == 0x000008, "Member 'mind__L_2fVerse_2eorg_2fInterop_2fmind_N_RGetNumActive::RetVal' has a wrong offset!");

}

