#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SoloButton.SoloButton_C
// 0x0070 (0x10A0 - 0x1030)
class USoloButton_C final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x1038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Container;                                  // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Control;                                   // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x1060(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x1068(0x0018)(Edit, BlueprintVisible)
	bool                                          FontSizeOveride;                                   // 0x1080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1081[0x3];                                     // 0x1081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x1084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Padding_Overide;                                   // 0x1088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PaddingOveride;                                    // 0x1098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x1099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetText(const class FText& Text);
	void PreConstruct(bool IsDesignTime);
	void HandleSize();
	void ExecuteUbergraph_SoloButton(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void BP_OnEnabled();
	void BP_OnDisabled();
	void BP_OnClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoloButton_C">();
	}
	static class USoloButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoloButton_C>();
	}
};
static_assert(alignof(USoloButton_C) == 0x000010, "Wrong alignment on USoloButton_C");
static_assert(sizeof(USoloButton_C) == 0x0010A0, "Wrong size on USoloButton_C");
static_assert(offsetof(USoloButton_C, UberGraphFrame) == 0x001030, "Member 'USoloButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Pressed) == 0x001038, "Member 'USoloButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Hover) == 0x001040, "Member 'USoloButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Border_Container) == 0x001048, "Member 'USoloButton_C::Border_Container' has a wrong offset!");
static_assert(offsetof(USoloButton_C, ButtonBacking) == 0x001050, "Member 'USoloButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USoloButton_C, SizeBox_Control) == 0x001058, "Member 'USoloButton_C::SizeBox_Control' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Text_ButtonAction) == 0x001060, "Member 'USoloButton_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Button_Description) == 0x001068, "Member 'USoloButton_C::Button_Description' has a wrong offset!");
static_assert(offsetof(USoloButton_C, FontSizeOveride) == 0x001080, "Member 'USoloButton_C::FontSizeOveride' has a wrong offset!");
static_assert(offsetof(USoloButton_C, FontSize) == 0x001084, "Member 'USoloButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Padding_Overide) == 0x001088, "Member 'USoloButton_C::Padding_Overide' has a wrong offset!");
static_assert(offsetof(USoloButton_C, PaddingOveride) == 0x001098, "Member 'USoloButton_C::PaddingOveride' has a wrong offset!");
static_assert(offsetof(USoloButton_C, IsDisabled) == 0x001099, "Member 'USoloButton_C::IsDisabled' has a wrong offset!");

}

