#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloButton_BattlePassPurchaseMobile

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function SoloButton_BattlePassPurchaseMobile.SoloButton_BattlePassPurchaseMobile_C.ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile
// 0x0040 (0x0040 - 0x0000)
struct SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile) == 0x000008, "Wrong alignment on SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile");
static_assert(sizeof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile) == 0x000040, "Wrong size on SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, EntryPoint) == 0x000000, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, Temp_bool_Variable) == 0x000004, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, Temp_float_Variable) == 0x000010, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, Temp_float_Variable_1) == 0x000014, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, K2Node_Event_IsDesignTime) == 0x000018, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, CallFunc_GetCurrentInputType_ReturnValue) == 0x000038, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile, K2Node_Select_Default) == 0x00003C, "Member 'SoloButton_BattlePassPurchaseMobile_C_ExecuteUbergraph_SoloButton_BattlePassPurchaseMobile::K2Node_Select_Default' has a wrong offset!");

// Function SoloButton_BattlePassPurchaseMobile.SoloButton_BattlePassPurchaseMobile_C.HandleSize
// 0x0080 (0x0080 - 0x0000)
struct SoloButton_BattlePassPurchaseMobile_C_HandleSize final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default;                             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default_1;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0030(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(SoloButton_BattlePassPurchaseMobile_C_HandleSize) == 0x000008, "Wrong alignment on SoloButton_BattlePassPurchaseMobile_C_HandleSize");
static_assert(sizeof(SoloButton_BattlePassPurchaseMobile_C_HandleSize) == 0x000080, "Wrong size on SoloButton_BattlePassPurchaseMobile_C_HandleSize");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_HandleSize, Temp_bool_Variable) == 0x000000, "Member 'SoloButton_BattlePassPurchaseMobile_C_HandleSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_HandleSize, Temp_bool_Variable_1) == 0x000001, "Member 'SoloButton_BattlePassPurchaseMobile_C_HandleSize::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_HandleSize, Temp_int_Variable) == 0x000004, "Member 'SoloButton_BattlePassPurchaseMobile_C_HandleSize::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_HandleSize, K2Node_MakeStruct_Margin) == 0x000008, "Member 'SoloButton_BattlePassPurchaseMobile_C_HandleSize::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_HandleSize, K2Node_Select_Default) == 0x000018, "Member 'SoloButton_BattlePassPurchaseMobile_C_HandleSize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_HandleSize, K2Node_Select_Default_1) == 0x000028, "Member 'SoloButton_BattlePassPurchaseMobile_C_HandleSize::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_HandleSize, K2Node_MakeStruct_SlateFontInfo) == 0x000030, "Member 'SoloButton_BattlePassPurchaseMobile_C_HandleSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function SoloButton_BattlePassPurchaseMobile.SoloButton_BattlePassPurchaseMobile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SoloButton_BattlePassPurchaseMobile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoloButton_BattlePassPurchaseMobile_C_PreConstruct) == 0x000001, "Wrong alignment on SoloButton_BattlePassPurchaseMobile_C_PreConstruct");
static_assert(sizeof(SoloButton_BattlePassPurchaseMobile_C_PreConstruct) == 0x000001, "Wrong size on SoloButton_BattlePassPurchaseMobile_C_PreConstruct");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SoloButton_BattlePassPurchaseMobile_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SoloButton_BattlePassPurchaseMobile.SoloButton_BattlePassPurchaseMobile_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct SoloButton_BattlePassPurchaseMobile_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SoloButton_BattlePassPurchaseMobile_C_SetText) == 0x000008, "Wrong alignment on SoloButton_BattlePassPurchaseMobile_C_SetText");
static_assert(sizeof(SoloButton_BattlePassPurchaseMobile_C_SetText) == 0x000018, "Wrong size on SoloButton_BattlePassPurchaseMobile_C_SetText");
static_assert(offsetof(SoloButton_BattlePassPurchaseMobile_C_SetText, Text) == 0x000000, "Member 'SoloButton_BattlePassPurchaseMobile_C_SetText::Text' has a wrong offset!");

}

