#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialSurfaceCoverageRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpecialSurfaceCoverageRuntime.FortGameStateComponent_SurfaceCoverageMap.UpdateCoverageMap
// 0x0050 (0x0050 - 0x0000)
struct FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 SpecialSurfaceRenderTarget;                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InTopLeftWorldCoordinate;                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InBottomRightWorldCoordinate;                      // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoverageThreshold;                                 // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugDrawDuration;                                 // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap) == 0x000008, "Wrong alignment on FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap");
static_assert(sizeof(FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap) == 0x000050, "Wrong size on FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap");
static_assert(offsetof(FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap, WorldContextObject) == 0x000000, "Member 'FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap::WorldContextObject' has a wrong offset!");
static_assert(offsetof(FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap, SpecialSurfaceRenderTarget) == 0x000008, "Member 'FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap::SpecialSurfaceRenderTarget' has a wrong offset!");
static_assert(offsetof(FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap, InTopLeftWorldCoordinate) == 0x000010, "Member 'FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap::InTopLeftWorldCoordinate' has a wrong offset!");
static_assert(offsetof(FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap, InBottomRightWorldCoordinate) == 0x000028, "Member 'FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap::InBottomRightWorldCoordinate' has a wrong offset!");
static_assert(offsetof(FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap, CoverageThreshold) == 0x000040, "Member 'FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap::CoverageThreshold' has a wrong offset!");
static_assert(offsetof(FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap, DebugDrawDuration) == 0x000044, "Member 'FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap::DebugDrawDuration' has a wrong offset!");
static_assert(offsetof(FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap, ReturnValue) == 0x000048, "Member 'FortGameStateComponent_SurfaceCoverageMap_UpdateCoverageMap::ReturnValue' has a wrong offset!");

}

