#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialEventGameplayRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SpecialEventGameplayRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_0_structs.hpp"
#include "CommonUILegacy_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// Class SpecialEventGameplayRuntime.FortCheatManager_SpecialEvent
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_SpecialEvent final : public UFortCheatManager_Coupled
{
public:
	void AddCSVEvent(const class FString& CSVEventName);
	void AutobalanceTargetScore();
	void ChangeWinCondition(float NewGoalScore);
	void CloseParachutes();
	void PauseWinCondition(bool bLockScores);
	void PlacePlayersInAircraft();
	void ResetMatchTimeToPrevious();
	void ResetSpecialEventAircraft();
	void ResetWinCondition();
	void ResetWinConditionProgressToZero();
	void ResumeWinCondition();
	void SendToNightNight();
	void SetDestroyVehiclesInStorm(bool bDestroyVehiclesInStorm);
	void SetIsSimulatingDamage(bool bIsSimulating);
	void SetLockingOnFocalPoint(bool bInLockingOnFocalPoint);
	void SetMatchTime(int32 NewMatchTime);
	void SetReturnToMainMenuDelay(float MinDelayReturnToMainMenu, float MaxDelayReturnToMainMenu);
	void ShrinkSafeZone();
	void SpecialEventClearAdditionalViewpoint();
	void SpecialEventSetAdditionalViewpoint(float X, float Y, float Z);
	void StartEventScript(int32 InStartingIndex);
	void TeleportAllPlayers(int32 SafeZoneIndex);
	void ToggleDisableParachutes(bool bIsDisabled);
	void UnloadTerrainMaps(class FName MapTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_SpecialEvent">();
	}
	static class UFortCheatManager_SpecialEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_SpecialEvent>();
	}
};
static_assert(alignof(UFortCheatManager_SpecialEvent) == 0x000008, "Wrong alignment on UFortCheatManager_SpecialEvent");
static_assert(sizeof(UFortCheatManager_SpecialEvent) == 0x000038, "Wrong size on UFortCheatManager_SpecialEvent");

// Class SpecialEventGameplayRuntime.FortCheatManager_DestroyActorsAndComponents
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_DestroyActorsAndComponents final : public UFortCheatManager_Coupled
{
public:
	void DestroyActorsAndComponentsMutator_SetActorDefinitionsEnabled(const class FString& TagString, const bool bEnabled);

	void DestroyActorsAndComponentsMutator_ListActorComponents(const class FString& InActorName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_DestroyActorsAndComponents">();
	}
	static class UFortCheatManager_DestroyActorsAndComponents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_DestroyActorsAndComponents>();
	}
};
static_assert(alignof(UFortCheatManager_DestroyActorsAndComponents) == 0x000008, "Wrong alignment on UFortCheatManager_DestroyActorsAndComponents");
static_assert(sizeof(UFortCheatManager_DestroyActorsAndComponents) == 0x000038, "Wrong size on UFortCheatManager_DestroyActorsAndComponents");

// Class SpecialEventGameplayRuntime.FortAthenaMutator_DestroyActorsAndComponents
// 0x0030 (0x0348 - 0x0318)
class AFortAthenaMutator_DestroyActorsAndComponents final : public AFortAthenaMutator
{
public:
	TArray<struct FDestroyActorsAndComponentsMutator_ActorDefinition> ActorDefinitions;                                  // 0x0318(0x0010)(Edit, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_328[0x20];                                     // 0x0328(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ActorDefinitions(const TArray<struct FDestroyActorsAndComponentsMutator_ActorDefinition>& OldActorDefinitions);
	void OnTrackedActorDestroyed(class AActor* DestroyedActor);
	void PermanentlyDisableActorDefinitions(const struct FGameplayTagContainer& InTags);
	void SetActorDefinitionsEnabled(const struct FGameplayTagContainer& InTags, const bool bEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_DestroyActorsAndComponents">();
	}
	static class AFortAthenaMutator_DestroyActorsAndComponents* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_DestroyActorsAndComponents>();
	}
};
static_assert(alignof(AFortAthenaMutator_DestroyActorsAndComponents) == 0x000008, "Wrong alignment on AFortAthenaMutator_DestroyActorsAndComponents");
static_assert(sizeof(AFortAthenaMutator_DestroyActorsAndComponents) == 0x000348, "Wrong size on AFortAthenaMutator_DestroyActorsAndComponents");
static_assert(offsetof(AFortAthenaMutator_DestroyActorsAndComponents, ActorDefinitions) == 0x000318, "Member 'AFortAthenaMutator_DestroyActorsAndComponents::ActorDefinitions' has a wrong offset!");

// Class SpecialEventGameplayRuntime.FortCheatManager_FakeKillRelevancy
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_FakeKillRelevancy final : public UFortCheatManager_Coupled
{
public:
	void FakeKillRelevancyDebug(const float TextScale);
	void FakeKillRelevancyReset();
	void FakeKillRelevancySetUpPhase(const int32 MaxPlayersRemaining, const class FString& ReasonGameplayTagString, const int32 NumWaves, const float RelevancyDelay);
	void FakeKillRelevancyStartNextWave();
	void FakeKillRelevancyTestAlgorithm(const int32 NumPlayers, const class FString& MaxPlayersRemainingAfterPhases, const int32 MinSquadSize, const int32 MaxSquadSize, const int32 Iterations, const int32 LogVerbosity);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_FakeKillRelevancy">();
	}
	static class UFortCheatManager_FakeKillRelevancy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_FakeKillRelevancy>();
	}
};
static_assert(alignof(UFortCheatManager_FakeKillRelevancy) == 0x000008, "Wrong alignment on UFortCheatManager_FakeKillRelevancy");
static_assert(sizeof(UFortCheatManager_FakeKillRelevancy) == 0x000038, "Wrong size on UFortCheatManager_FakeKillRelevancy");

// Class SpecialEventGameplayRuntime.FortControllerComponent_FakeKillRelevancy
// 0x0188 (0x0228 - 0x00A0)
class UFortControllerComponent_FakeKillRelevancy final : public UFortControllerComponent
{
public:
	struct FFakeKillRelevancyPlayerDataArray      PlayerDataArray;                                   // 0x00A0(0x0120)(Net, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class AFortPlayerStateAthena*, EFakeKillRelevancyPlayerKillStep> ClientPlayerStateKillStepMap;                      // 0x01C0(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         ResetCounter;                                      // 0x0210(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerStateAthena*>         DebugSupergroupPlayerStates;                       // 0x0218(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void CancelKillEffectsOnClient(const TArray<class AFortPlayerStateAthena*>& PlayerStates);
	void CancelKillEffectsOnServer();
	void OnKillEffectsPlayed(const class AFortPlayerStateAthena* PlayerState);
	void OnRep_ResetCounter();
	void PlayKillEffects(const struct FFakeKillRelevancyPlayerDataEntry& FakeKillData, const float RelevancyDelay);
	void ResetRelevancy();

	struct FVector GetDeathLocation(const class AFortPlayerStateAthena* PlayerState) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_FakeKillRelevancy">();
	}
	static class UFortControllerComponent_FakeKillRelevancy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_FakeKillRelevancy>();
	}
};
static_assert(alignof(UFortControllerComponent_FakeKillRelevancy) == 0x000008, "Wrong alignment on UFortControllerComponent_FakeKillRelevancy");
static_assert(sizeof(UFortControllerComponent_FakeKillRelevancy) == 0x000228, "Wrong size on UFortControllerComponent_FakeKillRelevancy");
static_assert(offsetof(UFortControllerComponent_FakeKillRelevancy, PlayerDataArray) == 0x0000A0, "Member 'UFortControllerComponent_FakeKillRelevancy::PlayerDataArray' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_FakeKillRelevancy, ClientPlayerStateKillStepMap) == 0x0001C0, "Member 'UFortControllerComponent_FakeKillRelevancy::ClientPlayerStateKillStepMap' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_FakeKillRelevancy, ResetCounter) == 0x000210, "Member 'UFortControllerComponent_FakeKillRelevancy::ResetCounter' has a wrong offset!");
static_assert(offsetof(UFortControllerComponent_FakeKillRelevancy, DebugSupergroupPlayerStates) == 0x000218, "Member 'UFortControllerComponent_FakeKillRelevancy::DebugSupergroupPlayerStates' has a wrong offset!");

// Class SpecialEventGameplayRuntime.FortAthenaMutator_FakeKillRelevancy
// 0x0060 (0x0480 - 0x0420)
class AFortAthenaMutator_FakeKillRelevancy final : public AFortAthenaMutator_SpecialRelevancy
{
public:
	TSubclassOf<class UFortControllerComponent_FakeKillRelevancy> FakeKillControllerComponentClass;                  // 0x0420(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFakeKillRelevancyPhaseData>    RelevancyPhaseDataArray;                           // 0x0428(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         PhaseNum;                                          // 0x0438(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_43C[0x44];                                     // 0x043C(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndWave(const int32 EndPhaseNum, const int32 WaveNum);
	void ResetRelevancy();
	void SetUpKillPhase(const int32 MaxPlayersRemaining, const struct FGameplayTag& Reason, const int32 NumWaves, const float RelevancyDelay);
	void StartNextKillWave();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_FakeKillRelevancy">();
	}
	static class AFortAthenaMutator_FakeKillRelevancy* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_FakeKillRelevancy>();
	}
};
static_assert(alignof(AFortAthenaMutator_FakeKillRelevancy) == 0x000008, "Wrong alignment on AFortAthenaMutator_FakeKillRelevancy");
static_assert(sizeof(AFortAthenaMutator_FakeKillRelevancy) == 0x000480, "Wrong size on AFortAthenaMutator_FakeKillRelevancy");
static_assert(offsetof(AFortAthenaMutator_FakeKillRelevancy, FakeKillControllerComponentClass) == 0x000420, "Member 'AFortAthenaMutator_FakeKillRelevancy::FakeKillControllerComponentClass' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_FakeKillRelevancy, RelevancyPhaseDataArray) == 0x000428, "Member 'AFortAthenaMutator_FakeKillRelevancy::RelevancyPhaseDataArray' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_FakeKillRelevancy, PhaseNum) == 0x000438, "Member 'AFortAthenaMutator_FakeKillRelevancy::PhaseNum' has a wrong offset!");

// Class SpecialEventGameplayRuntime.FortAthenaMutator_LoadGameFeature
// 0x0010 (0x0328 - 0x0318)
class AFortAthenaMutator_LoadGameFeature final : public AFortAthenaMutator
{
public:
	class FString                                 GameFeatureToLoad;                                 // 0x0318(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnPlaylistDataReady(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_LoadGameFeature">();
	}
	static class AFortAthenaMutator_LoadGameFeature* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_LoadGameFeature>();
	}
};
static_assert(alignof(AFortAthenaMutator_LoadGameFeature) == 0x000008, "Wrong alignment on AFortAthenaMutator_LoadGameFeature");
static_assert(sizeof(AFortAthenaMutator_LoadGameFeature) == 0x000328, "Wrong size on AFortAthenaMutator_LoadGameFeature");
static_assert(offsetof(AFortAthenaMutator_LoadGameFeature, GameFeatureToLoad) == 0x000318, "Member 'AFortAthenaMutator_LoadGameFeature::GameFeatureToLoad' has a wrong offset!");

// Class SpecialEventGameplayRuntime.FortAthenaMutator_RemoveGameFeatures
// 0x0010 (0x0328 - 0x0318)
class AFortAthenaMutator_RemoveGameFeatures final : public AFortAthenaMutator
{
public:
	TArray<class FString>                         AllowedGameFeatures;                               // 0x0318(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnPlaylistDataReady(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_RemoveGameFeatures">();
	}
	static class AFortAthenaMutator_RemoveGameFeatures* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_RemoveGameFeatures>();
	}
};
static_assert(alignof(AFortAthenaMutator_RemoveGameFeatures) == 0x000008, "Wrong alignment on AFortAthenaMutator_RemoveGameFeatures");
static_assert(sizeof(AFortAthenaMutator_RemoveGameFeatures) == 0x000328, "Wrong size on AFortAthenaMutator_RemoveGameFeatures");
static_assert(offsetof(AFortAthenaMutator_RemoveGameFeatures, AllowedGameFeatures) == 0x000318, "Member 'AFortAthenaMutator_RemoveGameFeatures::AllowedGameFeatures' has a wrong offset!");

// Class SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEvent
// 0x0408 (0x0720 - 0x0318)
class AFortAthenaMutator_SpecialEvent final : public AFortAthenaMutator
{
public:
	TMulticastInlineDelegate<void()>              TeleportAllPlayersFinished;                        // 0x0318(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerPawnAthena* NewPawn)> OnPawnLoaded;                                      // 0x0328(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerControllerAthena* NewPlayer)> OnInitController;                                  // 0x0338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnResumeGame;                                      // 0x0348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FSpecialClientEvent& ClientEventData)> OnSpecialClientEvent;                              // 0x0358(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APlayerState* PlayerState)> OnHandleLogout;                                    // 0x0368(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnClientInitialLoadingFinished;                    // 0x0378(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_388[0x68];                                     // 0x0388(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPlayersAreInvincible;                             // 0x03F0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F1[0x27];                                     // 0x03F1(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinimumScoreBumpForAutomadeGoal;                   // 0x0418(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ScoreBrackets;                                     // 0x0420(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnforceInfiniteSafeZonePhase;                     // 0x0430(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WarmupIslandPlayerStartTag;                        // 0x0434(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowInventoryOpen;                               // 0x0438(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bAllowFullScreenMap;                               // 0x0440(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bShouldClearFrontEndMapMarkers;                    // 0x0468(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlockTeamIndicators;                              // 0x0469(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  UIToHideDuringSpecialEvent;                        // 0x0470(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  UIToHideWhenInInfiniteWarmup;                      // 0x0490(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ClientEventsThatUnhideHiddenWhileLoadingHUDElements; // 0x04B0(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bForceGarbageCollectionAfterUnloadOnServer;        // 0x04D0(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceGarbageCollectionAfterUnloadOnClient;        // 0x04D1(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFullPurgeGC;                                      // 0x04D2(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D3[0x5];                                      // 0x04D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaAircraft*                    EventAircraft;                                     // 0x04D8(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAircraftFlightInfo                    EventAircraftInfo;                                 // 0x04E0(0x0048)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortAthenaAircraft>        EventAircraftClass;                                // 0x0528(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASpecialEventScript*                    ScriptActor;                                       // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisableHUD;                                       // 0x0538(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         GameResumed;                                       // 0x0539(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_53A[0x6];                                      // 0x053A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AdditionalViewpoint;                               // 0x0540(0x0018)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bParachutesDisabled;                               // 0x0558(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LastCSVEventName;                                  // 0x0560(0x0010)(Net, ZeroConstructor, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanStreamBuildingFoundationsIn;                   // 0x0570(0x0001)(Edit, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AllPlayerTeleportedCount;                          // 0x0574(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortDelayRTMMData                     DelayPlayersFromReturningToLobbyData;              // 0x0578(0x0010)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   NamedWeightForContainerLootRoll;                   // 0x0588(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WeightForContainerLootRoll;                        // 0x058C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_590[0x30];                                     // 0x0590(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortSpecialEventEmoteData>     SpecialEventEmoteData;                             // 0x05C0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockedNativeActions;                              // 0x05D0(0x0020)(Edit, Net, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UInputComponent*                        SpecialEventsInputComponent;                       // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLockingOnFocalPoint;                              // 0x05F8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortSpecialEventOverrideParts> SpecialEventOverrideParts;                         // 0x0600(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FFortSpecialEventGEData                GameplayEffectToApplyOnSwapToDefault;              // 0x0610(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<struct FUniqueNetIdRepl, int32>          OverridePartsArrayIndexMap;                        // 0x0620(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortSpecialEventGEData>        GameplayEffectsToApplyOnLogin;                     // 0x0670(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSpecialEventMapData>           TerrainMapsToUnload;                               // 0x0680(0x0010)(Edit, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_690[0x10];                                     // 0x0690(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerControllerAthena*>    UnhandledPlayerControllers;                        // 0x06A0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           HLODActorsToHideNames;                             // 0x06B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bForceAllowCloth;                                  // 0x06C0(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C1[0x1];                                      // 0x06C1(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanToggleCursorModeInStasis;                      // 0x06C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C3[0x5];                                      // 0x06C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MannequinRecentlyRenderedCheckToleranceValue;      // 0x06C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class ASpecialEventPlayerMannequin*>   SpecialEventMannequins;                            // 0x06F0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             ActorSpawnDelegateClasses;                         // 0x0700(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_710[0x10];                                     // 0x0710(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddClientCSVEvent(const class FString& CSVEventName);
	void AddCSVEvent(const class FString& CSVEventName, bool bShouldRepToClient);
	void AddToBlockedNativeActions(const struct FGameplayTagContainer& Actions, const bool bCancelAbilities);
	void AutobalanceTargetScore();
	void ChangeWinCondition(float NewGoalScore);
	void ClearAdditionalViewpoint();
	void ClearBlockedNativeActions();
	void CloseParachutes();
	void FlushUnhandledPlayerControllers();
	void ForceSafeZoneFinalLocation(const struct FVector& NewFinalLocation, float DefaultAircraftOffsetFromMidLine, float MinDefaultMidlineAngle, float MaxDefaultMidlineAngle);
	void HandleSpecialEventMannequinDestroyed(class AActor* MannequinActor);
	void JumpToSafeZonePhase(const struct FVector& PawnSpawnCenterLocation, float PawnSpawnMinDistance, float PawnSpawnMaxDistance);
	void NotifyClientsGameResumed();
	void OnActorPreSpawnInitialization(class AActor* Actor);
	void OnActorSpawned(class AActor* Actor);
	void OnAircraftEnteredDropZone(class AFortAthenaAircraft* FortAthenaAircraft);
	void OnAircraftExitedDropZone(class AFortAthenaAircraft* FortAthenaAircraft);
	void OnAircraftFlightEnded(class AFortAthenaAircraft* FortAthenaAircraft);
	void OnGamePhaseStepChanged(const TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, const EAthenaGamePhaseStep GamePhaseStep);
	void OnGameViewportActivationChanged(bool bHasFocus);
	void OnRep_AdditionalViewpoint();
	void OnRep_Aircraft();
	void OnRep_AllPlayerTeleportedCount();
	void OnRep_bCanStreamBuildingFoundationsIn();
	void OnRep_bDisableHUD();
	void OnRep_bLockingOnFocalPoint();
	void OnRep_bPlayersAreInvincible();
	void OnRep_DelayPlayersFromReturningToLobbyData();
	void OnRep_GameResumed();
	void OnRep_LastCSVEventName();
	void OnRep_TerrainMapsToUnload();
	void OnWarmUpTeleportComplete(class AFortPlayerPawn* PlayerPawn);
	void PauseStormDamage(bool bPause);
	void PauseStormProgression(bool bPause);
	void PauseSupplyDrops(bool bPause);
	void PauseWinCondition(bool bLockScores);
	void PlacePlayersInAircraft();
	void PopSpecialEventEmoteInputComponent();
	void PushSpecialEventEmoteInputComponent();
	void RemoveFromBlockedNativeActions(const struct FGameplayTagContainer& Actions);
	void ResetMatchTimeToPrevious();
	void ResetSafeZoneOverrideAfterEvent(int32 MinResetSafeZoneIndex, float MinDelayReturnToMainMenu, float MaxDelayReturnToMainMenu);
	void ResetSpecialEventAircraft();
	void ResetWinCondition();
	void ResetWinConditionProgressToZero();
	void ResumeWinCondition();
	void SendToNightNight();
	void SetAdditionalViewpoint(const struct FVector& WorldLocation);
	void SetCanStreamBuildingFoundationsIn(bool bEnable);
	void SetDestroyVehiclesInStorm(bool bDestroyVehiclesInStorm);
	void SetIsSimulatingDamage(bool bIsSimulating);
	void SetLockingOnFocalPoint(bool bInLockingOnFocalPoint);
	void SetMatchTime(int32 NewMatchTime);
	void SetNamedWeightForContainerLootRoll(const class FName WeightName);
	void SetReturnToMainMenuDelay(float MinDelayReturnToMainMenu, float MaxDelayReturnToMainMenu);
	void SetWeightForContainerLootRoll(const float Weight);
	void ShrinkSafeZone();
	void StartSafeZoneOverrideForEvent(int32 SafeZoneIndexForEvent);
	void SwapBodyParts(const int32 ArrayIndex, class AFortPlayerController* FortPC);
	void TeleportAllPlayers(const struct FGameplayTagContainer& EventTags, int32 TeleportsPerFrame, int32 SafeZoneIndex);
	void ToggleAllPlayersInvincibility(bool bInvincible);
	void ToggleDisableParachutes(bool bDisable);
	void ToggleDisableWeapons(bool bDisableWeapons);
	void ToggleHUDs(bool bHide);
	void UnloadTerrainMaps(const struct FGameplayTag& MapTag);
	void WarmUpIslandUpdated();

	bool GetHasInfiniteSafeZonePhase() const;
	class ASpecialEventScript* GetScript() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_SpecialEvent">();
	}
	static class AFortAthenaMutator_SpecialEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_SpecialEvent>();
	}
};
static_assert(alignof(AFortAthenaMutator_SpecialEvent) == 0x000008, "Wrong alignment on AFortAthenaMutator_SpecialEvent");
static_assert(sizeof(AFortAthenaMutator_SpecialEvent) == 0x000720, "Wrong size on AFortAthenaMutator_SpecialEvent");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, TeleportAllPlayersFinished) == 0x000318, "Member 'AFortAthenaMutator_SpecialEvent::TeleportAllPlayersFinished' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, OnPawnLoaded) == 0x000328, "Member 'AFortAthenaMutator_SpecialEvent::OnPawnLoaded' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, OnInitController) == 0x000338, "Member 'AFortAthenaMutator_SpecialEvent::OnInitController' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, OnResumeGame) == 0x000348, "Member 'AFortAthenaMutator_SpecialEvent::OnResumeGame' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, OnSpecialClientEvent) == 0x000358, "Member 'AFortAthenaMutator_SpecialEvent::OnSpecialClientEvent' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, OnHandleLogout) == 0x000368, "Member 'AFortAthenaMutator_SpecialEvent::OnHandleLogout' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, OnClientInitialLoadingFinished) == 0x000378, "Member 'AFortAthenaMutator_SpecialEvent::OnClientInitialLoadingFinished' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bPlayersAreInvincible) == 0x0003F0, "Member 'AFortAthenaMutator_SpecialEvent::bPlayersAreInvincible' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, MinimumScoreBumpForAutomadeGoal) == 0x000418, "Member 'AFortAthenaMutator_SpecialEvent::MinimumScoreBumpForAutomadeGoal' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, ScoreBrackets) == 0x000420, "Member 'AFortAthenaMutator_SpecialEvent::ScoreBrackets' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bEnforceInfiniteSafeZonePhase) == 0x000430, "Member 'AFortAthenaMutator_SpecialEvent::bEnforceInfiniteSafeZonePhase' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, WarmupIslandPlayerStartTag) == 0x000434, "Member 'AFortAthenaMutator_SpecialEvent::WarmupIslandPlayerStartTag' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bAllowInventoryOpen) == 0x000438, "Member 'AFortAthenaMutator_SpecialEvent::bAllowInventoryOpen' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bAllowFullScreenMap) == 0x000440, "Member 'AFortAthenaMutator_SpecialEvent::bAllowFullScreenMap' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bShouldClearFrontEndMapMarkers) == 0x000468, "Member 'AFortAthenaMutator_SpecialEvent::bShouldClearFrontEndMapMarkers' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bBlockTeamIndicators) == 0x000469, "Member 'AFortAthenaMutator_SpecialEvent::bBlockTeamIndicators' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, UIToHideDuringSpecialEvent) == 0x000470, "Member 'AFortAthenaMutator_SpecialEvent::UIToHideDuringSpecialEvent' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, UIToHideWhenInInfiniteWarmup) == 0x000490, "Member 'AFortAthenaMutator_SpecialEvent::UIToHideWhenInInfiniteWarmup' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, ClientEventsThatUnhideHiddenWhileLoadingHUDElements) == 0x0004B0, "Member 'AFortAthenaMutator_SpecialEvent::ClientEventsThatUnhideHiddenWhileLoadingHUDElements' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bForceGarbageCollectionAfterUnloadOnServer) == 0x0004D0, "Member 'AFortAthenaMutator_SpecialEvent::bForceGarbageCollectionAfterUnloadOnServer' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bForceGarbageCollectionAfterUnloadOnClient) == 0x0004D1, "Member 'AFortAthenaMutator_SpecialEvent::bForceGarbageCollectionAfterUnloadOnClient' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bFullPurgeGC) == 0x0004D2, "Member 'AFortAthenaMutator_SpecialEvent::bFullPurgeGC' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, EventAircraft) == 0x0004D8, "Member 'AFortAthenaMutator_SpecialEvent::EventAircraft' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, EventAircraftInfo) == 0x0004E0, "Member 'AFortAthenaMutator_SpecialEvent::EventAircraftInfo' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, EventAircraftClass) == 0x000528, "Member 'AFortAthenaMutator_SpecialEvent::EventAircraftClass' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, ScriptActor) == 0x000530, "Member 'AFortAthenaMutator_SpecialEvent::ScriptActor' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bDisableHUD) == 0x000538, "Member 'AFortAthenaMutator_SpecialEvent::bDisableHUD' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, GameResumed) == 0x000539, "Member 'AFortAthenaMutator_SpecialEvent::GameResumed' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, AdditionalViewpoint) == 0x000540, "Member 'AFortAthenaMutator_SpecialEvent::AdditionalViewpoint' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bParachutesDisabled) == 0x000558, "Member 'AFortAthenaMutator_SpecialEvent::bParachutesDisabled' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, LastCSVEventName) == 0x000560, "Member 'AFortAthenaMutator_SpecialEvent::LastCSVEventName' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bCanStreamBuildingFoundationsIn) == 0x000570, "Member 'AFortAthenaMutator_SpecialEvent::bCanStreamBuildingFoundationsIn' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, AllPlayerTeleportedCount) == 0x000574, "Member 'AFortAthenaMutator_SpecialEvent::AllPlayerTeleportedCount' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, DelayPlayersFromReturningToLobbyData) == 0x000578, "Member 'AFortAthenaMutator_SpecialEvent::DelayPlayersFromReturningToLobbyData' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, NamedWeightForContainerLootRoll) == 0x000588, "Member 'AFortAthenaMutator_SpecialEvent::NamedWeightForContainerLootRoll' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, WeightForContainerLootRoll) == 0x00058C, "Member 'AFortAthenaMutator_SpecialEvent::WeightForContainerLootRoll' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, SpecialEventEmoteData) == 0x0005C0, "Member 'AFortAthenaMutator_SpecialEvent::SpecialEventEmoteData' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, BlockedNativeActions) == 0x0005D0, "Member 'AFortAthenaMutator_SpecialEvent::BlockedNativeActions' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, SpecialEventsInputComponent) == 0x0005F0, "Member 'AFortAthenaMutator_SpecialEvent::SpecialEventsInputComponent' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bLockingOnFocalPoint) == 0x0005F8, "Member 'AFortAthenaMutator_SpecialEvent::bLockingOnFocalPoint' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, SpecialEventOverrideParts) == 0x000600, "Member 'AFortAthenaMutator_SpecialEvent::SpecialEventOverrideParts' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, GameplayEffectToApplyOnSwapToDefault) == 0x000610, "Member 'AFortAthenaMutator_SpecialEvent::GameplayEffectToApplyOnSwapToDefault' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, OverridePartsArrayIndexMap) == 0x000620, "Member 'AFortAthenaMutator_SpecialEvent::OverridePartsArrayIndexMap' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, GameplayEffectsToApplyOnLogin) == 0x000670, "Member 'AFortAthenaMutator_SpecialEvent::GameplayEffectsToApplyOnLogin' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, TerrainMapsToUnload) == 0x000680, "Member 'AFortAthenaMutator_SpecialEvent::TerrainMapsToUnload' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, UnhandledPlayerControllers) == 0x0006A0, "Member 'AFortAthenaMutator_SpecialEvent::UnhandledPlayerControllers' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, HLODActorsToHideNames) == 0x0006B0, "Member 'AFortAthenaMutator_SpecialEvent::HLODActorsToHideNames' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bForceAllowCloth) == 0x0006C0, "Member 'AFortAthenaMutator_SpecialEvent::bForceAllowCloth' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, bCanToggleCursorModeInStasis) == 0x0006C2, "Member 'AFortAthenaMutator_SpecialEvent::bCanToggleCursorModeInStasis' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, MannequinRecentlyRenderedCheckToleranceValue) == 0x0006C8, "Member 'AFortAthenaMutator_SpecialEvent::MannequinRecentlyRenderedCheckToleranceValue' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, SpecialEventMannequins) == 0x0006F0, "Member 'AFortAthenaMutator_SpecialEvent::SpecialEventMannequins' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEvent, ActorSpawnDelegateClasses) == 0x000700, "Member 'AFortAthenaMutator_SpecialEvent::ActorSpawnDelegateClasses' has a wrong offset!");

// Class SpecialEventGameplayRuntime.FortAthenaMutator_SpecialEventTODM
// 0x0030 (0x0348 - 0x0318)
class AFortAthenaMutator_SpecialEventTODM final : public AFortAthenaMutator
{
public:
	TArray<struct FSpecialEventTODMPhaseData>     PhaseDataArray;                                    // 0x0318(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class ASpecialEventScript*                    SpecialEventScript;                                // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  SpawnedTODM;                                       // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPhaseActivated(class ASpecialEventScript* InSpecialEventScript, class ASpecialEventPhase* InSpecialEventPhase);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_SpecialEventTODM">();
	}
	static class AFortAthenaMutator_SpecialEventTODM* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_SpecialEventTODM>();
	}
};
static_assert(alignof(AFortAthenaMutator_SpecialEventTODM) == 0x000008, "Wrong alignment on AFortAthenaMutator_SpecialEventTODM");
static_assert(sizeof(AFortAthenaMutator_SpecialEventTODM) == 0x000348, "Wrong size on AFortAthenaMutator_SpecialEventTODM");
static_assert(offsetof(AFortAthenaMutator_SpecialEventTODM, PhaseDataArray) == 0x000318, "Member 'AFortAthenaMutator_SpecialEventTODM::PhaseDataArray' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEventTODM, SpecialEventScript) == 0x000328, "Member 'AFortAthenaMutator_SpecialEventTODM::SpecialEventScript' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SpecialEventTODM, SpawnedTODM) == 0x000340, "Member 'AFortAthenaMutator_SpecialEventTODM::SpawnedTODM' has a wrong offset!");

// Class SpecialEventGameplayRuntime.FortCameraMode_SpecialEventFocalPoint
// 0x0010 (0x1AC0 - 0x1AB0)
class UFortCameraMode_SpecialEventFocalPoint final : public UFortCameraMode_FocalPoint
{
public:
	float                                         OverrideTransitionTime;                            // 0x1AB0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AB4[0xC];                                     // 0x1AB4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBecomeActiveBP(class AActor* ViewTarget);
	void OnBecomeInactiveBP(class AActor* ViewTarget);
	void SetOverrideTransitionTime(const float InTransitionTime);
	void UpdateCameraBP(class AActor* ViewTarget, float DeltaTime, struct FTViewTarget& OutVT);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraMode_SpecialEventFocalPoint">();
	}
	static class UFortCameraMode_SpecialEventFocalPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraMode_SpecialEventFocalPoint>();
	}
};
static_assert(alignof(UFortCameraMode_SpecialEventFocalPoint) == 0x000010, "Wrong alignment on UFortCameraMode_SpecialEventFocalPoint");
static_assert(sizeof(UFortCameraMode_SpecialEventFocalPoint) == 0x001AC0, "Wrong size on UFortCameraMode_SpecialEventFocalPoint");
static_assert(offsetof(UFortCameraMode_SpecialEventFocalPoint, OverrideTransitionTime) == 0x001AB0, "Member 'UFortCameraMode_SpecialEventFocalPoint::OverrideTransitionTime' has a wrong offset!");

// Class SpecialEventGameplayRuntime.FortCharacterMovementMutatorComponent
// 0x0880 (0x0920 - 0x00A0)
class UFortCharacterMovementMutatorComponent final : public UActorComponent
{
public:
	class ACharacter*                             CharacterOwner;                                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMovementComp_CharacterAthena*      MovementComponent;                                 // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMovementComp_CharacterAthena*      CDOMovementComponent;                              // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BuffetBubblesMoveToBoxSpeed;                       // 0x00C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesRelativeVelocityInterpSpeed;          // 0x00F0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesLocationInterpSpeed;                  // 0x0118(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesRotationInterpSpeed;                  // 0x0140(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesMinRelativeX;                         // 0x0168(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesMaxRelativeX;                         // 0x0190(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesMinRelativeY;                         // 0x01B8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesMaxRelativeY;                         // 0x01E0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesMinRelativeZ;                         // 0x0208(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesMaxRelativeZ;                         // 0x0230(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               BuffetBubblesRotationRate;                         // 0x0258(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesMaxAcceleration;                      // 0x0270(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesMaxRelativeSpeed;                     // 0x0298(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesRelativeDeceleration;                 // 0x02C0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetBubblesSphereRadius;                         // 0x02E8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 BuffetBubblesFollowActor;                          // 0x0310(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                BuffetBubblesInitialFollowBoxOffsetPercent;        // 0x0318(0x0018)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_330[0xE0];                                     // 0x0330(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBuffetBubblesReplicatedData           BuffetBubblesReplicatedData;                       // 0x0410(0x0080)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_490[0x280];                                    // 0x0490(0x0280)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BuffetBubblesIntroSpeed;                           // 0x0710(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_738[0x8];                                      // 0x0738(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BuffetBubblesIntroTargetTransform;                 // 0x0740(0x0060)(Net, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetFlyingMaxPitchDegrees;                       // 0x07A0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetFlyingMaxSpeed;                              // 0x07C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetFlyingVelocityDirectionInterpSpeed;          // 0x07F0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               BuffetFlyingRotationRate;                          // 0x0818(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         BuffetFlyingMaxSpeedOverride;                      // 0x0830(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BuffetFlyingMaxSpeedInterpSpeed;                   // 0x0834(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_838[0x4];                                      // 0x0838(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BuffetFlyingVelocityDirectionInterpSpeedOverride;  // 0x083C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         BuffetFlyingRicochetSphereSize;                    // 0x0840(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetFlyingRicochetRotationDuration;              // 0x0868(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BuffetFlyingRicochetControlRotationInterpSpeed;    // 0x0890(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8B8[0x48];                                     // 0x08B8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBuffetFlyingRicochetReplicatedData    BuffetFlyingRicochetReplicatedData;                // 0x0900(0x0020)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void OnMovementModeChanged(class ACharacter* Character, EMovementMode PreviousMovementMode, uint8 PreviousCustomMode);
	void OnRep_BuffetBubblesFollowActor();
	void OnRep_BuffetFlyingRicochetReplicatedData();
	void OverrideBuffetFlyingMaxSpeed(const float Value, const bool bAsMultiplier, const float InterpSpeed);
	void OverrideBuffetFlyingVelocityDirectionInterpSpeed(const float Value, const bool bAsMultiplier);
	void SetBuffetBubblesFollowActor(class AActor* Actor);
	void SetBuffetBubblesInitialFollowBoxOffsetPercent(const struct FVector& BoxOffsetPercent);
	void SetBuffetBubblesIntroTargetTransform(const struct FTransform& Transform);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCharacterMovementMutatorComponent">();
	}
	static class UFortCharacterMovementMutatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCharacterMovementMutatorComponent>();
	}
};
static_assert(alignof(UFortCharacterMovementMutatorComponent) == 0x000010, "Wrong alignment on UFortCharacterMovementMutatorComponent");
static_assert(sizeof(UFortCharacterMovementMutatorComponent) == 0x000920, "Wrong size on UFortCharacterMovementMutatorComponent");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, CharacterOwner) == 0x0000A0, "Member 'UFortCharacterMovementMutatorComponent::CharacterOwner' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, MovementComponent) == 0x0000A8, "Member 'UFortCharacterMovementMutatorComponent::MovementComponent' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, CDOMovementComponent) == 0x0000B0, "Member 'UFortCharacterMovementMutatorComponent::CDOMovementComponent' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesMoveToBoxSpeed) == 0x0000C8, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesMoveToBoxSpeed' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesRelativeVelocityInterpSpeed) == 0x0000F0, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesRelativeVelocityInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesLocationInterpSpeed) == 0x000118, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesLocationInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesRotationInterpSpeed) == 0x000140, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesRotationInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesMinRelativeX) == 0x000168, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesMinRelativeX' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesMaxRelativeX) == 0x000190, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesMaxRelativeX' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesMinRelativeY) == 0x0001B8, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesMinRelativeY' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesMaxRelativeY) == 0x0001E0, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesMaxRelativeY' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesMinRelativeZ) == 0x000208, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesMinRelativeZ' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesMaxRelativeZ) == 0x000230, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesMaxRelativeZ' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesRotationRate) == 0x000258, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesRotationRate' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesMaxAcceleration) == 0x000270, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesMaxAcceleration' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesMaxRelativeSpeed) == 0x000298, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesMaxRelativeSpeed' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesRelativeDeceleration) == 0x0002C0, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesRelativeDeceleration' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesSphereRadius) == 0x0002E8, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesSphereRadius' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesFollowActor) == 0x000310, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesFollowActor' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesInitialFollowBoxOffsetPercent) == 0x000318, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesInitialFollowBoxOffsetPercent' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesReplicatedData) == 0x000410, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesReplicatedData' has a wrong offset!");
static_assert(offsetof(UFortCharacterMovementMutatorComponent, BuffetBubblesIntroSpeed) == 0x000710, "Member 'UFortCharacterMovementMutatorComponent::BuffetBubblesIntroSpeed' has a wrong offset!");
