#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Speech

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Speech.Speech_C
// 0x0010 (0x0248 - 0x0238)
class USpeech_C final : public UFortConversationTaskNode_Speech
{
public:
	struct FGameplayTag                           SpeakerTag;                                        // 0x0238(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ListenerTag;                                       // 0x023C(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceOverTag;                                      // 0x0240(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void SwapSpeakerAndListener();

	void HandleVOPlayback(const struct FConversationContext& Context) const;
	class FText GetParticipantNameStyled(const struct FConversationContext& Context, const struct FGameplayTag& ParticipantTag) const;
	bool GetNodeBodyColor(struct FLinearColor* BodyColor) const;
	struct FConversationTaskResult ExecuteTaskNode(const struct FConversationContext& Context) const;
	void ExecuteClientEffects(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Speech_C">();
	}
	static class USpeech_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpeech_C>();
	}
};
static_assert(alignof(USpeech_C) == 0x000008, "Wrong alignment on USpeech_C");
static_assert(sizeof(USpeech_C) == 0x000248, "Wrong size on USpeech_C");
static_assert(offsetof(USpeech_C, SpeakerTag) == 0x000238, "Member 'USpeech_C::SpeakerTag' has a wrong offset!");
static_assert(offsetof(USpeech_C, ListenerTag) == 0x00023C, "Member 'USpeech_C::ListenerTag' has a wrong offset!");
static_assert(offsetof(USpeech_C, VoiceOverTag) == 0x000240, "Member 'USpeech_C::VoiceOverTag' has a wrong offset!");

}

