#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SquadLockScannerRay

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SquadLockScannerRay.SquadLockScannerRay
// 0x0018 (0x0018 - 0x0000)
struct FSquadLockScannerRay final
{
public:
	class AFortPawn*                              Pawn_17_CA2911E448C8191BD27FA28C945C96FA;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SMComp_2_9161E59C4F3629E93C3B238AA11CB77B;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AimActive_10_7CE804AF4B674E9FE898FCBB9EDA2C90;     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UnAimActive_12_9B66154E49CF5DD3A1CABAB49F3169AC;   // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSquadLockScannerRay) == 0x000008, "Wrong alignment on FSquadLockScannerRay");
static_assert(sizeof(FSquadLockScannerRay) == 0x000018, "Wrong size on FSquadLockScannerRay");
static_assert(offsetof(FSquadLockScannerRay, Pawn_17_CA2911E448C8191BD27FA28C945C96FA) == 0x000000, "Member 'FSquadLockScannerRay::Pawn_17_CA2911E448C8191BD27FA28C945C96FA' has a wrong offset!");
static_assert(offsetof(FSquadLockScannerRay, SMComp_2_9161E59C4F3629E93C3B238AA11CB77B) == 0x000008, "Member 'FSquadLockScannerRay::SMComp_2_9161E59C4F3629E93C3B238AA11CB77B' has a wrong offset!");
static_assert(offsetof(FSquadLockScannerRay, AimActive_10_7CE804AF4B674E9FE898FCBB9EDA2C90) == 0x000010, "Member 'FSquadLockScannerRay::AimActive_10_7CE804AF4B674E9FE898FCBB9EDA2C90' has a wrong offset!");
static_assert(offsetof(FSquadLockScannerRay, UnAimActive_12_9B66154E49CF5DD3A1CABAB49F3169AC) == 0x000011, "Member 'FSquadLockScannerRay::UnAimActive_12_9B66154E49CF5DD3A1CABAB49F3169AC' has a wrong offset!");

}

