#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanchUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio
// 0x0010 (0x0108 - 0x00F8)
class UFortMobileActionButtonBehavior_ToggleRadio : public UFortMobileActionButtonBehavior
{
public:
	class UPaperSprite*                           ToggleRadioOffSprite;                              // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleRadioPlaying(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void HandleRadioStopped(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_ToggleRadio">();
	}
	static class UFortMobileActionButtonBehavior_ToggleRadio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_ToggleRadio>();
	}
};
static_assert(alignof(UFortMobileActionButtonBehavior_ToggleRadio) == 0x000008, "Wrong alignment on UFortMobileActionButtonBehavior_ToggleRadio");
static_assert(sizeof(UFortMobileActionButtonBehavior_ToggleRadio) == 0x000108, "Wrong size on UFortMobileActionButtonBehavior_ToggleRadio");
static_assert(offsetof(UFortMobileActionButtonBehavior_ToggleRadio, ToggleRadioOffSprite) == 0x0000F8, "Member 'UFortMobileActionButtonBehavior_ToggleRadio::ToggleRadioOffSprite' has a wrong offset!");

// Class SrirachaRanchUI.RadioPlayerWidgetBase
// 0x0050 (0x0370 - 0x0320)
class URadioPlayerWidgetBase final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_320[0x40];                                     // 0x0320(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PriorityData;                                      // 0x0360(0x0002)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStreamingRadioPlayerComponent*         LastValidComp;                                     // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void NativeEnteredVehicle();
	void NativeExitedVehicle();
	void OnControllerGainedNewFortPawn(class AFortPawn* FortPawn);
	void OnDisconnectFromComp();
	void OnFailedToOpenSource(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void OnLoadingNewSource(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void OnRadioStopped(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& LastSource);
	void OnShouldShowDueToEntrance();
	void OnSourceFinished(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void OnSourcePlaying(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void SetControllable(bool bCanControl);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RadioPlayerWidgetBase">();
	}
	static class URadioPlayerWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadioPlayerWidgetBase>();
	}
};
static_assert(alignof(URadioPlayerWidgetBase) == 0x000008, "Wrong alignment on URadioPlayerWidgetBase");
static_assert(sizeof(URadioPlayerWidgetBase) == 0x000370, "Wrong size on URadioPlayerWidgetBase");
static_assert(offsetof(URadioPlayerWidgetBase, PriorityData) == 0x000360, "Member 'URadioPlayerWidgetBase::PriorityData' has a wrong offset!");
static_assert(offsetof(URadioPlayerWidgetBase, LastValidComp) == 0x000368, "Member 'URadioPlayerWidgetBase::LastValidComp' has a wrong offset!");

}

