#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanch

#include "Basic.hpp"


namespace SDK
{

// Enum SrirachaRanch.EOnlineRadioSourceType
// NumValues: 0x0002
enum class EOnlineRadioSourceType : uint8
{
	Epic                                     = 0,
	EOnlineRadioSourceType_MAX               = 1,
};

// Enum SrirachaRanch.ERadioSource
// NumValues: 0x0003
enum class ERadioSource : uint8
{
	Invalid                                  = 0,
	Vehicle                                  = 1,
	ERadioSource_MAX                         = 2,
};

// Enum SrirachaRanch.EStreamingRadioSourceState
// NumValues: 0x0006
enum class EStreamingRadioSourceState : uint8
{
	None                                     = 0,
	Loading                                  = 1,
	LoadingPlayer                            = 2,
	LoadedPlayer                             = 3,
	Playing                                  = 4,
	EStreamingRadioSourceState_MAX           = 5,
};

// ScriptStruct SrirachaRanch.AthenaRadioStation
// 0x0038 (0x0038 - 0x0000)
struct FAthenaRadioStation final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 StationImage;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ResourceID;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAthenaRadioStation) == 0x000008, "Wrong alignment on FAthenaRadioStation");
static_assert(sizeof(FAthenaRadioStation) == 0x000038, "Wrong size on FAthenaRadioStation");
static_assert(offsetof(FAthenaRadioStation, Title) == 0x000000, "Member 'FAthenaRadioStation::Title' has a wrong offset!");
static_assert(offsetof(FAthenaRadioStation, StationImage) == 0x000018, "Member 'FAthenaRadioStation::StationImage' has a wrong offset!");
static_assert(offsetof(FAthenaRadioStation, ResourceID) == 0x000028, "Member 'FAthenaRadioStation::ResourceID' has a wrong offset!");

// ScriptStruct SrirachaRanch.SrirachaInputMappingData
// 0x0020 (0x0020 - 0x0000)
struct FSrirachaInputMappingData final
{
public:
	class FName                                   MainActionName;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GamepadActionName;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSrirachaInputMappingData) == 0x000008, "Wrong alignment on FSrirachaInputMappingData");
static_assert(sizeof(FSrirachaInputMappingData) == 0x000020, "Wrong size on FSrirachaInputMappingData");
static_assert(offsetof(FSrirachaInputMappingData, MainActionName) == 0x000000, "Member 'FSrirachaInputMappingData::MainActionName' has a wrong offset!");
static_assert(offsetof(FSrirachaInputMappingData, GamepadActionName) == 0x000004, "Member 'FSrirachaInputMappingData::GamepadActionName' has a wrong offset!");
static_assert(offsetof(FSrirachaInputMappingData, DisplayName) == 0x000008, "Member 'FSrirachaInputMappingData::DisplayName' has a wrong offset!");

// ScriptStruct SrirachaRanch.SrirachaPerClassSpecialSeats
// 0x0010 (0x0010 - 0x0000)
struct FSrirachaPerClassSpecialSeats final
{
public:
	TArray<int32>                                 OutsideSeatIndices;                                // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSrirachaPerClassSpecialSeats) == 0x000008, "Wrong alignment on FSrirachaPerClassSpecialSeats");
static_assert(sizeof(FSrirachaPerClassSpecialSeats) == 0x000010, "Wrong size on FSrirachaPerClassSpecialSeats");
static_assert(offsetof(FSrirachaPerClassSpecialSeats, OutsideSeatIndices) == 0x000000, "Member 'FSrirachaPerClassSpecialSeats::OutsideSeatIndices' has a wrong offset!");

// ScriptStruct SrirachaRanch.StreamingRadioSourceData
// 0x0048 (0x0048 - 0x0000)
struct FStreamingRadioSourceData final
{
public:
	EStreamingRadioSourceState                    State;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayingIndex;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeoutSeconds;                                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaRadioStation                    SourceOverride;                                    // 0x0010(0x0038)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FStreamingRadioSourceData) == 0x000008, "Wrong alignment on FStreamingRadioSourceData");
static_assert(sizeof(FStreamingRadioSourceData) == 0x000048, "Wrong size on FStreamingRadioSourceData");
static_assert(offsetof(FStreamingRadioSourceData, State) == 0x000000, "Member 'FStreamingRadioSourceData::State' has a wrong offset!");
static_assert(offsetof(FStreamingRadioSourceData, PlayingIndex) == 0x000004, "Member 'FStreamingRadioSourceData::PlayingIndex' has a wrong offset!");
static_assert(offsetof(FStreamingRadioSourceData, FadeoutSeconds) == 0x000008, "Member 'FStreamingRadioSourceData::FadeoutSeconds' has a wrong offset!");
static_assert(offsetof(FStreamingRadioSourceData, SourceOverride) == 0x000010, "Member 'FStreamingRadioSourceData::SourceOverride' has a wrong offset!");

}

