#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StarlightPrompt

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function StarlightPrompt.StarlightPrompt_C.ExecuteUbergraph_StarlightPrompt
// 0x0070 (0x0070 - 0x0000)
struct StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortHUDTagPromptData                  K2Node_Event_PrompData;                            // 0x0008(0x0048)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt) == 0x000008, "Wrong alignment on StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt");
static_assert(sizeof(StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt) == 0x000070, "Wrong size on StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt");
static_assert(offsetof(StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt, EntryPoint) == 0x000000, "Member 'StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt, K2Node_Event_PrompData) == 0x000008, "Member 'StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt::K2Node_Event_PrompData' has a wrong offset!");
static_assert(offsetof(StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt, CallFunc_PlayAnimationForward_ReturnValue) == 0x000050, "Member 'StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'StarlightPrompt_C_ExecuteUbergraph_StarlightPrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function StarlightPrompt.StarlightPrompt_C.OpenWidget
// 0x0048 (0x0048 - 0x0000)
struct StarlightPrompt_C_OpenWidget final
{
public:
	struct FFortHUDTagPromptData                  PrompData;                                         // 0x0000(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(StarlightPrompt_C_OpenWidget) == 0x000008, "Wrong alignment on StarlightPrompt_C_OpenWidget");
static_assert(sizeof(StarlightPrompt_C_OpenWidget) == 0x000048, "Wrong size on StarlightPrompt_C_OpenWidget");
static_assert(offsetof(StarlightPrompt_C_OpenWidget, PrompData) == 0x000000, "Member 'StarlightPrompt_C_OpenWidget::PrompData' has a wrong offset!");

}

