#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StashItem_TaskNode

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonConversationRuntime_structs.hpp"


namespace SDK::Params
{

// Function StashItem_TaskNode.StashItem_TaskNode_C.WasPreviouslyStashedItemInvalid
// 0x01C8 (0x01C8 - 0x0000)
struct StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInvalidItem;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortControllerComponent_CampsiteAccountItem* CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemEntry                         CallFunc_GetCurrentlyStashedItemAsItemEntry_ReturnValue; // 0x0020(0x01A0)()
	bool                                          CallFunc_IsItemEntryAvailable_ReturnValue;         // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCurrentlyStashedItem_ReturnValue;      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid) == 0x000008, "Wrong alignment on StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid");
static_assert(sizeof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid) == 0x0001C8, "Wrong size on StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid");
static_assert(offsetof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid, Actor) == 0x000000, "Member 'StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid::Actor' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid, bInvalidItem) == 0x000008, "Member 'StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid::bInvalidItem' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid, CallFunc_GetCurrentlyStashedItemAsItemEntry_ReturnValue) == 0x000020, "Member 'StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid::CallFunc_GetCurrentlyStashedItemAsItemEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid, CallFunc_IsItemEntryAvailable_ReturnValue) == 0x0001C0, "Member 'StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid::CallFunc_IsItemEntryAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid, CallFunc_HasCurrentlyStashedItem_ReturnValue) == 0x0001C1, "Member 'StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid::CallFunc_HasCurrentlyStashedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid, CallFunc_Not_PreBool_ReturnValue) == 0x0001C2, "Member 'StashItem_TaskNode_C_WasPreviouslyStashedItemInvalid::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function StashItem_TaskNode.StashItem_TaskNode_C.SendQuestEventForRarity
// 0x0018 (0x0018 - 0x0000)
struct StashItem_TaskNode_C_SendQuestEventForRarity final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StashItem_TaskNode_C_SendQuestEventForRarity) == 0x000008, "Wrong alignment on StashItem_TaskNode_C_SendQuestEventForRarity");
static_assert(sizeof(StashItem_TaskNode_C_SendQuestEventForRarity) == 0x000018, "Wrong size on StashItem_TaskNode_C_SendQuestEventForRarity");
static_assert(offsetof(StashItem_TaskNode_C_SendQuestEventForRarity, Player) == 0x000000, "Member 'StashItem_TaskNode_C_SendQuestEventForRarity::Player' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_SendQuestEventForRarity, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000008, "Member 'StashItem_TaskNode_C_SendQuestEventForRarity::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_SendQuestEventForRarity, CallFunc_GetQuestManager_ReturnValue) == 0x000010, "Member 'StashItem_TaskNode_C_SendQuestEventForRarity::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function StashItem_TaskNode.StashItem_TaskNode_C.ItemRarityMythicOrTranscendent
// 0x0080 (0x0080 - 0x0000)
struct StashItem_TaskNode_C_ItemRarityMythicOrTranscendent final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MeetsRarityCriteria;                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RarityTags;                                        // 0x0010(0x0020)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetInventoryGUID_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_BP_GetInventoryItemWithGuid_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent) == 0x000008, "Wrong alignment on StashItem_TaskNode_C_ItemRarityMythicOrTranscendent");
static_assert(sizeof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent) == 0x000080, "Wrong size on StashItem_TaskNode_C_ItemRarityMythicOrTranscendent");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, Player) == 0x000000, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::Player' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, MeetsRarityCriteria) == 0x000008, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::MeetsRarityCriteria' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, RarityTags) == 0x000010, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::RarityTags' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, Temp_bool_Variable) == 0x000030, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000038, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, CallFunc_GetPlayerPawn_ReturnValue) == 0x000040, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000048, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, CallFunc_GetInventoryGUID_ReturnValue) == 0x000050, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::CallFunc_GetInventoryGUID_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, CallFunc_BP_GetInventoryItemWithGuid_ReturnValue) == 0x000060, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::CallFunc_BP_GetInventoryItemWithGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000068, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ItemRarityMythicOrTranscendent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000079, "Member 'StashItem_TaskNode_C_ItemRarityMythicOrTranscendent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function StashItem_TaskNode.StashItem_TaskNode_C.GatherStaticExtraData
// 0x01E8 (0x01E8 - 0x0000)
struct StashItem_TaskNode_C_GatherStaticExtraData final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<struct FConversationNodeParameterPair> InOutExtraData;                                    // 0x0038(0x0010)(Parm, OutParm)
	class AActor*                                 CallFunc_GetParticipantActorPlayer_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasPreviouslyStashedItemInvalid_bInvalidItem; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FConversationNodeParameterPair         K2Node_MakeStruct_ConversationNodeParameterPair;   // 0x0068(0x0020)()
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConversationNodeParameterPair> CallFunc_GatherStaticExtraData_InOutExtraData;     // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetInventoryGUID_ReturnValue;             // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_GuidToString_ReturnValue;            // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FConversationNodeParameterPair         K2Node_MakeStruct_ConversationNodeParameterPair_1; // 0x00E8(0x0020)()
	class UFortItem*                              CallFunc_BP_GetInventoryItemWithGuid_ReturnValue;  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortItem>               CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0118(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLoadedAmmo_ReturnValue;                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConversationNodeParameterPair         K2Node_MakeStruct_ConversationNodeParameterPair_2; // 0x0158(0x0020)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesItemUseRangedWeaponAmmo_ReturnValue;  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FConversationNodeParameterPair         K2Node_MakeStruct_ConversationNodeParameterPair_3; // 0x01B8(0x0020)()
	TArray<struct FConversationNodeParameterPair> K2Node_MakeArray_Array;                            // 0x01D8(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(StashItem_TaskNode_C_GatherStaticExtraData) == 0x000008, "Wrong alignment on StashItem_TaskNode_C_GatherStaticExtraData");
static_assert(sizeof(StashItem_TaskNode_C_GatherStaticExtraData) == 0x0001E8, "Wrong size on StashItem_TaskNode_C_GatherStaticExtraData");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, Context) == 0x000000, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::Context' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, InOutExtraData) == 0x000038, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::InOutExtraData' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_GetParticipantActorPlayer_ReturnValue) == 0x000048, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_GetParticipantActorPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_WasPreviouslyStashedItemInvalid_bInvalidItem) == 0x000050, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_WasPreviouslyStashedItemInvalid_bInvalidItem' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_SelectString_ReturnValue) == 0x000058, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, K2Node_MakeStruct_ConversationNodeParameterPair) == 0x000068, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::K2Node_MakeStruct_ConversationNodeParameterPair' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000088, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_GatherStaticExtraData_InOutExtraData) == 0x000090, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_GatherStaticExtraData_InOutExtraData' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000A8, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_IsValid_ReturnValue_2) == 0x0000B0, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_GetCurrentWeapon_ReturnValue) == 0x0000B8, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_IsValid_ReturnValue_3) == 0x0000C0, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_GetInventoryGUID_ReturnValue) == 0x0000C4, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_GetInventoryGUID_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_Conv_GuidToString_ReturnValue) == 0x0000D8, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_Conv_GuidToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, K2Node_MakeStruct_ConversationNodeParameterPair_1) == 0x0000E8, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::K2Node_MakeStruct_ConversationNodeParameterPair_1' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_BP_GetInventoryItemWithGuid_ReturnValue) == 0x000108, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_BP_GetInventoryItemWithGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_IsValid_Guid_ReturnValue) == 0x000110, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000118, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000140, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_GetLoadedAmmo_ReturnValue) == 0x000150, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_GetLoadedAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, K2Node_MakeStruct_ConversationNodeParameterPair_2) == 0x000158, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::K2Node_MakeStruct_ConversationNodeParameterPair_2' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_Conv_IntToString_ReturnValue) == 0x000178, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_GetNumInStack_ReturnValue) == 0x000188, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_IsValid_ReturnValue_4) == 0x00018C, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000190, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, CallFunc_DoesItemUseRangedWeaponAmmo_ReturnValue) == 0x0001A0, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::CallFunc_DoesItemUseRangedWeaponAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, Temp_bool_Variable) == 0x0001A1, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, K2Node_Select_Default) == 0x0001A8, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, K2Node_MakeStruct_ConversationNodeParameterPair_3) == 0x0001B8, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::K2Node_MakeStruct_ConversationNodeParameterPair_3' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_GatherStaticExtraData, K2Node_MakeArray_Array) == 0x0001D8, "Member 'StashItem_TaskNode_C_GatherStaticExtraData::K2Node_MakeArray_Array' has a wrong offset!");

// Function StashItem_TaskNode.StashItem_TaskNode_C.ExecuteTaskNode
// 0x01E8 (0x01E8 - 0x0000)
struct StashItem_TaskNode_C_ExecuteTaskNode final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FConversationTaskResult                ReturnValue;                                       // 0x0038(0x0080)(Parm, OutParm, ReturnParm)
	struct FConversationTaskResult                CallFunc_AbortConversation_ReturnValue;            // 0x00B8(0x0080)()
	struct FConversationTaskResult                CallFunc_ExecuteTaskNode_ReturnValue;              // 0x0138(0x0080)()
	class AActor*                                 CallFunc_GetParticipantActorPlayer_ReturnValue;    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParticipantActorNPC_ReturnValue;       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortControllerComponent_CampsiteAccountItem* CallFunc_GetComponentByClass_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemRarityMythicOrTranscendent_MeetsRarityCriteria; // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StashCurrentlyHeldItemAndRemoveFromInventory_ReturnValue; // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StashItem_TaskNode_C_ExecuteTaskNode) == 0x000008, "Wrong alignment on StashItem_TaskNode_C_ExecuteTaskNode");
static_assert(sizeof(StashItem_TaskNode_C_ExecuteTaskNode) == 0x0001E8, "Wrong size on StashItem_TaskNode_C_ExecuteTaskNode");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, Context) == 0x000000, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::Context' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, ReturnValue) == 0x000038, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_AbortConversation_ReturnValue) == 0x0000B8, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_AbortConversation_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_ExecuteTaskNode_ReturnValue) == 0x000138, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_ExecuteTaskNode_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_GetParticipantActorPlayer_ReturnValue) == 0x0001B8, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_GetParticipantActorPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_GetParticipantActorNPC_ReturnValue) == 0x0001C0, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_GetParticipantActorNPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, K2Node_DynamicCast_AsBuilding_Actor) == 0x0001C8, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_GetComponentByClass_ReturnValue) == 0x0001D8, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_Not_PreBool_ReturnValue) == 0x0001E1, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_ItemRarityMythicOrTranscendent_MeetsRarityCriteria) == 0x0001E2, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_ItemRarityMythicOrTranscendent_MeetsRarityCriteria' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_IsValid_ReturnValue_1) == 0x0001E3, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_ExecuteTaskNode, CallFunc_StashCurrentlyHeldItemAndRemoveFromInventory_ReturnValue) == 0x0001E4, "Member 'StashItem_TaskNode_C_ExecuteTaskNode::CallFunc_StashCurrentlyHeldItemAndRemoveFromInventory_ReturnValue' has a wrong offset!");

// Function StashItem_TaskNode.StashItem_TaskNode_C.DoesItemUseRangedWeaponAmmo
// 0x0028 (0x0028 - 0x0000)
struct StashItem_TaskNode_C_DoesItemUseRangedWeaponAmmo final
{
public:
	class UFortItem*                              ItemObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponRangedItemDefinition*        K2Node_DynamicCast_AsFort_Weapon_Ranged_Item_Definition; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUniqueAmmo_ReturnValue;                // 0x0021(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StashItem_TaskNode_C_DoesItemUseRangedWeaponAmmo) == 0x000008, "Wrong alignment on StashItem_TaskNode_C_DoesItemUseRangedWeaponAmmo");
static_assert(sizeof(StashItem_TaskNode_C_DoesItemUseRangedWeaponAmmo) == 0x000028, "Wrong size on StashItem_TaskNode_C_DoesItemUseRangedWeaponAmmo");
static_assert(offsetof(StashItem_TaskNode_C_DoesItemUseRangedWeaponAmmo, ItemObject) == 0x000000, "Member 'StashItem_TaskNode_C_DoesItemUseRangedWeaponAmmo::ItemObject' has a wrong offset!");
static_assert(offsetof(StashItem_TaskNode_C_DoesItemUseRangedWeaponAmmo, ReturnValue) == 0x000008, "Member 'StashItem_TaskNode_C_DoesItemUseRangedWeaponAmmo::ReturnValue' has a wrong offset!");
