#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatusWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function StatusWidget.StatusWidget_C.SetContinueButtonText
// 0x0018 (0x0018 - 0x0000)
struct StatusWidget_C_SetContinueButtonText final
{
public:
	class FText                                   ContinueText;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(StatusWidget_C_SetContinueButtonText) == 0x000008, "Wrong alignment on StatusWidget_C_SetContinueButtonText");
static_assert(sizeof(StatusWidget_C_SetContinueButtonText) == 0x000018, "Wrong size on StatusWidget_C_SetContinueButtonText");
static_assert(offsetof(StatusWidget_C_SetContinueButtonText, ContinueText) == 0x000000, "Member 'StatusWidget_C_SetContinueButtonText::ContinueText' has a wrong offset!");

// Function StatusWidget.StatusWidget_C.ExecuteUbergraph_StatusWidget
// 0x0030 (0x0030 - 0x0000)
struct StatusWidget_C_ExecuteUbergraph_StatusWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_ContinueText;                         // 0x0008(0x0018)(ConstParm)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatusWidget_C_ExecuteUbergraph_StatusWidget) == 0x000008, "Wrong alignment on StatusWidget_C_ExecuteUbergraph_StatusWidget");
static_assert(sizeof(StatusWidget_C_ExecuteUbergraph_StatusWidget) == 0x000030, "Wrong size on StatusWidget_C_ExecuteUbergraph_StatusWidget");
static_assert(offsetof(StatusWidget_C_ExecuteUbergraph_StatusWidget, EntryPoint) == 0x000000, "Member 'StatusWidget_C_ExecuteUbergraph_StatusWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(StatusWidget_C_ExecuteUbergraph_StatusWidget, K2Node_Event_ContinueText) == 0x000008, "Member 'StatusWidget_C_ExecuteUbergraph_StatusWidget::K2Node_Event_ContinueText' has a wrong offset!");
static_assert(offsetof(StatusWidget_C_ExecuteUbergraph_StatusWidget, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000020, "Member 'StatusWidget_C_ExecuteUbergraph_StatusWidget::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(StatusWidget_C_ExecuteUbergraph_StatusWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'StatusWidget_C_ExecuteUbergraph_StatusWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

