#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatValueWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function StatValueWidget.StatValueWidget_C.ExecuteUbergraph_StatValueWidget
// 0x0120 (0x0120 - 0x0000)
struct StatValueWidget_C_ExecuteUbergraph_StatValueWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaBaseStatView*                    CallFunc_GetBaseStatView_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortUIStatStyle                       CallFunc_GetStatStyle_ReturnValue;                 // 0x0010(0x0100)(ConstParm)
	float                                         CallFunc_GetStat_ReturnValue;                      // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatValueWidget_C_ExecuteUbergraph_StatValueWidget) == 0x000010, "Wrong alignment on StatValueWidget_C_ExecuteUbergraph_StatValueWidget");
static_assert(sizeof(StatValueWidget_C_ExecuteUbergraph_StatValueWidget) == 0x000120, "Wrong size on StatValueWidget_C_ExecuteUbergraph_StatValueWidget");
static_assert(offsetof(StatValueWidget_C_ExecuteUbergraph_StatValueWidget, EntryPoint) == 0x000000, "Member 'StatValueWidget_C_ExecuteUbergraph_StatValueWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(StatValueWidget_C_ExecuteUbergraph_StatValueWidget, CallFunc_GetBaseStatView_ReturnValue) == 0x000008, "Member 'StatValueWidget_C_ExecuteUbergraph_StatValueWidget::CallFunc_GetBaseStatView_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatValueWidget_C_ExecuteUbergraph_StatValueWidget, CallFunc_GetStatStyle_ReturnValue) == 0x000010, "Member 'StatValueWidget_C_ExecuteUbergraph_StatValueWidget::CallFunc_GetStatStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatValueWidget_C_ExecuteUbergraph_StatValueWidget, CallFunc_GetStat_ReturnValue) == 0x000110, "Member 'StatValueWidget_C_ExecuteUbergraph_StatValueWidget::CallFunc_GetStat_ReturnValue' has a wrong offset!");

}

