#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StopLight_Struct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct StopLight_Struct.StopLight_Struct
// 0x0038 (0x0038 - 0x0000)
struct FStopLight_Struct final
{
public:
	class ULightComponent*                        Red_6_3729E3834F25C8A951860C97D0945944;            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        Yellow_7_6C58D2A34918F0E215C9F682FF3A57B6;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        Green_8_2BE045D44F0054B0640F1F82B34BA858;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DirectionalVector_11_A423D2724C4D4270A2271A856C3CF768; // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeOffset_14_74C4DDF5400E11B2170DA58470B261F0;    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PairingOffset_20_57900148418F6DBF13AE35902B285F27; // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStopLight_Struct) == 0x000008, "Wrong alignment on FStopLight_Struct");
static_assert(sizeof(FStopLight_Struct) == 0x000038, "Wrong size on FStopLight_Struct");
static_assert(offsetof(FStopLight_Struct, Red_6_3729E3834F25C8A951860C97D0945944) == 0x000000, "Member 'FStopLight_Struct::Red_6_3729E3834F25C8A951860C97D0945944' has a wrong offset!");
static_assert(offsetof(FStopLight_Struct, Yellow_7_6C58D2A34918F0E215C9F682FF3A57B6) == 0x000008, "Member 'FStopLight_Struct::Yellow_7_6C58D2A34918F0E215C9F682FF3A57B6' has a wrong offset!");
static_assert(offsetof(FStopLight_Struct, Green_8_2BE045D44F0054B0640F1F82B34BA858) == 0x000010, "Member 'FStopLight_Struct::Green_8_2BE045D44F0054B0640F1F82B34BA858' has a wrong offset!");
static_assert(offsetof(FStopLight_Struct, DirectionalVector_11_A423D2724C4D4270A2271A856C3CF768) == 0x000018, "Member 'FStopLight_Struct::DirectionalVector_11_A423D2724C4D4270A2271A856C3CF768' has a wrong offset!");
static_assert(offsetof(FStopLight_Struct, TimeOffset_14_74C4DDF5400E11B2170DA58470B261F0) == 0x000030, "Member 'FStopLight_Struct::TimeOffset_14_74C4DDF5400E11B2170DA58470B261F0' has a wrong offset!");
static_assert(offsetof(FStopLight_Struct, PairingOffset_20_57900148418F6DBF13AE35902B285F27) == 0x000034, "Member 'FStopLight_Struct::PairingOffset_20_57900148418F6DBF13AE35902B285F27' has a wrong offset!");

}

