#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_MTXOffer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreMain_MTXOffer.StoreMain_MTXOffer_C
// 0x0130 (0x11F0 - 0x10C0)
class UStoreMain_MTXOffer_C final : public UFortRealMoneyOffer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Linear;                                      // 0x10C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhoverNew;                                        // 0x10D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverNew;                                          // 0x10D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x10E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x10E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMTXOffer_SpecialBanner_C*              AthenaDirectAcquisitionOffer_SpecialBanner;        // 0x10F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColor;                                         // 0x10F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BonusTag;                                          // 0x1100(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BonusText;                                         // 0x1108(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Footer;                                     // 0x1110(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderAll;                                         // 0x1118(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BundleTotalQuantity;                               // 0x1120(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BundleVBucksText;                                  // 0x1128(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrencyTotalQuantity;                             // 0x1130(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Price;                                        // 0x1138(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverBorder;                                       // 0x1140(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyArt;                                            // 0x1148(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradient;                                   // 0x1150(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x1158(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayStationStoreLogo;                              // 0x1160(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Plus;                                              // 0x1168(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RMTBundle;                                         // 0x1170(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RMTCurrency;                                       // 0x1178(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RMTTypeSwitcher;                                   // 0x1180(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RMTVBucksHB;                                       // 0x1188(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxKeyArt;                                    // 0x1190(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_Price;                                    // 0x1198(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x11A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferName;                                     // 0x11A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferPurchaseUnvailable;                       // 0x11B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x11B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TileSize;                                          // 0x11C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       VBucksText;                                        // 0x11C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              AboutToShowDetails;                                // 0x11D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bCanSetPrice;                                      // 0x11E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E1[0x7];                                     // 0x11E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCatalogMessaging*                      CatalogMessaging;                                  // 0x11E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TriggerIntro();
	void SetTileSize(EFortMtxOfferDisplaySize DisplaySize);
	void SetTextOutlineColor(class UTextBlock* Text, const struct FFortMtxGradient& Gradient);
	void PreConstruct(bool IsDesignTime);
	void OnUpdateStorePrice(const class FText& InStorePrice);
	void TriggerReset();
	void InitialReset();
	void OnStoreSelectionOfferSet();
	void OnOfferTileBrushLoaded(const struct FSlateBrush& OfferBrush);
	void OnOfferSet();
	void InitOffer();
	void GetBonusText(class UFortStoreFrontOfferInfo* OfferInfo, class FText* BonusText_0);
	void ExecuteUbergraph_StoreMain_MTXOffer(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreMain_MTXOffer_C">();
	}
	static class UStoreMain_MTXOffer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreMain_MTXOffer_C>();
	}
};
static_assert(alignof(UStoreMain_MTXOffer_C) == 0x000010, "Wrong alignment on UStoreMain_MTXOffer_C");
static_assert(sizeof(UStoreMain_MTXOffer_C) == 0x0011F0, "Wrong size on UStoreMain_MTXOffer_C");
static_assert(offsetof(UStoreMain_MTXOffer_C, UberGraphFrame) == 0x0010C0, "Member 'UStoreMain_MTXOffer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, Hover_Linear) == 0x0010C8, "Member 'UStoreMain_MTXOffer_C::Hover_Linear' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, UnhoverNew) == 0x0010D0, "Member 'UStoreMain_MTXOffer_C::UnhoverNew' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, HoverNew) == 0x0010D8, "Member 'UStoreMain_MTXOffer_C::HoverNew' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, Intro) == 0x0010E0, "Member 'UStoreMain_MTXOffer_C::Intro' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, OnHover) == 0x0010E8, "Member 'UStoreMain_MTXOffer_C::OnHover' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, AthenaDirectAcquisitionOffer_SpecialBanner) == 0x0010F0, "Member 'UStoreMain_MTXOffer_C::AthenaDirectAcquisitionOffer_SpecialBanner' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, BaseColor) == 0x0010F8, "Member 'UStoreMain_MTXOffer_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, BonusTag) == 0x001100, "Member 'UStoreMain_MTXOffer_C::BonusTag' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, BonusText) == 0x001108, "Member 'UStoreMain_MTXOffer_C::BonusText' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, Border_Footer) == 0x001110, "Member 'UStoreMain_MTXOffer_C::Border_Footer' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, BorderAll) == 0x001118, "Member 'UStoreMain_MTXOffer_C::BorderAll' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, BundleTotalQuantity) == 0x001120, "Member 'UStoreMain_MTXOffer_C::BundleTotalQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, BundleVBucksText) == 0x001128, "Member 'UStoreMain_MTXOffer_C::BundleVBucksText' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, CurrencyTotalQuantity) == 0x001130, "Member 'UStoreMain_MTXOffer_C::CurrencyTotalQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, HBox_Price) == 0x001138, "Member 'UStoreMain_MTXOffer_C::HBox_Price' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, HoverBorder) == 0x001140, "Member 'UStoreMain_MTXOffer_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, KeyArt) == 0x001148, "Member 'UStoreMain_MTXOffer_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, OverlayGradient) == 0x001150, "Member 'UStoreMain_MTXOffer_C::OverlayGradient' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, OverlaySalePrice) == 0x001158, "Member 'UStoreMain_MTXOffer_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, PlayStationStoreLogo) == 0x001160, "Member 'UStoreMain_MTXOffer_C::PlayStationStoreLogo' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, Plus) == 0x001168, "Member 'UStoreMain_MTXOffer_C::Plus' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, RMTBundle) == 0x001170, "Member 'UStoreMain_MTXOffer_C::RMTBundle' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, RMTCurrency) == 0x001178, "Member 'UStoreMain_MTXOffer_C::RMTCurrency' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, RMTTypeSwitcher) == 0x001180, "Member 'UStoreMain_MTXOffer_C::RMTTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, RMTVBucksHB) == 0x001188, "Member 'UStoreMain_MTXOffer_C::RMTVBucksHB' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, ScaleBoxKeyArt) == 0x001190, "Member 'UStoreMain_MTXOffer_C::ScaleBoxKeyArt' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, Switcher_Price) == 0x001198, "Member 'UStoreMain_MTXOffer_C::Switcher_Price' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, TextOfferDisplayPrice) == 0x0011A0, "Member 'UStoreMain_MTXOffer_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, TextOfferName) == 0x0011A8, "Member 'UStoreMain_MTXOffer_C::TextOfferName' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, TextOfferPurchaseUnvailable) == 0x0011B0, "Member 'UStoreMain_MTXOffer_C::TextOfferPurchaseUnvailable' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, TextOriginalPrice) == 0x0011B8, "Member 'UStoreMain_MTXOffer_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, TileSize) == 0x0011C0, "Member 'UStoreMain_MTXOffer_C::TileSize' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, VBucksText) == 0x0011C8, "Member 'UStoreMain_MTXOffer_C::VBucksText' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, AboutToShowDetails) == 0x0011D0, "Member 'UStoreMain_MTXOffer_C::AboutToShowDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, bCanSetPrice) == 0x0011E0, "Member 'UStoreMain_MTXOffer_C::bCanSetPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, CatalogMessaging) == 0x0011E8, "Member 'UStoreMain_MTXOffer_C::CatalogMessaging' has a wrong offset!");

}

