#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_LightColorsGlobal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_LightColorsGlobal.Struct_LightColorsGlobal
// 0x0080 (0x0080 - 0x0000)
struct FStruct_LightColorsGlobal final
{
public:
	struct FLinearColor                           Blue_2_835DEE5B4B1E8FE2DCBD2EB808F69637;           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Teal_4_32FEB0134E88F33098310F87B27D1674;           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Purple_6_D175DF4B447EED701E402DAEEB0431E4;         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Yellow_8_47BF9E0C4852EF9111C4CE903B40A8B3;         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           White_10_2FDB792D4A2A1052CE1B4789EA94FE97;         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Orange_12_D80329CB4E7F729BBECD1B9B879BB103;        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Green_14_F93EBBC04E7685314D7338B74C858B52;         // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Red_16_8F0F9B8040677BB0FB52E9BB1FD9A55E;           // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_LightColorsGlobal) == 0x000004, "Wrong alignment on FStruct_LightColorsGlobal");
static_assert(sizeof(FStruct_LightColorsGlobal) == 0x000080, "Wrong size on FStruct_LightColorsGlobal");
static_assert(offsetof(FStruct_LightColorsGlobal, Blue_2_835DEE5B4B1E8FE2DCBD2EB808F69637) == 0x000000, "Member 'FStruct_LightColorsGlobal::Blue_2_835DEE5B4B1E8FE2DCBD2EB808F69637' has a wrong offset!");
static_assert(offsetof(FStruct_LightColorsGlobal, Teal_4_32FEB0134E88F33098310F87B27D1674) == 0x000010, "Member 'FStruct_LightColorsGlobal::Teal_4_32FEB0134E88F33098310F87B27D1674' has a wrong offset!");
static_assert(offsetof(FStruct_LightColorsGlobal, Purple_6_D175DF4B447EED701E402DAEEB0431E4) == 0x000020, "Member 'FStruct_LightColorsGlobal::Purple_6_D175DF4B447EED701E402DAEEB0431E4' has a wrong offset!");
static_assert(offsetof(FStruct_LightColorsGlobal, Yellow_8_47BF9E0C4852EF9111C4CE903B40A8B3) == 0x000030, "Member 'FStruct_LightColorsGlobal::Yellow_8_47BF9E0C4852EF9111C4CE903B40A8B3' has a wrong offset!");
static_assert(offsetof(FStruct_LightColorsGlobal, White_10_2FDB792D4A2A1052CE1B4789EA94FE97) == 0x000040, "Member 'FStruct_LightColorsGlobal::White_10_2FDB792D4A2A1052CE1B4789EA94FE97' has a wrong offset!");
static_assert(offsetof(FStruct_LightColorsGlobal, Orange_12_D80329CB4E7F729BBECD1B9B879BB103) == 0x000050, "Member 'FStruct_LightColorsGlobal::Orange_12_D80329CB4E7F729BBECD1B9B879BB103' has a wrong offset!");
static_assert(offsetof(FStruct_LightColorsGlobal, Green_14_F93EBBC04E7685314D7338B74C858B52) == 0x000060, "Member 'FStruct_LightColorsGlobal::Green_14_F93EBBC04E7685314D7338B74C858B52' has a wrong offset!");
static_assert(offsetof(FStruct_LightColorsGlobal, Red_16_8F0F9B8040677BB0FB52E9BB1FD9A55E) == 0x000070, "Member 'FStruct_LightColorsGlobal::Red_16_8F0F9B8040677BB0FB52E9BB1FD9A55E' has a wrong offset!");

}

