#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Campsite_Improvement

#include "Basic.hpp"

#include "Enum_Campsite_Improvements_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Campsite_Improvement.Struct_Campsite_Improvement
// 0x0020 (0x0020 - 0x0000)
struct FStruct_Campsite_Improvement final
{
public:
	Enum_Campsite_Improvements                    ImprovementType_10_C979E3034A0C438EF098E28C9A7AED85; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 PrimaryImprovementBlueprint_17_4AEA2ED844EC9D81C71B018F1E72981C; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SupplementalImprovementBlueprint_20_64CB02744D29F5D03ADC35B471A705CA; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DeployamentGameplayCue_27_A7C7053F409D09E4C63137B4A0E85254; // 0x0018(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Campsite_Improvement) == 0x000008, "Wrong alignment on FStruct_Campsite_Improvement");
static_assert(sizeof(FStruct_Campsite_Improvement) == 0x000020, "Wrong size on FStruct_Campsite_Improvement");
static_assert(offsetof(FStruct_Campsite_Improvement, ImprovementType_10_C979E3034A0C438EF098E28C9A7AED85) == 0x000000, "Member 'FStruct_Campsite_Improvement::ImprovementType_10_C979E3034A0C438EF098E28C9A7AED85' has a wrong offset!");
static_assert(offsetof(FStruct_Campsite_Improvement, PrimaryImprovementBlueprint_17_4AEA2ED844EC9D81C71B018F1E72981C) == 0x000008, "Member 'FStruct_Campsite_Improvement::PrimaryImprovementBlueprint_17_4AEA2ED844EC9D81C71B018F1E72981C' has a wrong offset!");
static_assert(offsetof(FStruct_Campsite_Improvement, SupplementalImprovementBlueprint_20_64CB02744D29F5D03ADC35B471A705CA) == 0x000010, "Member 'FStruct_Campsite_Improvement::SupplementalImprovementBlueprint_20_64CB02744D29F5D03ADC35B471A705CA' has a wrong offset!");
static_assert(offsetof(FStruct_Campsite_Improvement, DeployamentGameplayCue_27_A7C7053F409D09E4C63137B4A0E85254) == 0x000018, "Member 'FStruct_Campsite_Improvement::DeployamentGameplayCue_27_A7C7053F409D09E4C63137B4A0E85254' has a wrong offset!");

}

