#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_LonelyDoor

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_LonelyDoor.STRUCT_LonelyDoor
// 0x0018 (0x0018 - 0x0000)
struct FSTRUCT_LonelyDoor final
{
public:
	int64                                         CurrentHealth_2_BADD3C564A73084D42A01BB582A7B147;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         DefaultHealth_4_18DD8DEB42610EA128AC96B66FA7CA87;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageMultiplier_7_DB43730F48DBBCF12EF4FCB7A262509A; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_LonelyDoor) == 0x000008, "Wrong alignment on FSTRUCT_LonelyDoor");
static_assert(sizeof(FSTRUCT_LonelyDoor) == 0x000018, "Wrong size on FSTRUCT_LonelyDoor");
static_assert(offsetof(FSTRUCT_LonelyDoor, CurrentHealth_2_BADD3C564A73084D42A01BB582A7B147) == 0x000000, "Member 'FSTRUCT_LonelyDoor::CurrentHealth_2_BADD3C564A73084D42A01BB582A7B147' has a wrong offset!");
static_assert(offsetof(FSTRUCT_LonelyDoor, DefaultHealth_4_18DD8DEB42610EA128AC96B66FA7CA87) == 0x000008, "Member 'FSTRUCT_LonelyDoor::DefaultHealth_4_18DD8DEB42610EA128AC96B66FA7CA87' has a wrong offset!");
static_assert(offsetof(FSTRUCT_LonelyDoor, DamageMultiplier_7_DB43730F48DBBCF12EF4FCB7A262509A) == 0x000010, "Member 'FSTRUCT_LonelyDoor::DamageMultiplier_7_DB43730F48DBBCF12EF4FCB7A262509A' has a wrong offset!");

}

