#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubgameTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SubgameTile.SubgameTile_C
// 0x0040 (0x1190 - 0x1150)
class USubgameTile_C final : public UFortSubgameTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1150(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RevealCMSKeyArt;                                   // 0x1158(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnFocused;                                         // 0x1160(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FocusedSecondary;                                  // 0x1168(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focused;                                           // 0x1170(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FocusPulse;                                        // 0x1178(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PulseMID;                                          // 0x1180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_SubgameTile(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void BndEvt__Image_KeyArt_K2Node_ComponentBoundEvent_1_onLoadingCompleted__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SubgameTile_C">();
	}
	static class USubgameTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubgameTile_C>();
	}
};
static_assert(alignof(USubgameTile_C) == 0x000010, "Wrong alignment on USubgameTile_C");
static_assert(sizeof(USubgameTile_C) == 0x001190, "Wrong size on USubgameTile_C");
static_assert(offsetof(USubgameTile_C, UberGraphFrame) == 0x001150, "Member 'USubgameTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USubgameTile_C, RevealCMSKeyArt) == 0x001158, "Member 'USubgameTile_C::RevealCMSKeyArt' has a wrong offset!");
static_assert(offsetof(USubgameTile_C, UnFocused) == 0x001160, "Member 'USubgameTile_C::UnFocused' has a wrong offset!");
static_assert(offsetof(USubgameTile_C, FocusedSecondary) == 0x001168, "Member 'USubgameTile_C::FocusedSecondary' has a wrong offset!");
static_assert(offsetof(USubgameTile_C, Focused) == 0x001170, "Member 'USubgameTile_C::Focused' has a wrong offset!");
static_assert(offsetof(USubgameTile_C, FocusPulse) == 0x001178, "Member 'USubgameTile_C::FocusPulse' has a wrong offset!");
static_assert(offsetof(USubgameTile_C, PulseMID) == 0x001180, "Member 'USubgameTile_C::PulseMID' has a wrong offset!");

}

