#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunDirectionandColorSet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SunDirectionandColorSet.SunDirectionandColorSet_C
// 0x0028 (0x0298 - 0x0270)
class ASunDirectionandColorSet_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SunLightColor;                                     // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_SunDirectionandColorSet(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SunDirectionandColorSet_C">();
	}
	static class ASunDirectionandColorSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASunDirectionandColorSet_C>();
	}
};
static_assert(alignof(ASunDirectionandColorSet_C) == 0x000008, "Wrong alignment on ASunDirectionandColorSet_C");
static_assert(sizeof(ASunDirectionandColorSet_C) == 0x000298, "Wrong size on ASunDirectionandColorSet_C");
static_assert(offsetof(ASunDirectionandColorSet_C, UberGraphFrame) == 0x000270, "Member 'ASunDirectionandColorSet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASunDirectionandColorSet_C, Scene) == 0x000278, "Member 'ASunDirectionandColorSet_C::Scene' has a wrong offset!");
static_assert(offsetof(ASunDirectionandColorSet_C, Arrow) == 0x000280, "Member 'ASunDirectionandColorSet_C::Arrow' has a wrong offset!");
static_assert(offsetof(ASunDirectionandColorSet_C, SunLightColor) == 0x000288, "Member 'ASunDirectionandColorSet_C::SunLightColor' has a wrong offset!");

}

