#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuperstormRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function SuperstormRuntime.TempestLightningComponent.GetCloudHeight
// 0x0004 (0x0004 - 0x0000)
struct TempestLightningComponent_GetCloudHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TempestLightningComponent_GetCloudHeight) == 0x000004, "Wrong alignment on TempestLightningComponent_GetCloudHeight");
static_assert(sizeof(TempestLightningComponent_GetCloudHeight) == 0x000004, "Wrong size on TempestLightningComponent_GetCloudHeight");
static_assert(offsetof(TempestLightningComponent_GetCloudHeight, ReturnValue) == 0x000000, "Member 'TempestLightningComponent_GetCloudHeight::ReturnValue' has a wrong offset!");

// Function SuperstormRuntime.TempestLightningComponent.GetLightningRadius
// 0x0004 (0x0004 - 0x0000)
struct TempestLightningComponent_GetLightningRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TempestLightningComponent_GetLightningRadius) == 0x000004, "Wrong alignment on TempestLightningComponent_GetLightningRadius");
static_assert(sizeof(TempestLightningComponent_GetLightningRadius) == 0x000004, "Wrong size on TempestLightningComponent_GetLightningRadius");
static_assert(offsetof(TempestLightningComponent_GetLightningRadius, ReturnValue) == 0x000000, "Member 'TempestLightningComponent_GetLightningRadius::ReturnValue' has a wrong offset!");

// Function SuperstormRuntime.TempestTornadoForcesComponent.IsActorInTornado
// 0x0010 (0x0010 - 0x0000)
struct TempestTornadoForcesComponent_IsActorInTornado final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TempestTornadoForcesComponent_IsActorInTornado) == 0x000008, "Wrong alignment on TempestTornadoForcesComponent_IsActorInTornado");
static_assert(sizeof(TempestTornadoForcesComponent_IsActorInTornado) == 0x000010, "Wrong size on TempestTornadoForcesComponent_IsActorInTornado");
static_assert(offsetof(TempestTornadoForcesComponent_IsActorInTornado, Actor) == 0x000000, "Member 'TempestTornadoForcesComponent_IsActorInTornado::Actor' has a wrong offset!");
static_assert(offsetof(TempestTornadoForcesComponent_IsActorInTornado, ReturnValue) == 0x000008, "Member 'TempestTornadoForcesComponent_IsActorInTornado::ReturnValue' has a wrong offset!");

}

