#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SupportModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SupportModal.SupportModal_C
// 0x0058 (0x0460 - 0x0408)
class USupportModal_C final : public UAthenaItemShopTimerInfoModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowUp;                                            // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_114;                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Containment;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              ContentSZ;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundBottomBar;                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightbox_HitTestBlocker;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              MobileClose;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             PrimaryScrollBox;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_Icon_Backpacks_220_FarmerFemale_L;               // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_PlatformSpecific;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_SupportModal(int32 EntryPoint);
	void OnModalBackout();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SupportModal_C">();
	}
	static class USupportModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USupportModal_C>();
	}
};
static_assert(alignof(USupportModal_C) == 0x000008, "Wrong alignment on USupportModal_C");
static_assert(sizeof(USupportModal_C) == 0x000460, "Wrong size on USupportModal_C");
static_assert(offsetof(USupportModal_C, UberGraphFrame) == 0x000408, "Member 'USupportModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USupportModal_C, ShowUp) == 0x000410, "Member 'USupportModal_C::ShowUp' has a wrong offset!");
static_assert(offsetof(USupportModal_C, CommonRichTextBlock_114) == 0x000418, "Member 'USupportModal_C::CommonRichTextBlock_114' has a wrong offset!");
static_assert(offsetof(USupportModal_C, Containment) == 0x000420, "Member 'USupportModal_C::Containment' has a wrong offset!");
static_assert(offsetof(USupportModal_C, ContentSZ) == 0x000428, "Member 'USupportModal_C::ContentSZ' has a wrong offset!");
static_assert(offsetof(USupportModal_C, Image_BackgroundBottomBar) == 0x000430, "Member 'USupportModal_C::Image_BackgroundBottomBar' has a wrong offset!");
static_assert(offsetof(USupportModal_C, Lightbox_HitTestBlocker) == 0x000438, "Member 'USupportModal_C::Lightbox_HitTestBlocker' has a wrong offset!");
static_assert(offsetof(USupportModal_C, MobileClose) == 0x000440, "Member 'USupportModal_C::MobileClose' has a wrong offset!");
static_assert(offsetof(USupportModal_C, PrimaryScrollBox) == 0x000448, "Member 'USupportModal_C::PrimaryScrollBox' has a wrong offset!");
static_assert(offsetof(USupportModal_C, T_Icon_Backpacks_220_FarmerFemale_L) == 0x000450, "Member 'USupportModal_C::T_Icon_Backpacks_220_FarmerFemale_L' has a wrong offset!");
static_assert(offsetof(USupportModal_C, VBox_PlatformSpecific) == 0x000458, "Member 'USupportModal_C::VBox_PlatformSpecific' has a wrong offset!");

}

