#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwimmingAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0337 (0x0338 - 0x0001)
struct SwimmingAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1049;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1050;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1051;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1052;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1053;                           // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1054;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1055;                           // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1056;                               // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1057;                           // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1058;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1059;                           // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1060;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1061;                           // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1062;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1063;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1064;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1065;                                 // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1066;                               // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1067;                               // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1068;                           // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1069;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1070;                               // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1071;                               // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1072;                           // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1073;                              // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_1074;                           // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1075;                               // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1076;                               // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1077;                                 // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_1078;                              // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1079;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1080;                              // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1081;                           // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1082;                               // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1083;                               // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1084;                           // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1085;                               // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1086;                               // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1087;                               // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1088;                           // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1089;                               // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1090;                                 // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1091;                               // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1092;                                 // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1093;                                 // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1094;                               // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1095;                                 // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1096;                              // 0x0148(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1097;                              // 0x0158(0x0010)(BlueprintVisible)
	class UBlendSpace*                            __BlendSpace_1098;                                 // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1099;                               // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1100;                               // 0x0174(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1101;                           // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1102;                               // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1103;                               // 0x0184(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1104;                                // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1105;                               // 0x018C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1106;                                // 0x0190(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1107;                                 // 0x0198(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1108;                               // 0x01A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1109;                               // 0x01A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1110;                                 // 0x01A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1111;                               // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1112;                                // 0x01B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1113;                             // 0x01B8(0x002C)(BlueprintVisible, NoDestructor)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1114;                           // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1115;                               // 0x01F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1116;                               // 0x01F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1117;                                // 0x01F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1118;                              // 0x0200(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1119;                               // 0x0210(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1120;                                // 0x0214(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_1121;                                 // 0x0218(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1122;                               // 0x0220(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1123;                               // 0x0224(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1124;                               // 0x0228(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_1125;                                 // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1126;                               // 0x0238(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1127;                              // 0x023C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1128;                               // 0x0240(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1129;                              // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1130;                              // 0x0248(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1131;                               // 0x024C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1132;                               // 0x024D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24E[0x2];                                      // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1133;                               // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1134;                               // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1135;                                 // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1136;                               // 0x0268(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1137;                               // 0x0269(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1138;                               // 0x026A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B[0x5];                                      // 0x026B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1139;                              // 0x0270(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_1140;                             // 0x0280(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1141;                               // 0x0298(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1142;                               // 0x029C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x02A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0320(0x0018)()
};
static_assert(alignof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SwimmingAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000338, "Wrong size on SwimmingAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1049) == 0x000004, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1049' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1050) == 0x000008, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1050' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1051) == 0x000010, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1051' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1052) == 0x000018, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1052' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1053) == 0x000020, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1053' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1054) == 0x000028, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1054' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1055) == 0x000030, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1055' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1056) == 0x000038, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1056' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1057) == 0x000040, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1057' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1058) == 0x000048, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1058' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1059) == 0x000050, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1059' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1060) == 0x000058, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1060' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1061) == 0x000060, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1061' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1062) == 0x000068, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1062' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1063) == 0x00006C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1063' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1064) == 0x000070, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1064' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1065) == 0x000078, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1065' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1066) == 0x000080, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1066' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1067) == 0x000084, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1067' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1068) == 0x000088, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1068' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1069) == 0x000090, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1069' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1070) == 0x000094, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1070' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1071) == 0x000098, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1071' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1072) == 0x0000A0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1072' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1073) == 0x0000A8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1073' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1074) == 0x0000B8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1074' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1075) == 0x0000C0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1075' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1076) == 0x0000C4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1076' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1077) == 0x0000C8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1077' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1078) == 0x0000D0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1078' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1079) == 0x0000D4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1079' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1080) == 0x0000D8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1080' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1081) == 0x0000E0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1081' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1082) == 0x0000E8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1082' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1083) == 0x0000EC, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1083' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1084) == 0x0000F0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1084' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1085) == 0x0000F8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1085' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1086) == 0x0000FC, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1086' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1087) == 0x000100, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1087' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1088) == 0x000108, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1088' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1089) == 0x000110, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1089' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1090) == 0x000118, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1090' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1091) == 0x000120, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1091' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1092) == 0x000128, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1092' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1093) == 0x000130, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1093' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1094) == 0x000138, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1094' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1095) == 0x000140, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1095' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1096) == 0x000148, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1096' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1097) == 0x000158, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1097' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1098) == 0x000168, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1098' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1099) == 0x000170, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1099' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1100) == 0x000174, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1100' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1101) == 0x000178, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1101' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1102) == 0x000180, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1102' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1103) == 0x000184, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1103' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1104) == 0x000188, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1104' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1105) == 0x00018C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1105' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1106) == 0x000190, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1106' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1107) == 0x000198, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1107' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1108) == 0x0001A0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1108' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1109) == 0x0001A1, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1109' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1110) == 0x0001A8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1110' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1111) == 0x0001B0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1111' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1112) == 0x0001B4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1112' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1113) == 0x0001B8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1113' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_1114) == 0x0001E8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_1114' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1115) == 0x0001F0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1115' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1116) == 0x0001F4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1116' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1117) == 0x0001F8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1117' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1118) == 0x000200, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1118' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1119) == 0x000210, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1119' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1120) == 0x000214, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1120' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1121) == 0x000218, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1121' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1122) == 0x000220, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1122' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1123) == 0x000224, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1123' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1124) == 0x000228, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1124' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_1125) == 0x000230, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_1125' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1126) == 0x000238, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1126' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1127) == 0x00023C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1127' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1128) == 0x000240, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1128' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1129) == 0x000244, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1129' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1130) == 0x000248, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1130' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1131) == 0x00024C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1131' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1132) == 0x00024D, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1132' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1133) == 0x000250, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1133' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1134) == 0x000258, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1134' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1135) == 0x000260, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1135' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1136) == 0x000268, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1136' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1137) == 0x000269, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1137' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1138) == 0x00026A, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1138' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1139) == 0x000270, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1139' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1140) == 0x000280, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1140' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1141) == 0x000298, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1141' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1142) == 0x00029C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1142' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0002A0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000320, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x00C7 (0x00C8 - 0x0001)
struct SwimmingAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase;                                // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_0;                              // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1;                                 // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_2;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_7;                                  // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __BlendSpace_8;                                    // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_11;                                   // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_14;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_16;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_19;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_21;                                 // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_22;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_24;                                 // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_25;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_30;                                 // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_31;                                 // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_32;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_34;                                 // 0x00AC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_35;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_37;                                   // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_38;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_39;                                 // 0x00C4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on SwimmingAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData) == 0x0000C8, "Wrong size on SwimmingAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase) == 0x000008, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase_0) == 0x000010, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase_0' has a wrong offset!");
