#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwingingLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SwingingLayerAnimBP.SwingingLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0327 (0x0328 - 0x0001)
struct SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_919;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_920;                            // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_921;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_922;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_923;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_924;                            // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_925;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_926;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_927;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_928;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_929;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_930;                            // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_931;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_932;                            // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_933;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_934;                            // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_935;                            // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_936;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_937;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_938;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_939;                               // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_940;                            // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_941;                            // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_942;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_943;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_944;                            // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_945;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_946;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_947;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_948;                                 // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_949;                                  // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_950;                                  // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_951;                                  // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_952;                                  // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_953;                                // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_954;                                 // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_955;                            // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_956;                                  // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_957;                               // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendSpace*                            __BlendSpace_958;                                  // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_959;                                  // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_960;                                  // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_961;                                // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_962;                            // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_963;                                // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_964;                            // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_965;                            // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_966;                               // 0x0158(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_967;                               // 0x0168(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendSpace*                            __BlendSpace_968;                                  // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_969;                                  // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_970;                                // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_971;                                 // 0x018C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_972;                            // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_973;                            // 0x0198(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_974;                            // 0x01A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_975;                                // 0x01A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_976;                            // 0x01B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_977;                                // 0x01B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_978;                               // 0x01C0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_979;                                // 0x01D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_980;                                 // 0x01D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_981;                            // 0x01D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_982;                                // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_983;                                 // 0x01E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_984;                                // 0x01E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_985;                                // 0x01EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_986;                                // 0x01F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_987;                                 // 0x01F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_988;                                // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_989;                                  // 0x0200(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_990;                                // 0x0208(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_991;                                // 0x0209(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_992;                               // 0x0210(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_993;                                // 0x0220(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_994;                               // 0x0224(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_995;                              // 0x0228(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_996;                               // 0x0254(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_997;                            // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_998;                                // 0x0260(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_999;                                // 0x0261(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1000;                               // 0x0262(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263[0x1];                                      // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1001;                               // 0x0264(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1002;                               // 0x0268(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1003;                               // 0x026C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1004;                               // 0x0270(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1005;                             // 0x0278(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0290(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0310(0x0018)()
};
static_assert(alignof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000328, "Wrong size on SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_919) == 0x000004, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_919' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_920) == 0x000008, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_920' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_921) == 0x000010, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_921' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_922) == 0x000018, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_922' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_923) == 0x000020, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_923' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_924) == 0x000028, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_924' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_925) == 0x000030, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_925' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_926) == 0x000034, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_926' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_927) == 0x000038, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_927' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_928) == 0x000040, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_928' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_929) == 0x000044, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_929' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_930) == 0x000048, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_930' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_931) == 0x000050, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_931' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_932) == 0x000058, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_932' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_933) == 0x000060, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_933' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_934) == 0x000068, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_934' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_935) == 0x000070, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_935' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_936) == 0x000078, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_936' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_937) == 0x000080, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_937' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_938) == 0x000088, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_938' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_939) == 0x000090, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_939' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_940) == 0x0000A0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_940' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_941) == 0x0000A8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_941' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_942) == 0x0000B0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_942' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_943) == 0x0000B4, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_943' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_944) == 0x0000B8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_944' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_945) == 0x0000C0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_945' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_946) == 0x0000C4, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_946' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_947) == 0x0000C8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_947' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_948) == 0x0000CC, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_948' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_949) == 0x0000D0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_949' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_950) == 0x0000D8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_950' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_951) == 0x0000E0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_951' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_952) == 0x0000E8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_952' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_953) == 0x0000F0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_953' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_954) == 0x0000F4, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_954' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_955) == 0x0000F8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_955' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_956) == 0x000100, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_956' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_957) == 0x000108, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_957' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_958) == 0x000118, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_958' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_959) == 0x000120, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_959' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_960) == 0x000128, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_960' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_961) == 0x000130, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_961' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_962) == 0x000138, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_962' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_963) == 0x000140, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_963' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_964) == 0x000148, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_964' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_965) == 0x000150, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_965' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_966) == 0x000158, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_966' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_967) == 0x000168, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_967' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_968) == 0x000178, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_968' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_969) == 0x000180, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_969' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_970) == 0x000188, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_970' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_971) == 0x00018C, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_971' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_972) == 0x000190, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_972' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_973) == 0x000198, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_973' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_974) == 0x0001A0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_974' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_975) == 0x0001A8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_975' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_976) == 0x0001B0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_976' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_977) == 0x0001B8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_977' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_978) == 0x0001C0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_978' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_979) == 0x0001D0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_979' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_980) == 0x0001D4, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_980' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_981) == 0x0001D8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_981' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_982) == 0x0001E0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_982' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_983) == 0x0001E4, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_983' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_984) == 0x0001E8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_984' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_985) == 0x0001EC, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_985' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_986) == 0x0001F0, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_986' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_987) == 0x0001F4, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_987' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_988) == 0x0001F8, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_988' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_989) == 0x000200, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_989' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_990) == 0x000208, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_990' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_991) == 0x000209, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_991' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_992) == 0x000210, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_992' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_993) == 0x000220, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_993' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_994) == 0x000224, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_994' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_995) == 0x000228, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_995' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_996) == 0x000254, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_996' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_997) == 0x000258, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_997' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_998) == 0x000260, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_998' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_999) == 0x000261, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_999' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1000) == 0x000262, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1000' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1001) == 0x000264, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1001' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1002) == 0x000268, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1002' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1003) == 0x00026C, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1003' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1004) == 0x000270, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1004' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1005) == 0x000278, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1005' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000290, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000310, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SwingingLayerAnimBP.SwingingLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0043 (0x0044 - 0x0001)
struct SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_5;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_8;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_12;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_17;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0041(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000044, "Wrong size on SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'SwingingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
