#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TacticalSprintRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "TacticalSprintRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class TacticalSprintRuntime.FortPlayerControllerComponent_TacticalSprint
// 0x0100 (0x01A0 - 0x00A0)
class UFortPlayerControllerComponent_TacticalSprint final : public UControllerComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CurrentBoundPlayerPawn;                            // 0x00B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bTacticalSprintEnabled : 1;                        // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bWantsToTacticalSprint : 1;                        // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bHandlingMoveForward : 1;                          // 0x00C0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsSprinting : 1;                                  // 0x00C0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bWasInBuildMode : 1;                               // 0x00C0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TacticalSprintAbilityGameplayTag;                  // 0x00C4(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           DisableTacticalSprintAbilityGameplayTag;           // 0x00C8(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         TacticalSprintEnabled;                             // 0x00D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TacticalSprintToggleGracePeriod;                   // 0x00F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnTacticalSprintStarted;                           // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnTacticalSprintEnded;                             // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnFailedToSprint;                                  // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           StopWantingToSprintTimerReceipt;                   // 0x0150(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x40];                                     // 0x0158(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        InputComponent;                                    // 0x0198(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void LogAndVisualLog(class UObject* LoggingSource, ESprintLoggingVerbosityLevel Verbosity, const class FString& LogString);
	void OnAutoRunChanged(bool bAutoRunIsOn);
	void OnMovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnPawnChanged(class AFortPawn* InPawn);
	void OnWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PreviousWeapon);
	void SetIsSprinting(bool bNewIsSprinting);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerControllerComponent_TacticalSprint">();
	}
	static class UFortPlayerControllerComponent_TacticalSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerControllerComponent_TacticalSprint>();
	}
};
static_assert(alignof(UFortPlayerControllerComponent_TacticalSprint) == 0x000008, "Wrong alignment on UFortPlayerControllerComponent_TacticalSprint");
static_assert(sizeof(UFortPlayerControllerComponent_TacticalSprint) == 0x0001A0, "Wrong size on UFortPlayerControllerComponent_TacticalSprint");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, CurrentBoundPlayerPawn) == 0x0000B8, "Member 'UFortPlayerControllerComponent_TacticalSprint::CurrentBoundPlayerPawn' has a wrong offset!");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, TacticalSprintAbilityGameplayTag) == 0x0000C4, "Member 'UFortPlayerControllerComponent_TacticalSprint::TacticalSprintAbilityGameplayTag' has a wrong offset!");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, DisableTacticalSprintAbilityGameplayTag) == 0x0000C8, "Member 'UFortPlayerControllerComponent_TacticalSprint::DisableTacticalSprintAbilityGameplayTag' has a wrong offset!");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, TacticalSprintEnabled) == 0x0000D0, "Member 'UFortPlayerControllerComponent_TacticalSprint::TacticalSprintEnabled' has a wrong offset!");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, TacticalSprintToggleGracePeriod) == 0x0000F8, "Member 'UFortPlayerControllerComponent_TacticalSprint::TacticalSprintToggleGracePeriod' has a wrong offset!");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, OnTacticalSprintStarted) == 0x000120, "Member 'UFortPlayerControllerComponent_TacticalSprint::OnTacticalSprintStarted' has a wrong offset!");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, OnTacticalSprintEnded) == 0x000130, "Member 'UFortPlayerControllerComponent_TacticalSprint::OnTacticalSprintEnded' has a wrong offset!");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, OnFailedToSprint) == 0x000140, "Member 'UFortPlayerControllerComponent_TacticalSprint::OnFailedToSprint' has a wrong offset!");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, StopWantingToSprintTimerReceipt) == 0x000150, "Member 'UFortPlayerControllerComponent_TacticalSprint::StopWantingToSprintTimerReceipt' has a wrong offset!");
static_assert(offsetof(UFortPlayerControllerComponent_TacticalSprint, InputComponent) == 0x000198, "Member 'UFortPlayerControllerComponent_TacticalSprint::InputComponent' has a wrong offset!");

}

