#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TankRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function TankRuntime.FortTankVehicleAnimInstance.UpdateMIDEngineProperties
// 0x0008 (0x0008 - 0x0000)
struct FortTankVehicleAnimInstance_UpdateMIDEngineProperties final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EngineHealthRatio;                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortTankVehicleAnimInstance_UpdateMIDEngineProperties) == 0x000004, "Wrong alignment on FortTankVehicleAnimInstance_UpdateMIDEngineProperties");
static_assert(sizeof(FortTankVehicleAnimInstance_UpdateMIDEngineProperties) == 0x000008, "Wrong size on FortTankVehicleAnimInstance_UpdateMIDEngineProperties");
static_assert(offsetof(FortTankVehicleAnimInstance_UpdateMIDEngineProperties, DeltaSeconds) == 0x000000, "Member 'FortTankVehicleAnimInstance_UpdateMIDEngineProperties::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(FortTankVehicleAnimInstance_UpdateMIDEngineProperties, EngineHealthRatio) == 0x000004, "Member 'FortTankVehicleAnimInstance_UpdateMIDEngineProperties::EngineHealthRatio' has a wrong offset!");

// Function TankRuntime.FortTankVehicleAudioController.GetTankVehicleActor
// 0x0008 (0x0008 - 0x0000)
struct FortTankVehicleAudioController_GetTankVehicleActor final
{
public:
	class AFortTankVehicle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortTankVehicleAudioController_GetTankVehicleActor) == 0x000008, "Wrong alignment on FortTankVehicleAudioController_GetTankVehicleActor");
static_assert(sizeof(FortTankVehicleAudioController_GetTankVehicleActor) == 0x000008, "Wrong size on FortTankVehicleAudioController_GetTankVehicleActor");
static_assert(offsetof(FortTankVehicleAudioController_GetTankVehicleActor, ReturnValue) == 0x000000, "Member 'FortTankVehicleAudioController_GetTankVehicleActor::ReturnValue' has a wrong offset!");

}

