#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function TeamMemberPedestal.TeamMemberPedestal_C.ExecuteUbergraph_TeamMemberPedestal
// 0x0490 (0x0490 - 0x0000)
struct TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventSource_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus_1;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent_1;            // 0x0070(0x0018)(ConstParm, NoDestructor)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameReadiness                                Temp_byte_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentTeamSize_ReturnValue;           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentTeamSize_ReturnValue_1;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInMatch;                           // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsPopulated_1;                       // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOwningSquadContainsLocalPlayer_1;    // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0118(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrontend_ReturnValue;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic_1; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrontEndHologram_ReturnValue;         // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrontEndHologram_ReturnValue_1;       // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameReadiness                                K2Node_Event_GameReadiness;                        // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACameraAnimationTransition_C*>   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0240(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_bMultipleSquadsPopulated;             // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOwningSquadContainsLocalPlayer;      // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaTeamDisplayInfo                 K2Node_Event_OwningSquadStyle;                     // 0x0258(0x0088)(ConstParm)
	class ACameraAnimationTransition_C*           CallFunc_Array_Get_Item;                           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue;          // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_1;        // 0x02FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_2;        // 0x02FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SquadIdx;                             // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSquadHasLocalPlayer;                 // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsPopulated;                         // 0x0305(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0306(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0307(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_3;        // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_4;        // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_5;        // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B[0x1];                                      // 0x030B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x030C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasValidTeamMember;                  // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingFortnite_ReturnValue;            // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x031B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x0330(0x0018)(ConstParm, NoDestructor)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_6;        // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x035C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrontend_ReturnValue_1;               // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_AvatarImage;                          // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Event_AvatarBackground;                     // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Event_HighlightColor;                       // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaterialIndex_ReturnValue;             // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_2;                // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bool_2;                         // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bool_1;                         // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bool;                           // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x03BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x03C0(0x00D0)(ContainsInstancedReference)
};
static_assert(alignof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal");
static_assert(sizeof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal) == 0x000490, "Wrong size on TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, EntryPoint) == 0x000000, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::EntryPoint' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_byte_Variable) == 0x000004, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable) == 0x000005, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_1) == 0x000006, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_2) == 0x000007, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_struct_Variable) == 0x000008, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CustomEvent_Loaded) == 0x000018, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_object_Variable) == 0x000020, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_AsTexture) == 0x000028, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_3) == 0x000031, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_struct_Variable_1) == 0x000034, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_4) == 0x000044, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_float_Variable) == 0x000048, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_float_Variable_1) == 0x00004C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_bool_Variable_5) == 0x000050, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_float_Variable_2) == 0x000054, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_float_Variable_3) == 0x000058, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_float_Variable_4) == 0x00005C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_EventSource_1) == 0x000060, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_EventSource_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_EventFocus_1) == 0x000068, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_EventFocus_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_ClientEvent_1) == 0x000070, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_ClientEvent_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetMaterial_ReturnValue) == 0x000088, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetMaterial_ReturnValue_1) == 0x000090, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000098, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000A0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_float_Variable_5) == 0x0000A8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_float_Variable_6) == 0x0000AC, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_byte_Variable_1) == 0x0000B0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetCurrentTeamSize_ReturnValue) == 0x0000B4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetCurrentTeamSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default) == 0x0000BC, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetCurrentTeamSize_ReturnValue_1) == 0x0000C0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetCurrentTeamSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000C4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_int_Loop_Counter_Variable) == 0x0000C8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Not_PreBool_ReturnValue) == 0x0000CC, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_1) == 0x0000D4, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bIsInMatch) == 0x0000D5, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bIsInMatch' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bIsPopulated_1) == 0x0000D6, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bIsPopulated_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bOwningSquadContainsLocalPlayer_1) == 0x0000D7, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bOwningSquadContainsLocalPlayer_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0000E0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x0000F0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_bSuccess_2) == 0x0000F8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_MakeVector_ReturnValue) == 0x000100, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000118, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001F8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0001FC, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000200, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000204, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000208, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x00020C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInFrontend_ReturnValue) == 0x000210, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInFrontend_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x000218, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_bSuccess_3) == 0x000220, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic_1) == 0x000228, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_DynamicCast_bSuccess_4) == 0x000230, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInFrontEndHologram_ReturnValue) == 0x000231, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInFrontEndHologram_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInFrontEndHologram_ReturnValue_1) == 0x000232, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInFrontEndHologram_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_GameReadiness) == 0x000233, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_GameReadiness' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_2) == 0x000234, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, Temp_int_Array_Index_Variable) == 0x000238, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetAllActorsOfClass_OutActors) == 0x000240, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bMultipleSquadsPopulated) == 0x000250, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bMultipleSquadsPopulated' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bOwningSquadContainsLocalPlayer) == 0x000251, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bOwningSquadContainsLocalPlayer' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_OwningSquadStyle) == 0x000258, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_OwningSquadStyle' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Array_Get_Item) == 0x0002E0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_3) == 0x0002E8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Array_Length_ReturnValue) == 0x0002F8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue) == 0x0002FC, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Less_IntInt_ReturnValue) == 0x0002FD, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_1) == 0x0002FE, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_2) == 0x0002FF, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_SquadIdx) == 0x000300, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_SquadIdx' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bSquadHasLocalPlayer) == 0x000304, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bSquadHasLocalPlayer' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bIsPopulated) == 0x000305, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bIsPopulated' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_BooleanOR_ReturnValue) == 0x000306, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000307, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_3) == 0x000308, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_4) == 0x000309, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_5) == 0x00030A, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CreateDelegate_OutputDelegate) == 0x00030C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_bHasValidTeamMember) == 0x000318, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_bHasValidTeamMember' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsPlayingFortnite_ReturnValue) == 0x000319, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsPlayingFortnite_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Not_PreBool_ReturnValue_1) == 0x00031A, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_BooleanAND_ReturnValue) == 0x00031B, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_EventSource) == 0x000320, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_EventSource' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_EventFocus) == 0x000328, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_HandleClientEvent_ClientEvent) == 0x000330, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_HandleClientEvent_ClientEvent' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000348, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInLocalSquadGroup_ReturnValue_6) == 0x000358, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInLocalSquadGroup_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_4) == 0x00035C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Select_Default_5) == 0x00036C, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_IsInFrontend_ReturnValue_1) == 0x000370, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_IsInFrontend_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_AvatarImage) == 0x000378, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_AvatarImage' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_AvatarBackground) == 0x000380, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_AvatarBackground' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_Event_HighlightColor) == 0x000384, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_Event_HighlightColor' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000388, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetMaterialIndex_ReturnValue) == 0x000398, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetMaterialIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_GetMaterial_ReturnValue_2) == 0x0003A0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_GetMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0003A8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x0003B0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CustomEvent_bool_2) == 0x0003B8, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CustomEvent_bool_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CustomEvent_bool_1) == 0x0003B9, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CustomEvent_bool_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, K2Node_CustomEvent_bool) == 0x0003BA, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::K2Node_CustomEvent_bool' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0003BB, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0003C0, "Member 'TeamMemberPedestal_C_ExecuteUbergraph_TeamMemberPedestal::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.HandleClientEvent_StoreTabClosed
// 0x0028 (0x0028 - 0x0000)
struct TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed");
static_assert(sizeof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed) == 0x000028, "Wrong size on TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed, EventSource) == 0x000000, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed::EventSource' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed, EventFocus) == 0x000008, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed::EventFocus' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed, ClientEvent) == 0x000010, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed::ClientEvent' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.HandleClientEvent_StoreTabSelected
// 0x0028 (0x0028 - 0x0000)
struct TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected");
static_assert(sizeof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected) == 0x000028, "Wrong size on TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected, EventSource) == 0x000000, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected::EventSource' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected, EventFocus) == 0x000008, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected::EventFocus' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected, ClientEvent) == 0x000010, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected::ClientEvent' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.HandleHoverInputActions
// 0x0011 (0x0011 - 0x0000)
struct TeamMemberPedestal_C_HandleHoverInputActions final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentMemberLocal_ReturnValue;         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_HandleHoverInputActions) == 0x000001, "Wrong alignment on TeamMemberPedestal_C_HandleHoverInputActions");
static_assert(sizeof(TeamMemberPedestal_C_HandleHoverInputActions) == 0x000011, "Wrong size on TeamMemberPedestal_C_HandleHoverInputActions");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, bIsHovered) == 0x000000, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::bIsHovered' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_byte_Variable) == 0x000001, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_byte_Variable_1) == 0x000002, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_bool_Variable) == 0x000003, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_byte_Variable_2) == 0x000004, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_byte_Variable_2' has a wrong offset!");
