#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TempestRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "TempestRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class TempestRuntime.FortAIControllerComponent_Tempest
// 0x0018 (0x00B8 - 0x00A0)
class UFortAIControllerComponent_Tempest final : public UFortControllerComponent
{
public:
	class UFortTimeOfDayWeatherComponent*         WeatherComponent;                                  // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIControllerComponent_Tempest">();
	}
	static class UFortAIControllerComponent_Tempest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIControllerComponent_Tempest>();
	}
};
static_assert(alignof(UFortAIControllerComponent_Tempest) == 0x000008, "Wrong alignment on UFortAIControllerComponent_Tempest");
static_assert(sizeof(UFortAIControllerComponent_Tempest) == 0x0000B8, "Wrong size on UFortAIControllerComponent_Tempest");
static_assert(offsetof(UFortAIControllerComponent_Tempest, WeatherComponent) == 0x0000A0, "Member 'UFortAIControllerComponent_Tempest::WeatherComponent' has a wrong offset!");

// Class TempestRuntime.FortCheatManager_Tempest
// 0x0000 (0x0028 - 0x0028)
class UFortCheatManager_Tempest final : public UChildCheatManager
{
public:
	void EndTempestStorm(const class FString& StormName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_Tempest">();
	}
	static class UFortCheatManager_Tempest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Tempest>();
	}
};
static_assert(alignof(UFortCheatManager_Tempest) == 0x000008, "Wrong alignment on UFortCheatManager_Tempest");
static_assert(sizeof(UFortCheatManager_Tempest) == 0x000028, "Wrong size on UFortCheatManager_Tempest");

// Class TempestRuntime.TempestMovementComponent
// 0x0110 (0x01B0 - 0x00A0)
class UTempestMovementComponent final : public UGameFrameworkComponent
{
public:
	struct FTempestReplicatedMovementData         MovementData;                                      // 0x00A0(0x0050)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnTempestMovementStuck;                            // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(bool bIsInSafeZone)> OnTempestSafeZoneStateChanged;                     // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	ETempestMovementMode                          MovementMode;                                      // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQuery*                              FindNextMovementLocationQuery;                     // 0x0118(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaPatrolPath*                  MovementPath;                                      // 0x0120(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MovementSpeed;                                     // 0x0128(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RotationSpeed;                                     // 0x0150(0x0028)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         bShouldIgnoreZMovement : 1;                        // 0x0178(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bFloatOnWater : 1;                                 // 0x0178(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         WaterTraceZOffset;                                 // 0x0180(0x0028)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_MovementData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TempestMovementComponent">();
	}
	static class UTempestMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempestMovementComponent>();
	}
};
static_assert(alignof(UTempestMovementComponent) == 0x000010, "Wrong alignment on UTempestMovementComponent");
static_assert(sizeof(UTempestMovementComponent) == 0x0001B0, "Wrong size on UTempestMovementComponent");
static_assert(offsetof(UTempestMovementComponent, MovementData) == 0x0000A0, "Member 'UTempestMovementComponent::MovementData' has a wrong offset!");
static_assert(offsetof(UTempestMovementComponent, OnTempestMovementStuck) == 0x0000F0, "Member 'UTempestMovementComponent::OnTempestMovementStuck' has a wrong offset!");
static_assert(offsetof(UTempestMovementComponent, OnTempestSafeZoneStateChanged) == 0x000100, "Member 'UTempestMovementComponent::OnTempestSafeZoneStateChanged' has a wrong offset!");
static_assert(offsetof(UTempestMovementComponent, MovementMode) == 0x000110, "Member 'UTempestMovementComponent::MovementMode' has a wrong offset!");
static_assert(offsetof(UTempestMovementComponent, FindNextMovementLocationQuery) == 0x000118, "Member 'UTempestMovementComponent::FindNextMovementLocationQuery' has a wrong offset!");
static_assert(offsetof(UTempestMovementComponent, MovementPath) == 0x000120, "Member 'UTempestMovementComponent::MovementPath' has a wrong offset!");
static_assert(offsetof(UTempestMovementComponent, MovementSpeed) == 0x000128, "Member 'UTempestMovementComponent::MovementSpeed' has a wrong offset!");
static_assert(offsetof(UTempestMovementComponent, RotationSpeed) == 0x000150, "Member 'UTempestMovementComponent::RotationSpeed' has a wrong offset!");
static_assert(offsetof(UTempestMovementComponent, WaterTraceZOffset) == 0x000180, "Member 'UTempestMovementComponent::WaterTraceZOffset' has a wrong offset!");

// Class TempestRuntime.TempestStateMachineComponent
// 0x00D0 (0x0170 - 0x00A0)
class alignas(0x10) UTempestStateMachineComponent final : public UGameFrameworkComponent
{
public:
	bool                                          bDestroyOnCompletion;                              // 0x00A0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         FormationDuration;                                 // 0x00A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ActiveDuration;                                    // 0x00D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DissipationDuration;                               // 0x00F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FTempestStateInfo                      CurrentStateInfo;                                  // 0x0120(0x000C)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12C[0x1C];                                     // 0x012C(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(struct FTempestStateInfo& TempestStateInfo)> OnTempestStateChangedDelegate;                     // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x18];                                     // 0x0158(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ForceDissipate(const class FString& InDissipationReason);
	void OnRep_CurrentStateInfo();

	ETempestState GetCurrentState() const;
	float GetCurrentStateCompletionPercentage() const;
	struct FTempestStateInfo GetCurrentStateInfo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TempestStateMachineComponent">();
	}
	static class UTempestStateMachineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempestStateMachineComponent>();
	}
};
static_assert(alignof(UTempestStateMachineComponent) == 0x000010, "Wrong alignment on UTempestStateMachineComponent");
static_assert(sizeof(UTempestStateMachineComponent) == 0x000170, "Wrong size on UTempestStateMachineComponent");
static_assert(offsetof(UTempestStateMachineComponent, bDestroyOnCompletion) == 0x0000A0, "Member 'UTempestStateMachineComponent::bDestroyOnCompletion' has a wrong offset!");
static_assert(offsetof(UTempestStateMachineComponent, FormationDuration) == 0x0000A8, "Member 'UTempestStateMachineComponent::FormationDuration' has a wrong offset!");
static_assert(offsetof(UTempestStateMachineComponent, ActiveDuration) == 0x0000D0, "Member 'UTempestStateMachineComponent::ActiveDuration' has a wrong offset!");
static_assert(offsetof(UTempestStateMachineComponent, DissipationDuration) == 0x0000F8, "Member 'UTempestStateMachineComponent::DissipationDuration' has a wrong offset!");
static_assert(offsetof(UTempestStateMachineComponent, CurrentStateInfo) == 0x000120, "Member 'UTempestStateMachineComponent::CurrentStateInfo' has a wrong offset!");
static_assert(offsetof(UTempestStateMachineComponent, OnTempestStateChangedDelegate) == 0x000148, "Member 'UTempestStateMachineComponent::OnTempestStateChangedDelegate' has a wrong offset!");

}

