#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_RealityFruit_Athena_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tiered_RealityFruit_Athena_Parent.Tiered_RealityFruit_Athena_Parent_C
// 0x0108 (0x1128 - 0x1020)
class ATiered_RealityFruit_Athena_Parent_C : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1020(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Chest_Ambient_Sound;                               // 0x1028(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Time_1D160C0840A776ECFE3572869222E745;  // 0x1030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_1D160C0840A776ECFE3572869222E745; // 0x1034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1035[0x3];                                     // 0x1035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1038(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpInteactoIcon_0577B8574F1CB5CC5A46CAA6B5168C3E; // 0x1040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpObject_0577B8574F1CB5CC5A46CAA6B5168C3E; // 0x1044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileSelectedTL__Direction_0577B8574F1CB5CC5A46CAA6B5168C3E; // 0x1048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1049[0x7];                                     // 0x1049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileSelectedTL;                                  // 0x1050(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileOnInteractTL_LERP_24887B34456E923C5BF85EB2F3AA6AE2; // 0x1058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileOnInteractTL__Direction_24887B34456E923C5BF85EB2F3AA6AE2; // 0x105C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105D[0x3];                                     // 0x105D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileOnInteractTL;                                // 0x1060(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Loot_Effect;                                       // 0x1068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpecialChestOpenSound;                             // 0x1070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MIDs;                                              // 0x1078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MobileWiggleAmount;                                // 0x1088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChestChimeVisualUpdate;                            // 0x108C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MobileInteractionMaterial;                         // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MobileInteractIcon;                                // 0x1098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconLocation;                        // 0x10A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconScale;                           // 0x10B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Open_Chest_Sound;                                  // 0x10D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Loot_Chest_Opened_FX;                            // 0x10D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NewVar_0;                                          // 0x10E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NewVar_1;                                          // 0x10E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Galileo_Chest_Open_FX;                             // 0x10F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpenFX_Rotation;                                   // 0x10F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioIndicator;                              // 0x10FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10FD[0x3];                                     // 0x10FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NurturedLootTierGroup;                             // 0x1100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UnNurturedLootTierGroup;                           // 0x1104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_SMA_Athena_RealitySapling_Parent_C*  SaplingParent;                                     // 0x1108(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MaxTierLevel;                                      // 0x1110(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewVar_2;                                          // 0x1114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FruitLoot_Open;                                 // 0x1118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NS_LootOpen;                                       // 0x1120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CleanupWiggleMIDs();
	void CreateMobileMIDs();
	void DetermineVFXRotation();
	void DisableBacchusHighlight();
	void EnableBacchusHighlight();
	void ExecuteUbergraph_Tiered_RealityFruit_Athena_Parent(int32 EntryPoint);
	void GetMaxAudibleDistance(float* Max_Distance);
	void HideChestOpenableCosmetics();
	void Mobile_OnDisconnect();
	void Mobile_OnInteract();
	void Mobile_Outline_Off();
	void Mobile_Outline_On();
	void MobileOnInteractTL__FinishedFunc();
	void MobileOnInteractTL__UpdateFunc();
	void MobileSelectedTL__FinishedFunc();
	void MobileSelectedTL__UpdateFunc();
	void OnBeginSearch();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnFruitLooted();
	void OnLoot();
	void OnSetCustomDepthStencilValue(const TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);
	void OnSetSearched();
	void PlayChestOpeningTimeline();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Set_Loot_Tier_Group_From_Nurturing(class AB_SMA_Athena_RealitySapling_Parent_C* LocalSaplingParent);
	void Set_Loot_Tier_Group_From_Rarity();
	void SetLightVisibility(bool Visible);
	void SetVisibleMobileInteractIcon(bool Visible);
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void SpawnChestOpenVFX();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tiered_RealityFruit_Athena_Parent_C">();
	}
	static class ATiered_RealityFruit_Athena_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATiered_RealityFruit_Athena_Parent_C>();
	}
};
static_assert(alignof(ATiered_RealityFruit_Athena_Parent_C) == 0x000008, "Wrong alignment on ATiered_RealityFruit_Athena_Parent_C");
static_assert(sizeof(ATiered_RealityFruit_Athena_Parent_C) == 0x001128, "Wrong size on ATiered_RealityFruit_Athena_Parent_C");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, UberGraphFrame) == 0x001020, "Member 'ATiered_RealityFruit_Athena_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, Chest_Ambient_Sound) == 0x001028, "Member 'ATiered_RealityFruit_Athena_Parent_C::Chest_Ambient_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, Timeline_0_Time_1D160C0840A776ECFE3572869222E745) == 0x001030, "Member 'ATiered_RealityFruit_Athena_Parent_C::Timeline_0_Time_1D160C0840A776ECFE3572869222E745' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, Timeline_0__Direction_1D160C0840A776ECFE3572869222E745) == 0x001034, "Member 'ATiered_RealityFruit_Athena_Parent_C::Timeline_0__Direction_1D160C0840A776ECFE3572869222E745' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, Timeline_0) == 0x001038, "Member 'ATiered_RealityFruit_Athena_Parent_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileSelectedTL_LerpInteactoIcon_0577B8574F1CB5CC5A46CAA6B5168C3E) == 0x001040, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileSelectedTL_LerpInteactoIcon_0577B8574F1CB5CC5A46CAA6B5168C3E' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileSelectedTL_LerpObject_0577B8574F1CB5CC5A46CAA6B5168C3E) == 0x001044, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileSelectedTL_LerpObject_0577B8574F1CB5CC5A46CAA6B5168C3E' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileSelectedTL__Direction_0577B8574F1CB5CC5A46CAA6B5168C3E) == 0x001048, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileSelectedTL__Direction_0577B8574F1CB5CC5A46CAA6B5168C3E' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileSelectedTL) == 0x001050, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileSelectedTL' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileOnInteractTL_LERP_24887B34456E923C5BF85EB2F3AA6AE2) == 0x001058, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileOnInteractTL_LERP_24887B34456E923C5BF85EB2F3AA6AE2' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileOnInteractTL__Direction_24887B34456E923C5BF85EB2F3AA6AE2) == 0x00105C, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileOnInteractTL__Direction_24887B34456E923C5BF85EB2F3AA6AE2' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileOnInteractTL) == 0x001060, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileOnInteractTL' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, Loot_Effect) == 0x001068, "Member 'ATiered_RealityFruit_Athena_Parent_C::Loot_Effect' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, SpecialChestOpenSound) == 0x001070, "Member 'ATiered_RealityFruit_Athena_Parent_C::SpecialChestOpenSound' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MIDs) == 0x001078, "Member 'ATiered_RealityFruit_Athena_Parent_C::MIDs' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileWiggleAmount) == 0x001088, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileWiggleAmount' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, ChestChimeVisualUpdate) == 0x00108C, "Member 'ATiered_RealityFruit_Athena_Parent_C::ChestChimeVisualUpdate' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileInteractionMaterial) == 0x001090, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileInteractionMaterial' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileInteractIcon) == 0x001098, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileInteractIcon' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileInteractIconLocation) == 0x0010A0, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileInteractIconLocation' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MobileInteractIconScale) == 0x0010B8, "Member 'ATiered_RealityFruit_Athena_Parent_C::MobileInteractIconScale' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, Open_Chest_Sound) == 0x0010D0, "Member 'ATiered_RealityFruit_Athena_Parent_C::Open_Chest_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, P_Loot_Chest_Opened_FX) == 0x0010D8, "Member 'ATiered_RealityFruit_Athena_Parent_C::P_Loot_Chest_Opened_FX' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, NewVar_0) == 0x0010E0, "Member 'ATiered_RealityFruit_Athena_Parent_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, NewVar_1) == 0x0010E8, "Member 'ATiered_RealityFruit_Athena_Parent_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, Galileo_Chest_Open_FX) == 0x0010F0, "Member 'ATiered_RealityFruit_Athena_Parent_C::Galileo_Chest_Open_FX' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, OpenFX_Rotation) == 0x0010F8, "Member 'ATiered_RealityFruit_Athena_Parent_C::OpenFX_Rotation' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, EnableAudioIndicator) == 0x0010FC, "Member 'ATiered_RealityFruit_Athena_Parent_C::EnableAudioIndicator' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, NurturedLootTierGroup) == 0x001100, "Member 'ATiered_RealityFruit_Athena_Parent_C::NurturedLootTierGroup' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, UnNurturedLootTierGroup) == 0x001104, "Member 'ATiered_RealityFruit_Athena_Parent_C::UnNurturedLootTierGroup' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, SaplingParent) == 0x001108, "Member 'ATiered_RealityFruit_Athena_Parent_C::SaplingParent' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, MaxTierLevel) == 0x001110, "Member 'ATiered_RealityFruit_Athena_Parent_C::MaxTierLevel' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, NewVar_2) == 0x001114, "Member 'ATiered_RealityFruit_Athena_Parent_C::NewVar_2' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, NS_FruitLoot_Open) == 0x001118, "Member 'ATiered_RealityFruit_Athena_Parent_C::NS_FruitLoot_Open' has a wrong offset!");
static_assert(offsetof(ATiered_RealityFruit_Athena_Parent_C, NS_LootOpen) == 0x001120, "Member 'ATiered_RealityFruit_Athena_Parent_C::NS_LootOpen' has a wrong offset!");

}

