#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_RealityFruit_Athena_Mythic

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tiered_RealityFruit_Athena_Mythic.Tiered_RealityFruit_Athena_Mythic_C.BlueprintOnLocalInteract
// 0x0010 (0x0010 - 0x0000)
struct Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract final
{
public:
	class AFortPlayerPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Owning_Player_Pawn_ReturnValue;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract) == 0x000008, "Wrong alignment on Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract");
static_assert(sizeof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract) == 0x000010, "Wrong size on Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract, InteractingPawn) == 0x000000, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract, InteractionBeingAttempted) == 0x000008, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract, ReturnValue) == 0x000009, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract, CallFunc_Is_Owning_Player_Pawn_ReturnValue) == 0x00000A, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintOnLocalInteract::CallFunc_Is_Owning_Player_Pawn_ReturnValue' has a wrong offset!");

// Function Tiered_RealityFruit_Athena_Mythic.Tiered_RealityFruit_Athena_Mythic_C.ExecuteUbergraph_Tiered_RealityFruit_Athena_Mythic
// 0x0004 (0x0004 - 0x0000)
struct Tiered_RealityFruit_Athena_Mythic_C_ExecuteUbergraph_Tiered_RealityFruit_Athena_Mythic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_RealityFruit_Athena_Mythic_C_ExecuteUbergraph_Tiered_RealityFruit_Athena_Mythic) == 0x000004, "Wrong alignment on Tiered_RealityFruit_Athena_Mythic_C_ExecuteUbergraph_Tiered_RealityFruit_Athena_Mythic");
static_assert(sizeof(Tiered_RealityFruit_Athena_Mythic_C_ExecuteUbergraph_Tiered_RealityFruit_Athena_Mythic) == 0x000004, "Wrong size on Tiered_RealityFruit_Athena_Mythic_C_ExecuteUbergraph_Tiered_RealityFruit_Athena_Mythic");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_ExecuteUbergraph_Tiered_RealityFruit_Athena_Mythic, EntryPoint) == 0x000000, "Member 'Tiered_RealityFruit_Athena_Mythic_C_ExecuteUbergraph_Tiered_RealityFruit_Athena_Mythic::EntryPoint' has a wrong offset!");

// Function Tiered_RealityFruit_Athena_Mythic.Tiered_RealityFruit_Athena_Mythic_C.Set Loot Tier Group From Rarity
// 0x0070 (0x0070 - 0x0000)
struct Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity final
{
public:
	struct FVector                                UseLocation;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetPoiGridTagsForLocation_ReturnValue;    // 0x0048(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity) == 0x000008, "Wrong alignment on Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity");
static_assert(sizeof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity) == 0x000070, "Wrong size on Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity, UseLocation) == 0x000000, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity::UseLocation' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity, CallFunc_GetGameStateAthena_ReturnValue) == 0x000038, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity, CallFunc_GetPoiGridTagsForLocation_ReturnValue) == 0x000048, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity::CallFunc_GetPoiGridTagsForLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity, CallFunc_HasTag_ReturnValue) == 0x000068, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity, CallFunc_HasTag_ReturnValue_1) == 0x000069, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity, CallFunc_HasTag_ReturnValue_2) == 0x00006A, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Set_Loot_Tier_Group_From_Rarity::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");

// Function Tiered_RealityFruit_Athena_Mythic.Tiered_RealityFruit_Athena_Mythic_C.BlueprintCanInteract
// 0x0020 (0x0020 - 0x0000)
struct Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BlueprintCanInteract_ReturnValue;         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract");
static_assert(sizeof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract) == 0x000020, "Wrong size on Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, CallFunc_BlueprintCanInteract_ReturnValue) == 0x00000B, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::CallFunc_BlueprintCanInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue_1) == 0x00001B, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00001C, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintCanInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function Tiered_RealityFruit_Athena_Mythic.Tiered_RealityFruit_Athena_Mythic_C.BlueprintGetFailedInteractionString
// 0x0028 (0x0028 - 0x0000)
struct Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString) == 0x000008, "Wrong alignment on Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString");
static_assert(sizeof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString) == 0x000028, "Wrong size on Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString, InteractingPawn) == 0x000000, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString, ReturnValue) == 0x000010, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetFailedInteractionString::ReturnValue' has a wrong offset!");

// Function Tiered_RealityFruit_Athena_Mythic.Tiered_RealityFruit_Athena_Mythic_C.BlueprintGetInteractionString
// 0x0030 (0x0030 - 0x0000)
struct Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_Is_Owning_Player_Pawn_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString");
static_assert(sizeof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString) == 0x000030, "Wrong size on Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString, CallFunc_Is_Owning_Player_Pawn_ReturnValue) == 0x000028, "Member 'Tiered_RealityFruit_Athena_Mythic_C_BlueprintGetInteractionString::CallFunc_Is_Owning_Player_Pawn_ReturnValue' has a wrong offset!");

// Function Tiered_RealityFruit_Athena_Mythic.Tiered_RealityFruit_Athena_Mythic_C.Is Owning Player Pawn
// 0x0020 (0x0020 - 0x0000)
struct Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn final
{
public:
	class AFortPawn*                              InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn) == 0x000008, "Wrong alignment on Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn");
static_assert(sizeof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn) == 0x000020, "Wrong size on Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn, InteractingPawn) == 0x000000, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn, ReturnValue) == 0x000008, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn::ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn, CallFunc_IsValid_ReturnValue_1) == 0x00001B, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00001C, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn, CallFunc_IsValid_ReturnValue_2) == 0x00001D, "Member 'Tiered_RealityFruit_Athena_Mythic_C_Is_Owning_Player_Pawn::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

