#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Chest_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tiered_Chest_Athena.Tiered_Chest_Athena_C
// 0x0140 (0x1160 - 0x1020)
class ATiered_Chest_Athena_C : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1020(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortSoundIndicatorComponent*           Sound_Indicator_Component;                         // 0x1028(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Loot_Chest_Aura_Athena;                          // 0x1030(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Chest_SmokeSheet;                                // 0x1038(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   TreasureLight;                                     // 0x1040(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Chest_Ambient_Sound;                               // 0x1048(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Time_C3D8BC62418047EE3E783F89FAF8EEB6;  // 0x1050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_C3D8BC62418047EE3E783F89FAF8EEB6; // 0x1054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1055[0x3];                                     // 0x1055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1058(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpInteactoIcon_EEB30EBE433E8977EDA63DB381EAF0C8; // 0x1060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpObject_EEB30EBE433E8977EDA63DB381EAF0C8; // 0x1064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileSelectedTL__Direction_EEB30EBE433E8977EDA63DB381EAF0C8; // 0x1068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1069[0x7];                                     // 0x1069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileSelectedTL;                                  // 0x1070(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileOnInteractTL_LERP_9BD788A146DACD005BAF94BEBEDAB584; // 0x1078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileOnInteractTL__Direction_9BD788A146DACD005BAF94BEBEDAB584; // 0x107C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_107D[0x3];                                     // 0x107D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileOnInteractTL;                                // 0x1080(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Loot_Effect;                                       // 0x1088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpecialChestOpenSound;                             // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MIDs;                                              // 0x1098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MobileWiggleAmount;                                // 0x10A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChestChimeVisualUpdate;                            // 0x10AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MobileInteractionMaterial;                         // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MobileInteractIcon;                                // 0x10B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconLocation;                        // 0x10C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconScale;                           // 0x10D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Open_Chest_Sound;                                  // 0x10F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Loot_Chest_Opened_FX;                            // 0x10F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NewVar_0;                                          // 0x1100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NewVar_1;                                          // 0x1108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Galileo_Chest_Open_FX;                             // 0x1110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpenFX_Rotation;                                   // 0x1118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudioIndicator;                              // 0x111C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111D[0x3];                                     // 0x111D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                AdditionalVFXToDestroyOnSearch;                    // 0x1120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FScalableFloat                         UsePhysics;                                        // 0x1130(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bOpened;                                           // 0x1158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Timeline_0__UpdateFunc();
	void SpawnChestOpenVFX();
	void Timeline_0__FinishedFunc();
	void SetLightVisibility(bool Visible);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void PlayChestOpeningTimeline();
	void OnSetSearched();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void SetVisibleMobileInteractIcon(bool Visible);
	void OnSetCustomDepthStencilValue(const TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);
	void OnLoot();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnBeginSearch();
	void MobileSelectedTL__UpdateFunc();
	void MobileSelectedTL__FinishedFunc();
	void MobileOnInteractTL__UpdateFunc();
	void Mobile_Outline_On();
	void MobileOnInteractTL__FinishedFunc();
	void Mobile_Outline_Off();
	void Mobile_OnInteract();
	void Mobile_OnDisconnect();
	void HideChestOpenableCosmetics();
	void GetMaxAudibleDistance(float* Max_Distance);
	void ExecuteUbergraph_Tiered_Chest_Athena(int32 EntryPoint);
	void EnableBacchusHighlight();
	void DisableBacchusHighlight();
	void DetermineVFXRotation();
	void DestroyAdditionalVFXComponents();
	void CreateMobileMIDs();
	void CleanupWiggleMIDs();
	void AudioOnOpened();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tiered_Chest_Athena_C">();
	}
	static class ATiered_Chest_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATiered_Chest_Athena_C>();
	}
};
static_assert(alignof(ATiered_Chest_Athena_C) == 0x000008, "Wrong alignment on ATiered_Chest_Athena_C");
static_assert(sizeof(ATiered_Chest_Athena_C) == 0x001160, "Wrong size on ATiered_Chest_Athena_C");
static_assert(offsetof(ATiered_Chest_Athena_C, UberGraphFrame) == 0x001020, "Member 'ATiered_Chest_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Sound_Indicator_Component) == 0x001028, "Member 'ATiered_Chest_Athena_C::Sound_Indicator_Component' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, P_Loot_Chest_Aura_Athena) == 0x001030, "Member 'ATiered_Chest_Athena_C::P_Loot_Chest_Aura_Athena' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, S_Chest_SmokeSheet) == 0x001038, "Member 'ATiered_Chest_Athena_C::S_Chest_SmokeSheet' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, TreasureLight) == 0x001040, "Member 'ATiered_Chest_Athena_C::TreasureLight' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Chest_Ambient_Sound) == 0x001048, "Member 'ATiered_Chest_Athena_C::Chest_Ambient_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Timeline_0_Time_C3D8BC62418047EE3E783F89FAF8EEB6) == 0x001050, "Member 'ATiered_Chest_Athena_C::Timeline_0_Time_C3D8BC62418047EE3E783F89FAF8EEB6' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Timeline_0__Direction_C3D8BC62418047EE3E783F89FAF8EEB6) == 0x001054, "Member 'ATiered_Chest_Athena_C::Timeline_0__Direction_C3D8BC62418047EE3E783F89FAF8EEB6' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Timeline_0) == 0x001058, "Member 'ATiered_Chest_Athena_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL_LerpInteactoIcon_EEB30EBE433E8977EDA63DB381EAF0C8) == 0x001060, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL_LerpInteactoIcon_EEB30EBE433E8977EDA63DB381EAF0C8' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL_LerpObject_EEB30EBE433E8977EDA63DB381EAF0C8) == 0x001064, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL_LerpObject_EEB30EBE433E8977EDA63DB381EAF0C8' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL__Direction_EEB30EBE433E8977EDA63DB381EAF0C8) == 0x001068, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL__Direction_EEB30EBE433E8977EDA63DB381EAF0C8' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL) == 0x001070, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileOnInteractTL_LERP_9BD788A146DACD005BAF94BEBEDAB584) == 0x001078, "Member 'ATiered_Chest_Athena_C::MobileOnInteractTL_LERP_9BD788A146DACD005BAF94BEBEDAB584' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileOnInteractTL__Direction_9BD788A146DACD005BAF94BEBEDAB584) == 0x00107C, "Member 'ATiered_Chest_Athena_C::MobileOnInteractTL__Direction_9BD788A146DACD005BAF94BEBEDAB584' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileOnInteractTL) == 0x001080, "Member 'ATiered_Chest_Athena_C::MobileOnInteractTL' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Loot_Effect) == 0x001088, "Member 'ATiered_Chest_Athena_C::Loot_Effect' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, SpecialChestOpenSound) == 0x001090, "Member 'ATiered_Chest_Athena_C::SpecialChestOpenSound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MIDs) == 0x001098, "Member 'ATiered_Chest_Athena_C::MIDs' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileWiggleAmount) == 0x0010A8, "Member 'ATiered_Chest_Athena_C::MobileWiggleAmount' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, ChestChimeVisualUpdate) == 0x0010AC, "Member 'ATiered_Chest_Athena_C::ChestChimeVisualUpdate' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractionMaterial) == 0x0010B0, "Member 'ATiered_Chest_Athena_C::MobileInteractionMaterial' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractIcon) == 0x0010B8, "Member 'ATiered_Chest_Athena_C::MobileInteractIcon' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractIconLocation) == 0x0010C0, "Member 'ATiered_Chest_Athena_C::MobileInteractIconLocation' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractIconScale) == 0x0010D8, "Member 'ATiered_Chest_Athena_C::MobileInteractIconScale' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Open_Chest_Sound) == 0x0010F0, "Member 'ATiered_Chest_Athena_C::Open_Chest_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, P_Loot_Chest_Opened_FX) == 0x0010F8, "Member 'ATiered_Chest_Athena_C::P_Loot_Chest_Opened_FX' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, NewVar_0) == 0x001100, "Member 'ATiered_Chest_Athena_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, NewVar_1) == 0x001108, "Member 'ATiered_Chest_Athena_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Galileo_Chest_Open_FX) == 0x001110, "Member 'ATiered_Chest_Athena_C::Galileo_Chest_Open_FX' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, OpenFX_Rotation) == 0x001118, "Member 'ATiered_Chest_Athena_C::OpenFX_Rotation' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, EnableAudioIndicator) == 0x00111C, "Member 'ATiered_Chest_Athena_C::EnableAudioIndicator' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, AdditionalVFXToDestroyOnSearch) == 0x001120, "Member 'ATiered_Chest_Athena_C::AdditionalVFXToDestroyOnSearch' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, UsePhysics) == 0x001130, "Member 'ATiered_Chest_Athena_C::UsePhysics' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, bOpened) == 0x001158, "Member 'ATiered_Chest_Athena_C::bOpened' has a wrong offset!");

}

