#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Ammo_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tiered_Ammo_Athena.Tiered_Ammo_Athena_C.SetVisibleMobileInteractIcon
// 0x00C0 (0x00C0 - 0x0000)
struct Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon) == 0x000010, "Wrong alignment on Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon");
static_assert(sizeof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon) == 0x0000C0, "Wrong size on Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, Visible) == 0x000000, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::Visible' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_2) == 0x0000B0, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_AddComponent_ReturnValue) == 0x0000B8, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function Tiered_Ammo_Athena.Tiered_Ammo_Athena_C.ExecuteUbergraph_Tiered_Ammo_Athena
// 0x0210 (0x0210 - 0x0000)
struct Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00F0(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena) == 0x000010, "Wrong alignment on Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena");
static_assert(sizeof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena) == 0x000210, "Wrong size on Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, EntryPoint) == 0x000000, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_AddComponent_ReturnValue) == 0x000080, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000088, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_VLerp_ReturnValue) == 0x000090, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsMobileGame_ReturnValue) == 0x0000A8, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_2) == 0x0000AA, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_3) == 0x0000AB, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000B0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Roll) == 0x0000C8, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Pitch) == 0x0000CC, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Yaw) == 0x0000D0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D4, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeRotator_ReturnValue_1) == 0x0000D8, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeTransform_ReturnValue_1) == 0x0000F0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_4) == 0x000150, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_AddComponent_ReturnValue_1) == 0x000158, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_5) == 0x000160, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000168, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000170, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000188, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Roll_1) == 0x0001A0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Pitch_1) == 0x0001A4, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Yaw_1) == 0x0001A8, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_6) == 0x0001AC, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001B0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeRotator_ReturnValue_2) == 0x0001B8, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x0001D0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_7) == 0x0001D1, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_8) == 0x0001D2, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001D8, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_Add_VectorVector_ReturnValue) == 0x0001F0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000208, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function Tiered_Ammo_Athena.Tiered_Ammo_Athena_C.IsTargetableByLinearMover
// 0x0001 (0x0001 - 0x0000)
struct Tiered_Ammo_Athena_C_IsTargetableByLinearMover final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Ammo_Athena_C_IsTargetableByLinearMover) == 0x000001, "Wrong alignment on Tiered_Ammo_Athena_C_IsTargetableByLinearMover");
static_assert(sizeof(Tiered_Ammo_Athena_C_IsTargetableByLinearMover) == 0x000001, "Wrong size on Tiered_Ammo_Athena_C_IsTargetableByLinearMover");
static_assert(offsetof(Tiered_Ammo_Athena_C_IsTargetableByLinearMover, ReturnValue) == 0x000000, "Member 'Tiered_Ammo_Athena_C_IsTargetableByLinearMover::ReturnValue' has a wrong offset!");

}

