#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Chest_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.UserConstructionScript
// 0x0078 (0x0078 - 0x0000)
struct Tiered_Chest_Athena_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_C_UserConstructionScript) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_C_UserConstructionScript");
static_assert(sizeof(Tiered_Chest_Athena_C_UserConstructionScript) == 0x000078, "Wrong size on Tiered_Chest_Athena_C_UserConstructionScript");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000010, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_GetPlatformName_ReturnValue) == 0x000018, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, K2Node_SwitchInteger_CmpSuccess) == 0x000028, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000029, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue) == 0x000030, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000048, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x00004C, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000050, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_Abs_ReturnValue) == 0x000054, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_Abs_ReturnValue_1) == 0x000058, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_Abs_ReturnValue_2) == 0x00005C, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'Tiered_Chest_Athena_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.SetLightVisibility
// 0x0002 (0x0002 - 0x0000)
struct Tiered_Chest_Athena_C_SetLightVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_C_SetLightVisibility) == 0x000001, "Wrong alignment on Tiered_Chest_Athena_C_SetLightVisibility");
static_assert(sizeof(Tiered_Chest_Athena_C_SetLightVisibility) == 0x000002, "Wrong size on Tiered_Chest_Athena_C_SetLightVisibility");
static_assert(offsetof(Tiered_Chest_Athena_C_SetLightVisibility, Visible) == 0x000000, "Member 'Tiered_Chest_Athena_C_SetLightVisibility::Visible' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetLightVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Tiered_Chest_Athena_C_SetLightVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.ShouldDie
// 0x0030 (0x0030 - 0x0000)
struct Tiered_Chest_Athena_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_C_ShouldDie) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_C_ShouldDie");
static_assert(sizeof(Tiered_Chest_Athena_C_ShouldDie) == 0x000030, "Wrong size on Tiered_Chest_Athena_C_ShouldDie");
static_assert(offsetof(Tiered_Chest_Athena_C_ShouldDie, Damage) == 0x000000, "Member 'Tiered_Chest_Athena_C_ShouldDie::Damage' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ShouldDie, EventInstigator) == 0x000008, "Member 'Tiered_Chest_Athena_C_ShouldDie::EventInstigator' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ShouldDie, DamageCauser) == 0x000010, "Member 'Tiered_Chest_Athena_C_ShouldDie::DamageCauser' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ShouldDie, ReturnValue) == 0x000018, "Member 'Tiered_Chest_Athena_C_ShouldDie::ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ShouldDie, K2Node_DynamicCast_AsFort_Player_Controller_Outpost) == 0x000020, "Member 'Tiered_Chest_Athena_C_ShouldDie::K2Node_DynamicCast_AsFort_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ShouldDie, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Tiered_Chest_Athena_C_ShouldDie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ShouldDie, CallFunc_IsOutpostOwner_ReturnValue) == 0x000029, "Member 'Tiered_Chest_Athena_C_ShouldDie::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.SetVisibleMobileInteractIcon
// 0x00C0 (0x00C0 - 0x0000)
struct Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon) == 0x000010, "Wrong alignment on Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon");
static_assert(sizeof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon) == 0x0000C0, "Wrong size on Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, Visible) == 0x000000, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::Visible' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_2) == 0x0000B0, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon, CallFunc_AddComponent_ReturnValue) == 0x0000B8, "Member 'Tiered_Chest_Athena_C_SetVisibleMobileInteractIcon::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.OnSetCustomDepthStencilValue
// 0x0038 (0x0038 - 0x0000)
struct Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue final
{
public:
	TArray<class UPrimitiveComponent*>            PrimComponents;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          bUseCustomDepth;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StencilValue;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutConsume;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue");
static_assert(sizeof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue) == 0x000038, "Wrong size on Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, PrimComponents) == 0x000000, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::PrimComponents' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, bUseCustomDepth) == 0x000010, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::bUseCustomDepth' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, StencilValue) == 0x000014, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::StencilValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, bOutConsume) == 0x000018, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::bOutConsume' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, Temp_int_Array_Index_Variable) == 0x000020, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, CallFunc_Array_Get_Item) == 0x000028, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Tiered_Chest_Athena_C_OnSetCustomDepthStencilValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.OnDeathPlayEffects
// 0x0148 (0x0148 - 0x0000)
struct Tiered_Chest_Athena_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0130(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Tiered_Chest_Athena_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_C_OnDeathPlayEffects");
static_assert(sizeof(Tiered_Chest_Athena_C_OnDeathPlayEffects) == 0x000148, "Wrong size on Tiered_Chest_Athena_C_OnDeathPlayEffects");
static_assert(offsetof(Tiered_Chest_Athena_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Tiered_Chest_Athena_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Tiered_Chest_Athena_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Tiered_Chest_Athena_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnDeathPlayEffects, HitInfo) == 0x000040, "Member 'Tiered_Chest_Athena_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnDeathPlayEffects, InstigatedBy) == 0x000120, "Member 'Tiered_Chest_Athena_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnDeathPlayEffects, DamageCauser) == 0x000128, "Member 'Tiered_Chest_Athena_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_OnDeathPlayEffects, EffectContext) == 0x000130, "Member 'Tiered_Chest_Athena_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.GetMaxAudibleDistance
// 0x0008 (0x0008 - 0x0000)
struct Tiered_Chest_Athena_C_GetMaxAudibleDistance final
{
public:
	float                                         Max_Distance;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_C_GetMaxAudibleDistance) == 0x000004, "Wrong alignment on Tiered_Chest_Athena_C_GetMaxAudibleDistance");
static_assert(sizeof(Tiered_Chest_Athena_C_GetMaxAudibleDistance) == 0x000008, "Wrong size on Tiered_Chest_Athena_C_GetMaxAudibleDistance");
static_assert(offsetof(Tiered_Chest_Athena_C_GetMaxAudibleDistance, Max_Distance) == 0x000000, "Member 'Tiered_Chest_Athena_C_GetMaxAudibleDistance::Max_Distance' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_GetMaxAudibleDistance, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Tiered_Chest_Athena_C_GetMaxAudibleDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.ExecuteUbergraph_Tiered_Chest_Athena
// 0x0300 (0x0300 - 0x0000)
struct Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0070(0x0080)()
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_6;          // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0160(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0198(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0288(0x0018)()
	int32                                         CallFunc_GetLootTier_ReturnValue;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena");
static_assert(sizeof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena) == 0x000300, "Wrong size on Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, EntryPoint) == 0x000000, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000C, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00000D, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000014, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_bool_IsClosed_Variable) == 0x00001C, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_bool_Has_Been_Initd_Variable) == 0x00001D, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000024, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x00002C, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_bool_IsClosed_Variable_1) == 0x00002D, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_bool_Has_Been_Initd_Variable_1) == 0x00002E, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000048, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_BreakRotator_Roll) == 0x000060, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_BreakRotator_Pitch) == 0x000064, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_BreakRotator_Yaw) == 0x000068, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_BPGetRarityData_ReturnValue) == 0x000070, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000F0, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x00010C, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Array_Length_ReturnValue_1) == 0x000110, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_int_Array_Index_Variable_1) == 0x000118, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Array_Get_Item) == 0x000120, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Array_Get_Item_1) == 0x000128, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Array_Length_ReturnValue_2) == 0x000130, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Less_IntInt_ReturnValue_1) == 0x000134, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Lerp_ReturnValue) == 0x000138, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_IsDedicatedServer_ReturnValue_6) == 0x00013C, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_IsDedicatedServer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_VLerp_ReturnValue) == 0x000140, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_IsMobileGame_ReturnValue) == 0x000158, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, K2Node_Event_Damage) == 0x00015C, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, K2Node_Event_DamageTags) == 0x000160, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, K2Node_Event_Momentum) == 0x000180, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, K2Node_Event_HitInfo) == 0x000198, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, K2Node_Event_InstigatedBy) == 0x000278, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, K2Node_Event_DamageCauser) == 0x000280, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, K2Node_Event_EffectContext) == 0x000288, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_GetLootTier_ReturnValue) == 0x0002A0, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_GetLootTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, K2Node_SwitchInteger_CmpSuccess) == 0x0002A4, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002A8, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_MakeRotator_ReturnValue) == 0x0002B0, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0002C8, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_int_Loop_Counter_Variable_2) == 0x0002D0, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002D4, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002D8, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, Temp_int_Array_Index_Variable_2) == 0x0002DC, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_Array_Get_Item_2) == 0x0002E0, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002E8, "Member 'Tiered_Chest_Athena_C_ExecuteUbergraph_Tiered_Chest_Athena::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.DestroyAdditionalVFXComponents
// 0x0020 (0x0020 - 0x0000)
struct Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents");
static_assert(sizeof(Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents) == 0x000020, "Wrong size on Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents");
static_assert(offsetof(Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents, CallFunc_Array_Get_Item) == 0x000010, "Member 'Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'Tiered_Chest_Athena_C_DestroyAdditionalVFXComponents::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena.Tiered_Chest_Athena_C.CreateMobileMIDs
// 0x0030 (0x0030 - 0x0000)
struct Tiered_Chest_Athena_C_CreateMobileMIDs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_C_CreateMobileMIDs) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_C_CreateMobileMIDs");
