#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Chest_Athena_FactionChest

#include "Basic.hpp"

#include "Struct_FactionChest_FactionMapping_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Tiered_Chest_Athena_FactionChest.Tiered_Chest_Athena_FactionChest_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Tiered_Chest_Athena_FactionChest_C_UserConstructionScript final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_FactionChest_C_UserConstructionScript) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_FactionChest_C_UserConstructionScript");
static_assert(sizeof(Tiered_Chest_Athena_FactionChest_C_UserConstructionScript) == 0x000010, "Wrong size on Tiered_Chest_Athena_FactionChest_C_UserConstructionScript");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_UserConstructionScript, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'Tiered_Chest_Athena_FactionChest_C_UserConstructionScript::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_UserConstructionScript, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000008, "Member 'Tiered_Chest_Athena_FactionChest_C_UserConstructionScript::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_UserConstructionScript, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'Tiered_Chest_Athena_FactionChest_C_UserConstructionScript::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000D, "Member 'Tiered_Chest_Athena_FactionChest_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena_FactionChest.Tiered_Chest_Athena_FactionChest_C.ShouldDie
// 0x0030 (0x0030 - 0x0000)
struct Tiered_Chest_Athena_FactionChest_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_FactionChest_C_ShouldDie) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_FactionChest_C_ShouldDie");
static_assert(sizeof(Tiered_Chest_Athena_FactionChest_C_ShouldDie) == 0x000030, "Wrong size on Tiered_Chest_Athena_FactionChest_C_ShouldDie");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ShouldDie, Damage) == 0x000000, "Member 'Tiered_Chest_Athena_FactionChest_C_ShouldDie::Damage' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ShouldDie, EventInstigator) == 0x000008, "Member 'Tiered_Chest_Athena_FactionChest_C_ShouldDie::EventInstigator' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ShouldDie, DamageCauser) == 0x000010, "Member 'Tiered_Chest_Athena_FactionChest_C_ShouldDie::DamageCauser' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ShouldDie, ReturnValue) == 0x000018, "Member 'Tiered_Chest_Athena_FactionChest_C_ShouldDie::ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ShouldDie, K2Node_DynamicCast_AsFort_Player_Controller_Outpost) == 0x000020, "Member 'Tiered_Chest_Athena_FactionChest_C_ShouldDie::K2Node_DynamicCast_AsFort_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ShouldDie, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Tiered_Chest_Athena_FactionChest_C_ShouldDie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ShouldDie, CallFunc_IsOutpostOwner_ReturnValue) == 0x000029, "Member 'Tiered_Chest_Athena_FactionChest_C_ShouldDie::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena_FactionChest.Tiered_Chest_Athena_FactionChest_C.SetVisibleMobileInteractIcon
// 0x00C0 (0x00C0 - 0x0000)
struct Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon) == 0x000010, "Wrong alignment on Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon");
static_assert(sizeof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon) == 0x0000C0, "Wrong size on Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, Visible) == 0x000000, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::Visible' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_2) == 0x0000B0, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon, CallFunc_AddComponent_ReturnValue) == 0x0000B8, "Member 'Tiered_Chest_Athena_FactionChest_C_SetVisibleMobileInteractIcon::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena_FactionChest.Tiered_Chest_Athena_FactionChest_C.SetLightVisibility
// 0x0002 (0x0002 - 0x0000)
struct Tiered_Chest_Athena_FactionChest_C_SetLightVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_FactionChest_C_SetLightVisibility) == 0x000001, "Wrong alignment on Tiered_Chest_Athena_FactionChest_C_SetLightVisibility");
static_assert(sizeof(Tiered_Chest_Athena_FactionChest_C_SetLightVisibility) == 0x000002, "Wrong size on Tiered_Chest_Athena_FactionChest_C_SetLightVisibility");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetLightVisibility, Visible) == 0x000000, "Member 'Tiered_Chest_Athena_FactionChest_C_SetLightVisibility::Visible' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_SetLightVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Tiered_Chest_Athena_FactionChest_C_SetLightVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena_FactionChest.Tiered_Chest_Athena_FactionChest_C.OnSetCustomDepthStencilValue
// 0x0038 (0x0038 - 0x0000)
struct Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue final
{
public:
	TArray<class UPrimitiveComponent*>            PrimComponents;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          bUseCustomDepth;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StencilValue;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutConsume;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue");
static_assert(sizeof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue) == 0x000038, "Wrong size on Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, PrimComponents) == 0x000000, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::PrimComponents' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, bUseCustomDepth) == 0x000010, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::bUseCustomDepth' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, StencilValue) == 0x000014, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::StencilValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, bOutConsume) == 0x000018, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::bOutConsume' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, Temp_int_Array_Index_Variable) == 0x000020, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, CallFunc_Array_Get_Item) == 0x000028, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Tiered_Chest_Athena_FactionChest_C_OnSetCustomDepthStencilValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena_FactionChest.Tiered_Chest_Athena_FactionChest_C.OnRep_T_Faction
// 0x0128 (0x0128 - 0x0000)
struct Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction final
{
public:
	bool                                          FoundFaction;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_FactionChest_FactionMapping    CallFunc_Array_Get_Item;                           // 0x0010(0x0060)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarkedActorDisplayInfo                K2Node_MakeStruct_MarkedActorDisplayInfo;          // 0x0078(0x0098)()
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_Lock_Scanner_C*             K2Node_DynamicCast_AsBGA_Athena_Lock_Scanner;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction");
static_assert(sizeof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction) == 0x000128, "Wrong size on Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, FoundFaction) == 0x000000, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::FoundFaction' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, CallFunc_Array_Get_Item) == 0x000010, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, K2Node_MakeStruct_MarkedActorDisplayInfo) == 0x000078, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::K2Node_MakeStruct_MarkedActorDisplayInfo' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000110, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, K2Node_DynamicCast_AsBGA_Athena_Lock_Scanner) == 0x000118, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::K2Node_DynamicCast_AsBGA_Athena_Lock_Scanner' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'Tiered_Chest_Athena_FactionChest_C_OnRep_T_Faction::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Tiered_Chest_Athena_FactionChest.Tiered_Chest_Athena_FactionChest_C.OnReady_4B230BA9462CBC682058038B6AD176CE
// 0x0030 (0x0030 - 0x0000)
struct Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE");
static_assert(sizeof(Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE) == 0x000030, "Wrong size on Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE, GameState) == 0x000000, "Member 'Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE::GameState' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE, Playlist) == 0x000008, "Member 'Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE::Playlist' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE, PlaylistContextTags) == 0x000010, "Member 'Tiered_Chest_Athena_FactionChest_C_OnReady_4B230BA9462CBC682058038B6AD176CE::PlaylistContextTags' has a wrong offset!");

// Function Tiered_Chest_Athena_FactionChest.Tiered_Chest_Athena_FactionChest_C.GetMaxAudibleDistance
// 0x0008 (0x0008 - 0x0000)
struct Tiered_Chest_Athena_FactionChest_C_GetMaxAudibleDistance final
{
public:
	float                                         Max_Distance;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_FactionChest_C_GetMaxAudibleDistance) == 0x000004, "Wrong alignment on Tiered_Chest_Athena_FactionChest_C_GetMaxAudibleDistance");
static_assert(sizeof(Tiered_Chest_Athena_FactionChest_C_GetMaxAudibleDistance) == 0x000008, "Wrong size on Tiered_Chest_Athena_FactionChest_C_GetMaxAudibleDistance");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_GetMaxAudibleDistance, Max_Distance) == 0x000000, "Member 'Tiered_Chest_Athena_FactionChest_C_GetMaxAudibleDistance::Max_Distance' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_GetMaxAudibleDistance, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Tiered_Chest_Athena_FactionChest_C_GetMaxAudibleDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_Athena_FactionChest.Tiered_Chest_Athena_FactionChest_C.ExecuteUbergraph_Tiered_Chest_Athena_FactionChest
// 0x0348 (0x0348 - 0x0000)
struct Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_ComponentBoundEvent_FactionTagOut;          // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0020(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0050(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x00F0(0x0080)()
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x01C8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0200(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x02F0(0x0018)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSpyLTMPlaylist_ReturnValue;          // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest) == 0x000008, "Wrong alignment on Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest");
static_assert(sizeof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest) == 0x000348, "Wrong size on Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, EntryPoint) == 0x000000, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_ComponentBoundEvent_FactionTagOut) == 0x000004, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_ComponentBoundEvent_FactionTagOut' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_CustomEvent_GameState) == 0x000010, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_CustomEvent_Playlist) == 0x000018, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_CustomEvent_PlaylistContextTags) == 0x000020, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_struct_Variable) == 0x000050, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_object_Variable) == 0x000070, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_object_Variable_1) == 0x000078, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000080, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_IsDedicatedServer_ReturnValue) == 0x000090, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000091, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_int_Loop_Counter_Variable_1) == 0x00009C, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_int_Array_Index_Variable_1) == 0x0000A4, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_int_Array_Index_Variable_2) == 0x0000A8, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0000AC, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0000AD, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0000AE, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000C8, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_BreakRotator_Roll) == 0x0000E0, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_BreakRotator_Pitch) == 0x0000E4, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_BreakRotator_Yaw) == 0x0000E8, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_BPGetRarityData_ReturnValue) == 0x0000F0, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Array_Get_Item) == 0x000170, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Less_IntInt_ReturnValue) == 0x00018C, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_bool_Has_Been_Initd_Variable) == 0x00018D, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Array_Get_Item_2) == 0x000190, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Array_Length_ReturnValue_2) == 0x000198, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Less_IntInt_ReturnValue_1) == 0x00019C, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Lerp_ReturnValue) == 0x0001A0, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_bool_IsClosed_Variable) == 0x0001A4, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_VLerp_ReturnValue) == 0x0001A8, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_IsMobileGame_ReturnValue) == 0x0001C0, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_Event_Damage) == 0x0001C4, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_Event_DamageTags) == 0x0001C8, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_Event_Momentum) == 0x0001E8, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_Event_HitInfo) == 0x000200, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_Event_InstigatedBy) == 0x0002E0, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_Event_DamageCauser) == 0x0002E8, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, K2Node_Event_EffectContext) == 0x0002F0, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_Add_FloatFloat_ReturnValue) == 0x000308, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_MakeRotator_ReturnValue) == 0x000310, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000328, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_RandomFloatInRange_ReturnValue) == 0x000330, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, CallFunc_CheckSpyLTMPlaylist_ReturnValue) == 0x000334, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::CallFunc_CheckSpyLTMPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest, Temp_int_Loop_Counter_Variable_2) == 0x000338, "Member 'Tiered_Chest_Athena_FactionChest_C_ExecuteUbergraph_Tiered_Chest_Athena_FactionChest::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
