#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastWidget_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ToastWidget_New.ToastWidget_New_C
// 0x0088 (0x0378 - 0x02F0)
class UToastWidget_New_C final : public UFortToastWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro_New;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImage;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImageExtended;                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_MainWidget;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         NotificationImage;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      OpenButton;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortUINotification*                    ToastNotification;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationFinishedDelay;                            // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedToast;                                   // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           AnimationDelayTimer;                               // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bActionTaken;                                      // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyAdditionalStyling();
	void BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ToastWidget_New(int32 EntryPoint);
	ESlateVisibility GetOpenButtonVisibility();
	void HandleIntroFinished();
	void HandleOutroFinished();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnPlayOpenAnimation();
	void OnSetToast(class UFortUINotification* ToastNotification_0);
	void PlayOutro();
	void SetImage();
	void SetToast(class UFortUINotification* Toast);
	void SetupAnimBindings(bool Unbind);
	void ShowText(const class FText& Text, class UCommonTextBlock* TextBlock);
	void StartIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ToastWidget_New_C">();
	}
	static class UToastWidget_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToastWidget_New_C>();
	}
};
static_assert(alignof(UToastWidget_New_C) == 0x000008, "Wrong alignment on UToastWidget_New_C");
static_assert(sizeof(UToastWidget_New_C) == 0x000378, "Wrong size on UToastWidget_New_C");
static_assert(offsetof(UToastWidget_New_C, UberGraphFrame) == 0x0002F0, "Member 'UToastWidget_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, Outro_New) == 0x0002F8, "Member 'UToastWidget_New_C::Outro_New' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, Intro) == 0x000300, "Member 'UToastWidget_New_C::Intro' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, B_NotificationImage) == 0x000308, "Member 'UToastWidget_New_C::B_NotificationImage' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, B_NotificationImageExtended) == 0x000310, "Member 'UToastWidget_New_C::B_NotificationImageExtended' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, CommonBorder_MainWidget) == 0x000318, "Member 'UToastWidget_New_C::CommonBorder_MainWidget' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, Description) == 0x000320, "Member 'UToastWidget_New_C::Description' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, NotificationImage) == 0x000328, "Member 'UToastWidget_New_C::NotificationImage' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, OpenButton) == 0x000330, "Member 'UToastWidget_New_C::OpenButton' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, TextBlock_0) == 0x000338, "Member 'UToastWidget_New_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, Title) == 0x000340, "Member 'UToastWidget_New_C::Title' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, ToastNotification) == 0x000348, "Member 'UToastWidget_New_C::ToastNotification' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, AnimationFinishedDelay) == 0x000350, "Member 'UToastWidget_New_C::AnimationFinishedDelay' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, OnFinishedToast) == 0x000358, "Member 'UToastWidget_New_C::OnFinishedToast' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, AnimationDelayTimer) == 0x000368, "Member 'UToastWidget_New_C::AnimationDelayTimer' has a wrong offset!");
static_assert(offsetof(UToastWidget_New_C, bActionTaken) == 0x000370, "Member 'UToastWidget_New_C::bActionTaken' has a wrong offset!");

}

