#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastSocialWidget_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.ApplyAdditionalStyling
// 0x0020 (0x0020 - 0x0000)
struct ToastSocialWidget_Base_C_ApplyAdditionalStyling final
{
public:
	class UClass*                                 NewLocalVar_2;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 NewLocalVar_1;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 NewLocalVar_0;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_ApplyAdditionalStyling) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_ApplyAdditionalStyling");
static_assert(sizeof(ToastSocialWidget_Base_C_ApplyAdditionalStyling) == 0x000020, "Wrong size on ToastSocialWidget_Base_C_ApplyAdditionalStyling");
static_assert(offsetof(ToastSocialWidget_Base_C_ApplyAdditionalStyling, NewLocalVar_2) == 0x000000, "Member 'ToastSocialWidget_Base_C_ApplyAdditionalStyling::NewLocalVar_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ApplyAdditionalStyling, NewLocalVar_1) == 0x000008, "Member 'ToastSocialWidget_Base_C_ApplyAdditionalStyling::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ApplyAdditionalStyling, NewLocalVar_0) == 0x000010, "Member 'ToastSocialWidget_Base_C_ApplyAdditionalStyling::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ApplyAdditionalStyling, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'ToastSocialWidget_Base_C_ApplyAdditionalStyling::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_Base_C_BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_Base_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToastSocialWidget_Base_C_BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.DetermineIntroAnim
// 0x0060 (0x0060 - 0x0000)
struct ToastSocialWidget_Base_C_DetermineIntroAnim final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortNotificationType                         Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_4;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_DetermineIntroAnim) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_DetermineIntroAnim");
static_assert(sizeof(ToastSocialWidget_Base_C_DetermineIntroAnim) == 0x000060, "Wrong size on ToastSocialWidget_Base_C_DetermineIntroAnim");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, ReturnValue) == 0x000000, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_bool_Variable) == 0x000008, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_bool_Variable_1) == 0x000009, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_bool_Variable_2) == 0x00000A, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_bool_Variable_3) == 0x00000B, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_byte_Variable) == 0x00000C, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_object_Variable) == 0x000010, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_object_Variable_1) == 0x000018, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_object_Variable_2) == 0x000020, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_object_Variable_3) == 0x000028, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, Temp_object_Variable_4) == 0x000030, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default) == 0x000038, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default_1) == 0x000040, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default_2) == 0x000048, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default_3) == 0x000050, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_DetermineIntroAnim, K2Node_Select_Default_4) == 0x000058, "Member 'ToastSocialWidget_Base_C_DetermineIntroAnim::K2Node_Select_Default_4' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.ExecuteUbergraph_ToastSocialWidget_Base
// 0x02B8 (0x02B8 - 0x0000)
struct ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0024(0x0014)()
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0050(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0090(0x0090)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0120(0x0090)(ConstParm)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_3;               // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01B8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINotification*                    K2Node_Event_ToastNotification;                    // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCursorModeEnabled;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_2;               // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_Event_NewInputType;                         // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EB[0x1];                                      // 0x01EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_DetermineIntroAnim_ReturnValue;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B[0x5];                                      // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_Select_Default_2;                           // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base");
static_assert(sizeof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base) == 0x0002B8, "Wrong size on ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, EntryPoint) == 0x000000, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable) == 0x000004, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_float_Variable) == 0x000008, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_float_Variable_1) == 0x00000C, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_MakeStruct_SlateColor_1) == 0x000024, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000038, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000040, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetCurrentInputType_ReturnValue) == 0x000048, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetCurrentInputType_ReturnValue_1) == 0x000049, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetCurrentInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004A, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00004B, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable_1) == 0x00004C, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_MyGeometry) == 0x000050, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_MouseEvent_1) == 0x000090, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_MouseEvent) == 0x000120, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_ComponentBoundEvent_Button_3) == 0x0001B0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_CreateDelegate_OutputDelegate) == 0x0001B8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_ToastNotification) == 0x0001C8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_ToastNotification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_bCursorModeEnabled) == 0x0001D0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_bCursorModeEnabled' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001D4, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001D8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_ComponentBoundEvent_Button_2) == 0x0001E0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_IsUsingTouch_ReturnValue) == 0x0001E8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_NewInputType) == 0x0001E9, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_NewInputType' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_BooleanOR_ReturnValue) == 0x0001EA, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0001EC, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Event_IsDesignTime) == 0x0001F0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue) == 0x0001F8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_float_Variable_2) == 0x000200, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_1) == 0x000208, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PauseAnimation_ReturnValue) == 0x000210, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000214, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000218, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00021C, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000220, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_2) == 0x000228, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_3) == 0x000230, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000238, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_DetermineIntroAnim_ReturnValue) == 0x000240, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_DetermineIntroAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_4) == 0x000248, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_IsValid_ReturnValue) == 0x000250, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_ComponentBoundEvent_Button_1) == 0x000258, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_ComponentBoundEvent_Button) == 0x000260, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default) == 0x000268, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000270, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000278, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable_2) == 0x000280, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default_1) == 0x000284, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_BooleanAND_ReturnValue) == 0x000288, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_5) == 0x000290, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, Temp_bool_Variable_3) == 0x000298, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000299, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_BooleanAND_ReturnValue_1) == 0x00029A, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default_2) == 0x0002A0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, K2Node_Select_Default_3) == 0x0002A8, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base, CallFunc_PlayAnimation_ReturnValue_6) == 0x0002B0, "Member 'ToastSocialWidget_Base_C_ExecuteUbergraph_ToastSocialWidget_Base::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.GetActiveWidgetIndex
// 0x0018 (0x0018 - 0x0000)
struct ToastSocialWidget_Base_C_GetActiveWidgetIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_GetActiveWidgetIndex) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_GetActiveWidgetIndex");
static_assert(sizeof(ToastSocialWidget_Base_C_GetActiveWidgetIndex) == 0x000018, "Wrong size on ToastSocialWidget_Base_C_GetActiveWidgetIndex");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, ReturnValue) == 0x000000, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_IsInZone_ReturnValue) == 0x000011, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetActiveWidgetIndex, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'ToastSocialWidget_Base_C_GetActiveWidgetIndex::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.GetButtonCursorText
// 0x0028 (0x0028 - 0x0000)
struct ToastSocialWidget_Base_C_GetButtonCursorText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class UFortUIFriendNotification*              K2Node_DynamicCast_AsFort_UIFriend_Notification;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_GetButtonCursorText) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_GetButtonCursorText");
static_assert(sizeof(ToastSocialWidget_Base_C_GetButtonCursorText) == 0x000028, "Wrong size on ToastSocialWidget_Base_C_GetButtonCursorText");
static_assert(offsetof(ToastSocialWidget_Base_C_GetButtonCursorText, Text) == 0x000000, "Member 'ToastSocialWidget_Base_C_GetButtonCursorText::Text' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetButtonCursorText, K2Node_DynamicCast_AsFort_UIFriend_Notification) == 0x000018, "Member 'ToastSocialWidget_Base_C_GetButtonCursorText::K2Node_DynamicCast_AsFort_UIFriend_Notification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetButtonCursorText, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ToastSocialWidget_Base_C_GetButtonCursorText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetButtonCursorText, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'ToastSocialWidget_Base_C_GetButtonCursorText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.GetButtonHoldText
// 0x0028 (0x0028 - 0x0000)
struct ToastSocialWidget_Base_C_GetButtonHoldText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class UFortUIFriendNotification*              K2Node_DynamicCast_AsFort_UIFriend_Notification;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_GetButtonHoldText) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_GetButtonHoldText");
static_assert(sizeof(ToastSocialWidget_Base_C_GetButtonHoldText) == 0x000028, "Wrong size on ToastSocialWidget_Base_C_GetButtonHoldText");
static_assert(offsetof(ToastSocialWidget_Base_C_GetButtonHoldText, Text) == 0x000000, "Member 'ToastSocialWidget_Base_C_GetButtonHoldText::Text' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetButtonHoldText, K2Node_DynamicCast_AsFort_UIFriend_Notification) == 0x000018, "Member 'ToastSocialWidget_Base_C_GetButtonHoldText::K2Node_DynamicCast_AsFort_UIFriend_Notification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetButtonHoldText, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ToastSocialWidget_Base_C_GetButtonHoldText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetButtonHoldText, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'ToastSocialWidget_Base_C_GetButtonHoldText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.GetFinishedAnimationDelay
// 0x0018 (0x0018 - 0x0000)
struct ToastSocialWidget_Base_C_GetFinishedAnimationDelay final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIFriendNotification*              K2Node_DynamicCast_AsFort_UIFriend_Notification;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_GetFinishedAnimationDelay) == 0x000008, "Wrong alignment on ToastSocialWidget_Base_C_GetFinishedAnimationDelay");
static_assert(sizeof(ToastSocialWidget_Base_C_GetFinishedAnimationDelay) == 0x000018, "Wrong size on ToastSocialWidget_Base_C_GetFinishedAnimationDelay");
static_assert(offsetof(ToastSocialWidget_Base_C_GetFinishedAnimationDelay, Value) == 0x000000, "Member 'ToastSocialWidget_Base_C_GetFinishedAnimationDelay::Value' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetFinishedAnimationDelay, K2Node_DynamicCast_AsFort_UIFriend_Notification) == 0x000008, "Member 'ToastSocialWidget_Base_C_GetFinishedAnimationDelay::K2Node_DynamicCast_AsFort_UIFriend_Notification' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetFinishedAnimationDelay, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ToastSocialWidget_Base_C_GetFinishedAnimationDelay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetFinishedAnimationDelay, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'ToastSocialWidget_Base_C_GetFinishedAnimationDelay::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.GetInputSwitcherVisibility
// 0x0005 (0x0005 - 0x0000)
struct ToastSocialWidget_Base_C_GetInputSwitcherVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility) == 0x000001, "Wrong alignment on ToastSocialWidget_Base_C_GetInputSwitcherVisibility");
static_assert(sizeof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility) == 0x000005, "Wrong size on ToastSocialWidget_Base_C_GetInputSwitcherVisibility");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, ReturnValue) == 0x000000, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, Temp_bool_Variable) == 0x000001, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, Temp_byte_Variable) == 0x000002, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastSocialWidget_Base_C_GetInputSwitcherVisibility, K2Node_Select_Default) == 0x000004, "Member 'ToastSocialWidget_Base_C_GetInputSwitcherVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ToastSocialWidget_Base.ToastSocialWidget_Base_C.HandleNotificationType
// 0x0238 (0x0238 - 0x0000)
struct ToastSocialWidget_Base_C_HandleNotificationType final
{
public:
	class FText                                   Return;                                            // 0x0000(0x0018)(Parm, OutParm)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_1;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue_1;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
