#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastWidgetDonut

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ToastWidgetDonut.ToastWidgetDonut_C.ApplyAdditionalStyling
// 0x0060 (0x0060 - 0x0000)
struct ToastWidgetDonut_C_ApplyAdditionalStyling final
{
public:
	class UClass*                                 Temp_class_Variable;                               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_4;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_5;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_2;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidgetDonut_C_ApplyAdditionalStyling) == 0x000008, "Wrong alignment on ToastWidgetDonut_C_ApplyAdditionalStyling");
static_assert(sizeof(ToastWidgetDonut_C_ApplyAdditionalStyling) == 0x000060, "Wrong size on ToastWidgetDonut_C_ApplyAdditionalStyling");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, Temp_class_Variable) == 0x000000, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, Temp_bool_Variable) == 0x000008, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, Temp_class_Variable_1) == 0x000010, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, Temp_class_Variable_2) == 0x000018, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, Temp_bool_Variable_1) == 0x000020, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, Temp_class_Variable_3) == 0x000028, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, Temp_class_Variable_4) == 0x000030, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::Temp_class_Variable_4' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, Temp_class_Variable_5) == 0x000038, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::Temp_class_Variable_5' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, Temp_bool_Variable_2) == 0x000040, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, K2Node_Select_Default) == 0x000048, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, K2Node_Select_Default_1) == 0x000050, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ApplyAdditionalStyling, K2Node_Select_Default_2) == 0x000058, "Member 'ToastWidgetDonut_C_ApplyAdditionalStyling::K2Node_Select_Default_2' has a wrong offset!");

// Function ToastWidgetDonut.ToastWidgetDonut_C.ExecuteUbergraph_ToastWidgetDonut
// 0x0028 (0x0028 - 0x0000)
struct ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINotification*                    K2Node_Event_ToastNotification;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut) == 0x000008, "Wrong alignment on ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut");
static_assert(sizeof(ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut) == 0x000028, "Wrong size on ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut");
static_assert(offsetof(ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut, EntryPoint) == 0x000000, "Member 'ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut::EntryPoint' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut, K2Node_Event_ToastNotification) == 0x000020, "Member 'ToastWidgetDonut_C_ExecuteUbergraph_ToastWidgetDonut::K2Node_Event_ToastNotification' has a wrong offset!");

// Function ToastWidgetDonut.ToastWidgetDonut_C.GetOpenButtonVisibility
// 0x0018 (0x0018 - 0x0000)
struct ToastWidgetDonut_C_GetOpenButtonVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidgetDonut_C_GetOpenButtonVisibility) == 0x000008, "Wrong alignment on ToastWidgetDonut_C_GetOpenButtonVisibility");
static_assert(sizeof(ToastWidgetDonut_C_GetOpenButtonVisibility) == 0x000018, "Wrong size on ToastWidgetDonut_C_GetOpenButtonVisibility");
static_assert(offsetof(ToastWidgetDonut_C_GetOpenButtonVisibility, ReturnValue) == 0x000000, "Member 'ToastWidgetDonut_C_GetOpenButtonVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_GetOpenButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'ToastWidgetDonut_C_GetOpenButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_GetOpenButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'ToastWidgetDonut_C_GetOpenButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_GetOpenButtonVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'ToastWidgetDonut_C_GetOpenButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_GetOpenButtonVisibility, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ToastWidgetDonut_C_GetOpenButtonVisibility::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_GetOpenButtonVisibility, CallFunc_IsInZone_ReturnValue) == 0x000010, "Member 'ToastWidgetDonut_C_GetOpenButtonVisibility::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_GetOpenButtonVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'ToastWidgetDonut_C_GetOpenButtonVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_GetOpenButtonVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'ToastWidgetDonut_C_GetOpenButtonVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_GetOpenButtonVisibility, K2Node_Select_Default) == 0x000013, "Member 'ToastWidgetDonut_C_GetOpenButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ToastWidgetDonut.ToastWidgetDonut_C.OnSetToast
// 0x0008 (0x0008 - 0x0000)
struct ToastWidgetDonut_C_OnSetToast final
{
public:
	class UFortUINotification*                    ToastNotification_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidgetDonut_C_OnSetToast) == 0x000008, "Wrong alignment on ToastWidgetDonut_C_OnSetToast");
static_assert(sizeof(ToastWidgetDonut_C_OnSetToast) == 0x000008, "Wrong size on ToastWidgetDonut_C_OnSetToast");
static_assert(offsetof(ToastWidgetDonut_C_OnSetToast, ToastNotification_0) == 0x000000, "Member 'ToastWidgetDonut_C_OnSetToast::ToastNotification_0' has a wrong offset!");

// Function ToastWidgetDonut.ToastWidgetDonut_C.SetToast
// 0x0108 (0x0108 - 0x0000)
struct ToastWidgetDonut_C_SetToast final
{
public:
	class UFortUINotification*                    Toast;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	class UFortUIFriendNotification*              K2Node_DynamicCast_AsFort_UIFriend_Notification;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0070(0x0018)()
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
};
static_assert(alignof(ToastWidgetDonut_C_SetToast) == 0x000008, "Wrong alignment on ToastWidgetDonut_C_SetToast");
static_assert(sizeof(ToastWidgetDonut_C_SetToast) == 0x000108, "Wrong size on ToastWidgetDonut_C_SetToast");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, Toast) == 0x000000, "Member 'ToastWidgetDonut_C_SetToast::Toast' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'ToastWidgetDonut_C_SetToast::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, K2Node_DynamicCast_AsFort_UIFriend_Notification) == 0x000058, "Member 'ToastWidgetDonut_C_SetToast::K2Node_DynamicCast_AsFort_UIFriend_Notification' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'ToastWidgetDonut_C_SetToast::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, K2Node_SwitchEnum_CmpSuccess) == 0x000061, "Member 'ToastWidgetDonut_C_SetToast::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000068, "Member 'ToastWidgetDonut_C_SetToast::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, CallFunc_MakeLiteralText_ReturnValue) == 0x000070, "Member 'ToastWidgetDonut_C_SetToast::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, CallFunc_IsInZone_ReturnValue) == 0x000088, "Member 'ToastWidgetDonut_C_SetToast::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'ToastWidgetDonut_C_SetToast::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, K2Node_MakeArray_Array) == 0x0000E0, "Member 'ToastWidgetDonut_C_SetToast::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetToast, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'ToastWidgetDonut_C_SetToast::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function ToastWidgetDonut.ToastWidgetDonut_C.SetupAnimBindings
// 0x0034 (0x0034 - 0x0000)
struct ToastWidgetDonut_C_SetupAnimBindings final
{
public:
	bool                                          Unbind;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidgetDonut_C_SetupAnimBindings) == 0x000004, "Wrong alignment on ToastWidgetDonut_C_SetupAnimBindings");
static_assert(sizeof(ToastWidgetDonut_C_SetupAnimBindings) == 0x000034, "Wrong size on ToastWidgetDonut_C_SetupAnimBindings");
static_assert(offsetof(ToastWidgetDonut_C_SetupAnimBindings, Unbind) == 0x000000, "Member 'ToastWidgetDonut_C_SetupAnimBindings::Unbind' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ToastWidgetDonut_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'ToastWidgetDonut_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_2) == 0x00001C, "Member 'ToastWidgetDonut_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_SetupAnimBindings, K2Node_CreateDelegate_OutputDelegate_3) == 0x000028, "Member 'ToastWidgetDonut_C_SetupAnimBindings::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function ToastWidgetDonut.ToastWidgetDonut_C.ShowText
// 0x0048 (0x0048 - 0x0000)
struct ToastWidgetDonut_C_ShowText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCommonTextBlock*                       TextBlock;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       LocalTextBlock;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LocalText;                                         // 0x0028(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidgetDonut_C_ShowText) == 0x000008, "Wrong alignment on ToastWidgetDonut_C_ShowText");
static_assert(sizeof(ToastWidgetDonut_C_ShowText) == 0x000048, "Wrong size on ToastWidgetDonut_C_ShowText");
static_assert(offsetof(ToastWidgetDonut_C_ShowText, Text) == 0x000000, "Member 'ToastWidgetDonut_C_ShowText::Text' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ShowText, TextBlock) == 0x000018, "Member 'ToastWidgetDonut_C_ShowText::TextBlock' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ShowText, LocalTextBlock) == 0x000020, "Member 'ToastWidgetDonut_C_ShowText::LocalTextBlock' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ShowText, LocalText) == 0x000028, "Member 'ToastWidgetDonut_C_ShowText::LocalText' has a wrong offset!");
static_assert(offsetof(ToastWidgetDonut_C_ShowText, CallFunc_TextIsEmpty_ReturnValue) == 0x000040, "Member 'ToastWidgetDonut_C_ShowText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function ToastWidgetDonut.ToastWidgetDonut_C.StartIntro
// 0x0008 (0x0008 - 0x0000)
struct ToastWidgetDonut_C_StartIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastWidgetDonut_C_StartIntro) == 0x000008, "Wrong alignment on ToastWidgetDonut_C_StartIntro");
static_assert(sizeof(ToastWidgetDonut_C_StartIntro) == 0x000008, "Wrong size on ToastWidgetDonut_C_StartIntro");
static_assert(offsetof(ToastWidgetDonut_C_StartIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'ToastWidgetDonut_C_StartIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

