#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastSocialWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ToastSocialWidget.ToastSocialWidget_C
// 0x0098 (0x03B8 - 0x0320)
class UToastSocialWidget_C final : public UFortSocialNotificationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro_New;                                         // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImage;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          B_NotificationImageExtended;                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Cursor;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Hold;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_MainWidget;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         NotificationImage;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_InputButtons;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortUINotification*                    ToastNotification;                                 // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationFinishedDelay;                            // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedToast;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           AnimationDelayTimer;                               // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bActionTaken;                                      // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyAdditionalStyling();
	void BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void CleanupBeforeClosing();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ToastSocialWidget(int32 EntryPoint);
	int32 GetActiveWidgetIndex();
	void GetButtonCursorText(class FText* Text);
	void GetButtonHoldText(class FText* Text);
	void GetFinishedAnimationDelay(float* Value);
	ESlateVisibility GetInputSwitcherVisibility();
	void HandleIntroFinished();
	void HandleOutroFinished();
	void OnCancelNotification();
	void OnCursorModeChanged(bool bCursorModeEnabled);
	void OnInputModeChanged(ECommonInputType NewInputType);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnPlayOpenAnimation();
	void OnSetToast(class UFortUINotification* ToastNotification_0);
	void OnTakeActionNotification();
	void OnUserStartedHoldActionNotification();
	void PlayOutro();
	void SetImage();
	void SetToast(class UFortUINotification* Toast);
	void SetupAnimBindings(bool Unbind);
	void SetVisibilityForOptionalElements();
	void ShowText(const class FText& Text, class UCommonTextBlock* TextBlock);
	void StartIntro();
	void TakeAction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ToastSocialWidget_C">();
	}
	static class UToastSocialWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToastSocialWidget_C>();
	}
};
static_assert(alignof(UToastSocialWidget_C) == 0x000008, "Wrong alignment on UToastSocialWidget_C");
static_assert(sizeof(UToastSocialWidget_C) == 0x0003B8, "Wrong size on UToastSocialWidget_C");
static_assert(offsetof(UToastSocialWidget_C, UberGraphFrame) == 0x000320, "Member 'UToastSocialWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Outro_New) == 0x000328, "Member 'UToastSocialWidget_C::Outro_New' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Intro) == 0x000330, "Member 'UToastSocialWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, B_NotificationImage) == 0x000338, "Member 'UToastSocialWidget_C::B_NotificationImage' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, B_NotificationImageExtended) == 0x000340, "Member 'UToastSocialWidget_C::B_NotificationImageExtended' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Button_Cursor) == 0x000348, "Member 'UToastSocialWidget_C::Button_Cursor' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Button_Hold) == 0x000350, "Member 'UToastSocialWidget_C::Button_Hold' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, CommonBorder_MainWidget) == 0x000358, "Member 'UToastSocialWidget_C::CommonBorder_MainWidget' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Description) == 0x000360, "Member 'UToastSocialWidget_C::Description' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, NotificationImage) == 0x000368, "Member 'UToastSocialWidget_C::NotificationImage' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Switcher_InputButtons) == 0x000370, "Member 'UToastSocialWidget_C::Switcher_InputButtons' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, TextBlock_0) == 0x000378, "Member 'UToastSocialWidget_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, Title) == 0x000380, "Member 'UToastSocialWidget_C::Title' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, ToastNotification) == 0x000388, "Member 'UToastSocialWidget_C::ToastNotification' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, AnimationFinishedDelay) == 0x000390, "Member 'UToastSocialWidget_C::AnimationFinishedDelay' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, OnFinishedToast) == 0x000398, "Member 'UToastSocialWidget_C::OnFinishedToast' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, AnimationDelayTimer) == 0x0003A8, "Member 'UToastSocialWidget_C::AnimationDelayTimer' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_C, bActionTaken) == 0x0003B0, "Member 'UToastSocialWidget_C::bActionTaken' has a wrong offset!");

}

