#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TODM_BR_s14

#include "Basic.hpp"


namespace SDK::Params
{

// Function TODM_BR_s14.TODM_BR_s14_C.ExecuteUbergraph_TODM_BR_s14
// 0x0048 (0x0048 - 0x0000)
struct TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& CVarName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataDrivenCVarEngineSubsystem*         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_CVarName;                       // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_CVarName;                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14) == 0x000008, "Wrong alignment on TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14");
static_assert(sizeof(TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14) == 0x000048, "Wrong size on TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14");
static_assert(offsetof(TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14, EntryPoint) == 0x000000, "Member 'TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14::EntryPoint' has a wrong offset!");
static_assert(offsetof(TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000010, "Member 'TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14, K2Node_CustomEvent_CVarName) == 0x000018, "Member 'TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14::K2Node_CustomEvent_CVarName' has a wrong offset!");
static_assert(offsetof(TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000028, "Member 'TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14, K2Node_Event_CVarName) == 0x000030, "Member 'TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14::K2Node_Event_CVarName' has a wrong offset!");
static_assert(offsetof(TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000040, "Member 'TODM_BR_s14_C_ExecuteUbergraph_TODM_BR_s14::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");

// Function TODM_BR_s14.TODM_BR_s14_C.OnDataDrivenCVarChangedEditorOnly
// 0x0010 (0x0010 - 0x0000)
struct TODM_BR_s14_C_OnDataDrivenCVarChangedEditorOnly final
{
public:
	class FString                                 CVarName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TODM_BR_s14_C_OnDataDrivenCVarChangedEditorOnly) == 0x000008, "Wrong alignment on TODM_BR_s14_C_OnDataDrivenCVarChangedEditorOnly");
static_assert(sizeof(TODM_BR_s14_C_OnDataDrivenCVarChangedEditorOnly) == 0x000010, "Wrong size on TODM_BR_s14_C_OnDataDrivenCVarChangedEditorOnly");
static_assert(offsetof(TODM_BR_s14_C_OnDataDrivenCVarChangedEditorOnly, CVarName) == 0x000000, "Member 'TODM_BR_s14_C_OnDataDrivenCVarChangedEditorOnly::CVarName' has a wrong offset!");

// Function TODM_BR_s14.TODM_BR_s14_C.OnDataDrivenCVarDelegate_Event_0
// 0x0010 (0x0010 - 0x0000)
struct TODM_BR_s14_C_OnDataDrivenCVarDelegate_Event_0 final
{
public:
	class FString                                 CVarName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TODM_BR_s14_C_OnDataDrivenCVarDelegate_Event_0) == 0x000008, "Wrong alignment on TODM_BR_s14_C_OnDataDrivenCVarDelegate_Event_0");
static_assert(sizeof(TODM_BR_s14_C_OnDataDrivenCVarDelegate_Event_0) == 0x000010, "Wrong size on TODM_BR_s14_C_OnDataDrivenCVarDelegate_Event_0");
static_assert(offsetof(TODM_BR_s14_C_OnDataDrivenCVarDelegate_Event_0, CVarName) == 0x000000, "Member 'TODM_BR_s14_C_OnDataDrivenCVarDelegate_Event_0::CVarName' has a wrong offset!");

// Function TODM_BR_s14.TODM_BR_s14_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct TODM_BR_s14_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TODM_BR_s14_C_UserConstructionScript) == 0x000001, "Wrong alignment on TODM_BR_s14_C_UserConstructionScript");
static_assert(sizeof(TODM_BR_s14_C_UserConstructionScript) == 0x000001, "Wrong size on TODM_BR_s14_C_UserConstructionScript");
static_assert(offsetof(TODM_BR_s14_C_UserConstructionScript, CallFunc_InEditorOrPIE_ReturnValue) == 0x000000, "Member 'TODM_BR_s14_C_UserConstructionScript::CallFunc_InEditorOrPIE_ReturnValue' has a wrong offset!");

// Function TODM_BR_s14.TODM_BR_s14_C.validateAdvancedPostProcessing
// 0x000C (0x000C - 0x0000)
struct TODM_BR_s14_C_validateAdvancedPostProcessing final
{
public:
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TODM_BR_s14_C_validateAdvancedPostProcessing) == 0x000004, "Wrong alignment on TODM_BR_s14_C_validateAdvancedPostProcessing");
static_assert(sizeof(TODM_BR_s14_C_validateAdvancedPostProcessing) == 0x00000C, "Wrong size on TODM_BR_s14_C_validateAdvancedPostProcessing");
static_assert(offsetof(TODM_BR_s14_C_validateAdvancedPostProcessing, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000000, "Member 'TODM_BR_s14_C_validateAdvancedPostProcessing::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TODM_BR_s14_C_validateAdvancedPostProcessing, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000004, "Member 'TODM_BR_s14_C_validateAdvancedPostProcessing::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TODM_BR_s14_C_validateAdvancedPostProcessing, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'TODM_BR_s14_C_validateAdvancedPostProcessing::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

