#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tooltip_Custom_S

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-Custom-S.Tooltip-Custom-S_C
// 0x0070 (0x0328 - 0x02B8)
class UTooltip_Custom_S_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 _hr_;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Body_HBox;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content_Slot;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Header_HBox;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Header;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Header;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Icon;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Header;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x0300(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class USlateBrushAsset*                       Icon_Brush;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUserWidget*                            ContentWidget;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Tooltip_Custom_S(int32 EntryPoint);
	class FText Get_Body_Text();
	class FText Get_Header_Text();
	struct FSlateBrush Get_Icon_Brush();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tooltip-Custom-S_C">();
	}
	static class UTooltip_Custom_S_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltip_Custom_S_C>();
	}
};
static_assert(alignof(UTooltip_Custom_S_C) == 0x000008, "Wrong alignment on UTooltip_Custom_S_C");
static_assert(sizeof(UTooltip_Custom_S_C) == 0x000328, "Wrong size on UTooltip_Custom_S_C");
static_assert(offsetof(UTooltip_Custom_S_C, UberGraphFrame) == 0x0002B8, "Member 'UTooltip_Custom_S_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, _hr_) == 0x0002C0, "Member 'UTooltip_Custom_S_C::_hr_' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, Body_HBox) == 0x0002C8, "Member 'UTooltip_Custom_S_C::Body_HBox' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, Content_Slot) == 0x0002D0, "Member 'UTooltip_Custom_S_C::Content_Slot' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, Header_HBox) == 0x0002D8, "Member 'UTooltip_Custom_S_C::Header_HBox' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, Icon_Header) == 0x0002E0, "Member 'UTooltip_Custom_S_C::Icon_Header' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, Spacer_Header) == 0x0002E8, "Member 'UTooltip_Custom_S_C::Spacer_Header' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, Spacer_Icon) == 0x0002F0, "Member 'UTooltip_Custom_S_C::Spacer_Icon' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, Text_Header) == 0x0002F8, "Member 'UTooltip_Custom_S_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, HeaderText) == 0x000300, "Member 'UTooltip_Custom_S_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, Icon_Brush) == 0x000318, "Member 'UTooltip_Custom_S_C::Icon_Brush' has a wrong offset!");
static_assert(offsetof(UTooltip_Custom_S_C, ContentWidget) == 0x000320, "Member 'UTooltip_Custom_S_C::ContentWidget' has a wrong offset!");

}

