#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tooltip_Basic_S

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-Basic-S.Tooltip-Basic-S_C
// 0x0088 (0x0368 - 0x02E0)
class UTooltip_Basic_S_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 _hr_;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Body_HBox;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Header_HBox;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Header;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Icon;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Body;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Header;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BodyText;                                          // 0x0320(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   HeaderText;                                        // 0x0338(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class USlateBrushAsset*                       Icon_Brush;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 Body_Style;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 Header_Style;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Tooltip_Basic_S(int32 EntryPoint);
	class FText Get_Body_Text();
	class FText Get_Header_Text();
	struct FSlateBrush Get_Icon_Brush();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tooltip-Basic-S_C">();
	}
	static class UTooltip_Basic_S_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltip_Basic_S_C>();
	}
};
static_assert(alignof(UTooltip_Basic_S_C) == 0x000008, "Wrong alignment on UTooltip_Basic_S_C");
static_assert(sizeof(UTooltip_Basic_S_C) == 0x000368, "Wrong size on UTooltip_Basic_S_C");
static_assert(offsetof(UTooltip_Basic_S_C, UberGraphFrame) == 0x0002E0, "Member 'UTooltip_Basic_S_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, _hr_) == 0x0002E8, "Member 'UTooltip_Basic_S_C::_hr_' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, Body_HBox) == 0x0002F0, "Member 'UTooltip_Basic_S_C::Body_HBox' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, Header_HBox) == 0x0002F8, "Member 'UTooltip_Basic_S_C::Header_HBox' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, Icon_Header) == 0x000300, "Member 'UTooltip_Basic_S_C::Icon_Header' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, Spacer_Icon) == 0x000308, "Member 'UTooltip_Basic_S_C::Spacer_Icon' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, Text_Body) == 0x000310, "Member 'UTooltip_Basic_S_C::Text_Body' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, Text_Header) == 0x000318, "Member 'UTooltip_Basic_S_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, BodyText) == 0x000320, "Member 'UTooltip_Basic_S_C::BodyText' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, HeaderText) == 0x000338, "Member 'UTooltip_Basic_S_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, Icon_Brush) == 0x000350, "Member 'UTooltip_Basic_S_C::Icon_Brush' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, Body_Style) == 0x000358, "Member 'UTooltip_Basic_S_C::Body_Style' has a wrong offset!");
static_assert(offsetof(UTooltip_Basic_S_C, Header_Style) == 0x000360, "Member 'UTooltip_Basic_S_C::Header_Style' has a wrong offset!");

}

