#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tooltip_Custom_S

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Tooltip-Custom-S.Tooltip-Custom-S_C.ExecuteUbergraph_Tooltip-Custom-S
// 0x0028 (0x0028 - 0x0000)
struct Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S) == 0x000008, "Wrong alignment on Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S");
static_assert(sizeof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S) == 0x000028, "Wrong size on Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, EntryPoint) == 0x000000, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_bool_Variable) == 0x000004, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_byte_Variable) == 0x000005, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_byte_Variable_1) == 0x000006, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_bool_Variable_1) == 0x000007, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_byte_Variable_2) == 0x000008, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_byte_Variable_3) == 0x000009, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_bool_Variable_2) == 0x00000A, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_byte_Variable_4) == 0x00000B, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_byte_Variable_5) == 0x00000C, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_bool_Variable_3) == 0x00000D, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_byte_Variable_6) == 0x00000E, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, Temp_byte_Variable_7) == 0x00000F, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, CallFunc_TextIsEmpty_ReturnValue) == 0x000010, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, K2Node_Select_Default) == 0x000013, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, K2Node_Select_Default_1) == 0x000014, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, CallFunc_BooleanOR_ReturnValue) == 0x000015, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, K2Node_Select_Default_2) == 0x000016, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, CallFunc_IsValid_ReturnValue_1) == 0x000017, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S, K2Node_Select_Default_3) == 0x000020, "Member 'Tooltip_Custom_S_C_ExecuteUbergraph_Tooltip_Custom_S::K2Node_Select_Default_3' has a wrong offset!");

// Function Tooltip-Custom-S.Tooltip-Custom-S_C.Get Body Text
// 0x0018 (0x0018 - 0x0000)
struct Tooltip_Custom_S_C_Get_Body_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Tooltip_Custom_S_C_Get_Body_Text) == 0x000008, "Wrong alignment on Tooltip_Custom_S_C_Get_Body_Text");
static_assert(sizeof(Tooltip_Custom_S_C_Get_Body_Text) == 0x000018, "Wrong size on Tooltip_Custom_S_C_Get_Body_Text");
static_assert(offsetof(Tooltip_Custom_S_C_Get_Body_Text, ReturnValue) == 0x000000, "Member 'Tooltip_Custom_S_C_Get_Body_Text::ReturnValue' has a wrong offset!");

// Function Tooltip-Custom-S.Tooltip-Custom-S_C.Get Header Text
// 0x0018 (0x0018 - 0x0000)
struct Tooltip_Custom_S_C_Get_Header_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Tooltip_Custom_S_C_Get_Header_Text) == 0x000008, "Wrong alignment on Tooltip_Custom_S_C_Get_Header_Text");
static_assert(sizeof(Tooltip_Custom_S_C_Get_Header_Text) == 0x000018, "Wrong size on Tooltip_Custom_S_C_Get_Header_Text");
static_assert(offsetof(Tooltip_Custom_S_C_Get_Header_Text, ReturnValue) == 0x000000, "Member 'Tooltip_Custom_S_C_Get_Header_Text::ReturnValue' has a wrong offset!");

// Function Tooltip-Custom-S.Tooltip-Custom-S_C.Get Icon Brush
// 0x0180 (0x0180 - 0x0000)
struct Tooltip_Custom_S_C_Get_Icon_Brush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00C0)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            CallFunc_MakeBrushFromAsset_ReturnValue;           // 0x00C0(0x00C0)()
};
static_assert(alignof(Tooltip_Custom_S_C_Get_Icon_Brush) == 0x000010, "Wrong alignment on Tooltip_Custom_S_C_Get_Icon_Brush");
static_assert(sizeof(Tooltip_Custom_S_C_Get_Icon_Brush) == 0x000180, "Wrong size on Tooltip_Custom_S_C_Get_Icon_Brush");
static_assert(offsetof(Tooltip_Custom_S_C_Get_Icon_Brush, ReturnValue) == 0x000000, "Member 'Tooltip_Custom_S_C_Get_Icon_Brush::ReturnValue' has a wrong offset!");
static_assert(offsetof(Tooltip_Custom_S_C_Get_Icon_Brush, CallFunc_MakeBrushFromAsset_ReturnValue) == 0x0000C0, "Member 'Tooltip_Custom_S_C_Get_Icon_Brush::CallFunc_MakeBrushFromAsset_ReturnValue' has a wrong offset!");

}

