#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tree_Broken_Oak_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Graybox_Prop_Large_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tree_Broken_Oak_01.Tree_Broken_Oak_01_C
// 0x0020 (0x0E90 - 0x0E70)
class ATree_Broken_Oak_01_C final : public AGraybox_Prop_Large_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           DeathEffect_leafColor;                             // 0x0E78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          useDeathFXOverride;                                // 0x0E88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void activateDeathFXOverride();
	void ExecuteUbergraph_Tree_Broken_Oak_01(int32 EntryPoint);
	void initRandomUndergrowth();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tree_Broken_Oak_01_C">();
	}
	static class ATree_Broken_Oak_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATree_Broken_Oak_01_C>();
	}
};
static_assert(alignof(ATree_Broken_Oak_01_C) == 0x000008, "Wrong alignment on ATree_Broken_Oak_01_C");
static_assert(sizeof(ATree_Broken_Oak_01_C) == 0x000E90, "Wrong size on ATree_Broken_Oak_01_C");
static_assert(offsetof(ATree_Broken_Oak_01_C, UberGraphFrame) == 0x000E70, "Member 'ATree_Broken_Oak_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATree_Broken_Oak_01_C, DeathEffect_leafColor) == 0x000E78, "Member 'ATree_Broken_Oak_01_C::DeathEffect_leafColor' has a wrong offset!");
static_assert(offsetof(ATree_Broken_Oak_01_C, useDeathFXOverride) == 0x000E88, "Member 'ATree_Broken_Oak_01_C::useDeathFXOverride' has a wrong offset!");

}

