#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TVPostProcessBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TVPostProcessBP.TVPostProcessBP_C
// 0x0020 (0x0290 - 0x0270)
class ATVPostProcessBP_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableOnStartup;                                  // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void IsEnabledForCurrentSubgame(bool* bEnabled);
	void FrontEndCameraSwitch();
	void ExecuteUbergraph_TVPostProcessBP(int32 EntryPoint);
	void ExecuteCameraSwitch();
	void Camera_DisableEffects();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TVPostProcessBP_C">();
	}
	static class ATVPostProcessBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATVPostProcessBP_C>();
	}
};
static_assert(alignof(ATVPostProcessBP_C) == 0x000008, "Wrong alignment on ATVPostProcessBP_C");
static_assert(sizeof(ATVPostProcessBP_C) == 0x000290, "Wrong size on ATVPostProcessBP_C");
static_assert(offsetof(ATVPostProcessBP_C, UberGraphFrame) == 0x000270, "Member 'ATVPostProcessBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATVPostProcessBP_C, Billboard) == 0x000278, "Member 'ATVPostProcessBP_C::Billboard' has a wrong offset!");
static_assert(offsetof(ATVPostProcessBP_C, Root) == 0x000280, "Member 'ATVPostProcessBP_C::Root' has a wrong offset!");
static_assert(offsetof(ATVPostProcessBP_C, DisableOnStartup) == 0x000288, "Member 'ATVPostProcessBP_C::DisableOnStartup' has a wrong offset!");

}

