#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TVPostProcessBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function TVPostProcessBP.TVPostProcessBP_C.IsEnabledForCurrentSubgame
// 0x0001 (0x0001 - 0x0000)
struct TVPostProcessBP_C_IsEnabledForCurrentSubgame final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TVPostProcessBP_C_IsEnabledForCurrentSubgame) == 0x000001, "Wrong alignment on TVPostProcessBP_C_IsEnabledForCurrentSubgame");
static_assert(sizeof(TVPostProcessBP_C_IsEnabledForCurrentSubgame) == 0x000001, "Wrong size on TVPostProcessBP_C_IsEnabledForCurrentSubgame");
static_assert(offsetof(TVPostProcessBP_C_IsEnabledForCurrentSubgame, bEnabled) == 0x000000, "Member 'TVPostProcessBP_C_IsEnabledForCurrentSubgame::bEnabled' has a wrong offset!");

// Function TVPostProcessBP.TVPostProcessBP_C.ExecuteUbergraph_TVPostProcessBP
// 0x0008 (0x0008 - 0x0000)
struct TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabledForCurrentSubgame_bEnabled;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP) == 0x000004, "Wrong alignment on TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP");
static_assert(sizeof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP) == 0x000008, "Wrong size on TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, EntryPoint) == 0x000000, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP, CallFunc_IsEnabledForCurrentSubgame_bEnabled) == 0x000004, "Member 'TVPostProcessBP_C_ExecuteUbergraph_TVPostProcessBP::CallFunc_IsEnabledForCurrentSubgame_bEnabled' has a wrong offset!");

}

