#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Background_Strings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Background_Strings.UI_Background_Strings_C
// 0x0028 (0x02E0 - 0x02B8)
class UUI_Background_Strings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonRichTextBlock*                   CustomString;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CustomText;                                        // 0x02C8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_UI_Background_Strings(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Background_Strings_C">();
	}
	static class UUI_Background_Strings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Background_Strings_C>();
	}
};
static_assert(alignof(UUI_Background_Strings_C) == 0x000008, "Wrong alignment on UUI_Background_Strings_C");
static_assert(sizeof(UUI_Background_Strings_C) == 0x0002E0, "Wrong size on UUI_Background_Strings_C");
static_assert(offsetof(UUI_Background_Strings_C, UberGraphFrame) == 0x0002B8, "Member 'UUI_Background_Strings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Background_Strings_C, CustomString) == 0x0002C0, "Member 'UUI_Background_Strings_C::CustomString' has a wrong offset!");
static_assert(offsetof(UUI_Background_Strings_C, CustomText) == 0x0002C8, "Member 'UUI_Background_Strings_C::CustomText' has a wrong offset!");

}

