#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_BigGoldButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_structs.hpp"
#include "CrewUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_BigGoldButton.UI_BigGoldButton_C
// 0x00B0 (0x10B0 - 0x1000)
class UUI_BigGoldButton_C final : public UBattlePassCrewPurchaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1000(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Empty;                                        // 0x1010(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x1018(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x1020(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x1028(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Button;                                      // 0x1030(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Button_Inner;                                // 0x1038(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CurrencyVBuck;                               // 0x1040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x1048(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Hover;                                     // 0x1050(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayStationStoreLogo;                              // 0x1058(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Currency;                                 // 0x1060(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilityWidgetLegacy*          Visibility_PlatformImage;                          // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisualAttachment*                Visuals_Glows;                                     // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x1078(0x0018)(Edit, BlueprintVisible)
	bool                                          Unskew;                                            // 0x1090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GlowsOff;                                          // 0x1091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HoverLightning;                                    // 0x1092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1093[0x5];                                     // 0x1093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             PurchaseButtonHover;                               // 0x1098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PurchaseButtonUnHover;                             // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void EventHover(bool In);
	void ExecuteUbergraph_UI_BigGoldButton(int32 EntryPoint);
	void OnCurrencyUpdated();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_BigGoldButton_C">();
	}
	static class UUI_BigGoldButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_BigGoldButton_C>();
	}
};
static_assert(alignof(UUI_BigGoldButton_C) == 0x000010, "Wrong alignment on UUI_BigGoldButton_C");
static_assert(sizeof(UUI_BigGoldButton_C) == 0x0010B0, "Wrong size on UUI_BigGoldButton_C");
static_assert(offsetof(UUI_BigGoldButton_C, UberGraphFrame) == 0x001000, "Member 'UUI_BigGoldButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Hover) == 0x001008, "Member 'UUI_BigGoldButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, HBox_Empty) == 0x001010, "Member 'UUI_BigGoldButton_C::HBox_Empty' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image) == 0x001018, "Member 'UUI_BigGoldButton_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_0) == 0x001020, "Member 'UUI_BigGoldButton_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_1) == 0x001028, "Member 'UUI_BigGoldButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_Button) == 0x001030, "Member 'UUI_BigGoldButton_C::Image_Button' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_Button_Inner) == 0x001038, "Member 'UUI_BigGoldButton_C::Image_Button_Inner' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_CurrencyVBuck) == 0x001040, "Member 'UUI_BigGoldButton_C::Image_CurrencyVBuck' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_Shadow) == 0x001048, "Member 'UUI_BigGoldButton_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Overlay_Hover) == 0x001050, "Member 'UUI_BigGoldButton_C::Overlay_Hover' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PlayStationStoreLogo) == 0x001058, "Member 'UUI_BigGoldButton_C::PlayStationStoreLogo' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Switcher_Currency) == 0x001060, "Member 'UUI_BigGoldButton_C::Switcher_Currency' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Visibility_PlatformImage) == 0x001068, "Member 'UUI_BigGoldButton_C::Visibility_PlatformImage' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Visuals_Glows) == 0x001070, "Member 'UUI_BigGoldButton_C::Visuals_Glows' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, ButtonText) == 0x001078, "Member 'UUI_BigGoldButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Unskew) == 0x001090, "Member 'UUI_BigGoldButton_C::Unskew' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, GlowsOff) == 0x001091, "Member 'UUI_BigGoldButton_C::GlowsOff' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, HoverLightning) == 0x001092, "Member 'UUI_BigGoldButton_C::HoverLightning' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PurchaseButtonHover) == 0x001098, "Member 'UUI_BigGoldButton_C::PurchaseButtonHover' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PurchaseButtonUnHover) == 0x0010A0, "Member 'UUI_BigGoldButton_C::PurchaseButtonUnHover' has a wrong offset!");

}

