#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIEmitter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIEmitter.UIEmitter_C.ExecuteUbergraph_UIEmitter
// 0x0100 (0x0100 - 0x0000)
struct UIEmitter_C_ExecuteUbergraph_UIEmitter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIEmitterElement_C*                    CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIEmitterElement_C*                    K2Node_CustomEvent_EmitterElement;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Vector2DVector2D_ReturnValue;    // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIEmitter_C_ExecuteUbergraph_UIEmitter) == 0x000008, "Wrong alignment on UIEmitter_C_ExecuteUbergraph_UIEmitter");
static_assert(sizeof(UIEmitter_C_ExecuteUbergraph_UIEmitter) == 0x000100, "Wrong size on UIEmitter_C_ExecuteUbergraph_UIEmitter");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, EntryPoint) == 0x000000, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, Temp_int_Variable) == 0x000004, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_X) == 0x000018, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_Y) == 0x00001C, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_Create_ReturnValue) == 0x000020, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_RandomFloatInRange_ReturnValue) == 0x000028, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, K2Node_MakeStruct_Margin) == 0x000040, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000050, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000058, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_X_1) == 0x000060, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_Y_1) == 0x000064, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000068, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_X_2) == 0x00006C, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_Y_2) == 0x000070, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000074, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, K2Node_Event_IsDesignTime) == 0x000078, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00007C, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, K2Node_MakeStruct_Margin_1) == 0x000080, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_AddChildToOverlay_ReturnValue) == 0x000090, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_GetChildrenCount_ReturnValue) == 0x000098, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, K2Node_CustomEvent_EmitterElement) == 0x0000A8, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::K2Node_CustomEvent_EmitterElement' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B0, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000B4, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_X_3) == 0x0000C0, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_Y_3) == 0x0000C4, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0000C8, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000D8, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_X_4) == 0x0000E0, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_Y_4) == 0x0000E4, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0000E8, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_NotEqual_Vector2DVector2D_ReturnValue) == 0x0000EC, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_NotEqual_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_X_5) == 0x0000F0, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_BreakVector2D_Y_5) == 0x0000F4, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(UIEmitter_C_ExecuteUbergraph_UIEmitter, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x0000F8, "Member 'UIEmitter_C_ExecuteUbergraph_UIEmitter::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");

// Function UIEmitter.UIEmitter_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UIEmitter_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIEmitter_C_PreConstruct) == 0x000001, "Wrong alignment on UIEmitter_C_PreConstruct");
static_assert(sizeof(UIEmitter_C_PreConstruct) == 0x000001, "Wrong size on UIEmitter_C_PreConstruct");
static_assert(offsetof(UIEmitter_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UIEmitter_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UIEmitter.UIEmitter_C.SetImage
// 0x0008 (0x0008 - 0x0000)
struct UIEmitter_C_SetImage final
{
public:
	class UUIEmitterElement_C*                    EmitterElement;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIEmitter_C_SetImage) == 0x000008, "Wrong alignment on UIEmitter_C_SetImage");
static_assert(sizeof(UIEmitter_C_SetImage) == 0x000008, "Wrong size on UIEmitter_C_SetImage");
static_assert(offsetof(UIEmitter_C_SetImage, EmitterElement) == 0x000000, "Member 'UIEmitter_C_SetImage::EmitterElement' has a wrong offset!");

}

