#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Upsell_TutorialTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Upsell_TutorialTooltip.Upsell_TutorialTooltip_C
// 0x0180 (0x0460 - 0x02E0)
class UUpsell_TutorialTooltip_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FloatLoop;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       burstLoop;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxcontent;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_Tooltip;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0320(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          In_Auto_Wrap_Text;                                 // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            In_Brush;                                          // 0x0340(0x00C0)(Edit, BlueprintVisible, ExposeOnSpawn)
	EHorizontalAlignment                          In_Horizontal_Alignment;                           // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EVerticalAlignment                            In_Vertical_Alignment;                             // 0x0401(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       In_Transform;                                      // 0x0408(0x0038)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	bool                                          Show_Icon;                                         // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Content_Padding;                                   // 0x0444(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          ShouldShowToolTip;                                 // 0x0454(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnabled;                                          // 0x0455(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Upsell_TutorialTooltip(int32 EntryPoint);
	void HideTooltip();
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& Text);
	void SetTooltipEnabled(bool bInEnabled);
	void ShowTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Upsell_TutorialTooltip_C">();
	}
	static class UUpsell_TutorialTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpsell_TutorialTooltip_C>();
	}
};
static_assert(alignof(UUpsell_TutorialTooltip_C) == 0x000010, "Wrong alignment on UUpsell_TutorialTooltip_C");
static_assert(sizeof(UUpsell_TutorialTooltip_C) == 0x000460, "Wrong size on UUpsell_TutorialTooltip_C");
static_assert(offsetof(UUpsell_TutorialTooltip_C, UberGraphFrame) == 0x0002E0, "Member 'UUpsell_TutorialTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, FloatLoop) == 0x0002E8, "Member 'UUpsell_TutorialTooltip_C::FloatLoop' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, burstLoop) == 0x0002F0, "Member 'UUpsell_TutorialTooltip_C::burstLoop' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Show) == 0x0002F8, "Member 'UUpsell_TutorialTooltip_C::Show' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, HorizontalBoxcontent) == 0x000300, "Member 'UUpsell_TutorialTooltip_C::HorizontalBoxcontent' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Icon) == 0x000308, "Member 'UUpsell_TutorialTooltip_C::Icon' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Image_Arrow) == 0x000310, "Member 'UUpsell_TutorialTooltip_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Text_Tooltip) == 0x000318, "Member 'UUpsell_TutorialTooltip_C::Text_Tooltip' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Text) == 0x000320, "Member 'UUpsell_TutorialTooltip_C::In_Text' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Auto_Wrap_Text) == 0x000338, "Member 'UUpsell_TutorialTooltip_C::In_Auto_Wrap_Text' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Brush) == 0x000340, "Member 'UUpsell_TutorialTooltip_C::In_Brush' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Horizontal_Alignment) == 0x000400, "Member 'UUpsell_TutorialTooltip_C::In_Horizontal_Alignment' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Vertical_Alignment) == 0x000401, "Member 'UUpsell_TutorialTooltip_C::In_Vertical_Alignment' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, In_Transform) == 0x000408, "Member 'UUpsell_TutorialTooltip_C::In_Transform' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Show_Icon) == 0x000440, "Member 'UUpsell_TutorialTooltip_C::Show_Icon' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, Content_Padding) == 0x000444, "Member 'UUpsell_TutorialTooltip_C::Content_Padding' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, ShouldShowToolTip) == 0x000454, "Member 'UUpsell_TutorialTooltip_C::ShouldShowToolTip' has a wrong offset!");
static_assert(offsetof(UUpsell_TutorialTooltip_C, bEnabled) == 0x000455, "Member 'UUpsell_TutorialTooltip_C::bEnabled' has a wrong offset!");

}

