#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserListHeaderEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UserListHeaderEntry.UserListHeaderEntry_C
// 0x0030 (0x1080 - 0x1050)
class UUserListHeaderEntry_C final : public USocialUserListHeaderEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x1058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x1060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortMobileImage*                       ExpandDirectionTick;                               // 0x1068(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_EntryContent;                                   // 0x1070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnUnhovered();
	void ExecuteUbergraph_UserListHeaderEntry(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnListItemObjectSet_1(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UserListHeaderEntry_C">();
	}
	static class UUserListHeaderEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserListHeaderEntry_C>();
	}
};
static_assert(alignof(UUserListHeaderEntry_C) == 0x000010, "Wrong alignment on UUserListHeaderEntry_C");
static_assert(sizeof(UUserListHeaderEntry_C) == 0x001080, "Wrong size on UUserListHeaderEntry_C");
static_assert(offsetof(UUserListHeaderEntry_C, UberGraphFrame) == 0x001050, "Member 'UUserListHeaderEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUserListHeaderEntry_C, OnExpansion) == 0x001058, "Member 'UUserListHeaderEntry_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(UUserListHeaderEntry_C, OnHover) == 0x001060, "Member 'UUserListHeaderEntry_C::OnHover' has a wrong offset!");
static_assert(offsetof(UUserListHeaderEntry_C, ExpandDirectionTick) == 0x001068, "Member 'UUserListHeaderEntry_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(UUserListHeaderEntry_C, SB_EntryContent) == 0x001070, "Member 'UUserListHeaderEntry_C::SB_EntryContent' has a wrong offset!");

}

