#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserSearchResultListEntry_XS

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UserSearchResultListEntry_XS.UserSearchResultListEntry_XS_C.BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UserSearchResultListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UserSearchResultListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on UserSearchResultListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(UserSearchResultListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on UserSearchResultListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(UserSearchResultListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'UserSearchResultListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function UserSearchResultListEntry_XS.UserSearchResultListEntry_XS_C.ExecuteUbergraph_UserSearchResultListEntry_XS
// 0x02C8 (0x02C8 - 0x0000)
struct UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0078(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x00B0(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_DisplayName;                          // 0x00F8(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Platform;                             // 0x0110(0x0018)(ConstParm)
	int32                                         K2Node_Event_MutualCount;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0130(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue; // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0150(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0168(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0180(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0198(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01B0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0200(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0250(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02B0(0x0018)()
};
static_assert(alignof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS) == 0x000008, "Wrong alignment on UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS");
static_assert(sizeof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS) == 0x0002C8, "Wrong size on UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, EntryPoint) == 0x000000, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::EntryPoint' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, Temp_bool_Variable) == 0x000058, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, Temp_text_Variable) == 0x000060, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, Temp_text_Variable_1) == 0x000078, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, Temp_bool_Variable_1) == 0x000090, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, Temp_text_Variable_2) == 0x000098, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, Temp_text_Variable_3) == 0x0000B0, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, Temp_bool_Variable_2) == 0x0000C8, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_ComponentBoundEvent_bIsOpen) == 0x0000C9, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_PlayAnimation_ReturnValue) == 0x0000D0, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000D8, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000E0, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000E8, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000F0, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_Event_DisplayName) == 0x0000F8, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_Event_DisplayName' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_Event_Platform) == 0x000110, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_Event_Platform' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_Event_MutualCount) == 0x000128, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_Event_MutualCount' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_MakeLiteralText_ReturnValue) == 0x000130, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_Greater_IntInt_ReturnValue) == 0x000148, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue) == 0x000149, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_Select_Default) == 0x000150, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_Select_Default_1) == 0x000168, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_Conv_IntToText_ReturnValue) == 0x000180, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_Select_Default_2) == 0x000198, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001B0, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_MakeStruct_FormatArgumentData_2) == 0x000200, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_MakeStruct_FormatArgumentData_3) == 0x000250, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, K2Node_MakeArray_Array) == 0x0002A0, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS, CallFunc_Format_ReturnValue) == 0x0002B0, "Member 'UserSearchResultListEntry_XS_C_ExecuteUbergraph_UserSearchResultListEntry_XS::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function UserSearchResultListEntry_XS.UserSearchResultListEntry_XS_C.SetNamePlatformAndMutuals
// 0x0038 (0x0038 - 0x0000)
struct UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Platform;                                          // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         MutualCount;                                       // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals) == 0x000008, "Wrong alignment on UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals");
static_assert(sizeof(UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals) == 0x000038, "Wrong size on UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals");
static_assert(offsetof(UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals, DisplayName) == 0x000000, "Member 'UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals::DisplayName' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals, Platform) == 0x000018, "Member 'UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals::Platform' has a wrong offset!");
static_assert(offsetof(UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals, MutualCount) == 0x000030, "Member 'UserSearchResultListEntry_XS_C_SetNamePlatformAndMutuals::MutualCount' has a wrong offset!");

}

