#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UserActionMenu.UserActionMenu_C
// 0x0030 (0x0520 - 0x04F0)
class UUserActionMenu_C final : public UFortSocialInteractionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Platform;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UserActionMenu(int32 EntryPoint);
	void OnOpened();
	void OnToggleConfirmation(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UserActionMenu_C">();
	}
	static class UUserActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserActionMenu_C>();
	}
};
static_assert(alignof(UUserActionMenu_C) == 0x000008, "Wrong alignment on UUserActionMenu_C");
static_assert(sizeof(UUserActionMenu_C) == 0x000520, "Wrong size on UUserActionMenu_C");
static_assert(offsetof(UUserActionMenu_C, UberGraphFrame) == 0x0004F0, "Member 'UUserActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, ConfirmationOpened) == 0x0004F8, "Member 'UUserActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, Opened) == 0x000500, "Member 'UUserActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, Border_OnlineStatusIndicator) == 0x000508, "Member 'UUserActionMenu_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, EntryBorder) == 0x000510, "Member 'UUserActionMenu_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, Image_Platform) == 0x000518, "Member 'UUserActionMenu_C::Image_Platform' has a wrong offset!");

}

